[{"source": "Facebook", "date": "2015-11-27T11:30:00-05:00", "description": "We are doing things a little different this Black Friday, and by different we mean awesome ;)\n\nABC is offering a one day discount on some of our finest, funkiest brews, all of which are suitable for drinking now - (think hostess gifts, toasting the New Year or simply enjoying on a cold winter night in front of the fireplace) or laying down to cellar (in your already established cellar or that collection you have been meaning to start).\n\nThe featured bottles:\n\nWild Root Special Reserve 2015 - A tart and complex old ale aged in oak for a year and bottle conditioned for an additional year. Autumnal aromas of crisp apple and earthy wet leaves mingle with sweet-tart sour cherry. Rich, vinous wet tobacco and juicy fruits on the palate are complemented by subtle chocolate and caramel notes and balanced by lactic acidity, tart green apple and dry tannins that persist through a long and slightly mineral finish.\n\nFramboise 2015 - Our take on this classic style is neither spontaneously fermented nor barrel aged, but the addition of lactic acid and raspberries to our crisp Blonde create a flavor that is refreshingly tart without being aggressively sour or acidic. A crisp and refreshing brew with tart raspberry, and subtle notes of zesty orange peel and spicy coriander.\n\nAnniversary Barleywine 2015 - Our 20th anniversary ale combines the best of all worlds – big, rich malts with plenty of nutty and caramel sweetness; the bitterness of a heavy-handed dose of resiny locally grown hops; and the warming alcohols you would expect in a high gravity brew. An American Barleywine brewed with predominantly Thomas Fawcett malts and Michigan-grown Chinook hops. We brewed this bad boy in honor of our 20th anniversary because a big celebration demanded a big beer! And since running a brewery is sometimes sweet and sometimes sour, we decided to pull off a portion of the beer to sour in our cellar... \n\nAnniversary Sour Barleywine 2015 - We like our sour beers big and rich, and sometimes even bitter so our hoppy anniversary barleywine was the perfect base beer for this special celebration ale. Floral, woodsy and hoppy aromas leads into an incredibly complex palate with toffee and caramel, a hint of sweet tart pineapple, notes of charred wood, sweet citrus and tangy grapefruit fading into a long and bracingly bitter finish.\n\nAll selections are only available at the Brewpub.", "url": "https://www.facebook.com/events/513930525454429/", "name": "Drink me now or lay me down, a sale of cellar bottles"}, {"source": "Facebook", "date": "2015-11-27T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2015-11-28T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2015-11-28T10:00:00-05:00", "description": "Join us for #IndiesFirst -- a nationwide campaign celebrating the Independent Bookstore! Throughout the day, we'll have several authors act as volunteer \"Literati Book Ninjas,\" talking with customers about their favorite books, what they're reading, and what books they're excited about. Participating authors scheduled to be volunteer booksellers include Claire Vaye Watkins, Raymond McDaniel, Keith Taylor, Robert James Russell, Julie Timmer. As a bonus, Nancy Shaw will be reading her children's books at 11am for a special story time!\n\nSince it's also Small Business Saturday, as well as the Michigan-Ohio State football game, we'll be offering SIGNED copies of Endzone, the latest book by John U. Bacon. We will be offering free shipping for signed Endzone copies throughout the U.S. until December 1st, so take advantage!", "url": "https://www.facebook.com/events/143987922628219/", "name": "Small Business Saturday & #IndiesFirst"}, {"source": "Facebook", "date": "2015-11-28T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2015-11-29T13:00:00-05:00", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "url": "https://www.facebook.com/events/1636907506583430/", "name": "Guided Tour: Engaging with Art"}, {"source": "Facebook", "date": "2015-11-29T14:00:00-05:00", "description": "“The unifying core of my work stems from encountering the world as it unfolds,” explains Jem Cohen. “It is through close observation, careful listening, and an embrace of chance that I establish the bedrock. . . . Regardless of the tools and the form, the project is . . . life drawing.” Join UMMA docents as they explore Cohen’s dual-gallery presentation including Polaroid images and digital prints of a variety of locations, from New York to Tangier, in the Photography Gallery, and a multi-media component that has been called a cinematic love letter to Nova Scotia's Cape Breton, in the Media Gallery.", "url": "https://www.facebook.com/events/1631391757112051/", "name": "Guided Tour: Jem Cohen: Life Drawing"}, {"source": "Facebook", "date": "2015-11-29T17:30:00-05:00", "description": "Helmut Stern Auditorium\nJamaal May’s first book of poems, Hum, is a “bittersweet love song” to the ruined streets of his native Detroit. Boston Review writes, “In May’s skilled hands, Keats’s urn becomes a Chinese takeout box and Wordsworth’s abbey spires are belching Zug Island factories.” May’s poetry uses images of technology past and present to render the “hum” that drives human identity and connection. Since Hum’s publication in 2013, May has won the Beatrice Hawley Award, the ALA Notable Book Award, and was a finalist for the NAACP Image Award and Kate Tufts Discovery Award. He has also published two chapbooks, The God Engine and The Whetting of Teeth.May’s poetry has been published in Poetry, The Believer, Ploughshares, New England Review, and The Kenyon Review. His work has been recognized by Cave Canem, Bread Loaf, the Lannan Foundation, and the Indiana Review. He has also been a recipient of the Kenyon Review Fellowship at Kenyon College, Bread Loaf, Callaloo, and the Civitella Ranieri Fellowship.May’s career as an editor and teacher began when he taught poetry in the Detroit public school system. Since then, he has also been on the faculty of the Vermont College of Fine Arts MFA. He has served as an associate editor of West Branch and the series editor, graphic designer and filmmaker for the Organic Weapon Arts Chapbook and Video Series. May is also a member of six national poetry slam teams, including five from Detroit and the NYC-based LouderARTS team. He is a three-time Rustbelt Regional Slam champion and has been a finalist at several national and international poetry slams.UMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please see: http://www.umma.museum/programs-and-tours/events/index.php?com=detail&eID=2657", "url": "https://www.facebook.com/events/1678322672398279/", "name": "Jamaal May Poetry Reading"}, {"source": "Facebook", "date": "2015-11-29T18:30:00-05:00", "description": "PLEASE SHARE WITH THE WOMAN-IDENTIFYING SLAMMERS YOU LOVE:\n\nWe will be hosting our first-ever WoWPS qualifier slam on November 29th at 7pm in Espresso Royale (on State St). The winner of the WoWPS qualifier slam will get to represent Ann Arbor at the Women of the World Poetry Slam in Brooklyn, New York, in March 2016. Ann Arbor Poetry Slam will pay for your registration fees and help you with a portion of your travel expenses.\n\nThe slam will be three rounds featuring:\n\n1st Round: 1 minute poem\n2nd Round: 2 minute poem\n3rd Round 3 minute poem\n\nEach round allots a 10-second grace period. The time limits are a max, meaning you do not have to fill up the time. However, there will be time penalties after the ten second grace period. \n\nThere will be cuts after each round, taking 8 poets into the second round, and 4 into the final round. The top-scoring poet, cumulatively, will represent our city in Brooklyn. For more details, visit:\n\nhttp://poetryslaminc.com/tournament/2016-women-world-poetry-slam\n\nELIGIBILITY: in order to be able to compete in the WoWPS qualifier slam, you must be at least 18 years of age, identify as a woman, and have attended *at least* TWO Ann Arbor Poetry & Slam event this calendar year (for the record, there are 2 more events left prior to the qualifier).\n\nWe wish you all the best, and are looking forward to seeing who comes out to represent our city!", "url": "https://www.facebook.com/events/429225057271441/", "name": "Ann Arbor Women of the World Poetry Slam Qualifier"}, {"source": "Facebook", "date": "2015-11-29T20:00:00-05:00", "description": "It's open mic and a meal.  Bring your Thanksgiving leftovers or whatever dish you want to the Yellow Barn on Sunday, November 29th.\n\nWe'll eat, drink, and tell jokes and stories of Michigan comedy.\n\nDinner at 6:00pm.  Stories and standup at 8:00pm\n\nFor non-performers, a $5 donation at the door to cover theater overhead is suggested.\n\nCOMICS and PERFORMERS: Please click \"See More\" below for spot request instructions for 11/29/15.\n\nComics and performers, please follow these procedures for stage time:\n\n- Click \"Going\" on this Facebook Event. Even if you are thinking about it, you can click \"Maybe\" so you can get updates on this page. Do this by 5:00pm, the day of the show. This does not guarantee you a spot, but not doing it puts you at the bottom of the list.\n\n- THERE ARE ONLY THREE TYPES OF GUARANTEED SPOTS.\n1 - Chili's Dojo participants, current and past.\n2 - Those acts who have been denied spots on their last request.\n3 - Pre-approved rideshare groups. A rideshare group is a group of four or more performers who arrive together. They must be pre-approved, meaning the names of the performers must be submitted before 5:00pm.\n\nAll other spots are given at the show-runner's discretion.\n\n- After 5:00pm Sunday, \"show ups\" can \"go up\" only if spots are available.\n- Those arriving after the line-up is finalized will be given spots as time permits.\n- Length of stage time will depend largely on the turn out, performer's experience, and the show-runner's discretion.\n- As always, if you show up and do not get a spot, you will be put at the top of the list for the next show.\n\n--- Want to increase your odds of getting a spot? Here's some DO's and DON'T's\nDO . . . . Share this event page with your fans on your fan page, your facebook page, your website, or your tweets, or any other social media.\nDO . . . . Volunteer for less time. If you are willing to do 3 rather than 5, or 4 rather than 7, then you are more likely to get a spot.\nDO . . . . Come to the paid shows.\nDO . . . . Stay for \"meet and greet\" after shows.\nDO . . . . Answer poll questions whenever they appear on the event page.\nDO . . . . Bring people. This is not, I repeat NOT, a \"bringer.\" But if somebody has come to see you, it will be very hard to deny you a spot. In the past, we've had shows where we've added a minute of time for every person the comic brought as a non-performing audience member. Bring three people and a five minute spot becomes an eight minute spot.\n\nContact Mark at: www.facebook.com/marksweetman", "url": "https://www.facebook.com/events/1074645842559129/", "name": "The UNclub \"Leftovers Show\" at The Yellow Barn (11/29/15)"}, {"source": "Facebook", "date": "2015-11-30T19:00:00-05:00", "description": "Entwining the lives of both historical and fictional characters, and moving between the past and the present, \"The Muralist\" plunges readers into the divisiveness of prewar politics and the largely forgotten plight of European refugees refused entrance to the United States. It captures both the inner workings of New York's art scene and the beginnings of the vibrant and quintessentially American school of Abstract Expressionism. As she did in her bestselling novel \"The Art Forger,\" B. A. Shapiro tells a gripping story while exploring provocative themes. In Alizee and Danielle she has created two unforgettable women, artists both, who compel us to ask: What happens when luminous talent collides with unstoppable historical forces? Does great art have the power to change the world?\n\nB.A. SHAPIRO is the author of \"The Art Forger\", which was a \"New York Times\" bestseller, a #1 Indie Next Pick and the winner of the 2013 New England Book Award, among many other honours. Writing as Barbara Shapiro, she is also the author of five suspense novels and one non-fiction book. She lives in Boston and teaches creative writing at Northeastern University.", "url": "https://www.facebook.com/events/2127405944067013/", "name": "Meet NYT Bestselling Author B.A. Shapiro for a Discussion & Signing  of Her New Historical Fiction Novel, 'The Muralist'"}, {"source": "Facebook", "date": "2015-11-30T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2015-12-01T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2015-12-01T18:00:00-05:00", "description": "Tuesday, December 1 we are throwing a celebration of epic proportions - First for our monthly release and second for our one and only, Rene Greff's 50th Birthday!\n\nJoin us from 6-7pm as we host the official release of Smoke & Mirrors, a Smoked Porter brewed with a healthy heaping of mesquite smoked malt - classic American BBQ meets dark chocolate and roasted flavors of a porter. Halyon Sound will  play beginning at 6pm. $10 cover includes light snacks, complimentary samples, and exclusive discounts of Smoke & Mirrors.  As always, the release parties are complimentary for Mug Club members.\n\nAt 7pm we will open the doors to friends and family to begin the official celebration with Rene for her 50th. The beers will be flowing and Rootstand will be jamming the night away. Please join us to raise a glass to Rene, and cheers to many more.", "url": "https://www.facebook.com/events/881949081919162/", "name": "Rene's 50th Birthday Beer - Release and Celebration"}, {"source": "Facebook", "date": "2015-12-02T21:00:00-05:00", "description": "Wed. December 2 | 9pm | 18+ | $10 Adv./ $12 Day of\n\n\nWhat The Sound Presents: Beat Connection\n with Phantoms and Jonah Baseball\n\nBeat Connection is Reed Juenger, Tom Eddy, Jarred Katz and Mark Hunter. Formed in 2010, Beat Connection has undergone numerous changes, finally stabilizing in its current form. The band has already shared the stage with Jungle, Toro y Moi, STRFKR, Washed Out, Holy Ghost! & ODESZA; and has garnered positive looks from Pitchfork, The Fader and The Guardian. With performances scheduled this year at ACL & CHBP, Beat Connection now looks to the future to focus on constantly bringing something new to their audience by bridging the gap between the mundane and the transcendent, the pop and the avant-garde. Expect something new at every turn.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/479", "url": "https://www.facebook.com/events/887650744615581/", "name": "Beat Connection w/ Phantoms & Jonah Baseball 12/2/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-12-03T19:00:00-05:00", "description": "Literati is pleased to open our event space to the Brick and Mortar Collective, a Detroit-based housing cooperative, for a fundraising event. \n\nEvent Description:\n\nThe Brick and Mortar Collective fundraiser will be an art filled, informational evening about the collective to raise money for renovating Brick & Mortar's forever home on the East Side of Detroit. There will be a presentation on the mission of this Detroit based housing cooperative, a Q & A with the Brick & Mortar members, and the sale and auction of arts and services including, but not limited to, the following:\n\nRelief Prints by Brick & Mortar Collective Member Lyz Luidens\n\nPrints of Paintings by Brick & Mortar Collective Member Ian Matchett\n\nRelief Prints by Internationally Acclaimed Printmaker and UM Professor, Endi Poskovic\n\nAnd More!\n\nAll donations and purchases will go toward funding the renovations of the duplex on the East Side of Detroit purchased by the Brick & Mortar Collective over the summer of 2015. The co-op members have been hard at work to fix up as much of the house as possible themselves, but still need to fundraise for the heating system, replacement windows, and repairs to the roof, which fell into disrepair due to years of neglect. The Brick and Mortar Collective is also accepting donations on their gofundme page, with various rewards to accompany donations: https://www.gofundme.com/brickhousefund\n\nOrganization Description:\n\nThe Brick & Mortar Collective (a.k.a. Brick House) is a nonprofit housing co-operative association in Detroit, MI. The organization was formed by a group of individuals inspired by the co-op houses of the Inter Co-operative Council of Ann Arbor. Our mission is to provide affordable room and board to artists, activists, educators, students, and community builders in Detroit while fostering a feminist, anti-racist, social justice and sustainability minded community among it's members. The Brick & Mortar Collective is currently in the process of renovating a duplex on the East Side of Detroit as the permanent home for it's members. Read more about the Brick and Mortar Collective here: http://brickandmortar.che.coop/", "url": "https://www.facebook.com/events/411040869095357/", "name": "Brick and Mortar Collective"}, {"source": "Facebook", "date": "2015-12-03T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2015-12-03T21:00:00-05:00", "description": "Thursday, December 3 | 9[m | 18+ | $10 adv. / $12 Day of\n\nFlint Eastwood\nwith Valley Hush and Air is the Arche\n\nFlint Eastwood is the evolution of the creative side of Detroit-based multi-talented artist Jax Anderson. Flint Eastwood is what happens when friends and family gather in the forgotten spaces of an embattled city and are left to create with no rules, no boundaries, and nothing holding them back. Jax's endless creativity is a byproduct of growing up in a talented family.\n\nHer father was one of ten kids, each of whom played guitar and sang. Her oldest brother, Sam, played in punk bands, and Jax spent her teenage years learning the value of passion and acceptance at DIY shows. As she got older, her other brother (and Flint Eastwood collaborator and producer) Seth started playing in bands throughout the Detroit garage rock scene. Their dad worked as a curb address painter to pay the bills once the housing crash made his job as a mortgage broker invalid. During this time, Jax and her brothers went door to door, passing out flyers advertising her father's services, through some of the toughest residential neighborhoods in Detroit. These struggles helped form the vision that drives Flint Eastwood: to give everyone listening (whether live or on record) a momentary escape from the problems we all have.\n\nBetween helping around the house, Jax spent her days in her family's Detroit-area home, without cable and internet, teaching herself to play her father's 12-string Taylor guitar that he left for them in the living room. It was also during this time that her mother's love for Motown music began to influence Jax's knack for the theatrics and power of the Detroit sound, as Mom played records from The Temptations, the Jackson Five, and Earth Wind & Fire.\n\nOnce old enough to break out on her own, Jax briefly moved to a small German tourist town in rural Georgia, where the only station in town played solely pop and country. There, she fell in love with the hooks and harmonies that define American pop music. Later, she moved with Seth to Los Angeles, to mainly focus on writing for licensing opportunities and playing small clubs and house parties around town. While in LA, Jax developed a love for film, hopping on tour with bands every chance she could get as a self-taught videographer. Her experiences on the West Coast still influence Jax's push to make her musical endeavors into well-rounded multimedia presentations (mixing music with theatrical lighting, video projection, and costumes).\n\nUpon returning home to Detroit at the very beginning of the much-maligned city's recent resurgence, Jax's explosive and endearing personality on stage became the driving force behind Flint Eastwood. But through it all, it was the songs that were always the focus.\n\nOn their now sold-out debut EP Late Nights In Bolo Ties (2013), Jax and her friends mixed elements of pulsing electronic tracks with blistering bluesy guitar licks, all with a spaghetti-western backdrop, inspired by Sunday night movie sessions with Jax and her father.\n\nOn the forthcoming EP, Small Victories (to be released October 23), Jax has returned to her Detroit roots, mixing a taste of the theatricality of Motown music with her more recently found love for pop music. The result is six songs full of hooks. The type of tracks that you turn up a little too loud, close your eyes, and forget where you are for four minutes. In a live setting, the songs are taken to another level entirely, mixing a CHVRCHES-like depth with a twenty | one | pilots-style flair for the dramatic. This approach has led the band to rapidly gain an ever-growing fanbase. Their last two hometown headline plays have sold out (400+ tickets per show), and the band has toured heavily through the Midwest, mixing festival looks like Electric Forest, MoPop Festival, and Midpoint Music Festival with club appearances alongside acts such as Foxy Shazam, Mayer Hawthorne, Betty Who, X Ambassadors, and Andrew WK.\n\nSmall Victories was crafted and polished in Detroit’s second oldest church, now repurposed as Assemble Sound, a hub of Detroit creativity that fosters artists through collaboration. In this crumbling but inspiring location, the new record was created as a coping mechanism to help Jax deal with the loss of her mother, who was her biggest fan and inspiration. As the listener makes their way through the EP, they experience Jax making her way through her mother's illness and passing, railing against it, dealing with the aftermath associated with such a loss, eventually accepting it, and using it as a driving force to continue to create.\n\nJax broke the EP down in one simple thought:\n\n\"Small Victories comes from the idea that doing anything creative in life takes a lot of persistence, struggle, and hustle. It's easy to expect that the spoils will come easily and be immediately fruitful. But if you focus on the little things, the \"small victories\", you realize that it's those things that are the most rewarding. That's what keeps me going.\"\n\nThe lead single is the EP's first track, \"Find What You're Looking For\", which is Jax's interpretation of her mother's final words to her:\n\n\"Don't let this break you\".", "url": "https://www.facebook.com/events/1643528942585214/", "name": "Flint Eastwood, Valley Hush and Air is the Arche 12/3/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-12-04T18:00:00-05:00", "description": "Join us for the opening reception of Art Off the Wall, which will be held on Friday, December 4 at the 117 Gallery, in the Ann Arbor Art Center, in conjunction with downtown Ann Arbor’s Midnight Madness!\n\nThis event is open to the public and will include food, drinks and live entertainment. \n\nJOIN US AND TAKE A UNIQUE PIECE OF ART OFF THE WALL!\n\nArt Off the Wall is the Ann Arbor Art Center's annual signature holiday art exhibition. In its second year, this exhibit features the work of 12 invited artists, each showcasing up to 15 original works of art “Salon Style”, representing a variety of mediums available in a range of prices to fit any budget.\n\n2016 ART OFF THE WALL ARTISTS:\n\n- Alan Maciag\n- Amy Fell-Burford\n- Brian Sun\n- Cathy Jacobs\n- Elise Mesner\n- Elizabeth Youngblood\n- Kate Robertson\n- Kim Rhoney\n- Krysti Spence\n- LeeAnn Frame\n- Matt Lewis\n- Teresa Petersen\n\nArt Off the Wall is designed to give patrons the opportunity to purchase original works of art as holiday gifts or to build upon their own collection. Artwork is purchased directly “off the wall” creating an exciting and festive art buying experience.", "url": "https://www.facebook.com/events/405860662947111/", "name": "Art Off the Wall - 2nd Annual Holiday Exhibition"}, {"source": "Facebook", "date": "2015-12-04T18:00:00-05:00", "description": "This year's KindleFest will take place on Friday, December 4th, in the Ann Arbor Farmers Market.", "url": "https://www.facebook.com/events/901646886595434/", "name": "2015 Kerrytown KindleFest - A ChristKindlmart"}, {"source": "Facebook", "date": "2015-12-04T19:00:00-05:00", "description": "It’s party time in the Main Street Area! Stores stay open late with lots of holiday specials.  While you shop enjoy the sidewalk entertainment, and say hello to Santa Claus and Miss Washtenaw County, who will be roaming the sidewalks from 7-9pm! Join local business owners as they welcome guests with extra special savings.\n\nwww.mainstreetannarbor.org", "url": "https://www.facebook.com/events/176874405986484/", "name": "Midnight Madness"}, {"source": "Facebook", "date": "2015-12-04T20:00:00-05:00", "description": "Friends! Loved Ones! Enemies! Join us!\n\nOn December 4th at 8pm, we will be officially lighting our magnificent (non-denominational) holiday tree! Enjoy the spectacle of electric lights, meticulous decorations, and a very special tree-topper. Be ready to exchange holiday good moods and high fives, hugs, etc. PLUS coffee and cider provided by the best cafe in town, the Espresso Bar and custom baked goods supplied by Vault of Midnight staff.\n\n\"Ok,\" you are thinking, \"that sounds like probably the best.\" You're right, but that's not even all: \n\nBring us an ornament for our new tree anytime between December 4th and Christmas Eve and we will reward you with a present! Our tree will be covered with them! Presents include gift cards worth up to $50, half-off coupons, free merchandise, and more. \n\nWe love this time of year at Vault of Midnight and we can't wait to share in some genuine holiday spirit with you. See you on December 4th!", "url": "https://www.facebook.com/events/1493679600934731/", "name": "Tree Lighting Soiree!"}, {"source": "Facebook", "date": "2015-12-04T20:00:00-05:00", "description": "In this holiday concert, Lee Murdock and his band celebrate the Christmas holidays steeped in Great Lakes heritage. The story of the Rouse Simmons is a holiday remembrance of loss and renewal, love, and the resilience of the human spirit. The ship's captain, Herman Schuenemann, was well-known and loved on the Chicago River docks where he sold (and sometimes gave away) the trees brought down from Manistique. The ship was lost in Lake Michigan in November 1912, but the captain's wife and family kept up this tradition for 22 years more, well beyond the days of the tall ships on the Great Lakes. There were many Christmas tree ships on the Great Lakes, but the Rouse Simmons is famed for her family. Numerous books, children's stories, and museum exhibits have kept this story alive. Lee wrote and recorded his song about her in 1989, and has presented an annual concert ever since to remember this story and many other songs and stories about family ties, and the holiday season, against a backdrop of mariners and Michigan history.\nwww.LeeMurdock.com", "url": "https://www.facebook.com/events/1141520755876717/", "name": "Lee Murdock's Christmas Ship Concert with Blue Horizon Band"}, {"source": "Facebook", "date": "2015-12-05T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2015-12-05T18:00:00-05:00", "description": "Join us as we celebrate five years of great beer at 2019 W. Stadium! Dragon Wagon, the first band EVER to play at Wolverine State, will be rocking out here starting at 9 pm. Want to take a look at our expansion?! We're featuring brewery tours all night! There will be killer food specials, giveaways, and special-edition 5th Anniversary t-shirts for purchase. \n\nWe'll have an exclusive reserve of 2014 Massacre on draft, and a brand-new beer, Vers l'avant (means \"forward\" -- appropriate, right?) will be released! Vers l'avant is a golden lager made with Michigan pear juice and aged in white wine barrels, and it promises to be complex, delicious, and representative of the next stage of evolution at Wolverine State Brewing Co! \n\nThis is going to be one helluva party. Come raise a glass to five years of Wolverine State Brewing Co and toast to the future!", "url": "https://www.facebook.com/events/1050406465015551/", "name": "Five Year Anniversary Party"}, {"source": "Facebook", "date": "2015-12-06T13:00:00-05:00", "description": "Tremendous progress has been made to increase the native habitat in these woods- help continue this effort! We’ll be expanding restoration work by removing invasive shrubs, such as honeysuckle and buckthorn. Please meet at the north end of Upland Drive, just north of Plymouth Road.\nPlease dress for the weather and for working off trail in the woods. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "url": "https://www.facebook.com/events/700887476679063/", "name": "Stewardship Workday at Leslie Woods"}, {"source": "Facebook", "date": "2015-12-07T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2015-12-09T21:00:00-05:00", "description": "$10 / under 21 $13 | 9pm | 18+\n\nMarbin is a progressive jazz-rock band based in Chicago, IL, with a unique story that stands out in today's music world. With a do-it-yourself approach, Marbin started touring in 2011 and has played over a thousand shows since, bringing their original instrumental music everywhere in the States that they could book a show. After well over a thousand shows and more than 20,000 albums sold, Marbin has gained thousands of devoted fans all over the worldwide. Marbin has released five albums with Moonjune Records: Marbin (2009), Breaking the Cycle (2011), Last Chapter of Dreaming (2013), The Third Set (2014), and Aggressive Hippies (2015). \n\nIn addition to their regular schedule, Marbin has toured with Allan Holdsworth’s trio with Yellow Jackets’ bassist Jimmy Haslip and drummer Virgil Donati of Planet X, as well as Scott Henderson's trio, which included Mike Clark and Jeff Berlin. Marbin has also recorded and performed with drummer Paul Wertico, (Pat Metheny Group), bassist Steve Rodby (Pat Metheny Group), percussionist Jamey Haddad (Paul Simon), Wayne Krantz, and more. With: Chirp", "url": "https://www.facebook.com/events/1524660224516076/", "name": "Marbin w/ Chirp 12/9/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-12-10T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2015-12-10T19:00:00-05:00", "description": "Given our love of beer and our passion for celebration, it should come as no surprise that our everyday drink also takes on a more festive air during the holidays. Everyday ales are transformed with fruit, herbs and spices. Standard recipes are beefed up for bigger, stronger, heartier, or hoppier versions of every- day favorites. Tis the season for old ales, dopplebocks, Christmas ales and meads.\n\nHoliday brews reflect the richness and diversity of beer styles being produced by the best breweries here and abroad. Wheats, Wits, Bocks, Ice Beers, and Meade join an assortment of wonderful fruited, spiced, and strengthened recipes on the evenings tasting list. These subtly fruited and spiced brews go great with food or as an aperitif and are a great way to dress up a traditional holiday meal.\n\nAll of the beers at this month's tasting fall into a loosely defined group of holiday beers. All a beer really needs to fit into this category is to be a little special and to be called a holiday beer by the brewer. This is a great way to meet fellow beer lovers, try new beers, and delve deeper into a style by tasting some of the best examples in a casual atmosphere.\n\nCost:\n$25 in advance\n$30 day of\nWe'll bring in two dozen great examples of this style and serve them up with an appetizer buffet. Tastings also feature style and tasting notes and a door prize drawing. \n\nPurchase tickets by calling 734-213-1393 or stopping by the Pub. ID is required at the door. Advance tickets are recommended as tastings usually sell out. 7-9pm", "url": "https://www.facebook.com/events/983747505030513/", "name": "Beer Tasting: Holiday Brews"}, {"source": "Facebook", "date": "2015-12-10T21:00:00-05:00", "description": "Thu. December 10 | 9pm | 18+ | $20 Cover\n\nThe Sword is a bladed weapon used primarily for cutting or thrusting. WSG: ROYAL THUNDER & Blue Snaggletooth\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/480", "url": "https://www.facebook.com/events/690897114388628/", "name": "The Sword High Country Tour wsg Royal Thunder & Blue Snaggletooth 12/10/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-12-12T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2015-12-14T19:00:00-05:00", "description": "After 3 rounds, the top eight business storytellers are ready to compete for the big pot, the big cheese, the big $10,000 pot of chitlins! :0 \n\nOver the past year, we've covered all phases of being a bad ass in the world of doing something out-of-the-comfort-zone. We've had: tears, smiles, breakthroughs, laughs, disappointments and yes, straight up pissed-offery yet what has bound everyone who has gone through this process of answering the question, 'WHY DO YOU EXIST?' is BOLDNESS.  \n\nThink about it...not only have these folks drummed up the bravery of speaking in public but speaking in public in a way that shows the world who they ARE not just what they DO. They have been completely vulnerable, real and raw.  These folks are truly bad ass. TRULY. People are STILL talking about:\n\nVickie Lewis who extended her hand, beautifully to the audience as she shared her secret of what she REALLY wanted to do in her life, and it wasn't being an environmental engineer. Vickie J. Lewis: The superSTAR!!\n\nNic Sims as she brandished a REAL, ginormous sword to show how she found the courage to dare the shittiest parts of this world to protect her family and then showed us how to find our own sword to take on our own battles. (she did put down the sword and showed truly where the power was and it was...LOVE...GULP with a lump in the throat)\n\nDavid Silver had the freakin' room in a complete PUDDLE as he shared how his love of horses and bringing them into the lives of children in Detroit is actually part of his own journey to find his way to make peace with his parents.\n\nOh wait...Remember when Jennifer Matthews pulled the fake baby out (accidently hit its head on the mic) and forced us to see how first impressions affect how we see each other?\n\nOooooo....Bryant and Kummbareh Owens from Everbutter LLC. FIRST we had Miss 'I hate talking in the public' turn into Viola Davis at the mic while her husband pulled out the stops at the end. And their kids ....the KIDS! A-D-O-R-A-B-L-E. \n\nAmy Peterson had everyone everbody ready to jump on the field when she declared her dream to be the first female general manager of a professional baseball team but saw it evaporate when a man was promoted ahead of her at the Detroit Tigers. But she was so bad ass that she took that moment and turned it around to help other women. #rebelnell\n\nUh... Mr. Christopher John who felt just a-okay with being in second place his entire life ONLY to come face to face with seeing the effects of how an entire community 'settling', he decided to do something about it. \n\nAnd then there was Muhammad Mazhari from Ballot who shared for the first time that it was his time as a student in Pakistan and seeing first hand the effects of having limited access to information and education. He's doing something about it.\n\nThere were many, many others who didn't make the top 8 who we celebrate as well. BUT, do come out and support these truly folks who are mastering the art of Bad Assery!!", "url": "https://www.facebook.com/events/189492038054557/", "name": "Entre-SLAM: The FINALE at The Ark"}, {"source": "Facebook", "date": "2015-12-16T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2015-12-18T18:00:00-05:00", "description": "Come join us for our first annual artist holiday party and critique night. Bring one or two pieces you are looking to get feedback on whether completed or in progress. It will be a fun night with lots of art and a great opportunity to meet other other working artists.", "url": "https://www.facebook.com/events/476990172480417/", "name": "Artists' Meet & Greet - Holiday Party Critique Night"}, {"source": "Facebook", "date": "2015-12-18T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2015-12-18T20:00:00-05:00", "description": "Katie Geddes sings traditional and contemporary folk, country-folk, and folk-pop tunes. A deft interpreter of beloved songs, her captivating voice and velvety-smooth delivery bring new life to the compositions of writers such as John Prine, Buffy Sainte-Marie, Michael Nesmith and Lennon and McCartney. Katie’s latest CD release, We Are Each Other’s Angels, features an inspired roster of guest artists including Michael Johnson, Mary McCaslin, Don Henry and Small Potatoes, and has received extensive airplay across the country and around the world.When not doing her own gigs, Katie has been known to “moonlight” singing harmony for folk- rock legend Melanie and local favorite Matt Watroba.\n\nMatt Watroba brings a special set of talents to the stage. His mellow voice, friendship with his audience, and knowledge of his presentations is impressive. Add to that Matt's own special brand of humor and you are in for a most entertaining and enlightening set. You will feel his love of folk music, both traditional and contemporary; its writers and performers, its heroes and villains. Matt sings songs of compassion, inner strength, humor, and everyday living. \n \nDavid Barrett writes songs about children. And criminals. He writes music about golf. And Norman Vincent Peale. He struggled for years, scrapping for gigs (and, in his words, \"driving for checks\") only to become the proverbial \"overnight sensation\" in a field he'd never dreamed of storming. Barrett recalls, \"In 1985, I was visiting a friend in New York City who was a writer for Sports Illustrated. We were watching the NBA Finals, talking about sports and life, and I remembered that I had written this song about sports and achievement, so when I got home I sent it to him. He took it over to CBS, and they called me up out of the blue.”  The song, of course was “One Shining Moment,” the paean to endeavor that now crowns the NCAA Basketball Finals. A version sung by Luther Vandross pushes the song’s power to a new height. David Barrett: a handsome guy singing provocative, hauntingly beautiful songs in which he tackles lost love, high comedy and the physics of life. \n\nVocal trio All About Eve (Katie Geddes, Deb Wood, David Vaughn) offers up a variety of close-harmony pop covers and traditional and contemporary folk and gospel songs, accompanied by Dan Reynolds on guitar, David Stearns on bass, and Lori Fithian on percussion.", "url": "https://www.facebook.com/events/1476261279354004/", "name": "Katie Geddes and Friends wsg All About Eve, David Barrett, and Matt Watroba"}, {"source": "Facebook", "date": "2015-12-18T21:30:00-05:00", "description": "Fri. Dcember 18 | 9:30pm | 18+ | $10 Cover\n\nUtterly unique and unclassifiable; Super Happy Funtime Burlesque is all at once a live band, an original work of musical theater, a comedy show, a bawdy and sexy burlesque production, a giant ball of chaos rolled up into one neat little production that has been leaving jaws on the floor for nearly a decade. Based out of Grand Rapids, Michigan, they travel the nation in their big red school bus bringing the good word of burlesque and musical theater to the nation. Not for the faint of heart!!!  http://www.blindpigmusic.com/calendar.html#!/events/569", "url": "https://www.facebook.com/events/908438685914218/", "name": "Super Happy Funtime Burlesque 12/18/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-12-23T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2015-12-25T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2015-12-30T23:00:00-05:00", "description": "Need a fantastic gift for your fave teacher? Grab a bag of Sweetwaters' new blend, Scholar Joe, in stock right now! For every bag you buy, Lucky's Market will make a donation to the Ann Arbor Public Schools Educational Foundation!", "url": "https://www.facebook.com/events/463341333828385/", "name": "Scholar Joe- Supporting the AAPSEF"}, {"source": "Facebook", "date": "2015-12-31T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2016-01-02T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-01-09T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2016-01-09T21:30:00-05:00", "description": "Saturday, January 9 | 9:30pm |  18+ | $10 Cover\n\nEmbarco Presents: Trick Trick live in concert!", "url": "https://www.facebook.com/events/443160592535849/", "name": "Embarco Presents: Trick Trick 1/9/16 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-01-11T19:30:00-05:00", "description": "Monday, January 11, 2016, 7:30 pm\nHill Auditorium\n\nFounded by Sir Thomas Beecham in 1946, the Royal Philharmonic Orchestra made its UMS debut in 1950 and last performed in Hill Auditorium in 1992. This concert features Pinchas Zukerman both at the helm and as the featured soloist. \n\nMore info: http://ums.org/performance/royal-philharmonic-orchestra/", "url": "https://www.facebook.com/events/780337908747994/", "name": "Royal Philharmonic Orchestra"}, {"source": "Facebook", "date": "2016-01-11T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-01-16T21:00:00-05:00", "description": "Sat. January 16 | 9pm | 18+ | $14 Cover\n\nChrome Sparks is the solo project of Jeremy Malvin, a Brooklyn transplant from Pittsburgh by way of Ann Arbor. In 2014, after having self released a small handful of singles and two EPs on Bandcamp, Malvin signed to the taste making Sydney based label Future Classic. Under the new label, he rereleased Sparks EP and released the Goddess EP. His next EP, Parallelism is slated to be released with Future Classic on November 6.\n\nInspired by a background in classical percussion and an obsession with synthesizers, Malvin creates dazed, melodic beat-centric tunes that loosely hang between down-tempo head nodders and up-tempo club bangers. FADER has described his music as ‘form-shifting beats [that] seem to resonate with spaced-out chillers and hyperactive party kids alike’.\n\nIn 2012, while on Warped Tour as the drummer for Stepdad, Malvin released the slow burning, bass heavy single “Marijuana” on a Bandcamp compilation highlighting music from he and his friends in Ann Arbor. It quickly rocketed to #1 on Hype Machine and has since become an internet-stoner anthem. It has subsequently been rereleased by Future Classic and Kitsuné.\n\nHis upcoming release, Parallelism, was made using sounds from three analog synthesizers, vocal samples from friends, and a tambourine.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/578", "url": "https://www.facebook.com/events/1390235697944662/", "name": "Chrome Sparks 1/16/16 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-01-19T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2016-01-20T19:30:00-05:00", "description": "Wednesday, January 20, 2016, 7:30 pm\nHill Auditorium\n\n“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas) Since 1988, Wynton Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, sophisticated to spirited, it’s all sheer jazz perfection — no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/1516-jazz-at-lincoln-center-orchestra/", "url": "https://www.facebook.com/events/1604747733142781/", "name": "Jazz at Lincoln Center Orchestra with Wynton Marsalis"}, {"source": "Facebook", "date": "2016-01-21T19:30:00-05:00", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "url": "https://www.facebook.com/events/1620983154780471/", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show"}, {"source": "Facebook", "date": "2016-01-21T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-01-22T19:30:00-05:00", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "url": "https://www.facebook.com/events/1620983154780471/", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show"}, {"source": "Facebook", "date": "2016-01-22T20:00:00-05:00", "description": "Friday, January 22, 2016, 8:00 pm\nRackham Auditorium\n\nThe Chamber Music Society of Lincoln Center presents chamber music of every instrumentation, style, and historical period. The six musicians performing in this concert include violinist Benjamin Beilman, an Ann Arbor native whose career has been burnished by a series of major awards recognizing his extraordinary musical talent. \n\nMore info: http://ums.org/performance/chamber-music-society-of-lincoln-center", "url": "https://www.facebook.com/events/1453480484950039/", "name": "Chamber Music Society of Lincoln Center"}, {"source": "Facebook", "date": "2016-01-22T20:00:00-05:00", "description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "url": "https://www.facebook.com/events/1452156068412417/", "name": "Young Jean Lee Theater Company: Straight White Men"}, {"source": "Facebook", "date": "2016-01-23T20:00:00-05:00", "description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "url": "https://www.facebook.com/events/1452156068412417/", "name": "Young Jean Lee Theater Company: Straight White Men"}, {"source": "Facebook", "date": "2016-01-24T19:30:00-05:00", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "url": "https://www.facebook.com/events/1620983154780471/", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show"}, {"source": "Facebook", "date": "2016-01-27T19:30:00-05:00", "description": "Wednesday, January 27, 2016, 7:30 pm\nMichigan Theater\n\nBy any measure of talent and accomplishment, Lisa Fischer is a superstar. Yet, if you do not know her name, it’s likely because she has spent the past 20 years as a backup singer for the Rolling Stones, Sting, Chris Botti, and countless others. Her name may not be on the marquee, but she doesn’t care. Her astonishing range, spot-on intonation, mastery of the stage, and infectious sweet smile make her the go-to singer for the likes of Tina Turner, Chaka Khan, Beyoncé, Bobby McFerrin, Lou Reed, Dionne Warwick, Aretha Franklin, and a host of others. As one of the top session and backup singers, she’s featured in the Oscar-winning documentary 20 Feet from Stardom and celebrated for her live concert duets with Mick Jagger during “Gimme Shelter” that have also received millions of hits on YouTube. After winning Grammy Awards for “Best Female R&B Performance” (1992) and “Best Music Film” (2015), she has decided to move forward from being a backup singer, putting together her own band and claiming her well-deserved place center stage. \n\nMore info: http://ums.org/performance/ms-lisa-fischer-and-grand-baton", "url": "https://www.facebook.com/events/1020565857968750/", "name": "Ms. Lisa Fischer and Grand Baton"}, {"source": "Facebook", "date": "2016-01-30T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2016-02-01T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-02-02T19:30:00-05:00", "description": "Tuesday, February 2, 2016, 7:30 pm\nLydia Mendelssohn Theatre\n\nWith Tanya Tagaq, ancient meets modern in provocative, powerful ways. This spellbinding performance features the Inuit throat singer accompanying a screening of Nanook of the North (1922) with a live score. Tagaq’s mixed-media performance reclaims the controversial classic — considered the first feature-length documentary — capturing the sense of the sound of the Arctic spaces shown in the film and adding tremendous feeling and depth to what is a complex mix of beautiful representations and racially charged clichés.\n\nTanya Tagaq’s music is unnerving and exquisite, rooted in Inuit throat singing, but also influenced by electronica, industrial, and metal influences. It is a style that she has perfected with collaborators such as Björk and that reminds some of Meredith Monk’s vocal innovations. Winner of the 2014 Polaris Prize for “Album of the Year” (she beat out Drake and Arcade Fire), Tanya Tagaq makes her UMS debut in this one-night only event. “Nobody, anywhere, sounds like she does.” (Globe and Mail)\n\nMore info: http://ums.org/performance/tanya-tagaq/", "url": "https://www.facebook.com/events/1155115267866605/", "name": "Tanya Tagaq in concert with Nanook of the North"}, {"source": "Facebook", "date": "2016-02-05T20:00:00-05:00", "description": "Friday, February 5, 2016, 8:00 pm\nLydia Mendelssohn Theatre\n\nTaylor Mac is equal parts bedazzled shaman, searing social critic, radical angel, and Elizabethan fool. A critical darling of the New York downtown cabaret scene, he is beloved for his iconic beauty, disarming vulnerability, and soaring spirit. His 24-Decade History of Popular Music will eventually become an epic show performed over 24 continuous hours; in Ann Arbor, Taylor will focus on the 1960s, 70s, and 80s, connecting the decades to the vibrant music scene in Detroit. “Fabulousness can come in many forms, and Taylor Mac seems intent on assuming every one of them.” (New York Times) A UMS co-commission. \n\nMore info: http://ums.org/performance/taylor-mac-a-24-decade-history-of-american-popular-music-1960s-1980s/", "url": "https://www.facebook.com/events/1594841967471096/", "name": "Taylor Mac: A 24-Decade History of American Popular Music: 1960s–1980s"}, {"source": "Facebook", "date": "2016-02-06T20:00:00-05:00", "description": "Saturday, February 6, 2016, 8:00 pm\nHill Auditorium \n\n“His superb live performance confirmed the impression of his recording: A major new pianist has arrived.” (New York Times) Born in 1987, the Russian-German pianist Igor Levit received effusive praise for his two-disc debut album of Beethoven’s late piano sonatas. A relative newcomer to the United States, he makes his UMS debut with this recital appearance. \n\nMore info: http://ums.org/performance/igor-levit/", "url": "https://www.facebook.com/events/1435582513413462/", "name": "Igor Levit, piano"}, {"source": "Facebook", "date": "2016-02-11T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2016-02-11T21:00:00-05:00", "description": "Thursday, Feb 11 | 9pm | 18+ | $10 Cover\n\nBroccoli Samurai is Cleveland, OH’s premiere jamtronica and EDM project. Broccoli Samurai features Ryan “Bruce” Hodson on keys and synth, Chris Walker on drums and percussion, and Josh Sebo on bass. Broccoli Samurai’s drum and bass influenced, progressive electronica has been thrilling audiences throughout the Midwest, winning the band spots at major events such as Rootwire, The Werk Out, Hyperion Fest, Summerdance, and The Mad Tea Party Jam, as well as direct support, club spots for such notable bands as Boombox, Lotus, Dopapod, Papadosio, Rusted Root, Big Gigantic, Conspirator, O.A.R., and Ozric Tentacles. Broccoli Samurai’s groove is the kind that keeps the crowd moving well into the wee hours of the morning. This band is making big moves and the time to take notice is now. \n\nWith: Liquid Monk\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/570", "url": "https://www.facebook.com/events/1655909208022221/", "name": "Broccoli Samurai w/ Liquid Monk 2/11/16 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-02-13T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-02-13T20:00:00-05:00", "description": "Saturday, February 13, 2016, 8:00 pm\nPower Center\n\n“Every aspect of the dance-making here is thoroughly accomplished.” (New York Times) A prolific choreographer who danced with Ronald K. Brown’s Evidence, Rennie Harris’s Puremovement, and the Alvin Ailey American Dance Theater, Camille A. Brown brings her newest work to Ann Arbor for her UMS debut. Black Girl — Linguistic Play speaks to the complexities of carving out a positive identity as a Black female in urban American culture.\n\nIn a world where Black women are often portrayed only in terms of their strength, resiliency, or trauma, this work interrogates these narratives by presenting a fuller spectrum of the black female and the complexities of negotiating in this racially and politically charged world. The work uses elements of African-American social dancing, rhythmic play, and musical compositions to better illustrate who “Black Girl” knows herself to be. Brown’s choreography is “fun, inventive, and watchable.” (Times Square Chronicles) \n\nMore info: http://ums.org/performance/camille-a-brown-dancers/", "url": "https://www.facebook.com/events/368546533344933/", "name": "Camille A. Brown & Dancers: Black Girl — A Linguistic Play"}, {"source": "Facebook", "date": "2016-02-16T19:30:00-05:00", "description": "February 16, 18\nRackham Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "url": "https://www.facebook.com/events/442008155980033/", "name": "Sir András Schiff, piano"}, {"source": "Facebook", "date": "2016-02-19T20:00:00-05:00", "description": "Friday, February 19, 2016, 8:00 pm\nMichigan Theater\n\nA decade after it was first brought to the screen, Benoît Charest revives the music of the Oscar-nominated film The Triplets of Belleville with a remarkable cast of musicians in this silent movie-live concert event. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His near-sighted grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas.\n\nBut the true star of the animated film is the hot jazz score written by Canadian composer Benoît Charest. This screening of the beloved French film transports audiences to the exciting streets of 1920s Paris and Le Jazz Hot.\n\nMore info: http://ums.org/performance/the-triplets-of-belleville/", "url": "https://www.facebook.com/events/1620380161539059/", "name": "The Triplets of Belleville"}, {"source": "Facebook", "date": "2016-02-20T20:00:00-05:00", "description": "February 20\nHill Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "url": "https://www.facebook.com/events/1611931089050428/", "name": "Sir András Schiff, piano"}, {"source": "Facebook", "date": "2016-02-24T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2016-02-24T21:00:00-05:00", "description": "Wed. February 24 | 18+ | 9pm | $15 / $65 VIP Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/567", "url": "https://www.facebook.com/events/1725536331010947/", "name": "Aaron Carter 2/24/16 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-02-25T21:00:00-05:00", "description": "Nashville-based, independent artist, Ron Pope, has stood at a crossroads where so many musicians find themselves — at the intersection of record label and independence. In an ever-evolving industry filled with rejection and compromise, he has plotted a new course for his music to reach loyal listeners, taking the industry-road-less-traveled in exchange for the ultimate payback, a league of devoted fans the world over. WSG: Tuett - http://www.truettofficial.com/\n\nVIP tix available here: http://www.etix.com/ticket/p/4574033/ron-pope-vip-meet-greet-ann-arbor-blind-pig-the-blind-pig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/446", "url": "https://www.facebook.com/events/1449897481978519/", "name": "Ron Pope & The Nighthawks w/ Truett 2/25/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-02-26T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-02-26T21:00:00-05:00", "description": "Second Show Added for Friday, February 26th!\n\nDoors 9pm | 18+ | $15 General Admission / $65 Admission + Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/573", "url": "https://www.facebook.com/events/1615405452043601/", "name": "Aaron Carter - Night Two 2/26/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-02-27T19:30:00-05:00", "description": "A journey to the land of the mind's eye. Note special start time!", "url": "https://www.facebook.com/events/1112577285437513/", "name": "The Ark's 29th Annual Storytelling Festival feat. Kevin Kling"}, {"source": "Facebook", "date": "2016-02-28T13:00:00-05:00", "description": "Storytelling for the family", "url": "https://www.facebook.com/events/1067500173261475/", "name": "Storytelling for Kids"}, {"source": "Facebook", "date": "2016-02-28T19:30:00-05:00", "description": "New music from North Carolina's renegade traditionalists", "url": "https://www.facebook.com/events/193289911005780/", "name": "Mipso"}, {"source": "Facebook", "date": "2016-03-02T20:00:00-05:00", "description": "An uncharted experiment in group improvisation.", "url": "https://www.facebook.com/events/1653174164942229/", "name": "Everyone Orchestra"}, {"source": "Facebook", "date": "2016-03-03T20:00:00-05:00", "description": "\"America's funniest lesbian\"—Curve", "url": "https://www.facebook.com/events/171919949819620/", "name": "Suzanne Westenhoefer"}, {"source": "Facebook", "date": "2016-03-04T20:00:00-05:00", "description": "The new wave in Irish music", "url": "https://www.facebook.com/events/468983299893529/", "name": "We Banjo 3"}, {"source": "Facebook", "date": "2016-03-05T20:00:00-05:00", "description": "Folk Festival's Friday MC returns.", "url": "https://www.facebook.com/events/1145716695439288/", "name": "David Mayfield"}, {"source": "Facebook", "date": "2016-03-05T20:00:00-05:00", "description": "Saturday, March 5, 2016, 8:00 pm\nHill Auditorium\n\nPaddy Malone and The Chieftains celebrated 50 years of performing in 2012, and their music remains as fresh and relevant as when they first began. Recognized for reinventing traditional Irish music on a contemporary and international scale, their ability to blend tradition with modern music has made them one of the most renowned and revered musical groups to this day. Back for their fifth UMS performance and their first in nearly a decade, “they seem ageless, and so does their Irish music. If common sense tells you they can’t go on forever, you wouldn’t know it from their electrifying performance.” (Boston Globe)\n\nMore info: http://ums.org/performance/the-chieftains/", "url": "https://www.facebook.com/events/1598997080377800/", "name": "The Chieftains"}, {"source": "Facebook", "date": "2016-03-07T20:00:00-05:00", "description": "Traditional and contemporary Irish music", "url": "https://www.facebook.com/events/1724878727724016/", "name": "The Alan Kelly Gang"}, {"source": "Facebook", "date": "2016-03-09T00:00:00-05:00", "description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "url": "https://www.facebook.com/events/147591712264416/", "name": "Holiday Sock Drive"}, {"source": "Facebook", "date": "2016-03-11T19:30:00-05:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-03-11T20:00:00-05:00", "description": "New music from Detroit's folk troubadour", "url": "https://www.facebook.com/events/776578575785364/", "name": "Chris Buhalis"}, {"source": "Facebook", "date": "2016-03-11T20:00:00-05:00", "description": "March 11-12\nPower Center\n\n“You can’t help but leave with a fuzzy feeling inside.” (examiner.com) The globetrotting, Montreal-based scratch DJ and music producer Kid Koala presents a magical, multi-disciplinary and theatrical adaptation of his graphic novel and soundtrack, Nufonia Must Fall. This charming story centers around a headphones-sporting robot on the verge of obsolescence who falls in love with a lonely office girl. This live adaptation unfolds via real-time filming of more than a dozen miniature stages and a cast of puppets, while Kid Koala and the Aelos Quartet provide original live scoring on piano, strings, and turntables. The result? You’ll seem to be watching an animated picture, but simultaneously seeing puppets being filmed and projected in real time. Heartfelt, hand-made, and a very cool live experience. \n\nMore info: http://ums.org/performance/nufonia-must-fall/", "url": "https://www.facebook.com/events/488544131294497/", "name": "Nufonia Must Fall"}, {"source": "Facebook", "date": "2016-03-11T21:00:00-05:00", "description": "$18 adv./ $20 day of | 18+ | 9pm\n\nSimply put, Tortoise has spent nearly 25 years making music that defies description. While the Chicago-based instrumental quintet has nodded to dub, rock, jazz, electronica and minimalism throughout its revered and influential six-album discography, the resulting sounds have always been distinctly, even stubbornly, their own.\n\nFull Bio - http://www.blindpigmusic.com/calendar.html#!/events/521", "url": "https://www.facebook.com/events/1622992504617740/", "name": "Tortoise 3/11/16 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-03-13T19:30:00-04:00", "description": "\"World's best acoustic band\"—Guitar Shop. Photo by Paolo Aizza.", "url": "https://www.facebook.com/events/690756901025231/", "name": "The California Guitar Trio"}, {"source": "Facebook", "date": "2016-03-15T19:30:00-04:00", "description": "Tuesday, March 15, 2016, 7:30 pm\nSt. Francis of Assisi\n\nFresh from their 2014 performance of Monteverdi’s Vespers, Apollo’s Fire & Singers returns to St. Francis of Assisi Church with one of their signature pieces, Bach’s St. John Passion. Bursting out of the gate from the agitated opening chorus, this work is considered Bach’s most dramatic and theatrical oratorio. In this acclaimed interpretation, the story’s action is highlighted by a dramatic approach: the roles are performed by true singing actors, staged on a special theatrical platform within the orchestra. The acclaimed Apollo’s Singers evoke the wild mob with fierce intensity. \n\nMore info: http://ums.org/performance/apollos-fire-st-john-passion/", "url": "https://www.facebook.com/events/971816919508035/", "name": "Apollo’s Fire & Apollo’s Singers: Bach’s St. John Passion"}, {"source": "Facebook", "date": "2016-03-15T20:00:00-04:00", "description": "Celtic folk and pop with incredible instrumental virtuosity", "url": "https://www.facebook.com/events/1723526264550616/", "name": "The High Kings"}, {"source": "Facebook", "date": "2016-03-19T20:00:00-04:00", "description": "Saturday, March 19, 2016, 8:00 pm\nHill Auditorium\n\nThe Montreal Symphony returns to Ann Arbor for the first time since 1989, with American conductor Kent Nagano and pianist Daniil Trifonov both making their UMS debuts. “Hearing Trifonov is like having a deep-tissue massage: you keep wanting to pull away from the sheer intensity of it, and you come out feeling as if your reality had been slightly altered…a knockout.” (Washington Post) \n\nMore info: http://ums.org/performance/montreal-symphony-orchestra/", "url": "https://www.facebook.com/events/1582133688713673/", "name": "Montreal Symphony"}, {"source": "Facebook", "date": "2016-03-20T19:30:00-04:00", "description": "Appalachia gone Brazilian! Photo by Vincent Soyez. This show is FREE to Ark members at the door.", "url": "https://www.facebook.com/events/1488521474793961/", "name": "Matuto"}, {"source": "Facebook", "date": "2016-03-23T20:00:00-04:00", "description": "Indian classical music and multicultural fusion", "url": "https://www.facebook.com/events/962546740435420/", "name": "Maestro Khan"}, {"source": "Facebook", "date": "2016-03-24T20:00:00-04:00", "description": "New music from Patty!", "url": "https://www.facebook.com/events/119883711695876/", "name": "Patty Larkin"}, {"source": "Facebook", "date": "2016-03-26T20:00:00-04:00", "description": "Saturday, March 26, 2016, 8:00 pm\nHill Auditorium\n\nBach’s complete Sonatas and Partitas have long been a “Mount Everest” of the violin repertoire — music that performers return to throughout their lives. In this special event, Gil Shaham collaborates with video artist David Michalek to open up new avenues for listening to and interpreting Bach’s towering masterpieces.\n\nVideo artist David Michalek, best known for his “Slow Dancing” installation at Lincoln Center, and in the capitals of Europe, says of the Bach Six Solos project: “As a contemporary artist with a particular interest in motion pictures and time, I’ve been compelled to consider how the addition of extreme slow motion might be applied to moving images of the face, the body, obliquely narrative tableaux, and also still life in ways that can both enhance and alter the meanings latent within them. As a visual strategy, extreme slowness creates a continuing sense of a pause in the action — as if the growth and evolution of the slow-moving image is itself a further manifestation of the deep and consuming absorptive state that often arises while observing it.”\n\nMore info: http://ums.org/performance/gil-shaham/", "url": "https://www.facebook.com/events/1663165150570187/", "name": "Bach Six Solos: Gil Shaham, violin"}, {"source": "Facebook", "date": "2016-03-26T20:30:00-04:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-03-31T19:30:00-04:00", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"source": "Facebook", "date": "2016-04-01T19:30:00-04:00", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"source": "Facebook", "date": "2016-04-01T20:00:00-04:00", "description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "url": "https://www.facebook.com/events/453190221522442/", "name": "Mariachi Vargas de Tecalitlán"}, {"source": "Facebook", "date": "2016-04-02T20:00:00-04:00", "description": "Punk-funk-folk's pathbreaking entrepreneur. At the Michigan Theater, 603 E. Liberty, Ann Arbor.", "url": "https://www.facebook.com/events/445903825593347/", "name": "Ani DiFranco at The Michigan Theater"}, {"source": "Facebook", "date": "2016-04-03T19:30:00-04:00", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"source": "Facebook", "date": "2016-04-06T19:30:00-04:00", "description": "Note special start time!", "url": "https://www.facebook.com/events/1617523538522455/", "name": "Micah Smiles Benefit Concert for C.S. Mott Children's Hospital"}, {"source": "Facebook", "date": "2016-04-06T19:30:00-04:00", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"source": "Facebook", "date": "2016-04-07T20:00:00-04:00", "description": "Bluegrass, Byrds, and more", "url": "https://www.facebook.com/events/724290011035895/", "name": "Chris Hillman & Herb Pedersen"}, {"source": "Facebook", "date": "2016-04-08T20:00:00-04:00", "description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "url": "https://www.facebook.com/events/827290400697161/", "name": "Jerusalem Quartet"}, {"source": "Facebook", "date": "2016-04-11T20:30:00-04:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-04-13T20:00:00-04:00", "description": "South Africa's legendary breaker of walls", "url": "https://www.facebook.com/events/1602568673339827/", "name": "The Johnny Clegg Band"}, {"source": "Facebook", "date": "2016-04-14T19:30:00-04:00", "description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "url": "https://www.facebook.com/events/1621365181438631/", "name": "Mnozil Brass"}, {"source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus, where it blended with elements of Spanish music, then was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed Tunisian singer Sonia M’barek, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "url": "https://www.facebook.com/events/419604171550681/", "name": "Zafir: Musical Winds from North Africa to Andalucía"}, {"source": "Facebook", "date": "2016-04-16T20:00:00-04:00", "description": "Legendary guitar mastery", "url": "https://www.facebook.com/events/1512513839062559/", "name": "Leo Kottke"}, {"source": "Facebook", "date": "2016-04-16T20:00:00-04:00", "description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "url": "https://www.facebook.com/events/1579924995611394/", "name": "Bavarian Radio Orchestra"}, {"source": "Facebook", "date": "2016-04-18T20:00:00-04:00", "description": "Monday, April 18 | 8pm | 18+ | $15 adv./ $17 day of\n\nPolica with MOTHXR \n\nUnited Crushers (out March 4, 2016) is POLIÇA’s third full-length release and most remarkable album to date. The band, which includes Channy Leaneagh, dual drummers, Drew Christopherson and Ben Ivascu and Chris Beirden on bass with producer Ryan Olson at the helm, collectively wrote the album in Minneapolis in the winter of 2015 during their first true break from two straight years of touring. The new album builds on POLIÇA’s signature synthesizer and percussion-heavy sounds with more complex arrangements and a bigger, crisper hi-fi punch due to the new approach they took to writing and recording: together, all in the same room. There's a tighter groove to these songs and a more vulnerable quality to them, especially in Leaneagh's singing. Her incredible vocal range is consistently on display throughout, beautifully raw and less electronically effected than on previous recordings. United Crushers is the follow up to 2013’s Shulamith which EW called \"propulsive enough for dance floors, and dreamy enough for headphones\" andMOJO said \"proves that intelligent pop music still has the ability to seduce and enthral.\" Their debut, 2012's Give You The Ghost, also garnered international acclaim, with Rolling Stone hailing it as \"the sound of heartbreak and celebration happening simultaneously\" and Q praising it as \"a bewitching, urgent, magical debut.\" The band has conquered massive festivals around the world from Coachella to Glastonbury in addition to performing on Late Night With Jimmy Fallon, Later With Jools Holland and more.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/564", "url": "https://www.facebook.com/events/769930223136488/", "name": "Polica w/ Mothxr 4/18/16 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-04-21T20:00:00-04:00", "description": "\"Lush, introspective, elegant\"—Boston Globe. Photo by Asia Kepka.", "url": "https://www.facebook.com/events/1088535237838163/", "name": "Anne Heaton"}, {"source": "Facebook", "date": "2016-04-23T20:00:00-04:00", "description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "url": "https://www.facebook.com/events/1589849627952742/", "name": "The Bad Plus Joshua Redman"}, {"source": "Facebook", "date": "2016-04-27T20:00:00-04:00", "description": "New music from an expat Australian trio", "url": "https://www.facebook.com/events/831801416940807/", "name": "The Waifs"}, {"source": "Facebook", "date": "2016-04-28T20:30:00-04:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-04-29T20:00:00-04:00", "description": "Michigan's cult hero of comedy", "url": "https://www.facebook.com/events/480751802102134/", "name": "Heywood Banks"}, {"source": "Facebook", "date": "2016-05-06T20:00:00-04:00", "description": "An American master of solo songwriting and blues", "url": "https://www.facebook.com/events/986462064751963/", "name": "Chris Smither"}, {"source": "Facebook", "date": "2016-05-07T20:00:00-04:00", "description": "\"Her songs are about living, breathing people.\"—No Depression", "url": "https://www.facebook.com/events/916584281712332/", "name": "Lucy Kaplansky"}, {"source": "Facebook", "date": "2016-05-07T20:00:00-04:00", "description": "\"Her songs are about living, breathing people.\"—No Depression", "url": "https://www.facebook.com/events/483349811834793/", "name": "Lucy Kaplansky"}, {"source": "Facebook", "date": "2016-05-16T20:30:00-04:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-06-04T20:30:00-04:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-06-24T20:30:00-04:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-07-15T20:30:00-04:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-08-06T20:30:00-04:00", "description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "url": "https://www.facebook.com/events/991614417546900/", "name": "An Almost British Christmas"}, {"source": "Facebook", "date": "2016-09-18T21:00:00-04:00", "description": "THIS EVENT HAS BEEN POSTPONED TO LATER IN THE POLITICAL SEASON.  PLEASE CHECK OUT THE NEW NOVEMBER 1ST PROGRAM, \"JOKES IN PROCESS\" THAT WE HAVE PUT INTO ITS PLACE.  \n\nThe presidential candidates have been HILARIOUS this year, but now let's see how the professionals do.\nJoin the Emergent Art's Theater and the UnClub as they present \"UnDebateable, the UnPresidential Debates\".\n\nIf you would like to be a part of this historic event, either as a moderator, an interview, and audience reporter, or an actual campaign spokeperson, or if you can do an impression of a candidate, please click the 'Going' button.  If you can't commit, but you are interested in following this event, click 'Maybe' and we will keep you informed.\n\nWe are also looking for folks who can help us stream a webcast of this event.\n\nWant to be a sponsor?  We'll take that too.", "url": "https://www.facebook.com/events/1690454564522707/", "name": "UnDebateable, the UnPresidential Debates - Clown Car to the White House"}]