[{"description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "\"Give me mud...\": an exploration of color in paintings", "date": "2015-12-06T13:00:00-05:00", "url": "https://www.facebook.com/events/634544963315292/", "source": "Facebook"}, {"description": "Tremendous progress has been made to increase the native habitat in these woods- help continue this effort! We’ll be expanding restoration work by removing invasive shrubs, such as honeysuckle and buckthorn. Please meet at the north end of Upland Drive, just north of Plymouth Road.\nPlease dress for the weather and for working off trail in the woods. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "name": "Stewardship Workday at Leslie Woods", "date": "2015-12-06T13:00:00-05:00", "url": "https://www.facebook.com/events/700887476679063/", "source": "Facebook"}, {"description": "During the 1920s the Soviet Union emerged on the world stage. The first decade was full of hope for a new social order.  A group of young artists known as Constructivists, spearheaded in part by Vladimir and Georgy Stenberg, championed an art that promoted the egalitarian ideals of the New Order and contributed to the growth of the Soviet Union. They advocated for a utilitarian art that spoke to the masses and their revolutionary aesthetic can still be seen in advertisements and other materials made for the public eye today. Among their most provocative and visionary works were posters advertising Soviet films. UMMA docents will introduce this exhibition that features posters by the Stenbergs and others for some of early cinema’s most inventive films.", "name": "Soviet Constructivist Posters: Branding the New Order", "date": "2015-12-06T14:00:00-05:00", "url": "https://www.facebook.com/events/139630769734608/", "source": "Facebook"}, {"description": "This program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.\n\nOn the occasion of the UMMA exhibition of The Art of Tyree Guyton: A Thirty-Year Journey, U-M Professors of Architecture and Urban Planning Robert Fishman and Mitch McEwen will discuss the work of artist and urban activist Tyree Guyton. Looking at the Heidelberg Project as a case study, these scholars will explore the relationship of public art and architecture to the neighborhood, as well as issues of urbanism, governance, and aesthetics in Detroit.\n\nLead support for this exhibition is provided by the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, the Andy Warhol Foundation for the Visual Arts, and Lisa Applebaum. Additional generous support is provided by the University of Michigan Taubman College of Architecture and Urban Planning and School of Social Work.", "name": "In Conversation: Site Specific: Public Art, the Community, and the Artist", "date": "2015-12-06T15:00:00-05:00", "url": "https://www.facebook.com/events/514200518741472/", "source": "Facebook"}, {"description": "tl;dr: \nnew place: Espresso Royale on State St.\nnew time: 7pm [sign-ups open at 6:30; list fills up, come early]\nnew model: bi-weekly on 1st and 3rd Sundays\n\nBring your friends and join us in one of the most intimate and longest-running poetry slams in the nation. \n\nWe meet up every week, but only put on a show 1st and 3rd Sundays in our new home at Espresso Royale on State St, and at our new time of 7pm!\n\nThis is an ancient, yet fresh and timeless experience: you, a stage, and everything you need to say for an audience who is ready to hear it. Bring yourself, bring your story, and we'll bring the love.\n\nFREE [$5 Suggested Donation]\n\nMORE ABOUT THE FEATURE:\n\nCOMING SOON\n\nMORE ABOUT THE EVENT:\n\nSign-up to perform at 6:30; the list fills up, so get there early to guarantee a spot. The Open Mic starts at 7pm, and the Slam starts whenever the open session ends. \n\nA maximum of 10 poets compete each week [spots are guaranteed for the first 8 slammers to arrive], the final two have to work for it. All poets who get into the Slam earn points qualifying toward the City Finals in April, and a chance to be one of four poets to represent Ann Arbor at the National Poetry Slam in August 2016, in Atlanta, Georgia. Poems must be the performer's original work. Come prepared with two poems [one if you're just doing the open mic], and keep it around three minutes or less. No costumes or props are allowed (unless otherwise specifically stated for themed events). See you there!", "name": "Ann Arbor Poetry Open Mic & Slam feat. Siaara Freeman and T. Miller", "date": "2015-12-06T18:30:00-05:00", "url": "https://www.facebook.com/events/558710847615653/", "source": "Facebook"}, {"description": "Please join the Jim Toy Community Center for a community conversation regarding the potential ballot initiative to prohibit discrimination against any Michigander on the basis of gender, gender identity, sex or sexual orientation. \n\nIn a community as diverse as ours, it should be expected that occassional disagreements will occur; however, our common goals and struggles have always unified us and given us our strength. It is with this in mind, that JTCC strives to provide a forum for our community to have a respectful, open-minded dialogue to plan a path forward together.\n\nJTCC would like to emphasize that despite initial reports, this event will not be a debate. Details about the event's format are still being finalized and more information will be announced soon.", "name": "Proposed Ballot Initiative Community Conversation", "date": "2015-12-07T18:30:00-05:00", "url": "https://www.facebook.com/events/1526398701013792/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2015-12-07T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "Story Time and Crafts with Ieva and special guest Th", "name": "A Grinch of a Story Time - Special Story Time with Ieva with Special Guest The Grinch", "date": "2015-12-08T10:00:00-05:00", "url": "https://www.facebook.com/events/951768698251108/", "source": "Facebook"}, {"description": "$10 / under 21 $13 | 9pm | 18+\n\nMarbin is a progressive jazz-rock band based in Chicago, IL, with a unique story that stands out in today's music world. With a do-it-yourself approach, Marbin started touring in 2011 and has played over a thousand shows since, bringing their original instrumental music everywhere in the States that they could book a show. After well over a thousand shows and more than 20,000 albums sold, Marbin has gained thousands of devoted fans all over the worldwide. Marbin has released five albums with Moonjune Records: Marbin (2009), Breaking the Cycle (2011), Last Chapter of Dreaming (2013), The Third Set (2014), and Aggressive Hippies (2015). \n\nIn addition to their regular schedule, Marbin has toured with Allan Holdsworth’s trio with Yellow Jackets’ bassist Jimmy Haslip and drummer Virgil Donati of Planet X, as well as Scott Henderson's trio, which included Mike Clark and Jeff Berlin. Marbin has also recorded and performed with drummer Paul Wertico, (Pat Metheny Group), bassist Steve Rodby (Pat Metheny Group), percussionist Jamey Haddad (Paul Simon), Wayne Krantz, and more. With: Chirp", "name": "Marbin w/ Chirp 12/9/15 @ Blind Pig - Ann Arbor", "date": "2015-12-09T21:00:00-05:00", "url": "https://www.facebook.com/events/1524660224516076/", "source": "Facebook"}, {"description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "name": "Holiday Sock Drive", "date": "2015-12-10T00:00:00-05:00", "url": "https://www.facebook.com/events/147591712264416/", "source": "Facebook"}, {"description": "Are you a spelling geek who likes the taste of victory? Did losing your middle school spelling bee on the word \"broccoli\" leave you demanding a do-over?\n\nBuzzed Bee is your chance to conquer some words, prove your 5th grade teacher wrong, and do it like an adult — in a bar! Buzzed Bee will combine some of that nostalgic middle-school spelling bee vibe with a super-fun, laid-back atmosphere, the option of beer, and the guarantee that each round will get more and more ridiculous. And, of course, we'll offer way better prizes than the \"Super Speller!\" sticker you'd have gotten in the 5th grade.\n\nDoors open and sign-up starts at 6:30 and the spelling starts at 7:00! Space for participation is limited, so if you want a spot in the bee, come early!\n\nBuzzed Bee is hosted by the Ann Arbor District Library, so it's COMPLETELY FREE and there is NO COVER.", "name": "Buzzed Bee: A Grown-Up Spelling Bee", "date": "2015-12-10T19:00:00-05:00", "url": "https://www.facebook.com/events/1700668420168785/", "source": "Facebook"}, {"description": "Given our love of beer and our passion for celebration, it should come as no surprise that our everyday drink also takes on a more festive air during the holidays. Everyday ales are transformed with fruit, herbs and spices. Standard recipes are beefed up for bigger, stronger, heartier, or hoppier versions of every- day favorites. Tis the season for old ales, dopplebocks, Christmas ales and meads.\n\nHoliday brews reflect the richness and diversity of beer styles being produced by the best breweries here and abroad. Wheats, Wits, Bocks, Ice Beers, and Meade join an assortment of wonderful fruited, spiced, and strengthened recipes on the evenings tasting list. These subtly fruited and spiced brews go great with food or as an aperitif and are a great way to dress up a traditional holiday meal.\n\nAll of the beers at this month's tasting fall into a loosely defined group of holiday beers. All a beer really needs to fit into this category is to be a little special and to be called a holiday beer by the brewer. This is a great way to meet fellow beer lovers, try new beers, and delve deeper into a style by tasting some of the best examples in a casual atmosphere.\n\nCost:\n$25 in advance\n$30 day of\nWe'll bring in two dozen great examples of this style and serve them up with an appetizer buffet. Tastings also feature style and tasting notes and a door prize drawing. \n\nPurchase tickets by calling 734-213-1393 or stopping by the Pub. ID is required at the door. Advance tickets are recommended as tastings usually sell out. 7-9pm", "name": "Beer Tasting: Holiday Brews", "date": "2015-12-10T19:00:00-05:00", "url": "https://www.facebook.com/events/983747505030513/", "source": "Facebook"}, {"description": "You better watch out, Nerd Nite Detroit's Winter Wonderland is coming to town! Join us on Thursday, December 10 at Tangent Gallery for an evening of winter themed entertainment. Doors open at 7:30 and the event begins at 8pm. Though the weather outside may be frightful, we'll have plenty of fun! \n\nOur speaker line up includes Andrew Humphrey, a meteorologist for Channel 4, the Detroit Climate Action Collaborative, and Dr. Andrew Suits, Professor of Chemistry at Wayne State University. We'll also have activities from the Michigan Science Center! \n\nDrinks will be available from the wonderful Tangent Gallery / Hastings Street Ballroom bar, along with a hot cocoa and s'mores bar provided by The Detroit Marshmallow Co.!\n\nIn the spirit of the season, this event will also feature a bring-a-gift-get-a-gift \"white elephant\" gift exchange. If you would like to participate, please bring a wrapped gift of an approximate value of $10. Bring the nerdiest gift you can find!\n\nTickets are available in advance online at Eventbrite and we accept cash and credit card payments at the door. We will also be accepting monetary donations for our \"Nerd Nite Cares\" charity - The United Community Housing Coalition.\n\nHope to see you there!", "name": "Nerd Nite Detroit's Winter Wonderland", "date": "2015-12-10T19:30:00-05:00", "url": "https://www.facebook.com/events/1491196237851949/", "source": "Facebook"}, {"description": "Thu. December 10 | 9pm | 18+ | $20 Cover\n\nThe Sword is a bladed weapon used primarily for cutting or thrusting. WSG: ROYAL THUNDER & Blue Snaggletooth\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/480", "name": "The Sword High Country Tour wsg Royal Thunder & Blue Snaggletooth 12/10/15 @ Blind Pig - Ann Arbor", "date": "2015-12-10T21:00:00-05:00", "url": "https://www.facebook.com/events/690897114388628/", "source": "Facebook"}, {"description": "Enjoy live music, engaging activities and special exhibitions at Fridays After 5! With all of UMMA’s galleries remaining open until 8pm, this exciting series provides a festive and interactive atmosphere for all audiences. As always, admission is free. Also, be sure to save the dates for our upcoming Fridays After 5:\n\nFebruary 12, 2016; April 8, 2016; May 13, 2016; June 10, 2016; July 8, 2016.\n\nUMMA Fridays After 5 are generously supported by Comerica Bank and the Community Foundation for Southeast Michigan. The media sponsor for Fridays After 5 is Michigan Radio.", "name": "Fridays After 5", "date": "2015-12-11T17:00:00-05:00", "url": "https://www.facebook.com/events/1088377574519623/", "source": "Facebook"}, {"description": "Come and meet author Bonnie Jo Campbell as she hangs out at Nicola's Books for a few hours at the front of the store signing books and chatting with customers.  Campbell is the author of 'Once Upon A River' and her latest collection of short stories 'Mothers, Tell Your Daughters: Stories'", "name": "A Sit and Sign with Michigan Author Bonnie Jo Campbell", "date": "2015-12-12T14:00:00-05:00", "url": "https://www.facebook.com/events/410649412463103/", "source": "Facebook"}, {"description": "Auditions at the A2CT Studio (322 W. Ann St, Ann Arbor)\nSaturday, December 12 at 7:00 pm\nSunday, December 13 at 4:00 pm\n\nCallbacks at the Children’s Creative Center\n(1600 Pauline Blvd, Ann Arbor)\nMonday, December 14 at 7:00 pm\n\nAnn Arbor Civic Theatre is seeking ten to fifteen actors for a unique production of Rosencrantz and Guildenstern Are Dead. Director David Widmayer brings his background in music and improv comedy to Tom Stoppard’s classic existential remix of Hamlet. Music developed by the ensemble throughout the rehearsal process will play an important role in the show, but no formal musical training is required to be cast. It’s more important that auditioners display a willingness to take risks and embrace the spirit of play present in Stoppard’s text.\n\nAll actors will be considered for all roles regardless of gender expression.\n\nFor auditions, actors may either prepare a modern comedic monologue no more than 1 to 2 minutes long, or receive a monologue at auditions for a cold reading. All actors will also be asked to cold-read a brief Shakespearean monologue at auditions.\n\nThe date of an important full-cast acting workshop with Kat Walsh will be announced at auditions. Text work with the director and an artistic consultant begins January 6, and rehearsals start January 17. The production runs March 10-13 at the Arthur Miller Theatre in Ann Arbor.\n\nPlease email the director with any questions: djwidmayer@gmail.com", "name": "Auditions for Rosencrantz and Guildenstern Are Dead", "date": "2015-12-12T19:00:00-05:00", "url": "https://www.facebook.com/events/980213775353571/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2015-12-12T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour Engaging with Art", "date": "2015-12-13T13:00:00-05:00", "url": "https://www.facebook.com/events/1276443825714726/", "source": "Facebook"}, {"description": "The Heidelberg Project is an outdoor art environment in the heart of an urban community on Detroit’s near-east side. The installation was started in 1985 by artist and local resident Tyree Guyton who covered abandoned houses, the street, and the surrounding area with found objects and paintings that express vivid personal, social, and sometimes political themes. The installation not only energized the local community but attracted visitors from around the world and has evolved from the vision of a single artist into a community-based organization run by Guyton and his team. Join UMMA docents as they explore this exhibition that looks at the project’s history and traces its trajectory as an exceptional work among site-specific installations.", "name": "The Art of Tyree Guyton: A Thirty-Year Journey", "date": "2015-12-13T14:00:00-05:00", "url": "https://www.facebook.com/events/917765648260547/", "source": "Facebook"}, {"description": "After 3 rounds, the top eight business storytellers are ready to compete for the big pot, the big cheese, the big $10,000 pot of chitlins! :0 \n\nOver the past year, we've covered all phases of being a bad ass in the world of doing something out-of-the-comfort-zone. We've had: tears, smiles, breakthroughs, laughs, disappointments and yes, straight up pissed-offery yet what has bound everyone who has gone through this process of answering the question, 'WHY DO YOU EXIST?' is BOLDNESS.  \n\nThink about it...not only have these folks drummed up the bravery of speaking in public but speaking in public in a way that shows the world who they ARE not just what they DO. They have been completely vulnerable, real and raw.  These folks are truly bad ass. TRULY. People are STILL talking about:\n\nVickie Lewis who extended her hand, beautifully to the audience as she shared her secret of what she REALLY wanted to do in her life, and it wasn't being an environmental engineer. Vickie J. Lewis: The superSTAR!!\n\nNic Sims as she brandished a REAL, ginormous sword to show how she found the courage to dare the shittiest parts of this world to protect her family and then showed us how to find our own sword to take on our own battles. (she did put down the sword and showed truly where the power was and it was...LOVE...GULP with a lump in the throat)\n\nDavid Silver had the freakin' room in a complete PUDDLE as he shared how his love of horses and bringing them into the lives of children in Detroit is actually part of his own journey to find his way to make peace with his parents.\n\nOh wait...Remember when Jennifer Matthews pulled the fake baby out (accidently hit its head on the mic) and forced us to see how first impressions affect how we see each other?\n\nOooooo....Bryant and Kummbareh Owens from Everbutter LLC. FIRST we had Miss 'I hate talking in the public' turn into Viola Davis at the mic while her husband pulled out the stops at the end. And their kids ....the KIDS! A-D-O-R-A-B-L-E. \n\nAmy Peterson had everyone everbody ready to jump on the field when she declared her dream to be the first female general manager of a professional baseball team but saw it evaporate when a man was promoted ahead of her at the Detroit Tigers. But she was so bad ass that she took that moment and turned it around to help other women. #rebelnell\n\nUh... Mr. Christopher John who felt just a-okay with being in second place his entire life ONLY to come face to face with seeing the effects of how an entire community 'settling', he decided to do something about it. \n\nAnd then there was Muhammad Mazhari from Ballot who shared for the first time that it was his time as a student in Pakistan and seeing first hand the effects of having limited access to information and education. He's doing something about it.\n\nThere were many, many others who didn't make the top 8 who we celebrate as well. BUT, do come out and support these truly folks who are mastering the art of Bad Assery!!", "name": "Entre-SLAM: The FINALE at The Ark", "date": "2015-12-14T19:00:00-05:00", "url": "https://www.facebook.com/events/189492038054557/", "source": "Facebook"}, {"description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "name": "Holiday Sock Drive", "date": "2015-12-16T00:00:00-05:00", "url": "https://www.facebook.com/events/147591712264416/", "source": "Facebook"}, {"description": "Come join us for our first annual artist holiday party and critique night. Bring one or two pieces you are looking to get feedback on whether completed or in progress. It will be a fun night with lots of art and a great opportunity to meet other other working artists.", "name": "Artists' Meet & Greet - Holiday Party Critique Night", "date": "2015-12-18T18:00:00-05:00", "url": "https://www.facebook.com/events/476990172480417/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2015-12-18T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "Katie Geddes sings traditional and contemporary folk, country-folk, and folk-pop tunes. A deft interpreter of beloved songs, her captivating voice and velvety-smooth delivery bring new life to the compositions of writers such as John Prine, Buffy Sainte-Marie, Michael Nesmith and Lennon and McCartney. Katie’s latest CD release, We Are Each Other’s Angels, features an inspired roster of guest artists including Michael Johnson, Mary McCaslin, Don Henry and Small Potatoes, and has received extensive airplay across the country and around the world.When not doing her own gigs, Katie has been known to “moonlight” singing harmony for folk- rock legend Melanie and local favorite Matt Watroba.\n\nMatt Watroba brings a special set of talents to the stage. His mellow voice, friendship with his audience, and knowledge of his presentations is impressive. Add to that Matt's own special brand of humor and you are in for a most entertaining and enlightening set. You will feel his love of folk music, both traditional and contemporary; its writers and performers, its heroes and villains. Matt sings songs of compassion, inner strength, humor, and everyday living. \n \nDavid Barrett writes songs about children. And criminals. He writes music about golf. And Norman Vincent Peale. He struggled for years, scrapping for gigs (and, in his words, \"driving for checks\") only to become the proverbial \"overnight sensation\" in a field he'd never dreamed of storming. Barrett recalls, \"In 1985, I was visiting a friend in New York City who was a writer for Sports Illustrated. We were watching the NBA Finals, talking about sports and life, and I remembered that I had written this song about sports and achievement, so when I got home I sent it to him. He took it over to CBS, and they called me up out of the blue.”  The song, of course was “One Shining Moment,” the paean to endeavor that now crowns the NCAA Basketball Finals. A version sung by Luther Vandross pushes the song’s power to a new height. David Barrett: a handsome guy singing provocative, hauntingly beautiful songs in which he tackles lost love, high comedy and the physics of life. \n\nVocal trio All About Eve (Katie Geddes, Deb Wood, David Vaughn) offers up a variety of close-harmony pop covers and traditional and contemporary folk and gospel songs, accompanied by Dan Reynolds on guitar, David Stearns on bass, and Lori Fithian on percussion.", "name": "Katie Geddes and Friends wsg All About Eve, David Barrett, and Matt Watroba", "date": "2015-12-18T20:00:00-05:00", "url": "https://www.facebook.com/events/1476261279354004/", "source": "Facebook"}, {"description": "Fri. Dcember 18 | 9:30pm | 18+ | $10 Cover\n\nUtterly unique and unclassifiable; Super Happy Funtime Burlesque is all at once a live band, an original work of musical theater, a comedy show, a bawdy and sexy burlesque production, a giant ball of chaos rolled up into one neat little production that has been leaving jaws on the floor for nearly a decade. Based out of Grand Rapids, Michigan, they travel the nation in their big red school bus bringing the good word of burlesque and musical theater to the nation. Not for the faint of heart!!!  http://www.blindpigmusic.com/calendar.html#!/events/569", "name": "Super Happy Funtime Burlesque 12/18/15 @ Blind Pig - Ann Arbor", "date": "2015-12-18T21:30:00-05:00", "url": "https://www.facebook.com/events/908438685914218/", "source": "Facebook"}, {"description": "Vault of Midnight is excited to announce that Jeremy Bastian, author and artist of Cursed Pirate Girl, will be doing an in store signing on Saturday December 19th from 6pm - 8pm.\n\n\nMeet the local legend behind one of the best reviewed, most beloved comics of the past bunch of years:\n\n“It’s all too rare that I see work that is truly original- and I almost never see work THIS original- Jeremy Bastian is a genius.”\n-Mike Mignola\n\n“A throwback to classic storytelling that any age can enjoy.”\n-David Petersen\n\n“Clearly he’s kidnapped his own inner child, plied her with enough Victorian sweets to keep her up for days, and then chained her to a drawing board in a tiny room…”\n- Jackson Publick\n\n“I LOVE Cursed Pirate Girl- it is a bright light in a vast sea of sameness!”\n-Charles Vess\n\n“Authentic and timeless and wonderfully bizarre- this looks like something from 1892 but is totally ahead of its time- I wish I’d thought of it!”\n-Gerard Way\n\n“Combines the endearing qualities of classic children’s books with a modern-day sensibility. The results are whimsically naive and genuinely hip!”\n-Gary Gianni\n\n“Cursed Pirate Girl is our generation’s Alice in Wonderland.”\n-Gail Potocki", "name": "Jeremy Bastian Signing", "date": "2015-12-19T18:00:00-05:00", "url": "https://www.facebook.com/events/1196420660371994/", "source": "Facebook"}, {"description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour Engaging with Art", "date": "2015-12-20T13:00:00-05:00", "url": "https://www.facebook.com/events/964198953659771/", "source": "Facebook"}, {"description": "Come as You Are: Art of the 1990s, is the first major museum survey to examine the art of this pivotal decade in its historical context. The exhibition, organized by the Montclair Art Museum, whose focuses on three principal themes—debates over “identity politics,” the digital revolution, and globalization— and explores a range of geopolitical milestones and social issues through the perspective of artists working at that time. It also illustrates the diverse ways in which the developments of the 1990s redefined contemporary approaches to artistic practice. UMMA docents will explore the themes of this pivotal decade.", "name": "Come as You Are: Art of the 1990s", "date": "2015-12-20T14:00:00-05:00", "url": "https://www.facebook.com/events/1027967063889987/", "source": "Facebook"}, {"description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "name": "Holiday Sock Drive", "date": "2015-12-23T00:00:00-05:00", "url": "https://www.facebook.com/events/147591712264416/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2015-12-25T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "Need a fantastic gift for your fave teacher? Grab a bag of Sweetwaters' new blend, Scholar Joe, in stock right now! For every bag you buy, Lucky's Market will make a donation to the Ann Arbor Public Schools Educational Foundation!", "name": "Scholar Joe- Supporting the AAPSEF", "date": "2015-12-30T23:00:00-05:00", "url": "https://www.facebook.com/events/463341333828385/", "source": "Facebook"}, {"description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "name": "Holiday Sock Drive", "date": "2015-12-31T00:00:00-05:00", "url": "https://www.facebook.com/events/147591712264416/", "source": "Facebook"}, {"description": "Tree Town Sound Present \nNYE Tree Town Ball Down Dance Party \nBlind Pig, Ann Arbor MI 9:30PM 18+ $15 \n-Presale Starts 12/1/15 10AM\nhttp://www.etix.com/ticket/p/6648703/nye-tree-town-ball-down-ann-arbor-blind-pig-the-blind-pig\n\nRobert Lux\nROBERT LUX ( formerly of Ella Riot & My Dear Disco)\nDJ. Producer. Based in Brooklyn, NY. http://soundcloud.com/bodyrock\nRobert Lux (aka Robert Lester) came to Brooklyn, NY from Ann Arbor, MI. As a DJ, he is known for pulling together dance music styles that are accessible and experimental, classic and contemporary, always fresh, always funky. Having now played in many of NYC's premiere nightlife spots (Hudson Terrace, Hiro Ballroom, Cellar Bar) and major national festival stages (Lollapalooza, SummerCamp, Rombello Cruise & 2014 Super Bowl), there is no crowd that cant be rocked by Robert Lux. \n\nw/s/g\nNicke Ayers\nDJ Hybrid Set // Live Drums // Percussion // Vinyl \nAnn Arbor native and formerly of The Macpodz and all American Bad Ass.", "name": "Tree Town Ball Down NYE 12-31-15 Dance Party // Blind Pig A2", "date": "2015-12-31T21:30:00-05:00", "url": "https://www.facebook.com/events/929871387099801/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-01-02T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "Literati is pleased to welcome Rebecca Scherm back to the store in support the paperback release of her acclaimed novel Unbecoming.\n\nIn a grubby antiques shop on the outskirts of Paris, Grace restores bric-a-brac, mends teapots, re-sets gems. She calls herself Julie, says she’s from California, and slips back to a rented room at night. From an anonymous internet café, she checks the website of her hometown paper.  Back in Garland, Tennessee, two young men are about to be paroled.   Both have served time for a crime about which Grace knows a great deal.   Their daring escapade  went bad, but not before Grace made it onto a plane — contraband in her carry-on —  and began methodically  disassembling the known facts of her life.  Now she knows that somehow, a piece of her past will find her. As the story  unfolds, taking us from small-town USA to the heights and depths of the art scene in New York and Europe, we learn who Grace has been: a girl with a messy, broken home life and a knack for making herself loveable– until she comes face to face with what she actually wants, and everything falls apart.   And so begins a cat-and-mouse waiting game, a tale of lies and deception, desperate stakes and dual identities.\n\nMesmerizing, atmospheric, and psychologically nuanced, Unbecoming reinvents the heist plot and takes up the making of a femme fatale—this time, from a woman’s point of view.\n\n“From the first page, you know Rebecca Scherm is the real thing. Unbecoming is an assured exploration of the intricate, intense, risky processes that go into creating identity—and into dismantling it.”\n\n—Tana French\n\n“Rebecca Scherm’s extraordinarily confident voice and style, this novel’s depth of detail—great characters and a terrifically engaging plot—are a sheer delight to read. There is something very fresh and captivating about this book, and best of all I had no idea what was going to happen from one page to the next.”\n\n—Kate Atkinson\n\n“Some characters who go bad find that it’s against their nature, and some who go bad discover that dishonesty is the central truth about themselves. Rebecca Scherm’s wonderful novel Unbecoming has a mesmerizing narrator, Grace, who discovers that her gift (and it is a real gift) is for deceit. A thriller, a psychological study, and a love story, this novel is an unusually intelligent and suspenseful book. The dark arts have rarely been so brightly lit.”\n\n—Charles Baxter\n\nRebecca Scherm is the author of Unbecoming, a novel. She received her MFA from the University of Michigan, where she was also a postgraduate Zell Fellow.  She lives in Michigan, where she is working on her second novel, Beta.", "name": "Rebecca Scherm", "date": "2016-01-06T19:00:00-05:00", "url": "https://www.facebook.com/events/942375365838618/", "source": "Facebook"}, {"description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "name": "Holiday Sock Drive", "date": "2016-01-09T00:00:00-05:00", "url": "https://www.facebook.com/events/147591712264416/", "source": "Facebook"}, {"description": "Saturday, January 9 | 9:30pm |  18+ | $10 Cover\n\nEmbarco Presents: Trick Trick performing with his live band GSM!", "name": "Embarco Presents: Trick Trick 1/9/16 @ Blind Pig - Ann Arbor", "date": "2016-01-09T21:30:00-05:00", "url": "https://www.facebook.com/events/443160592535849/", "source": "Facebook"}, {"description": "Monday, January 11, 2016, 7:30 pm\nHill Auditorium\n\nFounded by Sir Thomas Beecham in 1946, the Royal Philharmonic Orchestra made its UMS debut in 1950 and last performed in Hill Auditorium in 1992. This concert features Pinchas Zukerman both at the helm and as the featured soloist. \n\nMore info: http://ums.org/performance/royal-philharmonic-orchestra/", "name": "Royal Philharmonic Orchestra", "date": "2016-01-11T19:30:00-05:00", "url": "https://www.facebook.com/events/780337908747994/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-01-11T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "Sat. January 16 | 9pm | 18+ | $14 Cover\n\nChrome Sparks is the solo project of Jeremy Malvin, a Brooklyn transplant from Pittsburgh by way of Ann Arbor. In 2014, after having self released a small handful of singles and two EPs on Bandcamp, Malvin signed to the taste making Sydney based label Future Classic. Under the new label, he rereleased Sparks EP and released the Goddess EP. His next EP, Parallelism is slated to be released with Future Classic on November 6.\n\nInspired by a background in classical percussion and an obsession with synthesizers, Malvin creates dazed, melodic beat-centric tunes that loosely hang between down-tempo head nodders and up-tempo club bangers. FADER has described his music as ‘form-shifting beats [that] seem to resonate with spaced-out chillers and hyperactive party kids alike’.\n\nIn 2012, while on Warped Tour as the drummer for Stepdad, Malvin released the slow burning, bass heavy single “Marijuana” on a Bandcamp compilation highlighting music from he and his friends in Ann Arbor. It quickly rocketed to #1 on Hype Machine and has since become an internet-stoner anthem. It has subsequently been rereleased by Future Classic and Kitsuné.\n\nHis upcoming release, Parallelism, was made using sounds from three analog synthesizers, vocal samples from friends, and a tambourine.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/578", "name": "Chrome Sparks 1/16/16 @ Blind Pig - Ann Arbor", "date": "2016-01-16T21:00:00-05:00", "url": "https://www.facebook.com/events/1390235697944662/", "source": "Facebook"}, {"description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "name": "Holiday Sock Drive", "date": "2016-01-19T00:00:00-05:00", "url": "https://www.facebook.com/events/147591712264416/", "source": "Facebook"}, {"description": "Wednesday, January 20, 2016, 7:30 pm\nHill Auditorium\n\n“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas) Since 1988, Wynton Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, sophisticated to spirited, it’s all sheer jazz perfection — no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/1516-jazz-at-lincoln-center-orchestra/", "name": "Jazz at Lincoln Center Orchestra with Wynton Marsalis", "date": "2016-01-20T19:30:00-05:00", "url": "https://www.facebook.com/events/1604747733142781/", "source": "Facebook"}, {"description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show", "date": "2016-01-21T19:30:00-05:00", "url": "https://www.facebook.com/events/1620983154780471/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-01-21T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show", "date": "2016-01-22T19:30:00-05:00", "url": "https://www.facebook.com/events/1620983154780471/", "source": "Facebook"}, {"description": "Friday, January 22, 2016, 8:00 pm\nRackham Auditorium\n\nThe Chamber Music Society of Lincoln Center presents chamber music of every instrumentation, style, and historical period. The six musicians performing in this concert include violinist Benjamin Beilman, an Ann Arbor native whose career has been burnished by a series of major awards recognizing his extraordinary musical talent. \n\nMore info: http://ums.org/performance/chamber-music-society-of-lincoln-center", "name": "Chamber Music Society of Lincoln Center", "date": "2016-01-22T20:00:00-05:00", "url": "https://www.facebook.com/events/1453480484950039/", "source": "Facebook"}, {"description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "name": "Young Jean Lee Theater Company: Straight White Men", "date": "2016-01-22T20:00:00-05:00", "url": "https://www.facebook.com/events/1452156068412417/", "source": "Facebook"}, {"description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "name": "Young Jean Lee Theater Company: Straight White Men", "date": "2016-01-23T20:00:00-05:00", "url": "https://www.facebook.com/events/1452156068412417/", "source": "Facebook"}, {"description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show", "date": "2016-01-24T19:30:00-05:00", "url": "https://www.facebook.com/events/1620983154780471/", "source": "Facebook"}, {"description": "Wednesday, January 27, 2016, 7:30 pm\nMichigan Theater\n\nBy any measure of talent and accomplishment, Lisa Fischer is a superstar. Yet, if you do not know her name, it’s likely because she has spent the past 20 years as a backup singer for the Rolling Stones, Sting, Chris Botti, and countless others. Her name may not be on the marquee, but she doesn’t care. Her astonishing range, spot-on intonation, mastery of the stage, and infectious sweet smile make her the go-to singer for the likes of Tina Turner, Chaka Khan, Beyoncé, Bobby McFerrin, Lou Reed, Dionne Warwick, Aretha Franklin, and a host of others. As one of the top session and backup singers, she’s featured in the Oscar-winning documentary 20 Feet from Stardom and celebrated for her live concert duets with Mick Jagger during “Gimme Shelter” that have also received millions of hits on YouTube. After winning Grammy Awards for “Best Female R&B Performance” (1992) and “Best Music Film” (2015), she has decided to move forward from being a backup singer, putting together her own band and claiming her well-deserved place center stage. \n\nMore info: http://ums.org/performance/ms-lisa-fischer-and-grand-baton", "name": "Ms. Lisa Fischer and Grand Baton", "date": "2016-01-27T19:30:00-05:00", "url": "https://www.facebook.com/events/1020565857968750/", "source": "Facebook"}, {"description": "Friday, January 29 | 9:30pm | 18+ | $12 adv./ $14 day of\n\nProtomartyr (https://www.facebook.com/protomartyr)\nwith: Rebel Kind\n\nShow info: http://www.blindpigmusic.com/calendar.html#!/events/591", "name": "Protomartyr 1/29/15 @ Blind Pig - Ann Arbor", "date": "2016-01-29T21:30:00-05:00", "url": "https://www.facebook.com/events/1070813002942671/", "source": "Facebook"}, {"description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "name": "Holiday Sock Drive", "date": "2016-01-30T00:00:00-05:00", "url": "https://www.facebook.com/events/147591712264416/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-02-01T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "Tuesday, February 2, 2016, 7:30 pm\nLydia Mendelssohn Theatre\n\nWith Tanya Tagaq, ancient meets modern in provocative, powerful ways. This spellbinding performance features the Inuit throat singer accompanying a screening of Nanook of the North (1922) with a live score. Tagaq’s mixed-media performance reclaims the controversial classic — considered the first feature-length documentary — capturing the sense of the sound of the Arctic spaces shown in the film and adding tremendous feeling and depth to what is a complex mix of beautiful representations and racially charged clichés.\n\nTanya Tagaq’s music is unnerving and exquisite, rooted in Inuit throat singing, but also influenced by electronica, industrial, and metal influences. It is a style that she has perfected with collaborators such as Björk and that reminds some of Meredith Monk’s vocal innovations. Winner of the 2014 Polaris Prize for “Album of the Year” (she beat out Drake and Arcade Fire), Tanya Tagaq makes her UMS debut in this one-night only event. “Nobody, anywhere, sounds like she does.” (Globe and Mail)\n\nMore info: http://ums.org/performance/tanya-tagaq/", "name": "Tanya Tagaq in concert with Nanook of the North", "date": "2016-02-02T19:30:00-05:00", "url": "https://www.facebook.com/events/1155115267866605/", "source": "Facebook"}, {"description": "Friday, February 5, 2016, 8:00 pm\nLydia Mendelssohn Theatre\n\nTaylor Mac is equal parts bedazzled shaman, searing social critic, radical angel, and Elizabethan fool. A critical darling of the New York downtown cabaret scene, he is beloved for his iconic beauty, disarming vulnerability, and soaring spirit. His 24-Decade History of Popular Music will eventually become an epic show performed over 24 continuous hours; in Ann Arbor, Taylor will focus on the 1960s, 70s, and 80s, connecting the decades to the vibrant music scene in Detroit. “Fabulousness can come in many forms, and Taylor Mac seems intent on assuming every one of them.” (New York Times) A UMS co-commission. \n\nMore info: http://ums.org/performance/taylor-mac-a-24-decade-history-of-american-popular-music-1960s-1980s/", "name": "Taylor Mac: A 24-Decade History of American Popular Music: 1960s–1980s", "date": "2016-02-05T20:00:00-05:00", "url": "https://www.facebook.com/events/1594841967471096/", "source": "Facebook"}, {"description": "Saturday, February 6, 2016, 8:00 pm\nHill Auditorium \n\n“His superb live performance confirmed the impression of his recording: A major new pianist has arrived.” (New York Times) Born in 1987, the Russian-German pianist Igor Levit received effusive praise for his two-disc debut album of Beethoven’s late piano sonatas. A relative newcomer to the United States, he makes his UMS debut with this recital appearance. \n\nMore info: http://ums.org/performance/igor-levit/", "name": "Igor Levit, piano", "date": "2016-02-06T20:00:00-05:00", "url": "https://www.facebook.com/events/1435582513413462/", "source": "Facebook"}, {"description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "name": "Holiday Sock Drive", "date": "2016-02-11T00:00:00-05:00", "url": "https://www.facebook.com/events/147591712264416/", "source": "Facebook"}, {"description": "Thursday, Feb 11 | 9pm | 18+ | $10 Cover\n\nBroccoli Samurai is Cleveland, OH’s premiere jamtronica and EDM project. Broccoli Samurai features Ryan “Bruce” Hodson on keys and synth, Chris Walker on drums and percussion, and Josh Sebo on bass. Broccoli Samurai’s drum and bass influenced, progressive electronica has been thrilling audiences throughout the Midwest, winning the band spots at major events such as Rootwire, The Werk Out, Hyperion Fest, Summerdance, and The Mad Tea Party Jam, as well as direct support, club spots for such notable bands as Boombox, Lotus, Dopapod, Papadosio, Rusted Root, Big Gigantic, Conspirator, O.A.R., and Ozric Tentacles. Broccoli Samurai’s groove is the kind that keeps the crowd moving well into the wee hours of the morning. This band is making big moves and the time to take notice is now. \n\nWith: Liquid Monk\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/570", "name": "Broccoli Samurai w/ Liquid Monk 2/11/16 @ Blind Pig - Ann Arbor", "date": "2016-02-11T21:00:00-05:00", "url": "https://www.facebook.com/events/1655909208022221/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-02-13T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "Saturday, February 13, 2016, 8:00 pm\nPower Center\n\n“Every aspect of the dance-making here is thoroughly accomplished.” (New York Times) A prolific choreographer who danced with Ronald K. Brown’s Evidence, Rennie Harris’s Puremovement, and the Alvin Ailey American Dance Theater, Camille A. Brown brings her newest work to Ann Arbor for her UMS debut. Black Girl — Linguistic Play speaks to the complexities of carving out a positive identity as a Black female in urban American culture.\n\nIn a world where Black women are often portrayed only in terms of their strength, resiliency, or trauma, this work interrogates these narratives by presenting a fuller spectrum of the black female and the complexities of negotiating in this racially and politically charged world. The work uses elements of African-American social dancing, rhythmic play, and musical compositions to better illustrate who “Black Girl” knows herself to be. Brown’s choreography is “fun, inventive, and watchable.” (Times Square Chronicles) \n\nMore info: http://ums.org/performance/camille-a-brown-dancers/", "name": "Camille A. Brown & Dancers: Black Girl — A Linguistic Play", "date": "2016-02-13T20:00:00-05:00", "url": "https://www.facebook.com/events/368546533344933/", "source": "Facebook"}, {"description": "February 16, 18\nRackham Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "name": "Sir András Schiff, piano", "date": "2016-02-16T19:30:00-05:00", "url": "https://www.facebook.com/events/442008155980033/", "source": "Facebook"}, {"description": "Friday, February 19, 2016, 8:00 pm\nMichigan Theater\n\nA decade after it was first brought to the screen, Benoît Charest revives the music of the Oscar-nominated film The Triplets of Belleville with a remarkable cast of musicians in this silent movie-live concert event. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His near-sighted grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas.\n\nBut the true star of the animated film is the hot jazz score written by Canadian composer Benoît Charest. This screening of the beloved French film transports audiences to the exciting streets of 1920s Paris and Le Jazz Hot.\n\nMore info: http://ums.org/performance/the-triplets-of-belleville/", "name": "The Triplets of Belleville", "date": "2016-02-19T20:00:00-05:00", "url": "https://www.facebook.com/events/1620380161539059/", "source": "Facebook"}, {"description": "February 20\nHill Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "name": "Sir András Schiff, piano", "date": "2016-02-20T20:00:00-05:00", "url": "https://www.facebook.com/events/1611931089050428/", "source": "Facebook"}, {"description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "name": "Holiday Sock Drive", "date": "2016-02-24T00:00:00-05:00", "url": "https://www.facebook.com/events/147591712264416/", "source": "Facebook"}, {"description": "Wed. February 24 | 18+ | 9pm | $15 / $65 VIP Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\nWSG: Dan Henig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/567", "name": "Aaron Carter 2/24/16 @ Blind Pig - Ann Arbor", "date": "2016-02-24T21:00:00-05:00", "url": "https://www.facebook.com/events/1725536331010947/", "source": "Facebook"}, {"description": "Nashville-based, independent artist, Ron Pope, has stood at a crossroads where so many musicians find themselves — at the intersection of record label and independence. In an ever-evolving industry filled with rejection and compromise, he has plotted a new course for his music to reach loyal listeners, taking the industry-road-less-traveled in exchange for the ultimate payback, a league of devoted fans the world over. WSG: Tuett - http://www.truettofficial.com/\n\nVIP tix available here: http://www.etix.com/ticket/p/4574033/ron-pope-vip-meet-greet-ann-arbor-blind-pig-the-blind-pig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/446", "name": "Ron Pope & The Nighthawks w/ Truett 2/25/15 @ Blind Pig - Ann Arbor", "date": "2016-02-25T21:00:00-05:00", "url": "https://www.facebook.com/events/1449897481978519/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-02-26T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "Second Show Added for Friday, February 26th!\n\nDoors 9pm | 18+ | $15 General Admission / $65 Admission + Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/573", "name": "Aaron Carter - Night Two 2/26/15 @ Blind Pig - Ann Arbor", "date": "2016-02-26T21:00:00-05:00", "url": "https://www.facebook.com/events/1615405452043601/", "source": "Facebook"}, {"description": "Saturday, March 5, 2016, 8:00 pm\nHill Auditorium\n\nPaddy Malone and The Chieftains celebrated 50 years of performing in 2012, and their music remains as fresh and relevant as when they first began. Recognized for reinventing traditional Irish music on a contemporary and international scale, their ability to blend tradition with modern music has made them one of the most renowned and revered musical groups to this day. Back for their fifth UMS performance and their first in nearly a decade, “they seem ageless, and so does their Irish music. If common sense tells you they can’t go on forever, you wouldn’t know it from their electrifying performance.” (Boston Globe)\n\nMore info: http://ums.org/performance/the-chieftains/", "name": "The Chieftains", "date": "2016-03-05T20:00:00-05:00", "url": "https://www.facebook.com/events/1598997080377800/", "source": "Facebook"}, {"description": "New music from a highly personal songwriter", "name": "David Ramirez w/sg Lucette", "date": "2016-03-06T19:30:00-05:00", "url": "https://www.facebook.com/events/1699211580297103/", "source": "Facebook"}, {"description": "Traditional and contemporary Irish music", "name": "The Alan Kelly Gang", "date": "2016-03-07T20:00:00-05:00", "url": "https://www.facebook.com/events/1724878727724016/", "source": "Facebook"}, {"description": "Wonderful bluegrass ensemble work", "name": "Sideline", "date": "2016-03-08T20:00:00-05:00", "url": "https://www.facebook.com/events/1655633691385779/", "source": "Facebook"}, {"description": "Join ABC in our effort to warm the feet of each child and adult in need of new, warm socks this winter.\n\nWe are asking for new, warm socks this season as part of our terminate hunger partnerships with the St. Andrew’s Breakfast Program.\n\nEach donor will be recognized by their own “sock” hung in the pub with care during the holiday season and receive your choice of a coupons:\nBOGO 1/2 off meals or 1/2 off any draft beer. \nBegining November 25th through December 23rd.\n\nAny questions, please contact beth@arborbrewing.com", "name": "Holiday Sock Drive", "date": "2016-03-09T00:00:00-05:00", "url": "https://www.facebook.com/events/147591712264416/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-03-11T19:30:00-05:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "New music from Detroit's folk troubadour", "name": "Chris Buhalis", "date": "2016-03-11T20:00:00-05:00", "url": "https://www.facebook.com/events/776578575785364/", "source": "Facebook"}, {"description": "March 11-12\nPower Center\n\n“You can’t help but leave with a fuzzy feeling inside.” (examiner.com) The globetrotting, Montreal-based scratch DJ and music producer Kid Koala presents a magical, multi-disciplinary and theatrical adaptation of his graphic novel and soundtrack, Nufonia Must Fall. This charming story centers around a headphones-sporting robot on the verge of obsolescence who falls in love with a lonely office girl. This live adaptation unfolds via real-time filming of more than a dozen miniature stages and a cast of puppets, while Kid Koala and the Aelos Quartet provide original live scoring on piano, strings, and turntables. The result? You’ll seem to be watching an animated picture, but simultaneously seeing puppets being filmed and projected in real time. Heartfelt, hand-made, and a very cool live experience. \n\nMore info: http://ums.org/performance/nufonia-must-fall/", "name": "Nufonia Must Fall", "date": "2016-03-11T20:00:00-05:00", "url": "https://www.facebook.com/events/488544131294497/", "source": "Facebook"}, {"description": "$18 adv./ $20 day of | 18+ | 9pm\n\nSimply put, Tortoise has spent nearly 25 years making music that defies description. While the Chicago-based instrumental quintet has nodded to dub, rock, jazz, electronica and minimalism throughout its revered and influential six-album discography, the resulting sounds have always been distinctly, even stubbornly, their own.\n\nFull Bio - http://www.blindpigmusic.com/calendar.html#!/events/521", "name": "Tortoise 3/11/16 @ Blind Pig - Ann Arbor", "date": "2016-03-11T21:00:00-05:00", "url": "https://www.facebook.com/events/1622992504617740/", "source": "Facebook"}, {"description": "\"An unaffected but beautiful voice\"—Lifestyle Nova Scotia. Photo by Meghan Tansey Whitten", "name": "Rose Cousins", "date": "2016-03-12T20:00:00-05:00", "url": "https://www.facebook.com/events/1625874281006173/", "source": "Facebook"}, {"description": "\"World's best acoustic band\"—Guitar Shop. Photo by Paolo Aizza.", "name": "The California Guitar Trio", "date": "2016-03-13T19:30:00-04:00", "url": "https://www.facebook.com/events/690756901025231/", "source": "Facebook"}, {"description": "Tuesday, March 15, 2016, 7:30 pm\nSt. Francis of Assisi\n\nFresh from their 2014 performance of Monteverdi’s Vespers, Apollo’s Fire & Singers returns to St. Francis of Assisi Church with one of their signature pieces, Bach’s St. John Passion. Bursting out of the gate from the agitated opening chorus, this work is considered Bach’s most dramatic and theatrical oratorio. In this acclaimed interpretation, the story’s action is highlighted by a dramatic approach: the roles are performed by true singing actors, staged on a special theatrical platform within the orchestra. The acclaimed Apollo’s Singers evoke the wild mob with fierce intensity. \n\nMore info: http://ums.org/performance/apollos-fire-st-john-passion/", "name": "Apollo’s Fire & Apollo’s Singers: Bach’s St. John Passion", "date": "2016-03-15T19:30:00-04:00", "url": "https://www.facebook.com/events/971816919508035/", "source": "Facebook"}, {"description": "Celtic folk and pop with incredible instrumental virtuosity", "name": "The High Kings", "date": "2016-03-15T20:00:00-04:00", "url": "https://www.facebook.com/events/1723526264550616/", "source": "Facebook"}, {"description": "\"The common pop thread between alt.country, spaghetti western soundtracks and swampy blues\"—Paste", "name": "Honeyhoney", "date": "2016-03-16T20:00:00-04:00", "url": "https://www.facebook.com/events/779753718802028/", "source": "Facebook"}, {"description": "\"The common pop thread between alt.country, spaghetti western soundtracks and swampy blues\"—Paste", "name": "Honeyhoney", "date": "2016-03-16T20:00:00-04:00", "url": "https://www.facebook.com/events/531896413654057/", "source": "Facebook"}, {"description": "\"Acoustic textures and chamber-rock dynamics\"—Rolling Stone", "name": "Darlingside w/sg PM Buys", "date": "2016-03-18T20:00:00-04:00", "url": "https://www.facebook.com/events/174172569600898/", "source": "Facebook"}, {"description": "Saturday, March 19, 2016, 8:00 pm\nHill Auditorium\n\nThe Montreal Symphony returns to Ann Arbor for the first time since 1989, with American conductor Kent Nagano and pianist Daniil Trifonov both making their UMS debuts. “Hearing Trifonov is like having a deep-tissue massage: you keep wanting to pull away from the sheer intensity of it, and you come out feeling as if your reality had been slightly altered…a knockout.” (Washington Post) \n\nMore info: http://ums.org/performance/montreal-symphony-orchestra/", "name": "Montreal Symphony", "date": "2016-03-19T20:00:00-04:00", "url": "https://www.facebook.com/events/1582133688713673/", "source": "Facebook"}, {"description": "Appalachia gone Brazilian! Photo by Vincent Soyez. This show is FREE to Ark members at the door.", "name": "Matuto", "date": "2016-03-20T19:30:00-04:00", "url": "https://www.facebook.com/events/1488521474793961/", "source": "Facebook"}, {"description": "New Swiss American mountain music", "name": "The Kruger Brothers", "date": "2016-03-21T20:00:00-04:00", "url": "https://www.facebook.com/events/1634368160163727/", "source": "Facebook"}, {"description": "Indian classical music and multicultural fusion", "name": "Maestro Khan", "date": "2016-03-23T20:00:00-04:00", "url": "https://www.facebook.com/events/962546740435420/", "source": "Facebook"}, {"description": "New music from Patty!", "name": "Patty Larkin", "date": "2016-03-24T20:00:00-04:00", "url": "https://www.facebook.com/events/119883711695876/", "source": "Facebook"}, {"description": "Saturday, March 26, 2016, 8:00 pm\nHill Auditorium\n\nBach’s complete Sonatas and Partitas have long been a “Mount Everest” of the violin repertoire — music that performers return to throughout their lives. In this special event, Gil Shaham collaborates with video artist David Michalek to open up new avenues for listening to and interpreting Bach’s towering masterpieces.\n\nVideo artist David Michalek, best known for his “Slow Dancing” installation at Lincoln Center, and in the capitals of Europe, says of the Bach Six Solos project: “As a contemporary artist with a particular interest in motion pictures and time, I’ve been compelled to consider how the addition of extreme slow motion might be applied to moving images of the face, the body, obliquely narrative tableaux, and also still life in ways that can both enhance and alter the meanings latent within them. As a visual strategy, extreme slowness creates a continuing sense of a pause in the action — as if the growth and evolution of the slow-moving image is itself a further manifestation of the deep and consuming absorptive state that often arises while observing it.”\n\nMore info: http://ums.org/performance/gil-shaham/", "name": "Bach Six Solos: Gil Shaham, violin", "date": "2016-03-26T20:00:00-04:00", "url": "https://www.facebook.com/events/1663165150570187/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-03-26T20:30:00-04:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-03-31T19:30:00-04:00", "url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-04-01T19:30:00-04:00", "url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook"}, {"description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "name": "Mariachi Vargas de Tecalitlán", "date": "2016-04-01T20:00:00-04:00", "url": "https://www.facebook.com/events/453190221522442/", "source": "Facebook"}, {"description": "Punk-funk-folk's pathbreaking entrepreneur. At the Michigan Theater, 603 E. Liberty, Ann Arbor.", "name": "Ani DiFranco at The Michigan Theater", "date": "2016-04-02T20:00:00-04:00", "url": "https://www.facebook.com/events/445903825593347/", "source": "Facebook"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-04-03T19:30:00-04:00", "url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook"}, {"description": "Note special start time!", "name": "Micah Smiles Benefit Concert for C.S. Mott Children's Hospital", "date": "2016-04-06T19:30:00-04:00", "url": "https://www.facebook.com/events/1617523538522455/", "source": "Facebook"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-04-06T19:30:00-04:00", "url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook"}, {"description": "Bluegrass, Byrds, and more", "name": "Chris Hillman & Herb Pedersen", "date": "2016-04-07T20:00:00-04:00", "url": "https://www.facebook.com/events/724290011035895/", "source": "Facebook"}, {"description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "name": "Jerusalem Quartet", "date": "2016-04-08T20:00:00-04:00", "url": "https://www.facebook.com/events/827290400697161/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-04-11T20:30:00-04:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "South Africa's legendary breaker of walls", "name": "The Johnny Clegg Band", "date": "2016-04-13T20:00:00-04:00", "url": "https://www.facebook.com/events/1602568673339827/", "source": "Facebook"}, {"description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "name": "Mnozil Brass", "date": "2016-04-14T19:30:00-04:00", "url": "https://www.facebook.com/events/1621365181438631/", "source": "Facebook"}, {"description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus, where it blended with elements of Spanish music, then was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed Tunisian singer Sonia M’barek, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "name": "Zafir: Musical Winds from North Africa to Andalucía", "date": "2016-04-15T20:00:00-04:00", "url": "https://www.facebook.com/events/419604171550681/", "source": "Facebook"}, {"description": "Legendary guitar mastery", "name": "Leo Kottke", "date": "2016-04-16T20:00:00-04:00", "url": "https://www.facebook.com/events/1512513839062559/", "source": "Facebook"}, {"description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "name": "Bavarian Radio Orchestra", "date": "2016-04-16T20:00:00-04:00", "url": "https://www.facebook.com/events/1579924995611394/", "source": "Facebook"}, {"description": "Monday, April 18 | 8pm | 18+ | $15 adv./ $17 day of\n\nPolica with MOTHXR \n\nUnited Crushers (out March 4, 2016) is POLIÇA’s third full-length release and most remarkable album to date. The band, which includes Channy Leaneagh, dual drummers, Drew Christopherson and Ben Ivascu and Chris Beirden on bass with producer Ryan Olson at the helm, collectively wrote the album in Minneapolis in the winter of 2015 during their first true break from two straight years of touring. The new album builds on POLIÇA’s signature synthesizer and percussion-heavy sounds with more complex arrangements and a bigger, crisper hi-fi punch due to the new approach they took to writing and recording: together, all in the same room. There's a tighter groove to these songs and a more vulnerable quality to them, especially in Leaneagh's singing. Her incredible vocal range is consistently on display throughout, beautifully raw and less electronically effected than on previous recordings. United Crushers is the follow up to 2013’s Shulamith which EW called \"propulsive enough for dance floors, and dreamy enough for headphones\" andMOJO said \"proves that intelligent pop music still has the ability to seduce and enthral.\" Their debut, 2012's Give You The Ghost, also garnered international acclaim, with Rolling Stone hailing it as \"the sound of heartbreak and celebration happening simultaneously\" and Q praising it as \"a bewitching, urgent, magical debut.\" The band has conquered massive festivals around the world from Coachella to Glastonbury in addition to performing on Late Night With Jimmy Fallon, Later With Jools Holland and more.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/564", "name": "Polica w/ Mothxr 4/18/16 @ Blind Pig - Ann Arbor", "date": "2016-04-18T20:00:00-04:00", "url": "https://www.facebook.com/events/769930223136488/", "source": "Facebook"}, {"description": "\"Lush, introspective, elegant\"—Boston Globe. Photo by Asia Kepka.", "name": "Anne Heaton", "date": "2016-04-21T20:00:00-04:00", "url": "https://www.facebook.com/events/1088535237838163/", "source": "Facebook"}, {"description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "name": "The Bad Plus Joshua Redman", "date": "2016-04-23T20:00:00-04:00", "url": "https://www.facebook.com/events/1589849627952742/", "source": "Facebook"}, {"description": "New music from an expat Australian trio", "name": "The Waifs", "date": "2016-04-27T20:00:00-04:00", "url": "https://www.facebook.com/events/831801416940807/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-04-28T20:30:00-04:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "Michigan's cult hero of comedy", "name": "Heywood Banks", "date": "2016-04-29T20:00:00-04:00", "url": "https://www.facebook.com/events/480751802102134/", "source": "Facebook"}, {"description": "An American master of solo songwriting and blues", "name": "Chris Smither", "date": "2016-05-06T20:00:00-04:00", "url": "https://www.facebook.com/events/986462064751963/", "source": "Facebook"}, {"description": "\"Her songs are about living, breathing people.\"—No Depression", "name": "Lucy Kaplansky", "date": "2016-05-07T20:00:00-04:00", "url": "https://www.facebook.com/events/916584281712332/", "source": "Facebook"}, {"description": "\"Her songs are about living, breathing people.\"—No Depression", "name": "Lucy Kaplansky", "date": "2016-05-07T20:00:00-04:00", "url": "https://www.facebook.com/events/483349811834793/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-05-16T20:30:00-04:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-06-04T20:30:00-04:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-06-24T20:30:00-04:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-07-15T20:30:00-04:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "This original holiday romp is inspired by the British tradition of Pantomime (or Panto) - which is like a crazy mash up between a musical comedy, a vaudeville act, an old-fashioned melodrama and a parade - a truly raucous evening's entertainment. Bring the whole family for a night full of music, slapstick comedy, audience participation and (subtley ) ribald humor, where you'll cheer for the hero, boo the villain, and even eat some candy - that we'll throw at you during the performance! Ours is a distinctly American and hilarious Panto, with all of the traditional conventions: a Panto Dame, a rotating roster of local celebrities, pop culture references, and choirs of local schoolchildren, - a truly unique way to celebrate the season.\n\nNovember 27 - December 20.", "name": "An Almost British Christmas", "date": "2016-08-06T20:30:00-04:00", "url": "https://www.facebook.com/events/991614417546900/", "source": "Facebook"}, {"description": "THIS EVENT HAS BEEN POSTPONED TO LATER IN THE POLITICAL SEASON.  PLEASE CHECK OUT THE NEW NOVEMBER 1ST PROGRAM, \"JOKES IN PROCESS\" THAT WE HAVE PUT INTO ITS PLACE.  \n\nThe presidential candidates have been HILARIOUS this year, but now let's see how the professionals do.\nJoin the Emergent Art's Theater and the UnClub as they present \"UnDebateable, the UnPresidential Debates\".\n\nIf you would like to be a part of this historic event, either as a moderator, an interview, and audience reporter, or an actual campaign spokeperson, or if you can do an impression of a candidate, please click the 'Going' button.  If you can't commit, but you are interested in following this event, click 'Maybe' and we will keep you informed.\n\nWe are also looking for folks who can help us stream a webcast of this event.\n\nWant to be a sponsor?  We'll take that too.", "name": "UnDebateable, the UnPresidential Debates - Clown Car to the White House", "date": "2016-09-18T21:00:00-04:00", "url": "https://www.facebook.com/events/1690454564522707/", "source": "Facebook"}]