[{"description": "Join Thea Eck, expert ShopBot instructor with over 5 years of experience, and learn everything you need to know about CAD designing and CAM toolpathing.\n\nThis 1-day workshop is intended for new and beginner VCarve 8.0 users. VCarve 8.0 is the official ShopBot Tools Inc. software to be used with the ShopBot CNC Router and other milling machines.\n\nParticipants will learn how to utilize VCarve 8.0’s drawing tools (the CAD) such as creating shapes, editing nodes, adding text, and offsets. They will then learn the 3 basic toolpaths (the CAM) as well as the tool database. Concepts behind CAD and CAM such as feed and speed rates will also be discussed.\n\nThis is a hands-on, project-based workshop. Each person will have their own computer station and take home workbook.\n\nThere will be a 45-minute lunch break, taken on one’s own, at noon, and two 10-minute breaks. $100.\n\nThere are only 6 spaces available in this class, so give us a call to reserve your spot today! Reach us at (734) 222-4911 or send an email to frontdesk@maker-works.com.\n\nSaturday, January 30, 2016\n\n9am – 4:30pm", "name": "Intro to VCarve Pro", "source": "Facebook", "date": "2016-01-30T09:00:00-05:00", "url": "https://www.facebook.com/events/145062129201124/"}, {"description": "\"A Morning of Puppetry\" is a delightful medley of short plays, starring a variety of puppet types including string puppetry, object puppetry, hand puppetry, and hand and mouth puppetry. Under the skilled hands of  guest artists Seth and Liz Shaffer of Shaffer Handful Puppets, these creatures will come to life to tell such charming tales as \"Dancing Frogs,\" \"Harold the Mailman,\" \"The Wacky Ball\" and \"Hello\" and \"The Wacky Ball.\"\n\nFollowing the show, Seth will lead a workshop with participants where they will create a puppet and learn how to bring it to life.", "name": "A Morning of Puppetry with Shaffer Handful Puppets", "source": "Facebook", "date": "2016-01-30T10:30:00-05:00", "url": "https://www.facebook.com/events/1546900555626173/"}, {"description": "Join The Beer Grotto and Vault of Midnight for a day of drinking, gaming, laughter, and a little education. \n\nTimeline of the day - \n12:00 - Meet at Beer Grotto\n12:30 - Beer Tasting Education Starts / Beer Flights Are Served\n12:45 - 2:30 - Socializing / Drinking / Parlor Games\n2:30 - 3:30 - Dinner Break\n3:30 - 6:30 - Play All The Games at Vault of Midnight\n6:30 - Call A Cab and Let Vault Staff Clean The Shop\n\n\nTickets will be $15.00 and purchased at Vault of Midnight.\n\nThis price includes a tasting flight at Beer Grotto lead by one of their Well Seasoned Beer Drinkers, access to the legendary Vault of Midnight Game Library, and some wonderful company with fellow gaming enthusiasts.", "name": "Tactical Drinking", "source": "Facebook", "date": "2016-01-30T12:00:00-05:00", "url": "https://www.facebook.com/events/1710064412573793/"}, {"description": "Take advantage of this winter opportunity to explore and improve the wet meadow here along the riverbank, home to a variety of special wetland wildflowers, including Michigan lily and turtlehead. We’ll use the frozen ground to get in and remove invasive shrubs that are overgrowing this site. Meet at the south end of the park, in the parking lot off Lake Shore Dr. (via Main St.). Please wear sturdy shoes good for wet ground or snow, and dress in layers. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided.", "name": "Park Stewardship Workday - World Wetlands Day", "source": "Facebook", "date": "2016-01-30T13:00:00-05:00", "url": "https://www.facebook.com/events/947416775327618/"}, {"description": "#servingmorejoy for ONE NIGHT in January!", "name": "Buh-bye, January!", "source": "Facebook", "date": "2016-01-30T19:00:00-05:00", "url": "https://www.facebook.com/events/1698596503730864/"}, {"description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XIV", "source": "Facebook", "date": "2016-01-30T20:00:00-05:00", "url": "https://www.facebook.com/events/1673489232898555/"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Magic & Preach\" starring Maggie O'Reilly, Julia Schroeder, Lauren Bickers, and Cara Trautman. This long form improv troupe is made up of 4 dangerously talented and dazzling ladies who will keep you laughing with the magic of improv and a dash of intermittent hilarious preaching.\n\nGroup 2: \"Unicornucopia\" starring Doug Kolbicz, Annie Hendricks, Stefanie Bainter, Nicole Pascaretta, Mike Ramey, Steve Vagts, Andy Cach, and John Anderson\n\nGroup 3: \"The League of Pointless Improvisers\" starring Steve Oliver, Matt Swartz, Maggie O'Reilly, Julia Schroeder, Arthur Brannon, and Doug Kolbicz", "name": "Pointless Improv with Magic & Preach and Unicornucopia", "source": "Facebook", "date": "2016-01-30T20:00:00-05:00", "url": "https://www.facebook.com/events/879408362173098/"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Unicornucopia\" starring Doug Kolbicz, Annie Hendricks, Stefanie Bainter, Nicole Pascaretta, Mike Ramey, Steve Vagts, Andy Cach, and John Anderson\n\nGroup 2: \"Magic & Preach\" starring Maggie O'Reilly, Julia Schroeder, Lauren Bickers, and Cara Trautman. This long form improv troupe is made up of 4 dangerously talented and dazzling ladies who will keep you laughing with the magic of improv and a dash of intermittent hilarious preaching.\n\nGroup 3: \"The League of Pointless Improvisers\" starring Steve Oliver, Matt Swartz, Maggie O'Reilly, Julia Schroeder, Arthur Brannon, and Doug Kolbicz", "name": "Pointless Improv with Unicornucopia and Magic & Preach", "source": "Facebook", "date": "2016-01-30T22:30:00-05:00", "url": "https://www.facebook.com/events/804099723027311/"}, {"description": "Are you ready for some Football? What about snacks? \n\nDon't worry, we have got your back with our Super Bowl Sunday menu. Featuring hearty prefixed packages to feed the whole team or ala cart options to take to any gathering. \n\nCall in your order to (734) 997-8495. \n\nYou can pick up your order Sunday, February 7, at our location downtown. We are accepting orders until 3 PM Saturday, February 6th. \n\nCheck out our Grid Iron giveaway on Instagram, @babo_ann_arbor \n\nPrefixed Packages\n\nThe Kicker ($50)\n24ct Wings with Buffalo and Ranch, 30ct Turkey Meatballs with Sriracha\n\nSpring Training ($30)\nTortilla Chips with Guacamole and Salsa, Vegetable Platter\n\nThe Quarterback ($55)\nPulled Pork, Mac N Cheese\n\nThe Defensive Line ($95)\n24ct Wings, Vegetable Platter, Mac N Cheese, Pulled Pork\n\nThe Pigskin ($55)\nPotato Skins, Pulled Pork\n\nAla Carte Options\n\n12ct Potato skins, Bacon with gouda or white cheddar broccoli ($20)\n\n24ct Jumbo Wings, Classic Buffalo or Honey Pineapple BBQ ($26)\n\nHalf Pan 4 Cheese Macaroni ($30)\n\nHalf Pan Pulled Pork in Honey Pineapple BBQ sauce, with 6 brioche buns ($30)\n\nHalf Pan Sweet Potato Fries with Sweety Sauce ($14)\n\n30ct Turkey Meatballs, Teriyaki Glaze or Sriracha Sauce ($26)\n\nHousemade Tortilla Chips Platter with Guacamole and Salsa ($16)\n\nTempeh Nachos with 3 Cheese Blend, Lettuce, Onion, Jalapeno, Sour Cream and Salsa ($20)\n\nVegetable Platter with Ranch or Tzatziki Sauce ($16)", "name": "Super Bowl Catering Menu", "source": "Facebook", "date": "2016-01-31T16:00:00-05:00", "url": "https://www.facebook.com/events/576187139206687/"}, {"description": "We expanded the bar, rebuilt the bathrooms, knocked down walls, brought in some new tables and added a little fresh paint to revive and refresh the ABC that our fans have loved for 20 years.  Topping off the aesthetics with a brand new menu that is sure to please a variety of palates.  Same great beer, same great vibe. \n\nWe would love to see our friends, family and customers - new and old - as we celebrate the official re-opening of ABC. We are celebrating with a throwback beer from the original recipe book, live music by Heather Black Project at 5pm and late night happy hour prices from 8pm -close.\n\nWe can't wait to show off our new digs!", "name": "Grand Re-Opening", "source": "Facebook", "date": "2016-01-31T17:00:00-05:00", "url": "https://www.facebook.com/events/575785055912612/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-01-31T19:00:00-05:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "name": "Open Stage", "source": "Facebook", "date": "2016-01-31T19:00:00-05:00", "url": "https://www.facebook.com/events/992746967465142/"}, {"description": "We're hosting a good Old Cockney Competition this Sunday!\n\nFeaturing Two James Old Cockney Gin.\n\nOur bartenders will be competing with one another for a martini showdown. The winner's Martini will be featured in Artini 2016!\n\nJoin us as we mix, shake, and zest the evening away with good drinks, great company, and amazing people.\n\nWant to be a judge? Email Info@AventuraAnnArbor.com", "name": "Old Cockney Competition", "source": "Facebook", "date": "2016-01-31T21:00:00-05:00", "url": "https://www.facebook.com/events/1532461840386243/"}, {"description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "name": "Ann Arbor Restaurant Week", "source": "Facebook", "date": "2016-02-01T11:00:00-05:00", "url": "https://www.facebook.com/events/1657867854492206/"}, {"description": "Ann Arbor Restaurant Week and Food Gatherers are collaborating on a fundraiser this year! Participating restaurants will donate a portion of the sales of a select menu item to Food Gatherers. Look for the Food Gatherers logo to find out which restaurants are participating.\n\nRESTAURANT WEEK MENU\nSelect one dish from each course\nLunch $15 per person plus tax and gratuity\nDinner $28 per person plus tax and gratuity\n\n- first course -\nTomato Basil Bisque\nparmesan croutons\nor\nRoasted Pear And Spiced Pecan Salad\nmixed greens, roasted pear, spiced pecans, crumbled bleu cheese, Michigan dried cherries, whole grain mustard vinaigrette\n\n- second course -\nMacadamia Crusted Mahi-Mahi \nwith ginger beurre-blanc coriander rice and seasonal vegetables\nor\n10oz. Prime Rib\nwith roasted garlic mashed potatoes and house made au jus\n\n- dessert -\nCarrot Cake\nor\nChocolate Chip Cookie Sundae \nwith vanilla ice cream\n\nProceeds from select wines will be donated to Food Gatherers. Ask your server for details.", "name": "Ann Arbor Restaurant Week", "source": "Facebook", "date": "2016-02-01T11:30:00-05:00", "url": "https://www.facebook.com/events/992259070830553/"}, {"description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XIV", "source": "Facebook", "date": "2016-02-01T20:00:00-05:00", "url": "https://www.facebook.com/events/1673489232898555/"}, {"description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "name": "Story Time with Ieva", "source": "Facebook", "date": "2016-02-02T10:00:00-05:00", "url": "https://www.facebook.com/events/494458880715739/"}, {"description": "Literati welcomes Elizabeth McKenzie, who will read from her latest novel, The Portable Veblen.\n\nHere's Mairead's review:\n\n\"This massive romp of a novel is laugh-out-loud funny, completely bizarre, and still--somehow!--incredibly moving. A social novel about engagements and in-laws, a satire of the medical-industrial complex, an impassioned defense of squirrels... McKenzie can do it all and does, in vibrant, gleeful, somersaulting prose. Her heroine--the titular Veblen--might not be quite as quick-witted and ambitious as her author, but she's impossible not to root for. And trust me, you'll never look at squirrels the same way again.\"\n\n\nSet in and around Palo Alto, amid the culture clash of new money and old (antiestablishment) values, and with the specter of our current wars looming across its pages, The Portable Veblen is an unforgettable look at the way we live now. A young couple on the brink of marriage the charming Veblen and her fiancé Paul, a brilliant neurologist find their engagement in danger of collapse. Along the way they weather everything from each other’s dysfunctional families, to the attentions of a seductive pharmaceutical heiress, to an intimate tete-a-tete with a very charismatic squirrel.\n\nVeblen (named after the iconoclastic economist Thorstein Veblen, who coined the term conspicuous consumption ) is one of the most refreshing heroines in recent fiction. Not quite liberated from the burdens of her hypochondriac, narcissistic mother and her institutionalized father, Veblen is an amateur translator and freelance self; in other words, she’s adrift.\n\nMeanwhile, Paul the product of good hippies who were bad parents finds his ambition soaring. His medical research has led to the development of a device to help minimize battlefield brain trauma an invention that gets him swept up in a high-stakes deal with the Department of Defense, a Bizarro World that McKenzie satirizes with granular specificity.\n\nAs Paul is swept up by the promise of fame and fortune, Veblen heroically keeps the peace between all the damaged parties involved in their upcoming wedding, until she finds herself falling for someone or something else. Throughout, Elizabeth McKenzie asks: Where do our families end and we begin? How do we stay true to our ideals? And what is that squirrel really thinking? Replete with deadpan photos and sly appendices, The Portable Veblen is at once an honest inquiry into what we look for in love and an electrifying reading experience.\n\n“Man oh man, do I love this book! I have never read anything like it. I can't believe how funny it is given that we're dealing at times with pharmaceutical fraud, irreparable brain injury, and comatose veterans. (Family dysfunction, on the other hand, is always funny) Audacious, imaginative, and totally wonderful: The whole books zips and zings. -Karen Joy Fowler, PEN Faulkner winner for We Are All Completely Beside Ourselves.\n\n\"The Portable Veblen is the squirreliest novel I ever read. I enjoyed it completely.” -Ursula K. Le Guin, author of The Dispossessed and The Left Hand of Darkness.\n\nElizabeth McKenzie is the author of a collection, Stop That Girl, short-listed for The Story Prize, and the novel MacGregor Tells the World, a \"Chicago Tribune, San Francisco Chronicle and Library Journal Best Book of the year. Her work has appeared in The New Yorker, The Atlantic Monthly, Best American Nonrequired Reading, and the Pushcart Prize anthology, and has been recorded for NPR's Selected Shorts. She was an NEA/Japan US-Friendship Commission Fellow in 2010. She received her MA from Stanford, was an assistant fiction editor at \"he Atlantic, and currently teaches creative writing at Stanford's school of continuing studies.\n\nPhoto credit: Chuck Kramer", "name": "Elizabeth McKenzie", "source": "Facebook", "date": "2016-02-02T19:00:00-05:00", "url": "https://www.facebook.com/events/1560753257579168/"}, {"description": "Tuesday, February 2, 2016, 7:30 pm\nLydia Mendelssohn Theatre\n\nWith Tanya Tagaq, ancient meets modern in provocative, powerful ways. This spellbinding performance features the Inuit throat singer accompanying a screening of Nanook of the North (1922) with a live score. Tagaq’s mixed-media performance reclaims the controversial classic — considered the first feature-length documentary — capturing the sense of the sound of the Arctic spaces shown in the film and adding tremendous feeling and depth to what is a complex mix of beautiful representations and racially charged clichés.\n\nTanya Tagaq’s music is unnerving and exquisite, rooted in Inuit throat singing, but also influenced by electronica, industrial, and metal influences. It is a style that she has perfected with collaborators such as Björk and that reminds some of Meredith Monk’s vocal innovations. Winner of the 2014 Polaris Prize for “Album of the Year” (she beat out Drake and Arcade Fire), Tanya Tagaq makes her UMS debut in this one-night only event. “Nobody, anywhere, sounds like she does.” (Globe and Mail)\n\nMore info: http://ums.org/performance/tanya-tagaq/", "name": "Tanya Tagaq in concert with Nanook of the North", "source": "Facebook", "date": "2016-02-02T19:30:00-05:00", "url": "https://www.facebook.com/events/1155115267866605/"}, {"description": "Are you ready for some Football? What about snacks? \n\nDon't worry, we have got your back with our Super Bowl Sunday menu. Featuring hearty prefixed packages to feed the whole team or ala cart options to take to any gathering. \n\nCall in your order to (734) 997-8495. \n\nYou can pick up your order Sunday, February 7, at our location downtown. We are accepting orders until 3 PM Saturday, February 6th. \n\nCheck out our Grid Iron giveaway on Instagram, @babo_ann_arbor \n\nPrefixed Packages\n\nThe Kicker ($50)\n24ct Wings with Buffalo and Ranch, 30ct Turkey Meatballs with Sriracha\n\nSpring Training ($30)\nTortilla Chips with Guacamole and Salsa, Vegetable Platter\n\nThe Quarterback ($55)\nPulled Pork, Mac N Cheese\n\nThe Defensive Line ($95)\n24ct Wings, Vegetable Platter, Mac N Cheese, Pulled Pork\n\nThe Pigskin ($55)\nPotato Skins, Pulled Pork\n\nAla Carte Options\n\n12ct Potato skins, Bacon with gouda or white cheddar broccoli ($20)\n\n24ct Jumbo Wings, Classic Buffalo or Honey Pineapple BBQ ($26)\n\nHalf Pan 4 Cheese Macaroni ($30)\n\nHalf Pan Pulled Pork in Honey Pineapple BBQ sauce, with 6 brioche buns ($30)\n\nHalf Pan Sweet Potato Fries with Sweety Sauce ($14)\n\n30ct Turkey Meatballs, Teriyaki Glaze or Sriracha Sauce ($26)\n\nHousemade Tortilla Chips Platter with Guacamole and Salsa ($16)\n\nTempeh Nachos with 3 Cheese Blend, Lettuce, Onion, Jalapeno, Sour Cream and Salsa ($20)\n\nVegetable Platter with Ranch or Tzatziki Sauce ($16)", "name": "Super Bowl Catering Menu", "source": "Facebook", "date": "2016-02-03T16:00:00-05:00", "url": "https://www.facebook.com/events/576187139206687/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-02-04T19:00:00-05:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "Come join the conversation about sustainability in Ann Arbor! The City and the Ann Arbor District Library are hosting the fifth annual Sustainable Ann Arbor series.  A think tank of local stakeholders, including community organizations, local government staff, businesses, and residents will join the public to discuss local sustainability efforts and challenges in our community. \n\nThe series will include four events with each focusing on a different element of sustainability from Ann Arbor's sustainability framework (www.a2gov.org/sustainability). The events will be held from 7 p.m. to 8:30 p.m. in the Ann Arbor District Main Library at 343 South Fifth Ave on the first Thursday of January, February, March, and April of 2016. \n\nEach event will include a series of short presentations followed by a question and answer session. The forums offered an opportunity to learn more about sustainability in the Ann Arbor community. If you have comments on the forums or suggestions, please send them to sustainability@a2gov.org or call Sustainability Associate Emily Drennen at 734.794.6430 x43726.\n\nFebruary 4, 2016 – Resource Management, including discussions about improving Ann Arbor's waste diversion rate and communitywide efforts to reduce different waste streams. Speakers will include:\n\n-Roger Bowser, Zingerman's \n-Eileen Spring, Food Gatherers\n-Noelle Bowman, Washtenaw County\n-Tracy Artley, UofM Sustainability\n-Matt Naud, Environmental Coordinator, City of Ann Arbor", "name": "Resource Management Sustainability Forum", "source": "Facebook", "date": "2016-02-04T19:00:00-05:00", "url": "https://www.facebook.com/events/157869774578366/"}, {"description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XIV", "source": "Facebook", "date": "2016-02-04T20:00:00-05:00", "url": "https://www.facebook.com/events/1673489232898555/"}, {"description": "Co-curated by John DeHoog and Ray Wetzel\n\nOPENING RECEPTION: FRIDAY, FEBRUARY 5, FROM 6:00 TO 9:00 PM\n\nZoku, in Japanese means a loosely affiliated tribe or clan.  The title, Mid-West Furniture Zoku, refers to our regional clan of furniture makers, designers, and educators.\n\nThis exhibition (at the 117 Gallery from February 5 to March 5) is but a small sampling of a much larger group of like-minded artists, designers, and educators working in the context of furniture. The works in the show represent a broad range of techniques, styles, and personal sensibilities, while at the same time demonstrating universal respect for materials, and deep interest in the integration of form and function. On display are objects that are familiar on one level, yet poke holes in our conventional views of how furniture should look and what role furniture plays in our daily lives.\n\nFEATURED ARTISTS:\n\nAaron Blendowski •  Maxwell Davis •  John DeHoog • Laura Earle  • Nicole Hodsdon • Katie Hudnall • Chad Jenson •  Melissa Judd • Andy Kem  • Bob Marsh • Brian Nelson • Michael Neville • Matt O’Brien • Nick Stawinski •  Jim Stevens • Travis Taylor •  Marco Terenzi • Colin Tury •  Ray Wetzel \n\nJoin us for the Opening Reception on Friday, February 5, from 6:00 to 9:00 pm at the 117 Gallery in the Ann Arbor Art Center. This is a free, drop-in event! \n\n---------\n\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC \nMid-West Furniture ZOKU Exhibition is presented by Three Chairs Co.", "name": "Mid-West Furniture ZOKU Exhibition", "source": "Facebook", "date": "2016-02-05T18:00:00-05:00", "url": "https://www.facebook.com/events/576089435876883/"}, {"description": "Taylor Mac is equal parts bedazzled shaman and Elizabethan fool, who through his searing social criticism and soaring spirit reminds people of the things they’ve forgotten, dismissed, or buried. A 24-Decade History of Popular Music will eventually become a 24-hour extravaganza focused on music popular in America between 1776-2016, with an hour devoted to each decade. Clad in glittering, over-the-top drag, Mac brings an incomparable voice and high-voltage stage presence to an alternate version of American histories, brought to life through a gleefully subversive mash-up of performance art and song. Here, Mac focuses on the period 1956-1986, with chapters devoted to Songs Popular on the Bus/The March on Washington, Stonewall Songs, and Songs Popular in the Backroom. Selections will include songs made popular by Nina Simone and Stevie Wonder, among others.\n\nPlease note: Taylor Mac’s cabaret will include mature sexual content and is intended for adult audiences.\n\nMore info: http://ums.org/performance/taylor-mac-a-24-decade-history-of-american-popular-music-1960s-1980s/", "name": "Taylor Mac: A 24-Decade History of Popular Music: 1956–1986", "source": "Facebook", "date": "2016-02-05T20:00:00-05:00", "url": "https://www.facebook.com/events/1594841967471096/"}, {"description": "Following four sold-out shows in November, Ann Arbor Civic Theatre and the Civic Improv Ensemble are excited to announce the second Improv Showcase of their 2015-16 season. All three Civic Improv troupes will be performing on Friday February 5 and Saturday February 6 at 8pm and 10pm in the A2CT Studio, 322 W. Ann St., Ann Arbor. Tickets are $10 and are available by phone at 734-971-2228 or in limited quantities at the door", "name": "A2CT Winter Improv Showcase", "source": "Facebook", "date": "2016-02-05T20:00:00-05:00", "url": "https://www.facebook.com/events/1739860932892053/"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Consolation Fries\" starring Chris Moody and Ian McCain\n\nGroup 2: \"Listen, Stupid\" starring Tom Novi and Nuverre Naami\n\nGroup 3: \"The League of Pointless Improvisers\" starring Arthur Brannon, Chris Moody, Emily Engelhart, Jason Valentini, and Matt Swartz", "name": "Pointless Improv with Consolation Fries and Listen, Stupid", "source": "Facebook", "date": "2016-02-05T20:00:00-05:00", "url": "https://www.facebook.com/events/1721237768094769/"}, {"description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "name": "Little Peeps PlayGround - \"Dreams\"", "source": "Facebook", "date": "2016-02-06T10:30:00-05:00", "url": "https://www.facebook.com/events/1683843398552871/"}, {"description": "Back by popular demand, the legendary Vault of Midnight Build-A-Toy-Vaganza. Spend an afternoon assembling and breathing to life the action figure of your dreams/nightmares. Craft supplies and expertise will be provided, all for a measly $10 entry fee.\n\nTICKETS ARE ON SALE NOW! ONLY 30 SEATS AVAILABLE!\n\nThe event will be run and guided by Vault of Midnight Owner and Proprietor Curtis J Sullivan. He'll walk us through the proceedings with a gentle yet stern hand. Some of the highlights he'll be presenting and teaching include:\n\n- Planning out your custom toy! The Key To Success is Planning!\n- Learn how to use super glue the \"Curtis way!\"\n- How to properly use a hobby knife and avoid serious injury to yourself or others.\n- Painting Your Creation 101\n- Best Practices for taking a selfie with your new creation.\n\nBring the kids, bring your friends, and spend a day building with your hands and MIND. Don't miss it.", "name": "Ultimate Build-A-Toy", "source": "Facebook", "date": "2016-02-06T13:00:00-05:00", "url": "https://www.facebook.com/events/784692071662519/"}, {"description": "Detroit Is: An Essay in Photographs offers a very personal depiction of an often misrepresented and maligned place. It presents multiple, diverse, contrasting aspects of the complex city.\n\nJ. Gordon Rodwan’s photographs show sides of the city that many people – residents and non residents alike – often miss rather than reproducing images already widely seen. They don’t ignore the dilapidated parts of the city, but they don’t fetishise those elements either. Instead, Rodwan juxtaposes them with images capturing efforts to cultivate and sustain creativity and vibrancy in place where too many expect to see only relics or despair. Neither ‘ruin porn’ nor an equally distorted boosterish presentation of only the positive, Detroit Is offers a highly individual look at what it’s like to live in Detroit.\n\nComplementing the photographs are an introductory essay and poems by the photographer’s son, John G. Rodwan, Jr.", "name": "Meet Photographer J. Gordon Rodwan & Author John G. Rodwan, Jr for a Discussion & Signing of 'Detroit Is: an essay in photographs'", "source": "Facebook", "date": "2016-02-06T15:00:00-05:00", "url": "https://www.facebook.com/events/934979649873085/"}, {"description": "Saturday, February 6, 2016, 8:00 pm\nHill Auditorium \n\n“His superb live performance confirmed the impression of his recording: A major new pianist has arrived.” (New York Times) Born in 1987, the Russian-German pianist Igor Levit received effusive praise for his two-disc debut album of Beethoven’s late piano sonatas. A relative newcomer to the United States, he makes his UMS debut with this recital appearance. \n\nMore info: http://ums.org/performance/igor-levit/", "name": "Igor Levit, piano", "source": "Facebook", "date": "2016-02-06T20:00:00-05:00", "url": "https://www.facebook.com/events/1435582513413462/"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Freaks and Geeks\" starring Nicole Pascaretta, Maggie O'Reilly, Steve Oliver, Jacob Russell, Nuverre Naami, and Aaron Mondry\n\nGroup 2: \"Matt & Mitch\" starring Matt Penridge and Mitch Socia\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Corene Ford, Erik Heilner, Maggie O'Reilly, and Steve Oliver", "name": "Pointless Improv with Freaks and Geeks and Matt & Mitch", "source": "Facebook", "date": "2016-02-06T20:00:00-05:00", "url": "https://www.facebook.com/events/516736008506387/"}, {"description": "Pointless Improv Shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Matt & Mitch\" starring Matt Pendrige and Mitch Socia\n\nGroup 2: \"Freaks and Geeks\" starring Nicole Pascaretta, Maggie O'Reilly, Steve Oliver, Jacob Russell, Nuverre Naami, and Aaron Mondry\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Corene Ford, Erik Heilner, Maggie O'Reilly, and Steve Oliver", "name": "Pointless Improv with Matt & Mitch and Freaks and Geeks", "source": "Facebook", "date": "2016-02-06T22:00:00-05:00", "url": "https://www.facebook.com/events/1173637132664202/"}, {"description": "Help us celebrate Dr. Michael Petty’s release of his new book ‘Dr. Petty’s Pain Relief for Dogs’ and when you join us for this event please if you can bring dry dog or cat food with you for the Humane Society of Huron Valley’s Bountiful Bowls program.  The Bountiful Bowls program is a pet food assistance program that helps people with financial difficulties.  For more information regarding the program go to  bit.ly/1Ywz4TQ\n\nDr. Michael Petty is a veterinarian and pain management specialist. He is the owner of the Arbor Pointe Veterinary Hospital as well as the Animal Pain Center (www.animalpaincenter.com), both in Canton, Michigan. He is the immediate-past president of the International Veterinary Academy of Pain Management and the co-author of the 2014 American Animal Hospital Association Pain Guidelines. A frequent speaker and consultant, Petty has also published articles in veterinary journals and elsewhere. He lives in rural Michigan with his wife and two daughters, two dogs, a cat, and a hedgehog.\n\nYou love your dog, and hate to see him in pain. But you don t want to head to the vet's office for hundreds of dollars worth of tests that might prove useless. Dr. Mike Petty understands this. He's a pain vet working with cutting-edge research to find the best way to relieve your pet's pain. In this book, he guides readers in three critical points:\n\n1.\tHow to determine whether a dog is in pain\n\n2.\tHow to find a veterinarian capable of treating these pain issues.\n\n3.\tWhat treatments are available, and which are worth pursuing and which are not.\n\nDr. Petty offers clear descriptions of the treatments, both traditional and holistic. This guide offers the wisdom and support that dog owners crave in these situations.", "name": "Join Us for the Launch Party for Dr. Michael Petty & Fundraiser for HSHV Bountiful Bowls Program", "source": "Facebook", "date": "2016-02-07T15:00:00-05:00", "url": "https://www.facebook.com/events/449539918589830/"}, {"description": "Take in the Super Bowl at Wolverine State! We'll have the game on our big-screen tvs, plenty of seating, $2 & $3 15-oz pours, and brisket chili + smoked wings on the menu! \n\nKickoff is at 8 pm! We'll see you here.", "name": "Super Bowl Sunday at Wolverine State", "source": "Facebook", "date": "2016-02-07T16:00:00-05:00", "url": "https://www.facebook.com/events/517318825107223/"}, {"description": "Are you ready for some Football? What about snacks? \n\nDon't worry, we have got your back with our Super Bowl Sunday menu. Featuring hearty prefixed packages to feed the whole team or ala cart options to take to any gathering. \n\nCall in your order to (734) 997-8495. \n\nYou can pick up your order Sunday, February 7, at our location downtown. We are accepting orders until 3 PM Saturday, February 6th. \n\nCheck out our Grid Iron giveaway on Instagram, @babo_ann_arbor \n\nPrefixed Packages\n\nThe Kicker ($50)\n24ct Wings with Buffalo and Ranch, 30ct Turkey Meatballs with Sriracha\n\nSpring Training ($30)\nTortilla Chips with Guacamole and Salsa, Vegetable Platter\n\nThe Quarterback ($55)\nPulled Pork, Mac N Cheese\n\nThe Defensive Line ($95)\n24ct Wings, Vegetable Platter, Mac N Cheese, Pulled Pork\n\nThe Pigskin ($55)\nPotato Skins, Pulled Pork\n\nAla Carte Options\n\n12ct Potato skins, Bacon with gouda or white cheddar broccoli ($20)\n\n24ct Jumbo Wings, Classic Buffalo or Honey Pineapple BBQ ($26)\n\nHalf Pan 4 Cheese Macaroni ($30)\n\nHalf Pan Pulled Pork in Honey Pineapple BBQ sauce, with 6 brioche buns ($30)\n\nHalf Pan Sweet Potato Fries with Sweety Sauce ($14)\n\n30ct Turkey Meatballs, Teriyaki Glaze or Sriracha Sauce ($26)\n\nHousemade Tortilla Chips Platter with Guacamole and Salsa ($16)\n\nTempeh Nachos with 3 Cheese Blend, Lettuce, Onion, Jalapeno, Sour Cream and Salsa ($20)\n\nVegetable Platter with Ranch or Tzatziki Sauce ($16)", "name": "Super Bowl Catering Menu", "source": "Facebook", "date": "2016-02-07T16:00:00-05:00", "url": "https://www.facebook.com/events/576187139206687/"}, {"description": "PROJECt Trio is coming to Ann Arbor to help us celebrate our 25th Anniversary!  Concert to include collaborative performances with our Classical and Jazz Studies students!\n4:00 | Reception and Auction 5:00 | Benefit Concert\nGroup Ticket rates available!", "name": "25th Anniversary Benefit w/ PROJECT TRio!", "source": "Facebook", "date": "2016-02-07T16:00:00-05:00", "url": "https://www.facebook.com/events/1016509241723622/"}, {"description": "Join us to play short-form and long-form improv games! All experience levels welcome. Come to watch or to play. It's free!", "name": "The Arcade - A Pointless Improv Jam", "source": "Facebook", "date": "2016-02-07T19:00:00-05:00", "url": "https://www.facebook.com/events/1688201238089976/"}, {"description": "Every year the Emergent Arts Theater and the UnClub have defied the norm and presented a show on Super Bowl Sunday. This year is no different.\n\nWhat is different this year is that ALL THE PROCEEDS FROM OUR SUPER BOWL SUNDAY SHOWS WILL GO TO THE COMICS FOR FLINT CAMPAIGN #ComicsForFlint, which is raising money and delivering bottled water to social service agencies dealing with the Flint water fiasco, and the THE FLINT CHILD HEALTH & DEVELOPMENT FUND, which is always looking out for the welfare of Flint's children, before, during, and long after the Flint Water Crisis.\n\nThe Yellow Barn's newest Sunday night show, \"Stage Time\", will be teaming with the Unclub to present some of the best and brightest comedy this state has to offer.\n\nThere will be 2 shows, just like our regular Sunday night offerings.  \"Stage Time\" will start at 8:00pm and there is a $10 admission FOR EVERYONE, COMICS INCLUDED.\n\nMany of you already know of our format change.  This would be a great opportunity for both fans and performers to get to know the Yellow Barn and it's offerings to the Ann Arbor performing arts community, all while benefiting the folks in Flint.\n \nCOMICS and PERFORMERS: \n\nComics and performers, please follow these procedures for UNclub open mic:\n\n- Click \"Going\" on this Facebook Event. Even if you are thinking about it, you can click \"Interested\" so you can get updates on this page. Do this by 5:00pm, the day of the show. This does not guarantee you a spot, but not doing it puts you at the bottom of the list.\n\nThis show will have limited spots.  Anyone who comes for the Stage Time show will be guaranteed a spot in the Unclub Show.  The Unclub will operate as it always has with the line-up being created at showtime. There will be a suggested donation for the Unclub show at 9:30. Admission to Stage Time is $1\n\nDon't want to pay the $10 at 8:00pm?  Come at 9:30pm. It's that simple. It's a fundraiser. Don't ask for privileges. \n\n- For the Unclub show, the order of performance and length of set will be determined at showtime.  The priorities will be:\n1. Invited guests\n2. Acts who have indicated they will attend (Clicking on this Facebook event counts as an RSVP)\n3. Show ups\n\nAll spots will given at the show-runner's discretion.\n\n- Those arriving after the line-up is finalized will be given spots as time permits.\n- Length of stage time will be predetermined for the Stage Time show, but for the Unclub, set lengths will be determined largely by the turn out, performer's experience, and the show-runner's discretion.\n- As always, if you show up and do not get a spot, you will be put at the top of the list for the next show.\n\n--- Want to increase your odds of getting a spot? Here's some DO's and DON'T's\nDO . . . . Share this event page with your fans on your fan page, your facebook page, your website, or your tweets, or any other social media.\nDO . . . . Volunteer for less time. If you are willing to do 3 rather than 5, or 4 rather than 7, then you are more likely to get a spot.\nDO . . . . Come to the Stage Time show. $10 admission\nDO . . . . Bring people. This is not, I repeat NOT, a \"bringer.\" But if somebody has come to see you, it will be very hard to deny you a spot. In the past, we've had shows where we've added a minute of time for every person the comic brought as a non-performing audience member. Bring three people and a five minute spot becomes an eight minute spot.\n\nContact Mark at: www.facebook.com/marksweetman", "name": "Stage Time: #ComicsForFlint Benefit and 3rd Annual UNclub Super Bowl Show", "source": "Facebook", "date": "2016-02-07T20:00:00-05:00", "url": "https://www.facebook.com/events/971054972968627/"}, {"description": "Literati welcomes Garth Greenwell, who will read from his debut novel, What Belongs to You, which Publishers Weekly called \"the first great novel of 2016.\"\n\nOn an unseasonably warm autumn day, an American teacher enters a public bathroom beneath Sofia’s National Palace of Culture. There he meets Mitko, a charismatic young hustler, and pays him for sex. He returns to Mitko again and again over the next few months, drawn by hunger and loneliness and risk, and finds himself ensnared in a relationship in which lust leads to mutual predation, and tenderness can transform into violence. As he struggles to reconcile his longing with the anguish it creates, he’s forced to grapple with his own fraught history, the world of his southern childhood where to be queer was to be a pariah. There are unnerving similarities between his past and the foreign country he finds himself in, a country whose geography and griefs he discovers as he learns more of Mitko’s own narrative, his private history of illness, exploitation, and want.\n\nWhat Belongs to You is a stunning debut novel of desire and its consequences. With lyric intensity and startling eroticism, Garth Greenwell has created an indelible story about the ways in which our pasts and cultures, our scars and shames can shape who we are and determine how we love.\n\n“Garth Greenwell takes us deep inside a specific Bulgarian subculture to examine the universal: the disparity between the uninhibited lives we desire and the bearable lives we choose. I began reading What Belongs to You in admiration; I ended in tears. An exquisite debut.” --Jamie Quatro, author of I Want to Show You More.\n\nGarth Greenwell is the author of Mitko, which won the 2010 Miami University Press Novella Prize and was a finalist for the Edmund White Award for Debut Fiction Award and a Lambda Award. A native of Louisville, Kentucky, he holds graduate degrees from Harvard University and the Iowa Writers’ Workshop, where he was an Arts Fellow. His short fiction has appeared in The Paris Review and A Public Space. What Belongs to You is his first novel.", "name": "Garth Greenwell", "source": "Facebook", "date": "2016-02-08T19:00:00-05:00", "url": "https://www.facebook.com/events/538320006348926/"}, {"description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XIV", "source": "Facebook", "date": "2016-02-08T20:00:00-05:00", "url": "https://www.facebook.com/events/1673489232898555/"}, {"description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "name": "Story Time with Ieva", "source": "Facebook", "date": "2016-02-09T10:00:00-05:00", "url": "https://www.facebook.com/events/201462843528819/"}, {"description": "Celebrate Mardi Gras in the best way -- with New Orleans-themed eats! We'll have jambalaya, gumbo, and red beans & rice on the menu all night.", "name": "Mardi Gras Food Specials!", "source": "Facebook", "date": "2016-02-09T16:00:00-05:00", "url": "https://www.facebook.com/events/457021837755932/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-02-09T19:00:00-05:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "Literati is pleased to welcome Michigan native Travis Mulhauser in support of Sweetgirl, which was also recently listed as an Indie Next Great Reads pick!\n\n“SWEETGIRL is a gritty, compelling novel of a world where even a sixteen-year-old must confront what Edith Wharton called ‘the hard considerations of the poor.’ Mulhauser depicts his people and their landscape with uncompromising fidelity.” —Ron Rash\n\nIn his uncompromising and evocative debut novel, SWEETGIRL (Ecco; February 2, 2016), Travis Mulhauser takes readers deep into the heart and mind of an unforgettable young girl—a fearless and headstrong teenager navigating the hard luck terrain of northern Michigan as she looks for her mother, an addict who has gone missing. Percy James’s search launches a complicated series of events, triggered by an unexpected discovery that threatens her very survival. “There’s a big old neon heart pulsing on every page of SWEETGIRL, like the sign to a bar you can’t help but enter,” says Lindsay Hunter, author of Ugly Girls and Don't Kiss Me. “I felt thrilled and shocked, and I couldn’t stop turning the pages. Travis Mulhauser is a writer to be reckoned with.”\n\nNine days after Mama disappeared I heard she was throwing down with Shelton Potter. As a blizzard bears down, Percy James sets off to find her troubled mother. For years, Percy has had to take care of herself and Mama—a woman who’s been unraveling for as long as her daughter can remember. In a drug-ravaged farmhouse, Percy finds a neglected infant, and risks everything to save her. But, her decision puts her on the wrong side of Potter, a volatile ex-con who puts a bounty on the young girl’s head. As Percy disappears into the surrounding, isolated hill country, she will face a journey requiring plenty of courage and ingenuity, even as she confronts the nature of her mother’s affliction and the realities of life in a community devastated by meth addiction and the desperation that accompanies it.\n\n\"Percy actually started as a supporting character in another book, which I basically scrapped when I realized she was the one I was really interested in writing about,” Mulhauser says of the genesis of SWEETGIRL. “I think her story really came together through her voice, which I would say is heavily influenced by two experiences: a few years working with addict and ‘at risk teens’ in northern Michigan and seven years teaching at a small community college in North Carolina. Both of these experiences exposed me to really tough, vibrant kids who spoke with conviction and bluster, who were often hopeful despite difficult circumstances, and who, generally, did not imbue their very harrowing life experiences with much self-pity or melodrama.”\n\nTravis Mulhauser was born and raised in Northern Michigan, the insular and remote setting of the fictional Cutler County of the novel. Currently, Mulhauser lives in Durham, North Carolina with his wife and two children, where he teaches at North Carolina State University. He earned his MFA from the University of North Carolina-Greensboro.\n\n“A riveting novel… far, far funnier than it has any right to be,” adds Brock Clarke, author of The Happiest People in the World. “If you’re a fan of Charles Portis and Denis Johnson… then this book is exactly what you’ve been wanting, what you’ve been waiting for.”\n\nPHOTO CREDIT: Viki Redding", "name": "Travis Mulhauser", "source": "Facebook", "date": "2016-02-09T19:00:00-05:00", "url": "https://www.facebook.com/events/981751345241945/"}, {"description": "ENGAGE AND BE HEARD.\nSHARE YOUR WORK.\nCONNECT WITH OTHERS.\n\nArtsX UMMA is a gathering of students to bring different groups together on campus who are interested in leadership, diversity, and the arts. The program will include dynamic, short presentations and opportunities for networking, discussion, and building an audience with other students on campus, as well as connecting with potential partners and collaborators. \n\nHosted by the UMMA Student Engagement Council, which serves as a direct link between U-M students and the Art Museum. It is dedicated to helping support UMMA's mission of commitment to students and engagement with the arts.\n\nPresenters include:\nHelicon is the University of Michigan history of art undergraduate student organization dedicated to supporting the artistic culture at the University of Michigan. \n\nHip Hop Congress promote hip hop culture on campus and in the community through events including panels, speeches, concerts, and various other creative methods to showcase hip hop history and culture, as well as the social and political issues hip hop addresses. \n\nMichigan in Color is a section of the Michigan Daily that focuses on highlighting and prioritizing a space for the experiences of people of color at the University of Michigan. \n\nMiddle East and Arab Network (MEdAN) seeks to combat false misconceptions by educating the public, and to foster and sustain a sense of community and solidarity among Arab, Middle Eastern, and North African students, as well as between the different communities throughout the university.\n\nThe Program on Intergroup Relations is a social justice education program that blends theory and experiential learning to facilitate students' learning about social group identity, social inequality, and intergroup relations.\n\nSHEI Magazine is the University of Michigan's premiere fashion, art, and culture magazine and an organization that offers students hands-on experience in all matters editorial and business. \n\nSpecial alumnae guests:\nAsh Arder is an artist and researcher currently based in Detroit. She creates installations and sculptural objects using a combination of found and self-made materials. She also works as Cultural Strategist + Producer for Creative Many Michigan, an nonprofit focused on developing creative people, creative places and creative economies for a competitive Michigan. \n\nAlma Davila-Toro currently works as Event Manager & Director of Championships for the U of M Athletic Department. She is also Co-Founder & Faculty Advisor of FOKUS (Fighting Obstacles Knowing Ultimate Success).\n\nFREE! ALL ARE WELCOME TO ATTEND!! THERE WILL BE FOOD!!!\n\nCo-sponsored by Arts @ Michigan", "name": "ArtsX UMMA: Student Roundtable: Leadership, Diversity, and the Arts", "source": "Facebook", "date": "2016-02-10T18:00:00-05:00", "url": "https://www.facebook.com/events/176117589411983/"}, {"description": "Literati is delighted to welcome beloved young-adult author and staff favorite Ruta Sepetys in support of her latest novel!\n\nSalt to the Sea is a masterful work of historical fiction inspired by the single greatest maritime disaster in history: the real-life tragedy that was the sinking of the Wilhelm Gustloff (far more deadly than the sinkings of the Titanic and the Lusitania combined). Just as she did in her award-winning novel Between Shades of Gray, Ruta unearths a shockingly little-known casualty of a gruesome war, and proves that humanity can prevail, even in the darkest of hours.\n\nIt's 1945 in East Prussia. World War II is drawing to a close as Russian forces overtake the Germans, and thousands of refugees are on a frantic trek toward freedom, almost all of them with something to hide. Among the throngs of people seeking safety are Joana, Emilia, and Florian: each one borne of a different homeland, yet equally desperate to escape a life marked by brutality and war. As their paths converge en route to the Wilhelm Gustloff--the former cruise ship that promises each character's salvation and future just beyond the Baltic Sea--the three are forced by circumstance to unite, and with each step closer toward safety, their strength, courage, and trust in each other are tested. Yet just when it seems freedom is within their grasp, Russian torpedoes strike the massive ship. Not country, nor culture, nor status matter as all ten thousand people aboard must fight for the same thing: survival. Most will not make it.\n\n“With exquisite prose, Sepetys plumbs the depths of her quartet of characters, bringing each to the breaking point and back, shaping a narrative that is as much about the intricacies of human nature as it is about a historical catastrophe. Nominated for both the Morris Award and the Carnegie Medal for her first novel, Between Shades of Gray (2011), Sepetys returns to those roots with another harrowing, impeccably researched story of hardship and survival in Eastern Europe…This haunting gem of a novel begs to be remembered, and in turn, it tries to remember the thousands of real people its fictional characters represent.”—Booklist, starred review\n\n“Sepetys delivers another knockout historical novel…Sepetys excels in shining light on lost chapters of history, and this visceral novel proves a memorable testament to strength and resilience in the face of war and cruelty.”—Publishers Weekly, starred review\n\n“With the same lyrical prose, eye for detail, and breath-stopping ability to unfold delicate layers of characterization and theme with skillfully paced revelations, the author of Between Shades of Gray (2011) and Out of the Easy (2013) presents a fictionalized World War II story based on a true tragedy…Observations of war and loss, human cruelty, and hatred, are unflinching. But through the horror and heartbreak shine rays of hope: love, kindness, courage, and sacrifice. Verdict: Artfully told and sensitively crafted, Sepetys’ s exploration of this little-known piece of history will leave readers weeping.” —School Library Journal, starred review\n\nRuta Sepetys (www.rutasepetys.com) was born and raised in Michigan in a family of artists, readers, and music lovers. She is the award-winning, bestselling author of Between Shades of Gray and Out of the Easy. Ruta lives with her family in Nashville, Tennessee. Follow her on Twitter at @RutaSepetys.", "name": "Ruta Sepetys", "source": "Facebook", "date": "2016-02-10T19:00:00-05:00", "url": "https://www.facebook.com/events/714421995360971/"}, {"description": "Thursday, Feb. 11 | 8pm | 18+ | $7 Cover\n\nCooke with: Cetan Clawson & The Howling Loud\n\n“Cooke is the project I’ve always wanted to create,” says front-man and lead guitarist Robbie Cook. “It’s my take on a soulful approach to rock n’ roll, one whose core has been seeped in blues and pop music; a modern version of Tom Petty with the smoothness of John Mayer and the soulful vibes of Bill Withers. That’s the sound I’m going for.” The result is music that is just as easily enjoyed blowing down the highway or simply lying next to someone you love. It’s music that you feel. The band, a four-piece group comprised of guitarist/vocalist Robbie Cook (the extra ‘e’ was dropped by bookkeepers on Ellis Island), bassist Carl Limbacher, drummer Jacob Berg, and female backing vocalist Angie Atkinson. Their debut EP is anticipated spring of 2015 with an east coast/mid-west tour to follow. Cook, a twenty-nine year old blues guitarist hailing from Ann Arbor, Michigan, was a late bloomer to the music world. He picked up his first guitar at the age of eighteen and hasn’t put it down since, bouncing from project to project until finally moving to NYC to pursue his dream full-time. He worked hard to define his musical style and was greatly inspired by Creedence Clearwater Revival, Dave Matthews Band, Ben Harper, and countless others before stumbling upon blues master Eric Clapton. “That,” he says, “is when my direction became clear.” A spark was ignited and Cook now strives to emulate musical giants such as Stevie Ray Vaughn, Big Bill Broonzy, and Robert Johnson. With his band’s debut EP right around the corner, writing has become the new daily routine. Cooke’s strong catalog of blues licks, pop hooks, and delicious melodies creates a sound that is modern and exciting while still paying reverence to the classics. “At the end of the day,” Cook says, “I want to write great songs. I want to bring fresh vitality to the Blues, a style that forever changed the course of my life and direction of my dreams. I’m well on my way—here’s hoping I never stop trying.”", "name": "Cooke w/ Cetan Clawson Revival & The Howling Loud 2/10/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-02-10T20:00:00-05:00", "url": "https://www.facebook.com/events/1087790041253279/"}, {"description": "Join us Thursday evenings, from February 11 through March 3, for the mesmerizing music, humor, and sentiment of the one and only Jacques Brel. Originally performed off-Broadway in 1968, this show has enjoyed continuing success, and was revived Off-Broadway in 2006, to considerable acclaim. We are performing it as a dinner theatre event in partnership with Conor O'Neill's Traditional Irish Pub and Restaurant. Thus, you can purchase dinner-and-a-show tickets for just $20 each (dinner seatings begin at 6pm), or show-only tickets for $10. Curtain at 7:30pm in Conor O'Neill's Celtic Room. Seating is limited, to get your tickets now!", "name": "Jacques Brel is Alive and Well and Living in Paris", "source": "Facebook", "date": "2016-02-11T18:00:00-05:00", "url": "https://www.facebook.com/events/171925729842741/"}, {"description": "the style: the American craft beer market has an unfaltering affection for humulus lupulus and so do we. In February, come sample all the IPAs, pale ales, lagers, and other styles that feature your favorite little green cone.\n\nthe event: We'll gather brews worth sampling to bring you a novel and varied experience for your palates. We’ll pair beer samples with an appetizer buffet, provide a program with tasting notes, and top off the night with a door prize drawing.\n\nthe dets: ABC’s monthly tastings run from 7-9 PM on the 2nd Thursday of each month. Tickets are available at the pub or by phone at 734-213-1393. $25 in advance, $30 day of.", "name": "Beer Tasting: For the Love of Hops", "source": "Facebook", "date": "2016-02-11T19:00:00-05:00", "url": "https://www.facebook.com/events/941651205915732/"}, {"description": "Literati Welcomes David Joy, who will read from his latest novel, Where All Light Tends to Go.\n\nIn the meth-dealing McNeely family, killing a man is a rite of passage, but when eighteen-year-old Jacob McNeely botches a murder, he is torn between appeasing his kingpin father and leaving the mountains with the girl he loves. The area surrounding Cashiers, North Carolina is home to people of all kinds, but the world that Jacob lives in is crueler than most. His father runs a methodically organized meth ring, with local authorities on the dime to turn a blind eye to his dealings. Having dropped out of high school, subsequently cutting himself off from his peers, Jacob has been working for this father for years, all on the promise that his payday will come eventually. The only joy he finds comes from reuniting with Maggie, his first love, and a girl clearly bound for bigger and better things than their hardscrabble town. The world that Jacob inhabits is bleak and unrelenting in its violence and disregard for human life, and having known nothing more, Jacob wonders if he can muster the strength to rise above it.\n\n“Remarkable... This isn't your ordinary coming-of-age novel, but with his bone-cutting insights into these men and the region that bred them, Joy makes it an extraordinarily intimate experience.” — New York Times Book Review\n\n“Bound to draw comparisons to Daniel Woodrell's Winter's Bone...[Joy’s] moments of poetic cognizance are the stuff of fine fiction, lyrical sweets that will keep readers turning pages...'Where All Light Tends To Go' is a book that discloses itself gradually, like a sunrise peeking over a distant mountain range...If [Joy's next novel] is anything like his first, it'll be worth the wait.” — Atlanta Journal-Constitution\n\n“[Joy] has studied his forebears in Southern gothic: Where All Light Tends to Go mixes Flannery O'Connor's twisted religion with Cormac McCarthy's mythopoetic violence...Jacob's narrative voice mixes these poetic passages with down-home colloquialisms in sequences that are occasionally jarring, though nothing stands in the way of the story's momentum. Readers turn through pages of darkness hoping that, against the odds, Jacob can find his way to the light.” — Memphis Commercial-Appeal\n\n“[A] gripping first novel...[a] tragic, absorbing plot. Engaging characters, a well-realized setting, and poetic prose establish Joy as a novelist worth watching.” — Publishers Weekly\n\n“Joy's first novel is an uncompromising noir, its downward thrust pulling like quicksand on both the characters and the reader. And, yet, there is poetry here, too, as there is in Daniel Woodrell's novels, the kind of poetry that draws its power from a doomed character's grit in the face of disaster...This is the start of a very promising fiction-writing career.” — Booklist\n\nDavid Joy lives in a more remote part of North Carolina (Webster) and has great knowledge of the area and its people, the real-life inspirations for what he’s coined an “Appalachian noir.” David was born in Charlotte, N.C., in 1983, and moved to Cullowhee in 2003 to study literature at Western Carolina University mentoring under Ron Rash, Deidre Elliott, and Pamela Duncan. He is the author of Growing Gills: A Fly Fisherman’s Journey, which was a finalist for the Reed Environmental Writing Award and the Ragan Old North State Award for Creative Nonfiction. His stories and creative non-fiction have appeared in Drafthorse Literary Journal, Smoky Mountain Living, Wilderness House Literary Review, Bird Watcher's Digest, Pisgah Review, and Flycatcher.", "name": "David Joy, with Chigozie Obioma & Robert James Russell", "source": "Facebook", "date": "2016-02-11T19:00:00-05:00", "url": "https://www.facebook.com/events/1680859748860889/"}, {"description": "Thursday, Feb 11 | 9pm | 18+ | $10 Cover\n\nBroccoli Samurai is Cleveland, OH’s premiere jamtronica and EDM project. Broccoli Samurai features Ryan “Bruce” Hodson on keys and synth, Chris Walker on drums and percussion, and Josh Sebo on bass. Broccoli Samurai’s drum and bass influenced, progressive electronica has been thrilling audiences throughout the Midwest, winning the band spots at major events such as Rootwire, The Werk Out, Hyperion Fest, Summerdance, and The Mad Tea Party Jam, as well as direct support, club spots for such notable bands as Boombox, Lotus, Dopapod, Papadosio, Rusted Root, Big Gigantic, Conspirator, O.A.R., and Ozric Tentacles. Broccoli Samurai’s groove is the kind that keeps the crowd moving well into the wee hours of the morning. This band is making big moves and the time to take notice is now. \n\nWith: Liquid Monk\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/570", "name": "Broccoli Samurai w/ Liquid Monk 2/11/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-02-11T21:00:00-05:00", "url": "https://www.facebook.com/events/1655909208022221/"}, {"description": "Are you ready for some Football? What about snacks? \n\nDon't worry, we have got your back with our Super Bowl Sunday menu. Featuring hearty prefixed packages to feed the whole team or ala cart options to take to any gathering. \n\nCall in your order to (734) 997-8495. \n\nYou can pick up your order Sunday, February 7, at our location downtown. We are accepting orders until 3 PM Saturday, February 6th. \n\nCheck out our Grid Iron giveaway on Instagram, @babo_ann_arbor \n\nPrefixed Packages\n\nThe Kicker ($50)\n24ct Wings with Buffalo and Ranch, 30ct Turkey Meatballs with Sriracha\n\nSpring Training ($30)\nTortilla Chips with Guacamole and Salsa, Vegetable Platter\n\nThe Quarterback ($55)\nPulled Pork, Mac N Cheese\n\nThe Defensive Line ($95)\n24ct Wings, Vegetable Platter, Mac N Cheese, Pulled Pork\n\nThe Pigskin ($55)\nPotato Skins, Pulled Pork\n\nAla Carte Options\n\n12ct Potato skins, Bacon with gouda or white cheddar broccoli ($20)\n\n24ct Jumbo Wings, Classic Buffalo or Honey Pineapple BBQ ($26)\n\nHalf Pan 4 Cheese Macaroni ($30)\n\nHalf Pan Pulled Pork in Honey Pineapple BBQ sauce, with 6 brioche buns ($30)\n\nHalf Pan Sweet Potato Fries with Sweety Sauce ($14)\n\n30ct Turkey Meatballs, Teriyaki Glaze or Sriracha Sauce ($26)\n\nHousemade Tortilla Chips Platter with Guacamole and Salsa ($16)\n\nTempeh Nachos with 3 Cheese Blend, Lettuce, Onion, Jalapeno, Sour Cream and Salsa ($20)\n\nVegetable Platter with Ranch or Tzatziki Sauce ($16)", "name": "Super Bowl Catering Menu", "source": "Facebook", "date": "2016-02-12T16:00:00-05:00", "url": "https://www.facebook.com/events/576187139206687/"}, {"description": "Valentine's Day falls on a Sunday this year -- kinda lame, yes, but that means you've got a whole weekend to celebrate loving someone special: your partner, your dog, yourself! Whatever and whomever you're celebrating, we hope you make your way to Wolverine State for some great beer, great food, and great company. \n\nAs usual, Revilo, our India Red Lager, will be February's Beer of the Month, and you can get your hands on that for a special price all Valentine's Day weekend! 15-oz pours are only $3, so buy one for your sweetie. \n\nAnd don't even get us started on food specials. Ever had a hot date with a chicken? Well, you're about to. \"Hot Date with a Chicken\" is on the menu -- an entree for two! Dates, apricots, and cayenne combine as the filling for tender smoked chicken breast. \n\nFor dessert, we'll have a plate to split with your honey (or to keep to yourself -- please, we're the last people to judge). Chocolate-covered strawberries will be served alongside special cookies from the People's Food Co-op! You already love their sea salt chocolate chip cookies that we sell in the Tap Room -- just wait until you try these goodies! \n\nWe're also bringing in a local acoustic artist to play some tunes on Saturday evening! We'll keep you posted with more information as the weekend draws nearer. \n\nWe hope you'll share the love with us on Valentine's Day weekend! With Revilo on special, delicious chicken, and fabulous chocolate on the menu, how can you not?!", "name": "Valentine's Day Weekend at Wolverine State", "source": "Facebook", "date": "2016-02-13T12:00:00-05:00", "url": "https://www.facebook.com/events/446121065583340/"}, {"description": "Literati is thrilled to welcome poet Amber Tamblyn, reading from her 2015 collection Dark Sparkler.\n\nA unique, poetic, and harrowing exploration of life, death, celebrity, and immortality, from actress and acclaimed poet Amber Tamblyn, Dark Sparkler is “a smartly crafted collection, proving that she is a savvy and fierce woman and poet who knows that behind every spotlight is shadow.” (Booklist) A lifelong performer from a Hollywood family, actress Amber Tamblyn (Sisterhood of the Traveling Pants, Two and a Half Men) is also an established poet who has studied with Lawrence Ferlinghetti, Jack Hirschman, and others. As a working actress, she is also deeply fascinated—and intimately familiar—with the costs of fame and the demands placed on young women in movies and on television. An initially casual interest in the lives and disappointments of actresses before her time—tragic stories of suicide, murder, obscurity, and other forms of death—inspired this insightful and emotionally charged collection of poetic portraits of the lives and troubling ends of more than thirty actresses famous and obscure. Featuring subjects like Brittany Murphy, Marilyn Monroe, and Jane Mansfield—and paired with original artwork, commissioned for this book, by luminaries including David Lynch, Adrian Tomine, Marilyn Manson, and Marcel Dzama—Dark Sparkler is a surprising and thought-provoking collection from a searching and multi-talented young artist.\n\n“With a drummer’s approach to wording and a coroner’s attention to bodily detail, Amber Tamblyn’s tragicomic dead girl poems are a thoughtful, ghoulish kick.” —Sarah Vowell\n\n“Ms. Tamblyn has a gift for words.” —Quentin Tarantino\n\n“Amber Tamblyn’s Dark Sparkler is an elegy, a eulogy, a rhapsody, a rage. In these astonishing poems inspired by dead actresses, Tamblyn fiercely examines the spectacle of the actress as she lives and dies and how our hands and hearts linger on their lives.” —Roxane Gay, author of New York Times bestseller Bad Feminist\n\nAmber Tamblyn is an author, actress and director who has been nominated for an Emmy, Golden Globe and Independent Spirit Award for her work in television and film. She has three collections of poetry and prose, most recently \"Dark Sparkler\" (Harper Perennial) which explores the lives and deaths of child star actresses, with accompanying artwork by such luminaries as Marilyn Manson and David Lynch, amongst others. She reviews books of poetry written by women for Bust Magazine and is a contributing writer for The Poetry Foundation and visiting Woodrow Wilson Fellow. She lives in Brooklyn.\n\nEvent seating will open at 6:30, and will be limited. We suggest arriving early. \n\nPHOTO CRED: Katie Jacobs", "name": "Amber Tamblyn", "source": "Facebook", "date": "2016-02-13T19:00:00-05:00", "url": "https://www.facebook.com/events/800424580061613/"}, {"description": "Saturday, February 13, 2016, 8:00 pm\nPower Center\n\n“Every aspect of the dance-making here is thoroughly accomplished.” (New York Times) A prolific choreographer who danced with Ronald K. Brown’s Evidence, Rennie Harris’s Puremovement, and the Alvin Ailey American Dance Theater, Camille A. Brown brings her newest work to Ann Arbor for her UMS debut. Black Girl — Linguistic Play speaks to the complexities of carving out a positive identity as a Black female in urban American culture.\n\nIn a world where Black women are often portrayed only in terms of their strength, resiliency, or trauma, this work interrogates these narratives by presenting a fuller spectrum of the black female and the complexities of negotiating in this racially and politically charged world. The work uses elements of African-American social dancing, rhythmic play, and musical compositions to better illustrate who “Black Girl” knows herself to be. Brown’s choreography is “fun, inventive, and watchable.” (Times Square Chronicles) \n\nMore info: http://ums.org/performance/camille-a-brown-dancers/", "name": "Camille A. Brown & Dancers: Black Girl — Linguistic Play", "source": "Facebook", "date": "2016-02-13T20:00:00-05:00", "url": "https://www.facebook.com/events/368546533344933/"}, {"description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XIV", "source": "Facebook", "date": "2016-02-13T20:00:00-05:00", "url": "https://www.facebook.com/events/1673489232898555/"}, {"description": "Valentine's Day falls on a Sunday this year -- kinda lame, yes, but that means you've got a whole weekend to celebrate loving someone special: your partner, your dog, yourself! Whatever and whomever you're celebrating, we hope you make your way to Wolverine State for some great beer, great food, and great company. \n\nAs usual, Revilo, our India Red Lager, will be February's Beer of the Month, and you can get your hands on that for a special price all Valentine's Day weekend! 15-oz pours are only $3, so buy one for your sweetie. \n\nAnd don't even get us started on food specials. Ever had a hot date with a chicken? Well, you're about to. \"Hot Date with a Chicken\" is on the menu -- an entree for two! Dates, apricots, and cayenne combine as the filling for tender smoked chicken breast. \n\nFor dessert, we'll have a plate to split with your honey (or to keep to yourself -- please, we're the last people to judge). Chocolate-covered strawberries will be served alongside special cookies from the People's Food Co-op! You already love their sea salt chocolate chip cookies that we sell in the Tap Room -- just wait until you try these goodies! \n\nWe're also bringing in a local acoustic artist to play some tunes on Saturday evening! We'll keep you posted with more information as the weekend draws nearer. \n\nWe hope you'll share the love with us on Valentine's Day weekend! With Revilo on special, delicious chicken, and fabulous chocolate on the menu, how can you not?!", "name": "Valentine's Day Weekend at Wolverine State", "source": "Facebook", "date": "2016-02-14T12:00:00-05:00", "url": "https://www.facebook.com/events/446121065583340/"}, {"description": "Perfectly prepared for two.\n\nAventura will be offering a special 5-course tasting menu with a Cava toast, $50 per person (Tax and Gratuity Included), or wine pairings, $75 per person (Tax and Gratuity Included), February 14, for you and your sweetie. \n\nWine and dine your partner with great food, wine pairings, and decadent desserts. \n\nMake Love Bloom this Valentine's Day!  Call 734-369-3153 to make your reservation today.", "name": "Make Love Bloom", "source": "Facebook", "date": "2016-02-14T17:00:00-05:00", "url": "https://www.facebook.com/events/1676316662616175/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-02-15T19:00:00-05:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "name": "Story Time with Ieva", "source": "Facebook", "date": "2016-02-16T10:00:00-05:00", "url": "https://www.facebook.com/events/1686749728236981/"}, {"description": "February 16, 18\nRackham Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "name": "Sir András Schiff, piano", "source": "Facebook", "date": "2016-02-16T19:30:00-05:00", "url": "https://www.facebook.com/events/442008155980033/"}, {"description": "Wed. February 17 | 8pm | 18+ | $10 adv./ $13 day of\n\nIt Lies Within with Echo Of Silence, The Few, Abandon The Abyss and Stella Polaris\n\n*NEW Album PARAMOUNT Out Now*\nPrevailing from one of the highest murder city rates per capita in America; Flint, MI based metalcore act It Lies Within exploded on the scene with their highly energetic live performance and positive based message.\n\nAfter having quick success with their debut album \"Chrysalis\" produced by Josh Wickman (Within the Ruins, Oceans Ate Alaska), it was obvious to take this show to the road. Touring non-stop since 2011, ILW has built a die hard and loyal fanbase. Currently finishing up their 2015 release with producers Jonny Mcbee of The Browning and Nick Morris of As They Sleep, the group will have some big announcements to follow.\n\nThis highly motivated five piece is on a non-stop path to shed a different light on the metal scene with their creative music writing, positive message and insane live show. Because of this diversity they are one of the most entertaining groups to watch!", "name": "It Lies Within with Echo of Silence The Few Abandon The Abyss and Stella Polaris 2/17/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-02-17T20:00:00-05:00", "url": "https://www.facebook.com/events/1664936667112740/"}, {"description": "Are you ready for some Football? What about snacks? \n\nDon't worry, we have got your back with our Super Bowl Sunday menu. Featuring hearty prefixed packages to feed the whole team or ala cart options to take to any gathering. \n\nCall in your order to (734) 997-8495. \n\nYou can pick up your order Sunday, February 7, at our location downtown. We are accepting orders until 3 PM Saturday, February 6th. \n\nCheck out our Grid Iron giveaway on Instagram, @babo_ann_arbor \n\nPrefixed Packages\n\nThe Kicker ($50)\n24ct Wings with Buffalo and Ranch, 30ct Turkey Meatballs with Sriracha\n\nSpring Training ($30)\nTortilla Chips with Guacamole and Salsa, Vegetable Platter\n\nThe Quarterback ($55)\nPulled Pork, Mac N Cheese\n\nThe Defensive Line ($95)\n24ct Wings, Vegetable Platter, Mac N Cheese, Pulled Pork\n\nThe Pigskin ($55)\nPotato Skins, Pulled Pork\n\nAla Carte Options\n\n12ct Potato skins, Bacon with gouda or white cheddar broccoli ($20)\n\n24ct Jumbo Wings, Classic Buffalo or Honey Pineapple BBQ ($26)\n\nHalf Pan 4 Cheese Macaroni ($30)\n\nHalf Pan Pulled Pork in Honey Pineapple BBQ sauce, with 6 brioche buns ($30)\n\nHalf Pan Sweet Potato Fries with Sweety Sauce ($14)\n\n30ct Turkey Meatballs, Teriyaki Glaze or Sriracha Sauce ($26)\n\nHousemade Tortilla Chips Platter with Guacamole and Salsa ($16)\n\nTempeh Nachos with 3 Cheese Blend, Lettuce, Onion, Jalapeno, Sour Cream and Salsa ($20)\n\nVegetable Platter with Ranch or Tzatziki Sauce ($16)", "name": "Super Bowl Catering Menu", "source": "Facebook", "date": "2016-02-18T16:00:00-05:00", "url": "https://www.facebook.com/events/576187139206687/"}, {"description": "Join curators John DeHoog and Ray Wetzel, with some of the artists of Zoku, to learn about their curatorial process and artworks from the exhibition. Free and open to the public.", "name": "Artist Talk - MW Furniture ZOKU", "source": "Facebook", "date": "2016-02-18T18:00:00-05:00", "url": "https://www.facebook.com/events/553555484819957/"}, {"description": "Don't miss Artini 2016*, which in its 8th edition will once again transform the Downtown Ann Arbor area into a festive competition between the finest bars and restaurants, where the goal is to design the city's most artful martini!\n\nArtini will be on Friday, February 19, from 7:00 to 10:00 pm. Tickets will be for sale on Monday, January 4th for members of the Ann Arbor Art Center and on Wednesday, January 6th for all! As usual tickets will be sold fast, so please make sure you purchase yours as soon as possible.\n\nWHAT IS ARTINI?\n\nArtini is an annual fundraiser hosted by the Ann Arbor Art Center in which local bars and restaurants are invited to compete to create the most artful and innovative martini cocktail. Guests purchase tickets to participate in a fun bar crawl amongst the participating venues and spend the evening walking in Downtown Ann Arbor for the search of the best tasting martini.\n\nPARTICIPATING ARTINI 2016 VENUES INCLUDE:\n\n- Aventura Ann Arbor\n- Babs' Underground Lounge\n- Mélange\n- The Ravens Club\n- Vinology Wine Bar and Restaurant\n- Felix Bistro & Bar\n- Conor O'Neills Ann Arbor\n... and more to come! \n\nThe 2016 winner will be selected by a jury of individuals unaffiliated with our participating venues. These judges include Andy Mohr (Two James, sponsor), Alex Milshteyn (Real Estate Associates, sponsor), Yen Azzaro (of studio Chin-Azzaro), Horace Bomar (long-time Art Center supporter), Jessica Webster (MLive, food critic), and Jorge Avellan (WEMU, reporter).\n\n*Attendees must be 21 or older. Ticket prices are $55.\n\n--------------\n\nArtini 2016 is sponsored by Alex Milshteyn Real Estate Associates\nBeverage sponsor Two James Spirits", "name": "Artini 2016", "source": "Facebook", "date": "2016-02-19T19:00:00-05:00", "url": "https://www.facebook.com/events/1579264365729837/"}, {"description": "Friday, February 19, 2016, 8:00 pm\nMichigan Theater\n\nA decade after it was first brought to the screen, Benoît Charest revives the music of the Oscar-nominated film The Triplets of Belleville with a remarkable cast of musicians in this silent movie-live concert event. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His near-sighted grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas.\n\nBut the true star of the animated film is the hot jazz score written by Canadian composer Benoît Charest. This screening of the beloved French film transports audiences to the exciting streets of 1920s Paris and Le Jazz Hot.\n\nMore info: http://ums.org/performance/the-triplets-of-belleville/", "name": "The Triplets of Belleville Cine-Concert", "source": "Facebook", "date": "2016-02-19T20:00:00-05:00", "url": "https://www.facebook.com/events/1620380161539059/"}, {"description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XIV", "source": "Facebook", "date": "2016-02-19T20:00:00-05:00", "url": "https://www.facebook.com/events/1673489232898555/"}, {"description": "Fri. February 19 | 9pm | 18+ | $12 adv./ $14 Day of\n\nMustard Plug with The Vulnerable [https://www.facebook.com/thevulnerable ] &  1592\n\nMustard Plug started out in the punk clubs, basements and dive bars of the Midwest, playing punk-influenced ska music before most people in the U.S. had ever heard of ska. They clung to a DIY work ethic that had been ingrained in them growing up in the 1980′s hardcore punk scene and applied it to everything they would ever do together as a band. Mustard Plug released their first cassette tape themselves (1992′s Skapocalypse Now!), and played constantly to earn enough money to record their first album – 1994′s Big Daddy Mulititude. Their debut full length was released on legendary NYC label Moon Records (home of Toasters, Hepcat, Dance Hall Crashers, and pretty much every other 90′s ska band of note). With their new found national distribution and exposure, the band climbed into their van and performed their music to new fans across North America. Twenty-one years, 1500 shows and 200,000 album sales later, it cannot be denied that the band has surpassed all expectations and permanently staked their claim in contemporary music.\n\nFor their new album, “Can’t Contain It”, Mustard Plug have returned to the DIY blueprint that the band was built upon, while at the same time embracing all the school of hard knocks craftsmanship and wisdom that the band has earned along the way. The band spent the last several years writing new material that was informed by 22 years of songwriting experience while retaining the youthful energy that has endeared them to their fans. They tracked the record at bassist Rick Johnson’s Cold War Studios, giving them the flexibility to experiment and add new layers and dimensions that were not possible given the time constraints on their previous recordings. Many of their musician friends(Dan Potthast, Sean Bonnett, Mark Petz, Corey Ruffin) were tapped to contribute, creating a denser, more intricate sound.\n\nOnce the recording process for Can’t Contain It was complete, the band turned to their fans to help finance the mixing and production of their record. Their Kickstarter campaign surpassed all their expectations, doubling their initial goal and re-confirming the support and love of their audience. The tracks were then sent to be mixed at Bill Stevenson’s Blasting Room Studios where Mustard Plug had recorded 3 of their previous albums (including 1997’s breakthrough “Evildoers Beware” and 2007’s “In Black and White”). The result is possibly their most diverse and best record to date.\n\nAfter tapping their friends and fans to help out with the recording, the band turned to more of their posse to collaborate on the artwork. Underground icon Jeff Rosenstock designed the album packaging, while noted artists Craig Horkey and Larry Kole created alternative limited edition album covers and posters. The final piece came together when at the last minute, No Idea record founder, Var Thelin heard the record and offered to partner with the band on its release. Mustard Plug is excited to be given the opportunity to collaborate with a label known for its’ strong punk rock ethics and underground credibility.\n\nUltimately, this release is about the community Mustard Plug has built during its’ 22 year existence. Coming full circle back to the DIY scene and the community that the were born out of has helped them to put out their best record to date.", "name": "Mustard Plug, The Vulnerable & 1592 2/19/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-02-19T21:00:00-05:00", "url": "https://www.facebook.com/events/510894402424469/"}, {"description": "Tell your friends! Tell your family! Tell your dog! (But don't bring your dog!) It's the Second Annual Wolverine State Ski & Snowboard trip! \n\nThe rundown: Meet at the brewery (2019 W. Stadium, Ann Arbor, MI) at 7:30 am on Saturday, February 20th for bagels and to grab the 2016 edition of the Ski & Snowboard Club shirt! Bus departs from the brewery at 8 am and arrives at Alpine Valley around 9 am. You'll receive your lift ticket as you exit the bus, and if you're renting equipment, you'll also receive a rental slip (separate payment for equipment rental is required, but you get a group discount for coming with the brewery!) Meet back at the bus between 5 and 5:30, bus departs after final head count at 5:45 pm. \n\nTrip cost: $65 (includes bagels at the brewery, transportation to and from Alpine Valley, an all-day 9am - 5:30 pm lift ticket, a commemorative t-shirt, and beer on the bus to and from Alpine Valley. There will be room on the bus to store your equipment! \n\nEquipment rental: $21 for skis or snowboard. \n\nPlease use the eventbrite link to register! Remember to select your t-shirt size and indicate whether or not you will require rentals! You will have the option to pay for rentals on the eventbrite page. \n\nSeating is limited to 50 participants, so get on it!", "name": "Wolverine State Ski & Snowboard Trip", "source": "Facebook", "date": "2016-02-20T07:30:00-05:00", "url": "https://www.facebook.com/events/189689224712860/"}, {"description": "February 20\nHill Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "name": "Sir András Schiff, piano", "source": "Facebook", "date": "2016-02-20T20:00:00-05:00", "url": "https://www.facebook.com/events/1611931089050428/"}, {"description": "Sat. February 20 | 9:30pm | 18+ | $10 Cover\n\nTunde Olaniran with:  Bevlove / Pocket Candies / VNESSWOLFCHILD \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/624", "name": "Tunde Olaniran w/ Bevlove,  Pocket Candies & VNESSWOLFCHILD 2/20/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-02-20T21:30:00-05:00", "url": "https://www.facebook.com/events/562101443944037/"}, {"description": "After Groundhog announces six more weeks of winter, half his animal friends are disappointed, while the other half are excited. Each animal asks Groundhog to make his prediction in their favor the following year. Rather than being truthful about the fact that he just “calls it like he sees it,” he leads them to believe he can control the weather, accepting their gifts of food and favor. On the next Groundhog Day, he finally admits he made promises he couldn’t keep because he was trying to please everyone and makes amends.\n\nKristen Remenar is a children's librarian, writer, teacher, and national speaker on literacy. She is married to author/illustrator Matt Faulkner. This is her first picture book.\n\nA graduate of Rhode Island School of Design, Matt Faulkner has written and illustrated a number of children's books. His work has won wide praise for its humor, exuberance and sensitivity. In addition, he is a contributing illustrator to such national periodicals as The New York Times, The Wall Street Journal and Forbes. Matt is married to author and children's librarian, Kristen Remenar. They live with their 3 kids and 3 cats on the lower right corner of the Michigan mitten. He teaches illustration at the Art Academy University in San Francisco", "name": "Meet Author Kristen Remenar & Illustrator Matt Faulkner for a Discussion & Signing of Their New Picture Book, 'Groundhog's Dilemma'", "source": "Facebook", "date": "2016-02-21T15:00:00-05:00", "url": "https://www.facebook.com/events/1285645741460846/"}, {"description": "Auditons for A2CT's production of Neil Simon's classic romantic comedy, Barefoot in the Park, directed by Wendy Wright, are scheduled for Sunday, February 21 and Monday, February 22 at 7:00 in the A2CT Studio. Callbacks will take place Wednesday, February 24. There are roles for 2-3 women and 3-4 men.  Character descriptions and further audition details are available at: www.a2ct.org/audition", "name": "AUDITIONS: Barefoot in the Park", "source": "Facebook", "date": "2016-02-21T19:00:00-05:00", "url": "https://www.facebook.com/events/954841887943781/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-02-22T19:00:00-05:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "name": "Story Time with Ieva", "source": "Facebook", "date": "2016-02-23T10:00:00-05:00", "url": "https://www.facebook.com/events/1521814471451960/"}, {"description": "Discussion of this Year's Reads Book - \"The Book of Unknown Americans\"  Cristina Henriquez will be signing at the end of her presentation.  Books will be sold the night of the event by Nicola's Books.\n\nWriter Cristina Henriquez will discuss her work at a special appearance for the Ann Arbor / Ypsilanti Reads 2016. The public program will occur from 7:00 to 9:00 pm. Doors will open at 6 pm to offer the opportunity to connect with community agencies and representatives who will be staffing information tables in the lobby. Copies of \"The Book of Unknown Americans\" will be for sale and the event will include a book signing.\n\nTowsley Auditorium\nMorris Lawrence Building, Washtenaw Community College\n4800 E. Huron River Drive\nAnn Arbor, MI 48105\n\nAuthor: \n\nCristina Henríquez is also the author of the story collection Come Together, Fall Apart, which was a New York Times Editors’ Choice selection, and the novel The World in Half. Her work has appeared in The New Yorker, The Atlantic, The American Scholar, Glimmer Train, Virginia Quarterly Review, Ploughshares, TriQuarterly, AGNI, and Oxford American, as well as in various anthologies.\n\nBook: \n\nThe Book Of Unknown Americans centers on fifteen-year-old Maribel Rivera, who sustains a terrible injury. Her family leaves behind a comfortable life in Mexico and risks everything to come to the United States so that Maribel can have the care she needs. Once they arrive, it’s not long before Maribel attracts the attention of Mayor Toro, the son of one of their new neighbors, who sees a kindred spirit in this beautiful, damaged outsider. Their love story sets in motion events that will have profound repercussions for everyone involved.\n\nHenríquez seamlessly interweaves the story of these star-crossed lovers, and of the Rivera and Toro families, with the testimonials of men and women who have come to the United States from all over Latin America.", "name": "Ann Arbor/Ypsilanti Reads - Meet Author Cristina Henriquez for a Discussion & Signing", "source": "Facebook", "date": "2016-02-23T19:00:00-05:00", "url": "https://www.facebook.com/events/526138584222040/"}, {"description": "Our February Artists' Meet & Greet topic is Tax Tips for Artists. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "name": "Tax Tips for Artists", "source": "Facebook", "date": "2016-02-24T18:00:00-05:00", "url": "https://www.facebook.com/events/1548888185425127/"}, {"description": "Wed. February 24 | 18+ | 9pm | $15 / $65 VIP Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\nWSG: Dan Henig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/567", "name": "Aaron Carter 2/24/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-02-24T21:00:00-05:00", "url": "https://www.facebook.com/events/1725536331010947/"}, {"description": "Are you ready for some Football? What about snacks? \n\nDon't worry, we have got your back with our Super Bowl Sunday menu. Featuring hearty prefixed packages to feed the whole team or ala cart options to take to any gathering. \n\nCall in your order to (734) 997-8495. \n\nYou can pick up your order Sunday, February 7, at our location downtown. We are accepting orders until 3 PM Saturday, February 6th. \n\nCheck out our Grid Iron giveaway on Instagram, @babo_ann_arbor \n\nPrefixed Packages\n\nThe Kicker ($50)\n24ct Wings with Buffalo and Ranch, 30ct Turkey Meatballs with Sriracha\n\nSpring Training ($30)\nTortilla Chips with Guacamole and Salsa, Vegetable Platter\n\nThe Quarterback ($55)\nPulled Pork, Mac N Cheese\n\nThe Defensive Line ($95)\n24ct Wings, Vegetable Platter, Mac N Cheese, Pulled Pork\n\nThe Pigskin ($55)\nPotato Skins, Pulled Pork\n\nAla Carte Options\n\n12ct Potato skins, Bacon with gouda or white cheddar broccoli ($20)\n\n24ct Jumbo Wings, Classic Buffalo or Honey Pineapple BBQ ($26)\n\nHalf Pan 4 Cheese Macaroni ($30)\n\nHalf Pan Pulled Pork in Honey Pineapple BBQ sauce, with 6 brioche buns ($30)\n\nHalf Pan Sweet Potato Fries with Sweety Sauce ($14)\n\n30ct Turkey Meatballs, Teriyaki Glaze or Sriracha Sauce ($26)\n\nHousemade Tortilla Chips Platter with Guacamole and Salsa ($16)\n\nTempeh Nachos with 3 Cheese Blend, Lettuce, Onion, Jalapeno, Sour Cream and Salsa ($20)\n\nVegetable Platter with Ranch or Tzatziki Sauce ($16)", "name": "Super Bowl Catering Menu", "source": "Facebook", "date": "2016-02-25T16:00:00-05:00", "url": "https://www.facebook.com/events/576187139206687/"}, {"description": "Nashville-based, independent artist, Ron Pope, has stood at a crossroads where so many musicians find themselves — at the intersection of record label and independence. In an ever-evolving industry filled with rejection and compromise, he has plotted a new course for his music to reach loyal listeners, taking the industry-road-less-traveled in exchange for the ultimate payback, a league of devoted fans the world over. WSG: Tuett - http://www.truettofficial.com/\n\nVIP tix available here: http://www.etix.com/ticket/p/4574033/ron-pope-vip-meet-greet-ann-arbor-blind-pig-the-blind-pig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/446", "name": "Ron Pope & The Nighthawks w/ Truett 2/25/15 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-02-25T21:00:00-05:00", "url": "https://www.facebook.com/events/1449897481978519/"}, {"description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XIV", "source": "Facebook", "date": "2016-02-26T20:00:00-05:00", "url": "https://www.facebook.com/events/1673489232898555/"}, {"description": "Second Show Added for Friday, February 26th!\n\nDoors 9pm | 18+ | $15 General Admission / $65 Admission + Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\n\n\nWSG: Dan Henig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/573", "name": "Aaron Carter w/ Dan Henig - Night Two 2/26/15 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-02-26T21:00:00-05:00", "url": "https://www.facebook.com/events/1615405452043601/"}, {"description": "The A2CT is once again hosting their Annual Chili Cookoff here at Wolverine State! For $20, enjoy 10 chili samples and three samples of Wolverine State brews! Or, if you just want chili, tickets are available for $10. This is the A2CT's biggest fundraiser of the year, so come out and help support this great organization! For tickets, please call 734-971-2228. Tickets will also be available at the door! \n\nSunday, February 28th\n2-5 pm", "name": "Ann Arbor Civic Theatre Annual Chili Cookoff", "source": "Facebook", "date": "2016-02-28T14:00:00-05:00", "url": "https://www.facebook.com/events/1526104744359441/"}, {"description": "Chili, Beer, a 50/50 Raffle and a Silent Auction! \nAnn Arbor Civic Theatre announces its Seventh Annual Chili Cook-Off/Beer Tasting on Sunday, February 28 from 2-5pm at The Wolverine State Brewing Company at 2019 West Stadium Blvd, A2, MI, 48103.  Tickets are $20 and include ten chili tastings and three beer samples. Chili-only tickets are $10, with $5 tickets for children ages 5-10.  Kids under 5 attend free of charge.  Tickets for the event are available in advance at the A2CT office (734) 971-2228, or at the door of the Chili Cook-off.  Additional information is available at www.a2ct.org.", "name": "A2CT's 7th Annual Chili Cook-Off!", "source": "Facebook", "date": "2016-02-28T14:00:00-05:00", "url": "https://www.facebook.com/events/1124616054245547/"}, {"description": "Vic Amato's sixteen tales in his Incoming: Collected Stories are literary explorations of the corridors of the human psyche, some familiar, some dark, all incorporating empathetic portraits of people, including married couples, young men on the cusp of adulthood, and even a sympathetic examination of the quirky among us.\n\nNearly every piece is set in the modern age; the one exception is \"Everyone Hates Malvolio,\" a sardonic takeoff on Twelfth Night.\n\nVic Amato holds a PhD in political science/public administration from Wayne State University, Detroit. He is a former journalist, mental health services administrator, and college instructor, and he served with the Third Infantry Division. He and his wife, Susan, live in Port Huron, Michigan.", "name": "Meet Michigan Author Vic Amato for a Discussion and Signing of His New Collection of Short Stories, 'Incoming: Collected Stories'", "source": "Facebook", "date": "2016-02-28T15:00:00-05:00", "url": "https://www.facebook.com/events/152137558488266/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-03-01T19:00:00-05:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "What's better than beer and pizza? How about AWESOME beer and pizza? Join us for a beer dinner at Cantoro Italian Market and Trattoria for five pizzas paired with five Wolverine State brews! Tickets are just $50 for this limited-seating event! Call 734-420-1100 for tickets and information.", "name": "Beer + Pizza Pairing with Cantoro Italian Market", "source": "Facebook", "date": "2016-03-02T19:00:00-05:00", "url": "https://www.facebook.com/events/1683111571970300/"}, {"description": "Are you ready for some Football? What about snacks? \n\nDon't worry, we have got your back with our Super Bowl Sunday menu. Featuring hearty prefixed packages to feed the whole team or ala cart options to take to any gathering. \n\nCall in your order to (734) 997-8495. \n\nYou can pick up your order Sunday, February 7, at our location downtown. We are accepting orders until 3 PM Saturday, February 6th. \n\nCheck out our Grid Iron giveaway on Instagram, @babo_ann_arbor \n\nPrefixed Packages\n\nThe Kicker ($50)\n24ct Wings with Buffalo and Ranch, 30ct Turkey Meatballs with Sriracha\n\nSpring Training ($30)\nTortilla Chips with Guacamole and Salsa, Vegetable Platter\n\nThe Quarterback ($55)\nPulled Pork, Mac N Cheese\n\nThe Defensive Line ($95)\n24ct Wings, Vegetable Platter, Mac N Cheese, Pulled Pork\n\nThe Pigskin ($55)\nPotato Skins, Pulled Pork\n\nAla Carte Options\n\n12ct Potato skins, Bacon with gouda or white cheddar broccoli ($20)\n\n24ct Jumbo Wings, Classic Buffalo or Honey Pineapple BBQ ($26)\n\nHalf Pan 4 Cheese Macaroni ($30)\n\nHalf Pan Pulled Pork in Honey Pineapple BBQ sauce, with 6 brioche buns ($30)\n\nHalf Pan Sweet Potato Fries with Sweety Sauce ($14)\n\n30ct Turkey Meatballs, Teriyaki Glaze or Sriracha Sauce ($26)\n\nHousemade Tortilla Chips Platter with Guacamole and Salsa ($16)\n\nTempeh Nachos with 3 Cheese Blend, Lettuce, Onion, Jalapeno, Sour Cream and Salsa ($20)\n\nVegetable Platter with Ranch or Tzatziki Sauce ($16)", "name": "Super Bowl Catering Menu", "source": "Facebook", "date": "2016-03-04T16:00:00-05:00", "url": "https://www.facebook.com/events/576187139206687/"}, {"description": "Yes, THE Michael Johnson, singer of the smash hit singles, \"Bluer Than Blue,\" \"This Night Won't Last Forever,\" \"That's That,\" and other landmark songs. Michael started playing at age 13; studied classical guitar in Barcelona; in 1968 joined the Chad Mitchell Trio with John Denver, touring for a year; and in 1969 toured for a year with the company of \"Jacques Brel Is Alive And Well And Living In Paris.\" In addition to his pop radio hits of the 1970's and '80's, he racked up top singles on the country charts with \"Give Me Wings\" and \"The Moon Is Still Over Her Shoulder.\" Michael's recent recordings feature duet partners Nanci Griffith and Alison Krauss. His music shows a diversity, depth and heart that only come from years of dedication to a labor of love. His amazing guitar work, humor and showmanship will make for a very special evening. Bring a friend! Michael's latest CD is \"Moonlight Deja Vu.\"\nhttp://www.mjblue.com/", "name": "Michael Johnson at Green Wood Coffee House", "source": "Facebook", "date": "2016-03-04T20:00:00-05:00", "url": "https://www.facebook.com/events/788876821235695/"}, {"description": "Saturday, March 5, 2016, 8:00 pm\nHill Auditorium\n\nPaddy Malone and The Chieftains celebrated 50 years of performing in 2012, and their music remains as fresh and relevant as when they first began. Recognized for reinventing traditional Irish music on a contemporary and international scale, their ability to blend tradition with modern music has made them one of the most renowned and revered musical groups to this day. Back for their fifth UMS performance and their first in nearly a decade, “they seem ageless, and so does their Irish music. If common sense tells you they can’t go on forever, you wouldn’t know it from their electrifying performance.” (Boston Globe)\n\nMore info: http://ums.org/performance/the-chieftains/", "name": "The Chieftains", "source": "Facebook", "date": "2016-03-05T20:00:00-05:00", "url": "https://www.facebook.com/events/1598997080377800/"}, {"description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XIV", "source": "Facebook", "date": "2016-03-05T20:00:00-05:00", "url": "https://www.facebook.com/events/1673489232898555/"}, {"description": "Sat. March 5 | 9pm | $15 Cover | 18+\n\nElectric Six -  Mortality. It’s the primary reason we don’t live forever. If not for our mortality, the number of years each of us would have to roam this earth would be as infinite as the sands of time running through the earth itself. When extraterrestrials eventually make first contact with us within the next twenty years, the first glaringly obvious thing they will notice…is that we die. They will come to our planet with sinister intentions and they will immediately have the upper hand because we die…and they don’t. It’s a simple as that. And it’s all because of our mortality.\n\nWhile aliens (and the government!!!!!) will always be there to kill us, we have for generations used our cold dead hands to clutch onto whatever silver lining we could sew into the dark cloud of our everlasting mortality. Specifically, we tell ourselves that we can live forever, not in corporeal form, but through our creations of art…and our expressions of love.\n\nThusly, art and love are more important than ever, because they are now the conduits that preserve our life forces. If you don’t create art and you don’t love nobody…well then, you will be forgotten, rather quickly. No one wants to be forgotten rather quickly. No one more so…than Electric Six.\n\nElectric Six understands all this stuff as it prepares to unveil its eleventh studio album Bitch, Don’t Let Me Die!, which will be released on October 6 on Metropolis Records. The album is steeped in themes of mortality, death, discorporation and discoloration…all while it tries to convince you it is actually a work of art, a labour of love.\n\nFrom the pounding, driving opener, “Drone Strikes”, through the 1970s guitar anthem “Two Dollar Two”, Bitch, Don’t Let Me Die! reveals that Electric Six knows that it is going to die, but will not go out quietly. From there, the album moves through the pop goodness of “Kids Are Evil” and “A Variation of Elaine”, the prog-rock showmanship of “Slow Motion Man”, and even a tribute to Elvis Presley in his more rotund years with “Dime Dime Penny Dime”.\n\n“Big Red Arthur” is the anchor track of the album, as it emits a rock-opera bombast that is reminiscent of Radiohead sodomizing David Bowie in the center of his mind. It, like most of the songs on this record, is about death…but it’s kind of funny because it’s only about the death of a fake, out-of-shape drunk Santa Claus who is too fucking stupid to make it down the chimney correctly. In this case, we just end up laughing at death. And that’s uplifting.\n\nTo summarize, mortality is everywhere, and this fall, thanks to their new record Bitch, Don’t Let Me Die!, Electric Six will be everywhere too. Everybody gonna die someday, but with Electric Six’s new album, you no longer have to worry about any of it. Bitch, Don’t Let Me Die is Electric Six’s brand new record for 2015 and it is available on Metropolis Records on Oct. 2. You can come see Electric Six play in your town on the I Wanna Lick The Screen tour, starting in their home state of Michigan on Sept. 25.\n\nWSG: Parlour Tricks", "name": "Electric Six w/ Parlour Tricks 3/5/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-03-05T21:00:00-05:00", "url": "https://www.facebook.com/events/998925893483957/"}, {"description": "One day at a time, discover colorful Motor City moments in history spanning more than three centuries. On November 5, 1851, Voice of the Fugitive published a letter in support of escaped slaves. On July 3, 1904, Monk Parry became the first monkey to drive a car, and on January 16, 1919, the Statler Hotel menu offered whale meat for dinner. The legendary Steve Yzerman was named captain of the Red Wings on October 7, 1986. Local historian Bill Loomis covers the big events and remarkable stories of life and culture from Detroit’s founding to its recent struggles and rebirth.\n\nBill Loomis is the author of Detroit’s Delectable Past (2012), Detroit Food (2014) and numerous articles on culinary and social history. His writing has been published in the Detroit News, Michigan History Magazine, New York Times, Hour Detroit and more. Mr. Loomis was born in Detroit and lived for a number of years in the North Rosedale Park neighborhood in the city. Mr. Loomis now lives in Ann Arbor with his wife and children.", "name": "Meet Ann Arbor Author Bill Loomis for a Discussion & Signing of His New Book, 'On This Day in Detroit History'", "source": "Facebook", "date": "2016-03-06T15:00:00-05:00", "url": "https://www.facebook.com/events/1520482404946720/"}, {"description": "In 1944 Italian officer Captain Francesco Verdi is captured by Allied forces in North Africa and shipped to a POW camp in Michigan s Upper Peninsula, where the senior POW, the ruthless Kommandant Vogel, demands that all prisoners adhere to his Nazi dictates. His life threatened, Verdi escapes from the camp and meets up with an American woman, Chiara Frangiapani, who helps him elude capture as they flee to the Lower Peninsula. By 1956 they have become Frank and Claire Green, a young married couple building a new life in postwar Detroit. When INS agent James Giannopoulos tracks them down, Frank learns that Vogel is executing men like Frank for their wartime transgressions. As a series of brutal murders rivets Detroit, Frank is caught between American justice and Nazi vengeance. In \"Wolf s Mouth, \" the recollections of Francesco Verdi/Frank Green give voice to the hopes, fears, and hard choices of a survivor as he strives to escape the ghosts of history.\"\n\nJohn Smolens has published nine works of fiction, including Cold, Quarantine, and The Schoolmaster’s Daughter. He lives in Marquette, Michigan.", "name": "Meet Michigan Author John Smolens for a Discussion & Signing of His New Novel, 'Wolf's Mouth'", "source": "Facebook", "date": "2016-03-08T19:00:00-05:00", "url": "https://www.facebook.com/events/961213527303219/"}, {"description": "Tue. March 8 | 9pm | 18+ | $10 adv./ $12 day of\n\nNorthern California rapper, MC Lars, is set to release his 4th full-length studio album, the Zombie Dinosaur LP, at the end of this coming summer. He has returned home to the Bay Area after living in Los Angeles these past three years, and is self-producing his new album with help from friends in Berkeley and San Francisco. The Zombie Dinosaur LP revisits the satirical, funny, uptempo style of Lars’ 2004 debut album, the Laptop EP. It features guest appearances by Watsky, Kool Keith, and Less than Jake’s Roger Lima. Zombie Dinosaur tackles such topics as postfeminism, in a nod to Game of Thrones (“Dragon Blood”); disappointing reunion bands with very few of their original members (“Sublime with Rome is Not the Same thing as Sublime”); hipster parenting (“Hipster Mom”); and the current state of EDM (“Signing Dubstep”). The project was funded entirely by Lars’s third highly successful Kickstarter campaign, through which he raised over $42k to create and release Zombie Dinosaur under his own label, Horris Records. In the ten years that have followed his debut release, the Laptop EP, Lars has independently produced and released three other solo full-length albums, four EPs, and a number of mixtapes. He has collaborated with KRS-One, mentored and helped develop the career of fellow Stanford alum K.Flay (with whom he collaborated on the 2009 Single and Famous EP), opened for Nas and Snoop Dogg, and played multiple summers on the Vans Warped Tour. He has also headlined club shows across the US and in Canada, Japan, Australia, New Zealand, and Europe. Lars has spoken and presented at two different TEDx conferences, performed at Carnegie Hall with a live string section (at Scholastic’s 2012 Art and Writing Awards – where he debuted the video for his song, “Flow Like Poe,” which is the lead single on his 2012 Edgar Allan Poe EP). Lars has developed and grown Horris Records in this past decade, signing the label’s first artist, Weerd Science (the solo hip-hop project of Cohered & Cambria’s drummer, Josh Eppard). Lars has continued to produce music videos for himself and his friends, including a cameo credit on past musical collaborator “Weird Al” Yankovic’s 2014 “Lame Claim to Fame” (for which Lars was given a special shout out in the liner notes to Al’s Grammy Award winning album, Mandatory Fun). Having been labeled as one of the pioneers of the underground “nerdcore hip-hop” subgenre, Lars has recently expanded from the studio to the classroom. With visiting scholar/teacher residencies at USC, and in the UK, and across the US in Nantucket, Florida, California, Alaska, and Kansas, Lars has found joy in educating young people about “lit-hop,” a subject term he coined to highlight the connections between literature, classical poetry, and the cultural history of rap. Lars has continued to work closely with the American Foundation for Suicide Prevention, teaching workshops on preventing self-harm, and positive ways to use music as creative therapy for depression. He has also worked with the American Heart Association, promoting youth heart health. It’s been quite a decade. WSG: Mega Ran", "name": "MC Lars w/ Mega Ran 3/8/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-03-08T21:00:00-05:00", "url": "https://www.facebook.com/events/1017884834929568/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-03-10T19:00:00-05:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "Join us for the Opening Reception & Award announcement of NEVER NOT BROKEN on Friday March 11, 6-9 pm at the 117 Gallery.\n\nAn exhibition curated by Anna van Schaap \n\n[A call for entries is open. Artists are welcome to submit all mediums. Deadline: February 14, 2016. Learn more here: https://goo.gl/3rXum7]\n\nThe circumstances of life are such that at one point or another something will break us.  The loss of a life, a love, a job, a home, will shake our foundation and we will inevitably crumble.  We then consider ourselves defeated; disheartened and utterly broken. But there is power in the acknowledgment of brokenness.\n\nNever Not Broken is taken from the Hindu Goddess Akhilanda or the 'Always Broken Goddess'. \"Akhilanda derives her power from being broke: in flux, pulling herself apart, living in different selves [and states of being] at the same time, from never becoming a whole that has limitations.\" (*1)\n\n\"Fluid connections, the celebration of ambiguity and a sense of ritual in chaos... deeply invested in the notion of complexity, this work will explore the arena of [brokenness] as an entree to rapture.  Artists working in this mode push the deconstruction and dissolution of centre, definitions and boundaries to reach the sublime terror [and beauty] of placelessness [and brokenness]\" *(2)\n\nBrokenness is not indicative of weakness or inability, but rather can be a strong driving force towards creative output as a means of analysis, internalizing, and coping for many artists.  This show seeks work that was created from a state of, and acknowledges our, Never Not Brokenness.\n\n(*1) Excerpt from the online article Why Lying Broken in a Pile on Your Bedroom Floor is a Good Idea by Julie Peters, Elephant Journal\n\n(*2) Excerpt from the Essay Beneath the Remains by Shamin M. Momin, The Gothic: Documents of Contemporary Art\n\n- Never Not Broken March 11 to March 26 at the 117 Gallery - \n-------------------------------------------------------------------------------------\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC", "name": "Never Not Broken | Opening Reception", "source": "Facebook", "date": "2016-03-11T18:00:00-05:00", "url": "https://www.facebook.com/events/788568644581287/"}, {"description": "Sponsored by the University of Michigan Credit Union, Arts & Eats: Dig In with UMS is a $15 ticket package deal that includes a great seat at the performance, exclusive access to a pre-show dinner, and a fun activity to get you thinking about the performance in a whole new way. You can pick up your tickets for the show at the Arts & Eats event.\n\nMore info about Nufonia Must Fall: http://ums.org/multiperformance/nufonia-must-fall/\n\nMore about Dig Ins: http://ums.org/tickets/students/", "name": "Dig In: Nufonia Must Fall", "source": "Facebook", "date": "2016-03-11T18:30:00-05:00", "url": "https://www.facebook.com/events/447639965441046/"}, {"description": "March 11-12\nPower Center\n\n“You can’t help but leave with a fuzzy feeling inside.” (examiner.com) The globetrotting, Montreal-based scratch DJ and music producer Kid Koala presents a magical, multi-disciplinary and theatrical adaptation of his graphic novel and soundtrack, Nufonia Must Fall. This charming story centers around a headphones-sporting robot on the verge of obsolescence who falls in love with a lonely office girl. This live adaptation unfolds via real-time filming of more than a dozen miniature stages and a cast of puppets, while Kid Koala and the Aelos Quartet provide original live scoring on piano, strings, and turntables. The result? You’ll seem to be watching an animated picture, but simultaneously seeing puppets being filmed and projected in real time. Heartfelt, hand-made, and a very cool live experience. \n\nMore info: http://ums.org/performance/nufonia-must-fall/", "name": "Nufonia Must Fall", "source": "Facebook", "date": "2016-03-11T20:00:00-05:00", "url": "https://www.facebook.com/events/488544131294497/"}, {"description": "Two-time Grammy-winner Jim Lauderdale is a \"songwriter's songwriter\" who has written/co-written many modern classics for iconic artists, as well as an intuitive sideman, enhancing the music of a bevy of esteemed musicians. Throughout his three-decade career, Jim Lauderdale has helped pave the way for the current Americana movement, writing songs that cross genres from country, rock, folk, and bluegrass, to R & B and blues. As a solo artist he's created a body of work spanning 28 albums of imaginative roots music.  Along the way he's won awards, garnered critical acclaim, and earned himself an engaged fan base. Jim treats his fans to a new adventure, exploring the redemptive traditional sounds of Memphis and Nashville with his double album, \"Soul Searching: Vol. 1 Memphis/Vol. 2. Nashville.\"  www.jimlauderdale.com", "name": "Jim Lauderdale", "source": "Facebook", "date": "2016-03-11T20:00:00-05:00", "url": "https://www.facebook.com/events/1729037197315068/"}, {"description": "$18 adv./ $20 day of | 18+ | 9pm\n\nSimply put, Tortoise has spent nearly 25 years making music that defies description. While the Chicago-based instrumental quintet has nodded to dub, rock, jazz, electronica and minimalism throughout its revered and influential six-album discography, the resulting sounds have always been distinctly, even stubbornly, their own. \nWSG: Mind Over Mirrors\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/521", "name": "Tortoise w/ Mind Over Mirrors 3/11/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-03-11T21:00:00-05:00", "url": "https://www.facebook.com/events/1622992504617740/"}, {"description": "Sat. March 12 |  18+  |  Doors 9:00pm  |  $8 adv./ $10 day of \n\nDesmond Jones  is a five-piece funk/rock/jazz fusion band from Grand Rapids, Michigan. With original music written to compliment the group's sound as a whole, the music is centered around melodic guitar riffs, smooth bass lines, funky drum beats, and some saxophone.\n\nSince 2012 this unique group has played with groups like The Werks, Dopapod, Kung Fu, Jimkata, Tauk, The Verve Pipe, Badfish, Fareed Haque, Old Shoe and many more. The group takes influence from Frank Zappa, The Grateful Dead, Phish, Charles Mingus, The Band, to name a few.\n\nDesmond Jones puts on exciting and high energy shows and is proud to say that each set list and each song is different from show to show. \n\nWSG: Everyday Junior & Dave Menzo", "name": "Desmond Jones w/ Everyday Junior & Dave Menzo 3/12/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-03-12T21:00:00-05:00", "url": "https://www.facebook.com/events/100357510348543/"}, {"description": "Sunday, March 13 | 8pm | 18+ | $16 adv. / $18 day of\n\nmc chris (always spelled in all lower case letters) is rapper from the Libertyville, Illinois, a suburb of Chicago. He was one of the first rappers to focus solely on nerd life, rapping about Star Wars, Harry Potter, ninjas and unrequited love, instead of the usual hip hop fare. He’s just as likely to make an appearance at Comicon as he is at SXSW. mc got his start as an animator on many of the shows you see on Adult Swim. He was writer, actor, songwriter and animator for Sealab 2021, The Brak Show, Space Ghost Coast to Coast and Aqua Teen Hunger Force. He has voiced characters on several Adult Swim pilots such as Welcome to Eltingville, Cheyenne Cinnamon, Your Pretty Face is Going to Hell and Tight Bros. He was also a producer of on air content for over a year before leaving Williams Street to pursue a career in music. mc has since crossed America countless times touring as a headlining act, as well as opening for bands like Pinback and Reggie and the Full Effect. He's collaborated with Talib Kweli, Andrew WK, Cee-Lo and Childish Gambino. His music has been featured in Kevin Smith’s Zak and Miri Make a Porno, Jay and Silent Bob’s Super Groovy Cartoon Movie and he has composed several themes for Smith’s Smodcast podcast network. mc's song \"hoodie ninja\" was featured in both a Honda commercial and America's Funniest Home Videos. Other songs have been featured in Comedy Central’s Broad City and Fox's So You Think You Can Dance? mc most recently started in the pilot Bunny and Frog for Disney and a national commercial for Fiat. mc raises money to fight Cystic Fibrosis. Inspired by his nephew who has CF, mc chris and his fans have raised over $150,000 for the Cystic Fibrosis Foundation through eBay sales and donations collected at live shows. mc kickstarted “the mc chris cartoon” an animated extension of the skit universe featured on his records. Thanks to donations from his fans, he raised $60,000 and produced a six minute pilot presentation with the animation company Titmouse Inc. mc is currently shopping the project.", "name": "MC Chris w/ Nathan Anderson 3/13/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-03-13T20:00:00-04:00", "url": "https://www.facebook.com/events/995090703894430/"}, {"description": "Tuesday, March 15, 2016, 7:30 pm\nSt. Francis of Assisi\n\nFresh from their 2014 performance of Monteverdi’s Vespers, Apollo’s Fire & Singers returns to St. Francis of Assisi Church with one of their signature pieces, Bach’s St. John Passion. Bursting out of the gate from the agitated opening chorus, this work is considered Bach’s most dramatic and theatrical oratorio. In this acclaimed interpretation, the story’s action is highlighted by a dramatic approach: the roles are performed by true singing actors, staged on a special theatrical platform within the orchestra. The acclaimed Apollo’s Singers evoke the wild mob with fierce intensity. \n\nMore info: http://ums.org/performance/apollos-fire-st-john-passion/", "name": "Apollo’s Fire & Apollo’s Singers: Bach’s St. John Passion", "source": "Facebook", "date": "2016-03-15T19:30:00-04:00", "url": "https://www.facebook.com/events/971816919508035/"}, {"description": "Carlene Carter, daughter of country music legends June Carter and Carl Smith, stepdaughter of Johnny Cash, and granddaughter of \"Mother\" Maybelle Carter of the original Carter Family, started her career in the late 1970s when she recorded her acclaimed debut album.  She co-wrote hit songs for Emmylou Harris and The Doobie Brothers, recorded a Top 40 pop duet, then \"came home to country\" in the 1990s with hits like, \"I Fell in Love,\" \"Come On Back,\" and, \"Every Little Thing.\" Carlene's latest release, \"Carter Girl,\" is a tribute to the timeless music of her historic family, that critics hail as \"a triumph,\" \"masterpiece,\" \"an album for the ages,\" and \"really quite perfect.\"  But while she is often referred to as \"country music royalty,\" she simply calls herself a Carter Girl. www.carlenecarter.net", "name": "Carlene Carter at Green Wood Coffee House", "source": "Facebook", "date": "2016-03-18T20:00:00-04:00", "url": "https://www.facebook.com/events/1948490602041931/"}, {"description": "A heart-pounding new Stevens and Windermere thriller from the award-winning author of \"The Stolen Ones \"and\" The Professionals.\" \n\nKirk Stevens and Carla Windermere of the joint BCA-FBI violent crime task force have handled shocking cases before, but this one is different. Stevens s daughter, Andrea, is distraught over a classmate s suicide, but what the two investigators find is even more disturbing an online suicide club of unhappy teenagers, presided over by an anonymous presence who seems to be spurring them on. Soon, it becomes apparent that the classmate wasn t the first victim and won t be the last, either, unless they can hunt down this psychopath once and for all.\n\nOwen Laukkanen was born in Vancouver. After graduating from university in 2006, he answered an ad on Craigslist for a summer job at the World Series of Poker in Las Vegas as a poker tournament reporter for a poker website. At the end of the summer, they offered him a full-time job. You wouldn t think you could make a living at this, but you would be wrong. For the next three years he traveled around the world, reporting from the most luxurious casinos of Monaco and Macau and Australia to the sketchiest card rooms of California and Atlantic City. In 2009, having seen his fill, Laukkanen quit to concentrate on fiction. He also spends summers as a deckhand on the boats of his father and his uncle, both commercial fishermen. He is at work on more novels. \n\nHis previous Stevens and Windermere novels are \"The Professionals,\" \"Criminal Enterprise,\" \"Kill Fee,\" and \"The Stolen Ones.\" \"The Professionals\" was nominated for the Barry Award and International Thriller Writers Award for best first novel, as well as the \"Spinetingler\" Award for Best Novel: New Voice. \"Criminal Enterprise\" was nominated for the ITW Award for best novel. Both books, as well as \"Kill Fee,\" appeared on several best-of-the-year lists.", "name": "Meet Canadian Thriller Author Owen Laukkanen for a Discussion & Signing of His Latest Stevens & Windermere Novel, 'The Watcher in the Wall'", "source": "Facebook", "date": "2016-03-19T15:00:00-04:00", "url": "https://www.facebook.com/events/1064114296941949/"}, {"description": "Saturday, March 19, 2016, 8:00 pm\nHill Auditorium\n\nThe Montreal Symphony returns to Ann Arbor for the first time since 1989, with American conductor Kent Nagano and pianist Daniil Trifonov both making their UMS debuts. “Hearing Trifonov is like having a deep-tissue massage: you keep wanting to pull away from the sheer intensity of it, and you come out feeling as if your reality had been slightly altered…a knockout.” (Washington Post) \n\nMore info: http://ums.org/performance/montreal-symphony-orchestra/", "name": "Montreal Symphony", "source": "Facebook", "date": "2016-03-19T20:00:00-04:00", "url": "https://www.facebook.com/events/1582133688713673/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-03-20T20:00:00-04:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "Our March Artists' Meet & Greet topic is \"How to write an artist statement\". Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "name": "How to Write an Artist Statement", "source": "Facebook", "date": "2016-03-23T18:00:00-04:00", "url": "https://www.facebook.com/events/968784676489949/"}, {"description": "Friday, March 25 | 9pm | 18+ | $16 Adv. / $18 Day of\n\nThen Came the Morning, the second album by the Southern-born, Brooklyn-based indie-folk trio the The Lone Bellow, opens with a crest of churchly piano, a patter of drums, and a fanfare of voices harmonizing like a sunrise. It’s a powerful introduction, enormous and overwhelming, as Zach Williams, Brian Elmquist, and Kanene Pipkin testify mightily to life’s great struggles and joys, heralding the morning that dispels the dark night: “Then came the morning! It was bright, like the light that you kept from your smile!” Working with producer Aaron Dessner of the National, the Lone Bellow has created a sound that mixes folk sincerity, gospel fervor, even heavy metal thunder, but the heart of the band is harmony: three voices united in a lone bellow.\n\n\"The feeling I get singing with Zach and Brian is completely natural and wholly electrifying,” says Kanene. “Our voices feel like they were made to sing together.\"\n\nLong before they combined their voices, the three members of the Lone Bellow were singing on their own. Brian had been writing and recording as a solo artist for more than a decade, with three albums under his own name. Kanene and her husband Jason were living in Beijing, China, hosting open mic nights, playing at local clubs and teaching music lessons. Zach began writing songs in the wake of a family tragedy: After his wife was thrown from a horse, he spent days in the hospital at her bedside, bracing for the worst news. The journal he kept during this period would eventually become his first batch of songs as a solo artist. Happily, his wife made a full recovery.\n\nWhen Kanene’s brother asked her and Zach to sing “O Happy Day” together at his wedding, they discovered their voices fit together beautifully, but starting a band together seemed impossible when they lived on opposite sides of the world. Brian soon relocated to New York and Kanene moved there to attend culinary school a couple years later. The three got together in their new hometown to work on a few songs of Zach’s, he’d been chipping away at the scene as a solo artist for awhile by then. After hitting those first harmonies did they decide to abandon all other pursuits. Soon the trio was playing all over the city, although they considered Rockwood Music Hall on the Lower East Side to be their home. They opened for the Civil Wars, Dwight Yokam, Brandi Carlile and the Avett Brothers, and their self-titled debut, produced by Nashville’s Charlie Peacock (the Civil Wars, Holly Williams) and released in January 2013, established them as one of the boldest new acts in the Americana movement.\n\nAfter two hard years of constant touring, the band was exhausted but excited. By 2014, they had written nearly 40 songs on the road and were eager to get them down on tape. After putting together a list of dream producers, they reached out to their first choice, the National guitarist Aaron Dessner, who has helmed albums by the L.A. indie-rock group Local Natives and New York singer-songwriter Sharon Van Etten.\n\n“It occurred to me that it would be fun to get together and make music with them,” says Aaron. “My main interest in producing records is community and friendship more than making money. I already do a lot of traveling and working with the National, so when I have to time to work with other artists, it should be fun and meaningful.”\n\n“Aaron is just so kind,” Zach says. “And he has surrounded himself with all these incredibly talented people, like Jonathan Low, the engineer. His brother Bryce [Dessner, also a guitarist for the National] wrote these amazing brass and string arrangements, and he got some of his friends to play with us.”\n\nDessner and the Lone Bellow spent two weeks recording at Dreamland in upstate New York, a nineteenth-century church that had been converted into a homey studio. The singers found the space to inspire the emotional gravity necessary for the material and the acoustics they were looking for. (For Kanene, Dreamland had one other bonus: “I’m a big Muppets fan, and it looks exactly like the church where Dr. Teeth and the Electric Mayhem lived.”)\n\nAaron set them up in a circle in what had once been the sanctuary, with microphones hanging in the rafters to capture the sound of their voices bleeding together. Most of the vocals were recorded in single takes, a tactic that adds urgency to songs like “Heaven Don’t Call Me Home” and “If You Don’t Love Me.” “There were a couple of times when somebody sang the wrong word or hit a bad note, and we just had to keep going,” says Zach, who says that recording “Marietta” in particular was daunting—especially the moment near the end when he hits an anguished high note, bends it even higher, and holds it for an impossibly long time. It’s a startling display of vocal range, but it’s also almost unbearably raw in its emotional honesty.\n\n“‘Marietta’ is probably the darkest song on the whole record,” Zach explains, “and it’s based on something that happened between my wife and me. The band was getting ready to record that song when all of a sudden my wife showed up with our youngest baby. It was a great surprise, a beautiful moment. So I was able to go out and sing that song, knowing she was there to help me carry the moment.”\n\n“These are true stories,” says Brian. “These aren’t things we made up. We tried to write some songs that had nothing to do with our personal stories, but we just didn’t respond to them. But we’re best buds, so we know each others’ personal stuff and trust each other to figure out what needs to be said and how to say it.” Case in point: Brian wrote “Call to War” about his own struggles during his twenties, but gave the song to Kanene to sing. “The content is painful and brutal,” she says, “but the imagery, the vocals, they build something delicate and ethereal. That kind of contrast illuminates the true beauty and power of a song.”\n\nSays Brian, “We do this one thing together, and we carry each other. Hopefully that makes the listener want to be a part of it. It becomes a communal thing, which means that there’s never a sad song to sing. It’s more a celebration of the light and the dark.”", "name": "The Lone Bellow 3/25/16 at Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-03-25T21:00:00-04:00", "url": "https://www.facebook.com/events/1550469435268350/"}, {"description": "Saturday, March 26, 2016, 8:00 pm\nHill Auditorium\n\nBach’s complete Sonatas and Partitas have long been a “Mount Everest” of the violin repertoire — music that performers return to throughout their lives. In this special event, Gil Shaham collaborates with video artist David Michalek to open up new avenues for listening to and interpreting Bach’s towering masterpieces.\n\nVideo artist David Michalek, best known for his “Slow Dancing” installation at Lincoln Center, and in the capitals of Europe, says of the Bach Six Solos project: “As a contemporary artist with a particular interest in motion pictures and time, I’ve been compelled to consider how the addition of extreme slow motion might be applied to moving images of the face, the body, obliquely narrative tableaux, and also still life in ways that can both enhance and alter the meanings latent within them. As a visual strategy, extreme slowness creates a continuing sense of a pause in the action — as if the growth and evolution of the slow-moving image is itself a further manifestation of the deep and consuming absorptive state that often arises while observing it.”\n\nMore info: http://ums.org/performance/gil-shaham/", "name": "Bach Six Solos: Gil Shaham, violin", "source": "Facebook", "date": "2016-03-26T20:00:00-04:00", "url": "https://www.facebook.com/events/1663165150570187/"}, {"description": "Sunday, March 27 | 18+  |  Doors 9:00pm  |  $12 adv./ $15 day of \n\nYoung Fathers are DEAD.\n\nOr, rather, DEAD is Young Fathers. Their first full-length album, released in February, 2014, on Anticon and Big Dada has been given the kind of critical appraisal normally held hidden in the filing cabinets of dusty music journos and only brought out, along with the bottle of fine blended whisky for those special occasions, those special rock occasions. You know the kind, when a credible bunch of guitar, bass and drum twenty-somethings from some northern town in the UK or from Indianapolis USA put something together in the studio that reaches out and reminds everyone that modern life isn’t rubbish. Which is a weird reaction for a group who sit in some non-categorisable space between genres ancient and modern, who take hiphop and pop and dip it in a tie-dye mix of Ronnettes and krautrock and ragga and dub and post-punk and afropsych… and make something, something, something.\n\nMany years before dropping DEAD the three individuals who became Young Fathers were apprentice young men. 14 years old, meeting in a sweaty dancing circle in the infamous original Bongo Club in Edinburgh, Scotland, UK. Moving to the in-your-face beats of early noughties hiphop, R&B and Dancehall and then at the end of the night, agreeing to meet at solemn faced would-be producer G’s house, to ‘make records’ on an ancient karaoke machine. The three of them, already looking like their future selves: Alloysious, city street holy man, sad eyes to the stars, past of the Liberian war atrocities buried in childhood scar tissue; Kayus, face exploding from frowns to huge laughter, pure naija boy on the outside but reflective and always feeling far away from his Nigerian home on the inside; and G, quietly watching and waiting for good things to come, practising the serious don’t fuck street face for the neds where he grew up, but nurturing a heart of soul.\n\nFrom the bedroom to the basement. It took them a few years before they found the small underground studio in Leith where they could perfect the uniqueness already nascent in the early days. Here they developed what they call, like the Sicilian mafia, ‘our thing’. Recording processes that involve ritual, musical techniques more usually found in bebop jazz, playing with ways to write lyrics and tunes, scouring the further reaches and always recoiling from cliché. But always, always staying true to the Rules of Pop which demand hooks, energy, sparkle, accessibility, passion and beats that vibrate below the waist. From this point came their first release, what was originally conceived as a mixtape, literally only available on individually recorded cassettes with hand printed sleeves: TAPE ONE was the moment, recorded in a week, ready to release in two.\n\nShortly thereafter, TAPE TWO was recorded and a deal with far-out Los Angeles hiphopping label, Anticon inked. TAPE TWO took the dirty mounds of its predecessor and moulded beautiful sand sculptures, sealed by the sea, with the same processes, the same inspiration, gone deeper, gone darker. A year after its release TAPE TWO wins the Scottish Album Of The Year Award (2014), an indication, perhaps, that people are really starting to get it. YFs are just happy more people are listening, even if that 20 grand prize money does come in handy for debts and mashed up gear. And a final, critical tick from the music business comes at the end of summer when the album is nominated for a Mercury award.\n\nDid I mention the live show? I don’t believe so… on an insane tour of the USA, UK and Europe, heading over to Australia, Japan, Russia and then back to Europe. A huge 27-date UK & European tour preceded standout performances at SXSW, with a 33-date US tour supporting Anticon’s Baths before playing a homecoming show at the Park Stage at Glastonbury. By the end of this year, YFs will have driven around the world one and a half times and flown it several times more. What happens? Each time they appear as a support, the headliner regrets and celebrates, because, if the headliner can’t hope to make the desired impact after the explosion of uber-watt energy that is a Young Fathers show, they can at least reflect and bask in the knowledge that they were partly responsible for something special happening.\n\nWhen they headline, they squeeze hours into 45 minutes and leave the audience exhausted from spectacle and bass, necks aching from craning, ears ringing and a delayed smile forming as they leave after pointless demands for more. (Of course, YFs never give more, because they have given all they have).\n\nSounds like hyperbole? Read the reviews… The Guardian were particularly kind about DEAD, Alexis Petridis wrote: “Young Fathers have quietly constructed a strange and intoxicating musical universe that feels entirely their own” – Guardian 4/5 (Lead Review). I know the group intimately and yet they still shock me on a regular basis. Not with anything as base as the kind of look-at-me desperation of a shocking rocking Rocky Horror spit show, nor with pyro and cannons and strippers or any of the other circus tricks. Just with presence and passion and looking like that beamed in from another world lost aliens with a message of love type of group. With intense engagement… intense… the Johnny Rotten, Ian Curtis, James Brown kind. Taking that brief blast of special that is normally only allowed to boys from terraced houses for a couple of years before imp or exp-losion but YFs just, keep it going, impossibly, like an Ethiopian marathon racer. Which should be an indication, dear star watchers, that something special is happening.\n\nOK, 850 odd words and still so much info to impart. How about… America, it’s like jumping into a deep fat fryer, so many delicious possibilities, like: Jimmy Kimmel, set to take the crown of late night TV chat show hosts, who hosted Young Fathers in June, watched by the entire Anticon roster, performing with blood shot intensity after 24 hours of partying (yes, they party, seriously of course, as you ask) in Los Angeles. More America: the entire staff of KEXP in Seattle, cramming into the control booth and watching in awe during YFs’ radio session there. If you know how many artists go through those doors you’ll know what an accolade that is.\n\nWhat about the BBC? How about all the love from Zane Lowe for the singles, not to mention the weekly shows they made for 1Xtra through October last year (2013) ? Episodes of some outer space Dada drama slotted in amongst all the herbal urban clichés. How about being banned by the beeb? Queen Is Dead, from TAPE TWO, officially banned just in case the Queen of Britain pops her clogs at the moment of spinning.\n\nTime to round it up and leave all the untold good stuff for another time. Now signed with Big Dada, Young Fathers are already recording the next album, printing more of their iconic T-shirts (have you got one yet? You’ll probably have to wait), making more videos, sweating their way through the summer festivals, ignoring stupid borders and other constraints in order to bring it, whatever it is, to you. ENDS", "name": "Young Fathers 3/27/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-03-27T21:00:00-04:00", "url": "https://www.facebook.com/events/1551492585165998/"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty", "source": "Facebook", "date": "2016-03-31T19:30:00-04:00", "url": "https://www.facebook.com/events/1390173447979498/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-03-31T20:00:00-04:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "Sponsored by the University of Michigan Credit Union, Arts & Eats: Dig In with UMS is a $15 ticket package deal that includes a great seat at the performance, exclusive access to a pre-show dinner, and a fun activity to get you thinking about the performance in a whole new way. You can pick up your tickets for the show at the Arts & Eats event.\n\nMore info about Mariachi Vargas de Tecalitlán : http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan/\n\nMore about Dig Ins: http://ums.org/tickets/students/", "name": "Dig In: Mariachi Vargas de Tecalitlán", "source": "Facebook", "date": "2016-04-01T18:30:00-04:00", "url": "https://www.facebook.com/events/1667725740151395/"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty", "source": "Facebook", "date": "2016-04-01T19:30:00-04:00", "url": "https://www.facebook.com/events/1390173447979498/"}, {"description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "name": "Mariachi Vargas de Tecalitlán", "source": "Facebook", "date": "2016-04-01T20:00:00-04:00", "url": "https://www.facebook.com/events/453190221522442/"}, {"description": "In a career that spans 23 albums and includes three Grammy awards, Tom Chapin has covered a lot of creative ground. In addition to his work as a recording artist and concert performer, Chapin has acted on Broadway and worked in films, television and radio. Tom grew up in a family that encouraged artistic pursuits. He began performing professionally as a teenager in the early 1960s, playing in Greenwich Village folk clubs alongside his siblings, Harry and Steve, as one of The Chapin Brothers. In 1971, he began a five-year run as the host of the ABC-TV children's series, \"Make A Wish.\" Chapin and his songs were also featured in the 1970 documentary film, \"Blue Water, White Death,\" for which he spent six months sailing the Indian Ocean searching for great white sharks.\n\nAs a music-maker, Chapin has maintained two parallel careers, as a highly respected contemporary folk artist and as a pioneer in the field of children's music. In the former role, Chapin has established a reputation for insightful, heartfelt songcraft and charismatic live performances. In the latter, he continues to engage the hearts, minds and imaginations of young listeners with witty, life-affirming original songs delivered in a sophisticated array of musical styles. Chapin's infectious songs, sterling musicianship and personal warmth shine, whether he's performing on record or in a concert hall, an outdoor festival, a school, in front of a symphony orchestra, or in an intimate coffeehouse. www.tomchapin.com", "name": "Tom Chapin at  Green Wood Coffee House", "source": "Facebook", "date": "2016-04-01T20:00:00-04:00", "url": "https://www.facebook.com/events/1713063788906616/"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty", "source": "Facebook", "date": "2016-04-03T19:30:00-04:00", "url": "https://www.facebook.com/events/1390173447979498/"}, {"description": "Monday, April 4 | 9pm | 18+ | $13 adv./ $15 day of\n\nCritically acclaimed pop duo Chairlift has released new music in the form of the infinitely danceable “Ch-Ching.” The R&B laced, vibrating drum infused pop track serves as the first musical offering from their forthcoming album Moth, which will be released in January 2016 via Columbia Records. Although the single is the first work to be released from Chairlift in three years, the duo – comprised of writer/producers and multi-instrumentalists Caroline Polachek and Patrick Wimberly – has hardly been quiet. They collaborated with Beyoncé on her groundbreaking self-titled album via the track “No Angel,” which was written and produced by Caroline and co-produced by Patrick. Caroline released and toured Arcadia, a self-produced solo album under the alias Ramona Lisa and collaborated with SBTRKT, Blood Orange and others, while Patrick produced and collaborated with artists such as Solange Knowles, Wet, Kelela, and Tei Shi.\n\nAn evolution from their last album, 2012’s Something, Moth proves to be an emotionally uninhibited and markedly stronger, more pop inspired body of work. A very New York City inspired album, listeners can expect to be led through an aural mix of big, rich pop inspired hooks, vibrating bass, lively brass and sensuous R&B inspired vocals, all anchored in the duo’s meticulously crafted instrumentation.", "name": "Chairlift 4/4/16 at Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-04-04T21:00:00-04:00", "url": "https://www.facebook.com/events/162598590780251/"}, {"description": "Tuesday, April 5 | 8pm | 18+ | $12 Cover\n\n“During the writing of Drinking From A Salt Pond, the band admits to flaring tempers and tense operations as they worked to redefine their sound, goals, and relationships…”\n\nRun River North will be the first to tell you: it has largely been an uphill climb for the indie rock sextet from Los Angeles, a hero’s journey full of odds-defying opportunities seized amidst rocky naysayers and the snagging brambles of band life. And now, with their second full-length album Drinking From A Salt Pond, Run River North are poised to push forward and create their own wake as a major voice in today’s music landscape.\n\nSince the band’s beginnings just over four years ago, their rise has been steadily spectacular, marked by appearances on national television, sold-out shows at historic venues, tours with rock and roll royalty and heaps of praise from fans and critics alike. As they blossomed, they embraced their initially folk-driven sound, which found its harmonic home alongside rootsy, foot stomping, sing-along-leading peers like Mumford & Sons, The Head and the Heart, and Of Monsters and Men. Powered by the acoustic-guitar-and-vocals songwriting of frontman Alex Hwang, their 2014 self-titled debut record, produced by Phil Ek (Fleet Foxes, Modest Mouse, Band of Horses), was released with their lineup rounded out by the strings duo of Daniel Chae and Jennifer Rim, Joe Chun on bass, Sally Kang on keys, and John Chong on drums.\n\nAs time and tours passed, the six lives spent in close-quarters began to grind the gears a little differently; their whole dynamic began to change. “When we became a band, we mostly played Alex’s songs in band form,” says Chae. “Since then we’ve all put our musical input into it, so the music has changed a lot.”\n\n“We were tired of me on acoustic guitar and everybody singing harmonies,” says Hwang. “We were hitting a ceiling, and it wasn’t fun. We had always agreed this band was six-ways, for better or worse. So at the end of last year, after being in the van constantly, we said, ‘no more touring, let’s write new songs.’”\n\n“We had to grow up pretty fast as a band,” says Chong. “So this past year, there were times when different perspectives and priorities have butted heads.”\n\nDuring the writing of Drinking From A Salt Pond, the band admits to flaring tempers and tense operations as they worked to redefine their sound, goals and relationships. “We’ve had a lot of hating each other, almost kicking people out of the band,” says Hwang. “We’re being honest and that openness is one of the main thrusts for the album. Embracing the bitter with the sweet, not trying to hide the crappy parts…the crappy parts helped make the good.” Being open about its faults, the band recognizes how the turmoil has helped Run River North create something beautiful.\n\n“The record we just made, it’s all the difficult stuff we went through so there’s a darker tone to the music. It works,” says Chae.\n\nOne of the first steps in leaving behind their folk roots was to work with new collaborators. Instead of the reverb-heavy, northwest sound of Ek, they recorded in Los Angeles with Lars Stalfors (Cold War Kids, HEALTH, Deap Vally, Matt and Kim) at the production helm. Stalfors opened their eyes to the upbeat energy and electric tone of indie bands like The Walkmen. Throughout Salt Pond the indie rock influence can be heard, with the band nodding inspiration to everyone from Cage the Elephant and Kings of Leon to The National, Death Cab for Cutie, and Cold War Kids, whose studio in San Pedro, CA the band borrowed to make the album. Also, in a move encouraged by their record label, Nettwerk, Hwang and Chae were sent to Nashville for a week in April 2015 to work on a few new tracks with two different co-writers, Lincoln Parish (formerly of Cage the Elephant) and the Kings of Leon collaborator Nick Brown.\n\n“It was weird but at the same time it was really encouraging,” says Hwang of the co-writing. “It was like bringing our demos to a blind date.”\n\nThe first song from the Nashville sessions was “Run Or Hide,” co-written with Parish, and from first listen it’s clear that Run River North are exploring bombastic new territory. Hwang, Chae, and Parish came up with an organic way of working that was based on jamming and vibing together, and once the song’s melody was nailed down, the rest came easily. It was immediately hard-hitting than any previous song from the band, with a discernible strut serving as a sonic contrast. When the demo was sent home to LA, the rest of the band was shocked.\n\n“Almost everyone else was really scared,” says Hwang, “‘this is not your voice, this is not who we are.’ I was confident it was a really good song and that we were gonna keep it. There’s nothing more aggressive on the record, and that groove on the verses is bigger than the band. The band can’t contain the song.”\n\n“I loved it!” says Chong emphatically. “Alex has a very wide range of emotion when he sings—soft, whispery things; really bombastic; rough—this song showcases all of that. I got really excited. When we recorded it, it really showcases more groove. Joe, our bass player, is solid, and the way the melody is created in the verses really adds to that. There’s a really cool contrast happening, but the choruses hit hard.”\n\nThe other song written in Tennessee was the Nick Brown co-penned “Can’t Come Down,” a track with pop qualities that the band does not shy away from recognizing. For that they leaned on Brown heavily, who served almost as a mentor to Hwang and Chae during the sessions, teaching them about pop hooks, authenticity, and Southern tradition. Deciding to go all in on a pop song, the trio rallied behind Brown’s catchy melodies and licks, and what they ended up with is a happy medium that “still sounds as Run River North as possible,” according to Chong, while simultaneously reaching for the rafters.\n\n“We really gelled with Nick Brown,” says Hwang. “We had the same idea: ‘We have enough songs that exemplify us, so let’s try our hand at writing a pop hook.’ With that mentality we came up with ‘Can’t Come Down.’ Nick wrote the hook, Daniel and Nick wrote the music, and a heavy collaboration on lyrics from everyone. It’s the first song I ever sang the word ‘baby’ in.”\n\nWith those songs firmly planting the band’s flag in new ground, it is Hwang’s “29” that may be the best indicator of the band Run River North are becoming. A piano and drum fueled anthem examining the ups and downs of transition, it finds the singer posing multiple existential questions at once. “Everyone’s always talking about how if you will something, it’s gonna happen. But, sometimes it doesn’t!” says Hwang. “That was a realization I wanted to play with: ‘Your words are cold like the wind…’ It’s kind of like saying, ‘I don’t care what you think,’ but it’s also a reflection about my words. What I do can be just as insignificant as anyone else. So what are you gonna do about it? You’re 29. ‘I know it’s home, I know it hurts/I know I’ll end up at the bottom/What if I leave?’ What if we go on this tour and we don’t end up anywhere? The brutal question is, who cares, and why does it matter? Not answering that in the song really helps. The music is still upbeat, it still has the ‘oh’s’ going on, it’s an anthemic thing. I’m still energetic, I’m not some old dude at 29.”\n\n“29” was written on electric guitar, a tool Hwang has been using more frequently since the end of the debut album’s touring cycle. Originally intended for a more somber feel, at the suggestion of their producer Stalfors, the tempo rose to meet Hwang’s intonations. “It became this song with so much energy,” says Chong, “it’s probably the fastest song we’ve ever done as a band. It’s new territory for us; it’s very fun. It’s a good transition, with lulled verses and really upbeat instrumentals and choruses. This is a good appetizer for our old fans, as this is who we’ve become.”\n\nEmbracing their natural growth and learning to ride the waves of their personal and musical evolutions with open hearts and nimble hands, Run River North have created a sophomore album that will propel them to the forefront of today’s landscape. Although at times the rushing water of their rise will pool into depths tough to swallow, they have learned to lean on each other and to trust themselves along the way in order to make something lasting and truly beautiful.\n\n“From the start, we always said we wanted to play on the biggest stages possible,” says Hwang. “That’s still the same. But it isn’t some self-indulgent dream of becoming rock stars; we still want to support our families with this, we still have the parents that sacrificed for us and we want to honor them. For us as a band, at times it’s felt like we’ve been drinking from a salt pond—and yet, we still created something pretty fresh that we like and are proud of.”\n\nWSG: The Lighthouse and the Whaler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/634", "name": "Run River North w/ The Lighthouse & The Whaler 4/5/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-04-05T20:00:00-04:00", "url": "https://www.facebook.com/events/629378653882823/"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty", "source": "Facebook", "date": "2016-04-06T19:30:00-04:00", "url": "https://www.facebook.com/events/1390173447979498/"}, {"description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "name": "Jerusalem Quartet", "source": "Facebook", "date": "2016-04-08T20:00:00-04:00", "url": "https://www.facebook.com/events/827290400697161/"}, {"description": "Friday, April 8 | 9pm | 18+ | $22 Adv./ $25 Day of\n\nthe Mountain Goats - One thing that happened this past year was at City Winery, in April, where we did a session down in the cellar between soundcheck and the show. We hadn’t really thought a whole lot about the session in advance—on tour, your default response to things is “let’s just show up and play”—and we were kind of under the gun time-wise when we got to the club. So we decided to just do it quick and dirty, old-school style. Like the open mic nights I used to play: unamplified guitar and vocals, friends with their axes playing along, arrangements arrived at on the fly and infinitely flexible. Four songs later we felt really inspired—me and Matt played a song or two without anybody else around because we’d gotten down to the basement before the others, the total song choice was strictly “what do you figure we should play now?”, the mood was relaxed and free…we loved it. Later that night, we decided to strip down the drum kit to essentials and play a choke-the-motor set echoing and elaborating on what we’d done downstairs: a sort of small-ensemble feel, lower in volume but actually higher in intensity. Like what we do in concentrate. It was one of our two favorite performances of the year, the other being the second night at the Fillmore. It felt like acres of new terrain opening up atop an ancient foundation. As soon as it was over, we all wanted to do it again. So in 2016 we’re taking that set on the road. Not that exact set, obviously; the particulars will vary from night to night. But smaller rooms, audible frequencies, up close and personal: this is the general plan. Making eye contact with people in the back row, being able to go off-mic when I want to and still be heard. Total visibility. We couldn’t be more excited about this tour. I love the big album release shows as much as anybody, but that City Winery feel of just playing together with bare essentials in close quarters…there’s nothing like it, and when the whole room locks onto the signal, it’s really special.\nWith: William Tyler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/581", "name": "The Mountain Goats w/ William Tyler 4/8/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-04-08T21:00:00-04:00", "url": "https://www.facebook.com/events/554988117991170/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-04-12T20:00:00-04:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "Tuesday, April. 12 | 9pm | 18+ | $13 Adv./ $15 Day of\n\nDenzel Curry 2055 The Ult Experience\nwsg: Allan Kingdom and Sdotbraddy\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/636", "name": "Denzel Curry - 2055: The Ult Experience 4/12/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-04-12T21:00:00-04:00", "url": "https://www.facebook.com/events/523621744459410/"}, {"description": "South Africa's legendary breaker of walls", "name": "The Johnny Clegg Band", "source": "Facebook", "date": "2016-04-13T20:00:00-04:00", "url": "https://www.facebook.com/events/1602568673339827/"}, {"description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "name": "Mnozil Brass", "source": "Facebook", "date": "2016-04-14T19:30:00-04:00", "url": "https://www.facebook.com/events/1621365181438631/"}, {"description": "American Idol's Season 8 winner, up close and personal!", "name": "Kris Allen", "source": "Facebook", "date": "2016-04-14T20:00:00-04:00", "url": "https://www.facebook.com/events/1662156430732435/"}, {"description": "Much-awaited new music from a performer bridging bluegrass and folk", "name": "Tim O'Brien", "source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "url": "https://www.facebook.com/events/933628040025902/"}, {"description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus, where it blended with elements of Spanish music, then was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed Tunisian singer Sonia M’barek, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "name": "Zafir: Musical Winds from North Africa to Andalucía", "source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "url": "https://www.facebook.com/events/419604171550681/"}, {"description": "Scott Ainslie came of age during the Civil Rights era, and cultivated a powerful affinity for cross-cultural exchange. He has studied with elder musicians on both sides of the color line, in the old-time southern Appalachian fiddle and banjo traditions, as well as Black gospel and blues. He plays this music with affection, authority, and power. Armed with a variety of instruments -- vintage guitars, a fretless gourd banjo, a one-string, homemade diddley bow (cigar box guitar) --  and carefully chosen personal anecdotes of his encounters with senior musicians across the South, Ainslie explores the African and European roots of American music and culture, bringing the musical history of America alive.  www.cattailmusic.com", "name": "Scott Ainslie at Green Wood Coffee House", "source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "url": "https://www.facebook.com/events/506775856161991/"}, {"description": "Michigan masters explore folk roots for families", "name": "Ford Motor Company Fund Family Series: Robert Jones & Matt Watroba", "source": "Facebook", "date": "2016-04-16T13:00:00-04:00", "url": "https://www.facebook.com/events/1683791998557275/"}, {"description": "Legendary guitar mastery", "name": "Leo Kottke", "source": "Facebook", "date": "2016-04-16T20:00:00-04:00", "url": "https://www.facebook.com/events/1512513839062559/"}, {"description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "name": "Bavarian Radio Orchestra", "source": "Facebook", "date": "2016-04-16T20:00:00-04:00", "url": "https://www.facebook.com/events/1579924995611394/"}, {"description": "Small-town dreams from a Grammy-nominated country and rock Nashville songwriter", "name": "Will Hoge", "source": "Facebook", "date": "2016-04-17T19:30:00-04:00", "url": "https://www.facebook.com/events/788218501301041/"}, {"description": "Monday, April 18 | 8pm | 18+ | $15 adv./ $17 day of\n\nPolica with MOTHXR \n\nUnited Crushers (out March 4, 2016) is POLIÇA’s third full-length release and most remarkable album to date. The band, which includes Channy Leaneagh, dual drummers, Drew Christopherson and Ben Ivascu and Chris Beirden on bass with producer Ryan Olson at the helm, collectively wrote the album in Minneapolis in the winter of 2015 during their first true break from two straight years of touring. The new album builds on POLIÇA’s signature synthesizer and percussion-heavy sounds with more complex arrangements and a bigger, crisper hi-fi punch due to the new approach they took to writing and recording: together, all in the same room. There's a tighter groove to these songs and a more vulnerable quality to them, especially in Leaneagh's singing. Her incredible vocal range is consistently on display throughout, beautifully raw and less electronically effected than on previous recordings. United Crushers is the follow up to 2013’s Shulamith which EW called \"propulsive enough for dance floors, and dreamy enough for headphones\" andMOJO said \"proves that intelligent pop music still has the ability to seduce and enthral.\" Their debut, 2012's Give You The Ghost, also garnered international acclaim, with Rolling Stone hailing it as \"the sound of heartbreak and celebration happening simultaneously\" and Q praising it as \"a bewitching, urgent, magical debut.\" The band has conquered massive festivals around the world from Coachella to Glastonbury in addition to performing on Late Night With Jimmy Fallon, Later With Jools Holland and more.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/564", "name": "Polica w/ Mothxr 4/18/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-04-18T20:00:00-04:00", "url": "https://www.facebook.com/events/769930223136488/"}, {"description": "\"Lush, introspective, elegant\"—Boston Globe. Photo by Asia Kepka.", "name": "Anne Heaton", "source": "Facebook", "date": "2016-04-21T20:00:00-04:00", "url": "https://www.facebook.com/events/1088535237838163/"}, {"description": "\"Nora Jane Struthers has been creating quite a buzz.\"—The Tennessean, Nashville", "name": "Nora Jane Struthers", "source": "Facebook", "date": "2016-04-22T20:00:00-04:00", "url": "https://www.facebook.com/events/937454106322981/"}, {"description": "Warm as summer sunshine, real as the truth, intimate as a long overdue visit between old friends … such is a Jonathan Edwards concert. Four decades into a stellar career of uncompromising musical integrity, the man simply delivers, night after night – songs of passion, songs of insight, songs of humor, all rendered in that pure and powerful tenor which, like fine wine, has only grown sweeter with age.\nThis is one veteran performer who is neither grizzled nor nostalgic.  \nJonathan's  highly respected repertoire  includes such classics as, “Sometimes,” “One Day Closer,” “Don’t Cry Blue,” “Emma,” “Everybody Knows Her,” “Athens County,” and everyone’s favorite ode to putting a good buzz on, “Shanty.” And then, of course, there’s the anthemic “Sunshine (Go Away Today),” that fierce proclamation of protest and independence that resonated with thousands and thousands of frustrated and angry young men and women when it was first released in 1971. Almost 40 years later, at show after show, the song continues to be embraced by faithful followers and new fans alike.\nSince 1971, Jonathan has released 15 albums, including \"Blue Ridge,\" his standard-setting collaboration with bluegrass favorites the Seldom Scene, and \"Little Hands,\" his collection of children’s songs, which was honored with a National Library Association award. His brand new album is, \"Tomorrow's Child.\"\nwww.jonathanedwards.net", "name": "Jonathan Edwards at Green Wood Coffee House", "source": "Facebook", "date": "2016-04-22T20:00:00-04:00", "url": "https://www.facebook.com/events/1943009162591226/"}, {"description": "A blues and boogie summit! Note special start time.", "name": "Mr. B's Blues and Boogie Celebration", "source": "Facebook", "date": "2016-04-23T19:30:00-04:00", "url": "https://www.facebook.com/events/423521121176906/"}, {"description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "name": "The Bad Plus Joshua Redman", "source": "Facebook", "date": "2016-04-23T20:00:00-04:00", "url": "https://www.facebook.com/events/1589849627952742/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-04-25T20:00:00-04:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "Our April Artists' Meet & Greet topic is How to Photograph Your Artwork. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet events: http://www.annarborartcenter.org/artists-meet-greet/", "name": "How to Photograph Your Artwork", "source": "Facebook", "date": "2016-04-27T18:00:00-04:00", "url": "https://www.facebook.com/events/1668025760140932/"}, {"description": "New music from an expat Australian trio", "name": "The Waifs", "source": "Facebook", "date": "2016-04-27T20:00:00-04:00", "url": "https://www.facebook.com/events/831801416940807/"}, {"description": "Wed. April 27 | 9pm | 18+ | $28 Cover\n\nReverend Horton Heat with: Unknown Hinson, Nashville Pussy & Lucky Tubb & the Modern Day Troubadours Live in Concert!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/612", "name": "Rev. Horton Heat & Company 4/27/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-04-27T21:00:00-04:00", "url": "https://www.facebook.com/events/991272244292924/"}, {"description": "Thursday, April 28 | 9pm | 18+ | $15 Cover\n\nIt’s rare for an artist to bridge the divide between critical acclaim and dedicated fan engagement. Chris Pureka is a Portland-based singer-songwriter whose body of work has resonated deeply with these seemingly disparate milieus. Her bold vulnerability in processing the intimacies of her life in song has long appealed to those listeners who crave authenticity. Now, five years coming, she shares with us another powerful entry in her life’s work, her sixth release, the aptly titled, Backin the Ring. Chris’s elegant emotionality as a vocalist, and her flair and immediacy as a lyricist have garnered her favorable comparisons to Gillian Welch, Ryan Adams, Bruce Springsteen, and Patty Griffin. She’s earned accolades from such distinguished taste-making outlets as The New York Times, Paste, Magnet,Billboard.com, and The AllMusic Guide. She’s shared the stage with such diverse and esteemed artists as Dar Williams, TheLumineers, The Cowboy Junkies, Gregory Alan Isakov, Martin Sexton, and Ani DiFranco. Along the way, Chris has remained fiercely independent, selling nearly 50,000 albums through her own label, Sad Rabbit Records. Chris’s journey in music mirrors her path toward self-discovery. At 16, writing songs became a way of journaling. “I was shy and introverted, and songwriting was a very personal process. I never had any intention of performing,” she shares. Post high school, she went on to complete a biology degree at Wesleyan University, and afterwards, worked in a microbiology research lab at Smith College. Meanwhile, she established a music career parallel to her biology work through touring and issuing a clutch of well-received indie releases.In 2006, when Chris found herself turning down too many opportunities as a musician, she shifted her priorities to become a full-time artist. Her latest album, Backin the Ring, is Chris’s first studio full length since 2010’s critically acclaimedHow I Learned to See in the Dark. “I’m not interested in releasing songs I can’t get behind or records I don’t love,” she says of the five-year span between albums. The title of her latest playfully suggests something of an artistic comeback, but it also references the album’s themes of relationship conflict and making the decision to fight back against dark inner demons. “My music is the outward expression of the work I’m doing internally. What I do comes from my experiences, and I strive to express these experiences authentically. Speaking my truth, and being myself, is the way that I connect with people,” Chris confides. Her rise as an esteemed artist with captivating emotional integrity has been organic and always on her own terms.For someone who never had an intention of being a professional musician, it’s been a life of far-reaching changes and unexpected rewards. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/595", "name": "Chris Pureka 4/28/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-04-28T21:00:00-04:00", "url": "https://www.facebook.com/events/1318721681600135/"}, {"description": "Michigan's cult hero of comedy", "name": "Heywood Banks", "source": "Facebook", "date": "2016-04-29T20:00:00-04:00", "url": "https://www.facebook.com/events/480751802102134/"}, {"description": "Don Campbell is a contemporary/country crossover and folk-rock singer/songwriter whose presentation of music supports the story in the song and welcomes the audience on board for the ride. Often compared to the sounds of Dan Fogelberg, Vince Gill, and Chris Isaak, Don and his ensembles are based out of New England. In 2012, Don released a double CD, \"Kites To Fly: Celebrating the Music of Dan Fogelberg,\" and in 2013 began presenting live performances of this music around his own busy schedule of Don Campbell shows.\nwww.doncampbellmusic.com", "name": "A Special Evening Of Dan Fogelberg Music by Don Campbell", "source": "Facebook", "date": "2016-04-29T20:00:00-04:00", "url": "https://www.facebook.com/events/930690620345924/"}, {"description": "\"A welcome gearshift\"—Real Detroit Weekly", "name": "The Ben Daniels Band", "source": "Facebook", "date": "2016-04-30T20:00:00-04:00", "url": "https://www.facebook.com/events/530159733818023/"}, {"description": "Genre-crossing jazz virtuosity", "name": "The Julian Lage Trio", "source": "Facebook", "date": "2016-05-02T20:00:00-04:00", "url": "https://www.facebook.com/events/1650789915178155/"}, {"description": "An American master of solo songwriting and blues", "name": "Chris Smither", "source": "Facebook", "date": "2016-05-06T20:00:00-04:00", "url": "https://www.facebook.com/events/986462064751963/"}, {"description": "Vocalist and composer Carla Cooke is the youngest daughter of the legendary Sam Cooke, whose musical life encompassed religion, romance, and history. Carla’s career mirrors that of her father, in that she crafted her sound in the church. Carla sought not to use her father’s name, but to build her own reputation. Now the younger Cooke knows that her roots are firmly entwined in her father's as she connects with them through his music.\n\nCarla Cooke’s style is diverse in gospel, Christian, R&B, soul, and pop styles. With a strong vocal range and warm personality, Carla shows that the apple doesn't fall far from the tree, as she channels the raw talent, emotion, beauty, and charisma of the Cooke family persona. www.carlacooke.com", "name": "An Evening of Sam Cooke by Daughter Carla Cooke", "source": "Facebook", "date": "2016-05-06T20:00:00-04:00", "url": "https://www.facebook.com/events/919947144747827/"}, {"description": "\"Her songs are about living, breathing people.\"—No Depression", "name": "Lucy Kaplansky", "source": "Facebook", "date": "2016-05-07T20:00:00-04:00", "url": "https://www.facebook.com/events/916584281712332/"}, {"description": "\"Her songs are about living, breathing people.\"—No Depression", "name": "Lucy Kaplansky", "source": "Facebook", "date": "2016-05-07T20:00:00-04:00", "url": "https://www.facebook.com/events/483349811834793/"}, {"description": "FREE\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nIn our ongoing Night School series, UMS looks at the dynamic quality of how social identities are constructed and explored in this season’s artistic program. How do artists’ personal identities inform their work? Do audiences’ own identities shape what they see on the stage?\n\nDrop in to just one session, or attend them all. Events are free, and no preregistration is required.\n\nOur schedule\n\nMonday, January 18 \nThinking about Identity and Performance\n\nMonday, January 25 \nActing and Dancing Identity\n\nMonday, February 1\nConstructing Identity Onstage: An Interview with Taylor Mac and Tanya Tagaq\n\nMonday, February 8 \nConstructing Identity Together: Artists and Audiences\n\nMonday, February 15 \nReflection & Graduation\n\nFull info: http://ums.org/multiperformance/ums-night-school-constructing-identity", "name": "UMS Night School: Constructing Identity", "source": "Facebook", "date": "2016-05-09T20:00:00-04:00", "url": "https://www.facebook.com/events/1679627042325707/"}, {"description": "\"A profound lyricist and respected composer\"—Toronto Star", "name": "Garnet Rogers", "source": "Facebook", "date": "2016-05-13T20:00:00-04:00", "url": "https://www.facebook.com/events/1569905103231931/"}, {"description": "Harmony Bones is a quartet of long-time veterans of the Ann Arbor folk music scene. The band consists of Jeanne Mackey, Tom Voiles, Linda Teaman, and Laz Slomovits. The name Harmony Bones comes from an acupuncture point that harmonizes imbalances and promotes clear thinking, seeing, and hearing.\nJeanne, Tom, Linda and Laz have joined forces to explore a wide range of traditional, contemporary and original folk songs. Rich vocal harmonies and an array of instruments -- guitar, mandolin, flute, pennywhistle, fiddle, banjo, percussion, sitar -- combine to make Harmony Bones.\nSinger/songwriter Jeanne Mackey offers a blend of emotional intensity, wry humor, and global consciousness. In addition to original tunes, her repertoire ranges from Dar Williams to Patsy Cline, from Pete Seeger to Irving Berlin. A seasoned guitarist, she draws on a variety of styles -- folk, classic swing, funky blues, and more -- with the occasional sprinkle of mandolin, accordion, or banjo. Mackey rocked the 1970s East Coast topical music circuit as a young musician advocating feminist values and social justice.  In 2010, Mackey created \"Drop The Knife: A Memoir-in-Song,\" an evening of original songs and stories exploring the meaning of homeland, curses, death, and magic.\nLinda Teaman and Tom Voiles do much of their singing and playing with Nutshell, an Ann Arbor-based Celtic roots band. Nutshell plays for contra-dances and performs at festivals across North America.\nLinda is a singer who brings depth of understanding, warmth and sensitivity to the music. In 2005, her graduation recital for a degree in k-12 choral music had her singing in five languages, encompassing musical forms such as Irish sean nos singing and Italian and German arias by composers Purcell, Mozart and Brahms. She leads the Rudolf Steiner Community Singers, a small choir that sings uncommon Christmas and seasonal songs of celebration.  She hopes you'll forgive her classical background and that she is redeemed by her love of folk music.  In addition to vocals, she adds light percussion to the mix.\nTom consumes a well-rounded musical diet that ranges from Celtic to Indian to rock and roll. He enjoys mixing different styles while maintaining a respect for the traditions from which they spring. Tom has studied North Indian Classical music, Moroccan folk drumming and western classical flute. He has worked with performance artists, dancers, mimes and poets, including Hosain Mosavat, Gerry the Fool, Matthew Smith, ML Liebler and the Magic Poetry Band.\nLaz Slomovits is one of the twin brothers in Ann Arbor’s nationally-known children’s music duo, Gemini. A fine singer and multi-instrumentalist, Laz is starting his 4nd year playing music. His songs are featured in songbooks used by music teachers throughout the country, and Gemini's recordings have won numerous awards. In addition, Laz has had a notable solo career. In his solo work, Laz is best known for his powerful musical settings of the poetry of ancient Sufi mystics Rumi and Hafiz, as well as that of contemporary American poets.", "name": "Harmony Bones at Green Wood Coffee House", "source": "Facebook", "date": "2016-05-13T20:00:00-04:00", "url": "https://www.facebook.com/events/1637106023218709/"}, {"description": "The ears and eyes of America!", "name": "The Corn Potato String Band", "source": "Facebook", "date": "2016-05-15T19:30:00-04:00", "url": "https://www.facebook.com/events/1080836985282330/"}, {"description": "Grammy winner Pat Donahue is one of the most popular finger pickers in the world. His musical tastes are eclectic. Though he considers himself foremost a folk guitarist, Pat’s influences are rooted in bluesmen Blind Blake, Robert Johnson, Duke Ellington, Muddy Waters and Miles Davis.\nHaving been a songwriter and guitarist for twenty years for the “Guys All Star Shoe Band” of Minnesota Public Radio’s “A Prairie Home Companion,” Pat got to show off his savvy licks and distinctive original songs to millions of listeners each week. After wrapping up this impressive longterm gig, Pat now turns to full time concert touring, presenting master guitar workshops and attending prestigious music camps. www.patdonahue.com", "name": "Pat Donahue at Green Wood Coffee House", "source": "Facebook", "date": "2016-05-20T20:00:00-04:00", "url": "https://www.facebook.com/events/148870615480384/"}, {"description": "\"The best live performer I've ever seen\"—John Mayer", "name": "Martin Sexton", "source": "Facebook", "date": "2016-05-21T20:00:00-04:00", "url": "https://www.facebook.com/events/200517660293245/"}, {"description": "Our May Artists' Meet & Greet topic is \nHow to Submit Your Artwork to a Show or Gallery. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "name": "How to Submit Your Artwork to a Show or Gallery", "source": "Facebook", "date": "2016-05-25T18:00:00-04:00", "url": "https://www.facebook.com/events/1176167649079840/"}, {"description": "Finding the point where blues and the jam bands meet", "name": "Nick Moss", "source": "Facebook", "date": "2016-05-26T20:00:00-04:00", "url": "https://www.facebook.com/events/1513930968936295/"}, {"description": "New voices from Michigan and Chicago", "name": "Chris DuPont & Frances Luke Accord", "source": "Facebook", "date": "2016-06-04T20:00:00-04:00", "url": "https://www.facebook.com/events/483627578508260/"}, {"description": "Virtuoso bluegrass and roots sounds from Washtenaw County", "name": "Thunderwüde", "source": "Facebook", "date": "2016-06-09T20:00:00-04:00", "url": "https://www.facebook.com/events/987088328046526/"}, {"description": "A direct link to the early days of folk and the blues", "name": "Josh White Jr.", "source": "Facebook", "date": "2016-06-10T20:00:00-04:00", "url": "https://www.facebook.com/events/1698056820481625/"}, {"description": "October Project's lead vocalist returns", "name": "Mary Fahl", "source": "Facebook", "date": "2016-06-11T20:00:00-04:00", "url": "https://www.facebook.com/events/927935930621496/"}, {"description": "Our June Artists' Meet & Greet topic is Legal Issues for Artists. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "name": "Legal Issues for Artists", "source": "Facebook", "date": "2016-06-29T18:00:00-04:00", "url": "https://www.facebook.com/events/527954430710284/"}, {"description": "Newfound Road's amazing lead vocalist steps out with music by Jackson Browne and more. This show has been rescheduled from June 16.", "name": "Tim Shelton", "source": "Facebook", "date": "2016-07-10T19:30:00-04:00", "url": "https://www.facebook.com/events/1124052387614735/"}, {"description": "There are songs that transport you to good times remembered. Songs like, “I’d Really Love To See You Tonight,” “Nights Are Forever Without You,” and, “Love Is The Answer” have that effect on many of us. These songs and numerous others have made John Ford Coley a singing legend.\nJohn is most revered as half of the duo England Dan and John Ford Coley. The classically-trained pianist and talented guitarist continues performing the gold and platinum record hits for audiences around the world. Some of Coley’s other hits are, “Gone Too Far,” “We’ll Never Have To Say Goodbye Again,” and, “Sad To Belong.\"\nJohn’s experiences comprise a broad background. Although he performed throughout high school and college as a classical and rock pianist, he chose to major in English Literature in college, and is an avid student of history. In the mid-1980’s, John began acting in television and in feature films. He recently penned a book, \"Backstage Pass,\" about his years in the music industry.\nwww.johnfordcoley.com", "name": "John Ford Coley at Green Wood Coffee House", "source": "Facebook", "date": "2016-09-09T20:00:00-04:00", "url": "https://www.facebook.com/events/1675656812706888/"}, {"description": "At Woodstock, as a New York kid barely known outside the coffeehouse circuit in Greenwich Village, she sang her song, \"Beautiful People\" and inspired the first panorama of candles and cigarette lighters ever raised at a concert event. That, in turn, moved the young singer to write \"Lay Down (Candles in the Rain\"), which sold more than one million copies in 1970 and prompted Billboard, Cashbox, Melody Maker, Record World, and Bravo to anoint her as female vocalist of the year. Her single, \"Brand New Key,\" topped the charts in 1971.\nWith guitar in hand and a combination of amazing vocal talent, disarming humor, and a vibrant engagement with life, she was booked as the first solo pop/rock artist ever to appear at the Royal Albert Hall, Carnegie Hall, and the Metropolitan Opera House, and later opened the New Metropolitan Opera House in New York, the Sydney Opera House, and in the General Assembly of the United Nations, where she was invited to perform on many occasions as delegates greeted her performances with standing ovations.\nThe top television hosts of all time -- Ed Sullivan, Johnny Carson, and Dick Cavett -- battled to book her.\nUNICEF made her its spokesperson; Jimi Hendrix's father introduced her to the multitude assembled for the twentieth anniversary of Woodstock. Her records continued to sell -- more than eighty million to date. She's had her songs covered by singers as diverse as Cher, Dolly Parton, and Macy Gray. She's raised a family, won an Emmy, opened a restaurant, and written a musical about Wild Bill Hickok and Calamity Jane.\nThis is a rare opportunity to experience Melanie live and in person in an intimate venue. Don't miss it!\nwww.melaniesafka.com", "name": "Melanie at Green Wood Coffee House", "source": "Facebook", "date": "2016-09-16T20:00:00-04:00", "url": "https://www.facebook.com/events/1653085994944878/"}, {"description": "THIS EVENT HAS BEEN POSTPONED TO LATER IN THE POLITICAL SEASON.  PLEASE CHECK OUT THE NEW NOVEMBER 1ST PROGRAM, \"JOKES IN PROCESS\" THAT WE HAVE PUT INTO ITS PLACE.  \n\nThe presidential candidates have been HILARIOUS this year, but now let's see how the professionals do.\nJoin the Emergent Art's Theater and the UnClub as they present \"UnDebateable, the UnPresidential Debates\".\n\nIf you would like to be a part of this historic event, either as a moderator, an interview, and audience reporter, or an actual campaign spokeperson, or if you can do an impression of a candidate, please click the 'Going' button.  If you can't commit, but you are interested in following this event, click 'Maybe' and we will keep you informed.\n\nWe are also looking for folks who can help us stream a webcast of this event.\n\nWant to be a sponsor?  We'll take that too.", "name": "UnDebateable, the UnPresidential Debates - Clown Car to the White House", "source": "Facebook", "date": "2016-09-18T21:00:00-04:00", "url": "https://www.facebook.com/events/1690454564522707/"}, {"description": "Lou and Peter Berryman were both raised in Appleton, WI, and began playing music together in high school during the sixties. During the following nomadic decade, Lou studied classical voice and music theory in college while Peter continued an unfocused fascination with surrealist art, beatnik poetry, and jug band music. Early influences of American and British musical comedy and folk music fed a growing repertoire of original songs. A brief marriage in the early seventies resolved into a lifelong friendship, and by the late seventies and early eighties the two were honing their skills playing regular weekly concerts in Madison, becoming full-time musicians and songwriters in 1979. During those early years they wrote new songs every week, many about the history, cheese, beer and strange politics of their home state. By the mid '80s they were traveling all across the country, still writing and singing, but now with a broader perspective, finding that the quirks of their home state were not so much Midwestern as human. In twenty-five years of performing together, Lou and Peter have released twenty albums and four songbooks worth of hilarious, quirky, yet oddly profound songs, rich with word play and interesting images. Pete Seeger, Tom Paxton and Tom Lehrer count themselves among their fans. Their work has appeared in numerous compilations such as the popular \"Rise Up Singing\" songbook, in periodicals like \"SING OUT! Magazine\", and in many audio compilations. Berryman songs are being sung around the world by a legion of professional musicians including Peter, Paul and Mary, Garrison Keillor and Peggy Seeger. They have appeared numerous times on such national programs as NPR's \"A Prairie Home Companion\" and \"Weekend Edition.\"\nwww.louandpeter.com", "name": "Lou and Peter Berryman at Green Wood Coffee House", "source": "Facebook", "date": "2016-10-07T20:00:00-04:00", "url": "https://www.facebook.com/events/964923176923370/"}, {"description": "lauriemcclain.com", "name": "Laurie McLain at Green Wood Coffee House", "source": "Facebook", "date": "2016-10-14T20:00:00-04:00", "url": "https://www.facebook.com/events/197527007266742/"}, {"description": "There is no better storyteller than Chuck Brodsky.  Ranging from poignant to hilarious, his songs are about the little things in the lives of everyday people.  Chuck's soulful and compassionate voice brings his characters to life, and is the perfect instrument for infusing his lyrics with heartfelt humanity or biting wit. His spoken introductions to his songs can be as spellbinding as his colorful lyrics, which he brings to life with a well-travelled voice and a delivery that's natural and conversational. His groove-oriented strumming and fingerpicking draw on influences from the mountains of western North Carolina where he now lives, and from lots of different good old traditional folk stuff of all kinds. Chuck is widely known for his many wonderful songs about the heroes -- and zeroes -- of baseball. His latest CD is The Baseball Ballads 2.\nwww.chuckbrodsky.com", "name": "Chuck Brodsky at Green Wood Coffee House", "source": "Facebook", "date": "2016-10-28T20:00:00-04:00", "url": "https://www.facebook.com/events/147078752335941/"}, {"description": "http://www.donhenry.com/", "name": "Don Henry at Green Wood Coffee House", "source": "Facebook", "date": "2016-11-18T20:00:00-05:00", "url": "https://www.facebook.com/events/1513216465641630/"}]