[{"url": "https://www.facebook.com/events/200524000286839/", "description": "Michigan barrel-aged tap takeover is the best way to kick off the New Year! We will tap all of the following beers at 10 AM and will serve them until we run out!\n\nFounders 2014 KBS, American Double / Imperial Stout |  11.20% ABV \nFounders 2014 CBS, American Double / Imperial Stout, 10.60% ABV \nFounders Backwoods Bastard, Scotch Ale / Wee Heavy, 11.60% ABV \nSietsema's Bourbon Barrel Cider, 6.9% ABV\nNew Holland Pilgrim's Dole, Wheatwine, 12.00% ABV \nNew Holland Woodsman, American Pale Ale (APA), 4.40% ABV \n\nPlus we will be raffling off Bell's Black Note!\nAll raffle proceeds will benefit the Detroit Children's Choir.", "date": "2016-01-01T10:00:00-05:00", "source": "Facebook", "name": "Michigan Barrel-Aged Tap Takeover"}, {"url": "https://www.facebook.com/events/996226863777093/", "description": "You know what Michigan football means: $2 pours of Premium Lager. Kickoff is at 1 pm -- get here and cheer on the Wolverines! Or...the Gators, we guess...", "date": "2016-01-01T13:00:00-05:00", "source": "Facebook", "name": "New Years Day: Watch the Citrus Bowl at Wolverine State!"}, {"url": "https://www.facebook.com/events/1077254918992990/", "description": "An incredibly playful group of adults who hope to one day grow up to be kids. What more could you want for a Friday night? Throw in a brewed-on-site craft beer, and you are all set!", "date": "2016-01-01T20:00:00-05:00", "source": "Facebook", "name": "Pointless Improv with Future Kids and Julene"}, {"url": "https://www.facebook.com/events/543557505808163/", "description": "Looking for some family-friendly programming? Come to the Little Peeps PlayGround: part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additonal children $5 each). Parents are free!", "date": "2016-01-02T10:30:00-05:00", "source": "Facebook", "name": "Little Peeps PlayGround - \"Friendship\""}, {"url": "https://www.facebook.com/events/1686345871611884/", "description": "Reclassify Pluto is a long form improv troupe whose form is a combination of heavy character based scenes and duologs. \n\nPointless Improv shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. No two shows are the same!", "date": "2016-01-02T20:00:00-05:00", "source": "Facebook", "name": "Pointless Improv with Reclassify Pluto and Anna & Andy"}, {"url": "https://www.facebook.com/events/182457038775930/", "description": "Reclassify Pluto is a long form improv troupe whose form is a combination of heavy character based scenes and duologs.\n\nPointless Improv shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. No two shows are the same!", "date": "2016-01-02T22:30:00-05:00", "source": "Facebook", "name": "Pointless Improv with Anna & Andy and Reclassify Pluto"}, {"url": "https://www.facebook.com/events/928153350595881/", "description": "**NOTICE: Due to Espresso Royale-State St. Ann Arbor's holiday hours (they close at 8pm), we will be starting the slam exactly 1 HOUR EARLIER. This means that doors open at 5:30, and the slam will start at 6pm. Come early, and let everyone know!\n\nWe meet up every week, but only put on a show 1st and 3rd Sundays in our new home at Espresso Royale on State St, and at our new time of 7pm**!\n\nThis is an ancient, yet fresh and timeless experience: you, a stage, and everything you need to say for an audience who is ready to hear it. Bring yourself, bring your story, and we'll bring the love.\n\nFREE [$5 Suggested Donation]\n\nMORE ABOUT THE EVENT:\n\nSign-up to perform at 6:30; the list fills up, so get there early to guarantee a spot. The Open Mic starts at 7pm, and the Slam starts whenever the open session ends. \n\nA maximum of 10 poets compete each week [spots are guaranteed for the first 8 slammers to arrive], the final two have to work for it. All poets who get into the Slam earn points qualifying toward the City Finals in April, and a chance to be one of four poets to represent Ann Arbor at the National Poetry Slam in August 2016, in Atlanta, Georgia. Poems must be the performer's original work. Come prepared with two poems [one if you're just doing the open mic], and keep it around three minutes or less. No costumes or props are allowed (unless otherwise specifically stated for themed events). See you there!", "date": "2016-01-03T17:30:00-05:00", "source": "Facebook", "name": "Ann Arbor Poetry Open Mic & Slam: First of the Year!"}, {"url": "https://www.facebook.com/events/554436011387170/", "description": "The acoustic piano trio made up of bassist and former Community High School student Perrin Grace, pianist Addison Frei and drummer Matt Young returns to Kerrytown Concert House for a CD release event, this time joined by vocalist Tahira Clayton.  They will perform selections from their latest album along with some of their favorites from the Great American Songbook.\n\nThe group released their new album m(y)our world on November 6th, 2015 along with a YouTube video series by Snarky Puppy video director Andy Laviolette. Since its release, m(y)our world has received international radio play, has been featured in the top 50 of the JazzWeek radio charts and been reviewed by Drummer Magazine, Midwest Record and JazzWeekly As of late the trio has performed at notable venues the Velvet Note, a 2015 DownBeat Great Jazz Venue in Alpharetta, GA and ShapeShifter Lab in Brooklyn, New York.\n\nAMP Trio made its start in Denton, TX in 2012.  After releasing their debut album “Flow” the group went on several tours in the United States and Canada.  Their sound became sought after by New York City trumpeter John Raymond for a series of live performances with saxophonists Tim Green and Quamon Fowler.  AMP Trio is the rhythm section on Spenser Liszt’s “Until Further Notice” and Aaron Hedenstrom’s “A Moment of Clarity.”  The group was invited to the 2014 Steans Institute at Ravinia Residency Program. Each member of AMP Trio has participated in the Jason Moran directed residency program Betty Carter Jazz Ahead.\n\nFor news on AMP Trio visit www.facebook.com/amptriomusic or www.amptrio.com", "date": "2016-01-03T19:00:00-05:00", "source": "Facebook", "name": "AMP Trio featuring Tahira Clayton"}, {"url": "https://www.facebook.com/events/1009094692467523/", "description": "Sunday nights we open the stage to the many artists in our community. Do you play music, write poetry, dance, act, do standup or have another performance style? Then sign up for a slot to share this gift with other artists and arts-appreciators in our community. \n\nFree for performers, pay-what-you-can for spectators.", "date": "2016-01-03T19:00:00-05:00", "source": "Facebook", "name": "Open Stage"}, {"url": "https://www.facebook.com/events/723692684397559/", "description": "Literati is thrilled to welcome Thomas Lynch, in support of the anthology The Good Book: Writers Reflect on Favorite Bible Passages, edited by Andrew Blauner.\n\nIn The Good Book: Writers Reflect on Favorite Bible Passages, with an introduction by Adam Gopnik, veteran anthologist Andrew Blauner collects new pieces by writers from many different faiths and ethnicities including literary fiction writers (Colm Tóibín, Edwidge Danticat, Tobias Wolff, Rick Moody); bestselling nonfiction writers (A.J. Jacobs, Ian Frazier, Thomas Lynch); notable figures in the media (Charles McGrath, Cokie Roberts, Steven V. Roberts); and social activists (Al Sharpton, Kerry Kennedy). While these contributors are not primarily known as religious thinkers, they write intelligently and movingly about specific passages in the Bible that inform the way they live, think about past experiences, and see society today. Some pieces are close readings of specific passages, some are anecdotes from everyday life, and all will inspire, provoke, or illuminate.\n\nAddressing some of the best-known and best-loved characters and stories from Genesis to Revelation, The Good Book will be a beautiful, enlightening gift for secular readers and readers of faith as well as a collection of interest to reading groups, readers of creative nonfiction and personal essays, and fans of each of the individual contributors.\n\n\"What a marvelous book of encounters and revelations! These writers raise questions that are age-old, yet utterly contemporary, pressing, thoughtful, eternal.\"\n\n—Edward Hirsch\n\n\"Each of these thoughtful and beautifully written pieces sheds new light on one of the world's oldest and most influential books. People of all faiths will find common ground within these pages.\"\n\n—Reza Aslan, author of No god but God and Zealot: The Life and Times of Jesus of Nazareth\n\n\"It's the Sunday School class you've been waiting for, the one whose members have thought hard about the texts and are free to say what they think. The one you look forward to. God bless the Word.”\n\n—Garrison Keillor\n\nThomas Lynch is a funeral director and writer.  He is the author of five collections of poems and three collections of essays including The Undertaking, which won The American Book Award, The Heartland Prize and was a finalist for the National Book Award.  Apparition and Late Fictions – A Novella and Stories, was published in 2010 to critical acclaim.  His work has been the subject of two documentary films: the PBS Frontline film of “The Undertaking,” broadcast nationwide in 2007, won the 2008 Emmy Award for Arts & Culture Documentary; and Cathal Black’s film, “Learning Gravity,” aired in the UK and Ireland.  Mr. Lynch has taught with Wayne State University Department of Mortuary Science, with the graduate program in writing at University of Michigan and the Candler School of Theology at Emory University.  His most recent book, The Good Funeral -- Death, Grief and the Community of Care, was co-authored with the theologian, Thomas G. Long.   Thomas Lynch keeps homes in Michigan and in Moveen, Co. Clare, Ireland.", "date": "2016-01-04T19:00:00-05:00", "source": "Facebook", "name": "Thomas Lynch"}, {"url": "https://www.facebook.com/events/179676072386212/", "description": "Every Sunday Aventura is La Familia Industry Night because when you work in the industry we are all family. We offer specials for all of our family in the industry from 8:00 PM to midnight.\n\nDrink Specials include:\nOTOÑO\nblood orange, sage, angostura, beefeater gin\n$5 special for La Familia\n\nDale's Pale Ale or Estrella with shot of Bulleit bourbon \n$5 special for La Familia", "date": "2016-01-04T20:00:00-05:00", "source": "Facebook", "name": "La Familia Industry Night"}, {"url": "https://www.facebook.com/events/1709152499298477/", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "date": "2016-01-05T10:00:00-05:00", "source": "Facebook", "name": "Story Time with Ieva"}, {"url": "https://www.facebook.com/events/942375365838618/", "description": "Literati is pleased to welcome Rebecca Scherm back to the store in support the paperback release of her acclaimed novel Unbecoming.\n\nIn a grubby antiques shop on the outskirts of Paris, Grace restores bric-a-brac, mends teapots, re-sets gems. She calls herself Julie, says she’s from California, and slips back to a rented room at night. From an anonymous internet café, she checks the website of her hometown paper.  Back in Garland, Tennessee, two young men are about to be paroled.   Both have served time for a crime about which Grace knows a great deal.   Their daring escapade  went bad, but not before Grace made it onto a plane — contraband in her carry-on —  and began methodically  disassembling the known facts of her life.  Now she knows that somehow, a piece of her past will find her. As the story  unfolds, taking us from small-town USA to the heights and depths of the art scene in New York and Europe, we learn who Grace has been: a girl with a messy, broken home life and a knack for making herself loveable– until she comes face to face with what she actually wants, and everything falls apart.   And so begins a cat-and-mouse waiting game, a tale of lies and deception, desperate stakes and dual identities.\n\nMesmerizing, atmospheric, and psychologically nuanced, Unbecoming reinvents the heist plot and takes up the making of a femme fatale—this time, from a woman’s point of view.\n\n“From the first page, you know Rebecca Scherm is the real thing. Unbecoming is an assured exploration of the intricate, intense, risky processes that go into creating identity—and into dismantling it.”\n\n—Tana French\n\n“Rebecca Scherm’s extraordinarily confident voice and style, this novel’s depth of detail—great characters and a terrifically engaging plot—are a sheer delight to read. There is something very fresh and captivating about this book, and best of all I had no idea what was going to happen from one page to the next.”\n\n—Kate Atkinson\n\n“Some characters who go bad find that it’s against their nature, and some who go bad discover that dishonesty is the central truth about themselves. Rebecca Scherm’s wonderful novel Unbecoming has a mesmerizing narrator, Grace, who discovers that her gift (and it is a real gift) is for deceit. A thriller, a psychological study, and a love story, this novel is an unusually intelligent and suspenseful book. The dark arts have rarely been so brightly lit.”\n\n—Charles Baxter\n\nRebecca Scherm is the author of Unbecoming, a novel. She received her MFA from the University of Michigan, where she was also a postgraduate Zell Fellow.  She lives in Michigan, where she is working on her second novel, Beta.", "date": "2016-01-06T19:00:00-05:00", "source": "Facebook", "name": "Rebecca Scherm"}, {"url": "https://www.facebook.com/events/772067996231569/", "description": "Join the conversation about sustainability in Ann Arbor! The City of Ann Arbor and the Ann Arbor District Library are hosting the fifth annual Sustainable Ann Arbor series. A think tank of local stakeholders, including community organizations, local government staff, businesses and residents will join the public to discuss local sustainability efforts and challenges in our community.  \n\nThe series will include four events with each focusing on a different element of sustainability from Ann Arbor’s sustainability framework (www.a2gov.org/sustainability). The events will be held 7–8:30 p.m. in the Ann Arbor District Main Library, at 343 S. Fifth Ave., on the first Thursday of January, February, March and April of 2016.\n\nJanuary 7, 2016 – Climate and Energy, including updates on Ann Arbor’s Climate Action Plan, an overview of local climate impacts, and sustainable programs underway at the University of Michigan. Speakers will include:\no   Mike Garfield, Executive Director, Ecology Center\no   Anya Dale, Sustainability Rep, University of Michigan\no   Nathan Geisler, Energy Programs Analyst, City of Ann Arbor\no   Wayne Appleyard, Chair, Ann Arbor Energy Commission            \no   Sean Reed, Executive Director, Clean Energy Coalition", "date": "2016-01-07T19:00:00-05:00", "source": "Facebook", "name": "Climate and Energy Sustainability Forum"}, {"url": "https://www.facebook.com/events/1644402012465837/", "description": "Ann Arbor Civic Theatre presents the beloved Sondheim musical, Company, directed by Rachel Francisco with music direction by Jennifer Goltz-Taylor, January 7-10, 2016 at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109.  Performances are Thursday at 7:30 pm, Friday and Saturday at 8:00 pm, and Sunday at 2:00 pm. Ticket prices are $25 for adults, $22 for seniors, $19 for tickets on Thursday, with students tickets just $13 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St, or at the door.  Additional information is available by visiting www.a2ct.org.  \n\nCompany, the Tony Award-winning 1970 musical with music and lyrics by Stephen Sondheim and book by George Furth, tells the story of bachelor Bobby, his married friends, and several girlfriends, as Bobby faces his 35th birthday.   Some of Sondheim’s biggest hits, including “Being Alive,” “The Ladies Who Lunch,” and “Marry Me a Little,” take Bobby through a contemplation of the responsibility of marriage and monogamy at this turning point in his adulthood.", "date": "2016-01-07T19:30:00-05:00", "source": "Facebook", "name": "COMPANY!"}, {"url": "https://www.facebook.com/events/1688381331432875/", "description": "You haven’t heard “Pinball Wizard” or “People Are Strange” until you’ve heard it played on jugs and “various other sundries.” Jug band music is blues, ragtime, swing and jazz combined in a strange concoction spawned in Loiusville, home of the Juggernaut Jug Band. Jug bands flourished in towns along the Ohio and Mississippi Rivers in the 1920s and 1930s. Today, as then, a jug band is the ultimate party band. The Juggernauts have been featured on the Today Show and radio’s “Dr. Demento Show.” Their current CD isYou Mean We Get Paid For This\nwww.juggernautjugband.com", "date": "2016-01-08T20:00:00-05:00", "source": "Facebook", "name": "Juggernaut Jug Band at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/1649557688666202/", "description": "In this kid friendly workshop, attendees will build a toolbox suitable for holding the tools of a beginning woodworker! A brief discussion on wood and general safety instruction will be followed by use of a rasp, sandpaper, hammer, nails and clamps to assemble your toolbox. \n\nThis is a two hour workshop that repeats on the following Saturdays: \n\nJanuary 9th from 12:30pm to 2:30pm \nFebruary 6th from 12:30pm to 2:30pm \nMarch 5th from 12:30pm to 2:30pm \n\nCost is $40. This includes materials, tools, and instruction for one Toolbox. No prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.", "date": "2016-01-09T12:30:00-05:00", "source": "Facebook", "name": "Beginner's Toolbox Make & Take"}, {"url": "https://www.facebook.com/events/965374846889380/", "description": "Rikki the Golden Retriever loves to have kids read to her according to her owner, special education teacher Shelly Schwartz.  If your child has a difficult time reading outloud in class or reading in general bring them to the store to read to Rikki.  Experience has shown that reluctant readers are more comfortable reading to a dog than to another person. \nOr just bring your kids if they would like to read to Rikki!  \nNicola’s Books is pleased to have Rikki as part of the staff!", "date": "2016-01-09T13:30:00-05:00", "source": "Facebook", "name": "Bring Your Kids to Read to Rikki the Reading Therapy Dog"}, {"url": "https://www.facebook.com/events/141055732930742/", "description": "Tap Room favorite \"The Moxie Strings\" returns on Saturday, January 9th! From the band: \n\"The Moxie Strings is the electrifying combination of fiddler, Diana Ladio, and cellist, Alison Lynn. With their feel-good melodies and foot-stomping, rock-influenced rhythms, this duo has put a fresh, enticing spin on Celtic and Americana music. Diana and Alison often join forces with dynamic drummer and world percussionist, Fritz McGirr, who lends his spirited expertise of traditional music’s percussion component and an engaging rhythmic energy to the show. Though rooted in tradition, The Moxie Strings offer listeners the unique opportunity to experience some of the world’s best known instruments and oldest genres through a young, progressive lens.\"\n\nCheck out their website for more information: http://www.themoxiestrings.com/", "date": "2016-01-09T20:30:00-05:00", "source": "Facebook", "name": "The Moxie Strings at Wolverine State"}, {"url": "https://www.facebook.com/events/179676072386212/", "description": "Every Sunday Aventura is La Familia Industry Night because when you work in the industry we are all family. We offer specials for all of our family in the industry from 8:00 PM to midnight.\n\nDrink Specials include:\nOTOÑO\nblood orange, sage, angostura, beefeater gin\n$5 special for La Familia\n\nDale's Pale Ale or Estrella with shot of Bulleit bourbon \n$5 special for La Familia", "date": "2016-01-10T20:00:00-05:00", "source": "Facebook", "name": "La Familia Industry Night"}, {"url": "https://www.facebook.com/events/446791705531102/", "description": "Literati welcomes Julie Posselt as she launches her title Inside Graduate Admissions: Merit, Diversity, and Faculty Gatekeeping. Joining Julie will be Gloria Thomas, director of the Center for the Education of Women at the University of Michigan, for a post-reading conversation.\n\nHow does graduate admissions work? Who does the system work for, and who falls through its cracks? More people than ever seek graduate degrees, but little has been written about who gets in and why. Drawing on firsthand observations of admission committees and interviews with faculty in 10 top-ranked doctoral programs in the humanities, social sciences, and natural sciences, education professor Julie Posselt pulls back the curtain on a process usually conducted in secret.\n\nInside Graduate Admissions presents admissions from a decision maker’s point of view, including thought-provoking episodes of committees debating the process, interviewing applicants, and grappling with borderline cases. Who ultimately makes the admit list reveals as much about how professors see themselves and each other as it does about how they view students. Professors in these programs say that they admit on merit, but they act on different meanings of the term. Disciplinary norms shape what counts as merit, as do professor’s ideas about intelligence and their aversions to risk, conflict, ambiguity, and change. Professors also say that they seek diversity, but Posselt shows that their good intentions don t translate into results. In fact, faculty weigh diversity in only a small fraction of admissions decisions. Often, they rely upon criteria that keep longstanding inequalities in place.\n\nMore equitable outcomes occur when admissions committees are themselves diverse and when members take a fresh look at inherited assumptions that affect their judgment. To help academic departments promote transparency and accountability, Posselt closes with concrete strategies to improve admissions review.\n\nJulie Posselt is Assistant Professor of Higher Education at the University of Michigan.", "date": "2016-01-11T19:00:00-05:00", "source": "Facebook", "name": "Julie Posselt w/ Gloria Thomas"}, {"url": "https://www.facebook.com/events/780337908747994/", "description": "Monday, January 11, 2016, 7:30 pm\nHill Auditorium\n\nFounded by Sir Thomas Beecham in 1946, the Royal Philharmonic Orchestra made its UMS debut in 1950 and last performed in Hill Auditorium in 1992. This concert features Pinchas Zukerman both at the helm and as the featured soloist. \n\nMore info: http://ums.org/performance/royal-philharmonic-orchestra/", "date": "2016-01-11T19:30:00-05:00", "source": "Facebook", "name": "Royal Philharmonic Orchestra"}, {"url": "https://www.facebook.com/events/1540155739639357/", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "date": "2016-01-12T10:00:00-05:00", "source": "Facebook", "name": "Story Time with Ieva"}, {"url": "https://www.facebook.com/events/147675538928865/", "description": "The Ann Arbor Art Center and LifeinMichigan.com are pleased to present GIG: The Art of Michigan Music. This exhibit features concert photography, gig posters, and shirt designs by twenty Michigan artists of Michigan bands and musicians.\n\nGIG: The Art of Michigan Music is designed to give patrons the immersive experience of the diverse Michigan music scene from promotion to performance. All of the artwork will be on sale and is sure to please music fans as well as art lovers.\n\nJOIN US FOR THE OPENING RECEPTION AT THE 117 GALLERY ON FRIDAY, JANUARY 15, FROM 6PM – 9PM. A DJ WILL SPIN MICHIGAN MUSIC AND BEER FROM DARK HORSE BREWING WILL BE AVAILABLE.\n\nArtists: Mark Arminski, Chris Beata, Scott Boyink, Emilo Cardiel, Chopper, Doug Coombe, Tony Fero, Jen Harley, Luke Jackson, Coe Lacy, Carl Lundgren, Chuck Marshall, Mick McDonald, Jena McShane, Robert Nixon, Joe Orlando, Steve Sergent, Alyssa Shirkey, Chole Songalewski, Jeremy Wheeler\n\n-------------------------------------------------------------------------------------\n\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC", "date": "2016-01-15T18:00:00-05:00", "source": "Facebook", "name": "GIG: THE ART OF MICHIGAN MUSIC"}, {"url": "https://www.facebook.com/events/1686886398191682/", "description": "Literati welcomes Richard Polt in support of his book The Typewriter Revolution. Joining Richard will be representatives from our friends at Harlequin Creature, a hand-typed literary journal.\n\nWhat do thousands of writers, makers, kids, poets, artists, steampunks, hipsters, activists, and musicians have in common?  They love typewriters--the magical, mechanical contraptions that are enjoying a surprising second life in the 21st century.  The Typewriter Revolution documents the movement and provides practical advice on how to choose a typewriter, care for it, and use it--from National Novel Writing Month to letter-writing socials, from type-ins to typewritten blogs, from custom-painted typewriters to typewriter tattoos. The book features the experiences and creations of leaders of the 21st-century typewriter revival, including artists such as L.A. Marler, Keira Rathbone, and Tim Youd; street typists such as Typewriter Rodeo, Poems While You Wait, and Jacqueline Suskin; and the bloggers of the Typosphere.\n\nAuthor Richard Polt is the creator of The Classic Typewriter Page and editor of the typewriter magazine ETCetera.", "date": "2016-01-15T19:00:00-05:00", "source": "Facebook", "name": "Richard Polt: The Typewriter Revolution"}, {"url": "https://www.facebook.com/events/442595582613364/", "description": "Adapted and directed by Kelly Joyce Fielder, Sedna is an Inuit tale brought to life - all within the magic of a pillow fort.  Storytelling and puppetry unite bringing to life the ancient tale of the goddess of the sea and creating a thoroughly unique theatre experience. Join us within the pillow fort and underneath the stars to hear the intriguing tale of Sedna. Special guest Spinning Dot Theatre brings this original family-friendly production to Pointless.", "date": "2016-01-16T10:30:00-05:00", "source": "Facebook", "name": "Sedna: An Inuit Legend"}, {"url": "https://www.facebook.com/events/1390235697944662/", "description": "Sat. January 16 | 9pm | 18+ | $14 Cover\n\nChrome Sparks is the solo project of Jeremy Malvin, a Brooklyn transplant from Pittsburgh by way of Ann Arbor. In 2014, after having self released a small handful of singles and two EPs on Bandcamp, Malvin signed to the taste making Sydney based label Future Classic. Under the new label, he rereleased Sparks EP and released the Goddess EP. His next EP, Parallelism is slated to be released with Future Classic on November 6.\n\nInspired by a background in classical percussion and an obsession with synthesizers, Malvin creates dazed, melodic beat-centric tunes that loosely hang between down-tempo head nodders and up-tempo club bangers. FADER has described his music as ‘form-shifting beats [that] seem to resonate with spaced-out chillers and hyperactive party kids alike’.\n\nIn 2012, while on Warped Tour as the drummer for Stepdad, Malvin released the slow burning, bass heavy single “Marijuana” on a Bandcamp compilation highlighting music from he and his friends in Ann Arbor. It quickly rocketed to #1 on Hype Machine and has since become an internet-stoner anthem. It has subsequently been rereleased by Future Classic and Kitsuné.\n\nHis upcoming release, Parallelism, was made using sounds from three analog synthesizers, vocal samples from friends, and a tambourine.\n\nWSG: Moon Diagrams - https://soundcloud.com/geonorth/moon-diagrams-scratch-the-snow-edit\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/578", "date": "2016-01-16T21:00:00-05:00", "source": "Facebook", "name": "Chrome Sparks w/ Moon Diagrams 1/16/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1657867854492206/", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "date": "2016-01-17T11:00:00-05:00", "source": "Facebook", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/1092767804120832/", "description": "This is Nicola’s Books first winter Local Authors Event where we can showcase local authors to the community.  By bringing multiple authors together we hope to bring in a larger crowd to give the authors more exposure and help get the word out about their creative works.", "date": "2016-01-17T14:00:00-05:00", "source": "Facebook", "name": "Nicola's Books Winter Local Author Event with Mary Koral, Marilyn Churchill and Chris Lord"}, {"url": "https://www.facebook.com/events/179676072386212/", "description": "Every Sunday Aventura is La Familia Industry Night because when you work in the industry we are all family. We offer specials for all of our family in the industry from 8:00 PM to midnight.\n\nDrink Specials include:\nOTOÑO\nblood orange, sage, angostura, beefeater gin\n$5 special for La Familia\n\nDale's Pale Ale or Estrella with shot of Bulleit bourbon \n$5 special for La Familia", "date": "2016-01-17T20:00:00-05:00", "source": "Facebook", "name": "La Familia Industry Night"}, {"url": "https://www.facebook.com/events/1657867854492206/", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "date": "2016-01-18T11:00:00-05:00", "source": "Facebook", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/1161100170586702/", "description": "Peter Ash came home from the wars in Iraq and Afghanistan with only one souvenir: what he calls his white static, the buzzing claustrophobia due to post-traumatic stress that has driven him to spend a year roaming in nature, sleeping under the stars. But when a friend from the Marines commits suicide, Ash returns to civilization to help the man's widow with some home repairs. Under her dilapidated porch, he finds more than he bargained for...\n\nNicholas Petrie received his MFA in fiction from the University of Washington, won a Hopwood Award for short fiction while an undergraduate at the University of Michigan, and his story “At the Laundromat” won the 2006 Short Story Contest in the The Seattle Review, a national literary journal. A husband and father, he runs a home-inspection business in Milwaukee. The Drifter is his first novel.", "date": "2016-01-18T19:00:00-05:00", "source": "Facebook", "name": "Meet U of M Graduate Nicholas Petrie for a Discussion and Signing of His Debut Novel, 'The Drifter'"}, {"url": "https://www.facebook.com/events/849241661863515/", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "date": "2016-01-19T10:00:00-05:00", "source": "Facebook", "name": "Story Time with Ieva"}, {"url": "https://www.facebook.com/events/1657867854492206/", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "date": "2016-01-20T11:00:00-05:00", "source": "Facebook", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/1604747733142781/", "description": "Wednesday, January 20, 2016, 7:30 pm\nHill Auditorium\n\n“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas) Since 1988, Wynton Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, sophisticated to spirited, it’s all sheer jazz perfection — no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/1516-jazz-at-lincoln-center-orchestra/", "date": "2016-01-20T19:30:00-05:00", "source": "Facebook", "name": "Jazz at Lincoln Center Orchestra with Wynton Marsalis"}, {"url": "https://www.facebook.com/events/1620983154780471/", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "date": "2016-01-21T19:30:00-05:00", "source": "Facebook", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show"}, {"url": "https://www.facebook.com/events/1620983154780471/", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "date": "2016-01-22T19:30:00-05:00", "source": "Facebook", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show"}, {"url": "https://www.facebook.com/events/1453480484950039/", "description": "Friday, January 22, 2016, 8:00 pm\nRackham Auditorium\n\nThe Chamber Music Society of Lincoln Center presents chamber music of every instrumentation, style, and historical period. The six musicians performing in this concert include violinist Benjamin Beilman, an Ann Arbor native whose career has been burnished by a series of major awards recognizing his extraordinary musical talent. \n\nMore info: http://ums.org/performance/chamber-music-society-of-lincoln-center", "date": "2016-01-22T20:00:00-05:00", "source": "Facebook", "name": "Chamber Music Society of Lincoln Center"}, {"url": "https://www.facebook.com/events/1452156068412417/", "description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "date": "2016-01-22T20:00:00-05:00", "source": "Facebook", "name": "Young Jean Lee Theater Company: Straight White Men"}, {"url": "https://www.facebook.com/events/1657867854492206/", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "date": "2016-01-23T11:00:00-05:00", "source": "Facebook", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/1452156068412417/", "description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "date": "2016-01-23T20:00:00-05:00", "source": "Facebook", "name": "Young Jean Lee Theater Company: Straight White Men"}, {"url": "https://www.facebook.com/events/643718722398474/", "description": "Sat. January 23 | 9pm | 18+ | $15 Cover\n\nMatthew Dear - Depending on whom you ask, Matthew Dear is a DJ, a dance-music producer, an experimental pop artist, a bandleader. He co-founded both Ghostly International and its dancefloor offshoot, Spectral Sound. He’s had remixes commissioned by The XX, Charlotte Gainsbourg, Spoon, Hot Chip, The Postal Service, and Chemical Brothers; He’s made mixes for Get Physicals Body Language and Fabric mix series. He maintains four aliases (Audion, False, Jabberjaw, and Matthew Dear), each with its own style and distinct visual identity. He straddles multiple musical worlds and belongs to none and he’s just hitting his stride.\n\nMatthew Dear’s 2003 full-length debut, Leave Luck to Heaven, is a suite of sparse, wickedly funky house laced with Dear’s deep, distinctive vocals, and includes the much-loved single Dog Days (voted one of Pitchforks Top 100 Songs of the Decade). The record was met with rapturous acclaim from both the dance-music establishment and the critical press, including a four-star review in Rolling Stone. The 2007 follow-up, Asa Breed, is a considerable departure from Heavens dancefloor excursions, incorporating the polyrhythms of Afrobeat, the irreverent pop sensibilities of Brian Eno, and the austere beauty of Krautrock. More four-stars reviews followed, and Dear subsequently began touring with a live three-piece band, Matthew Dear’s Big Hands, in which Dear acted as frontman, commanding the stage with a Bryan Ferry-like swagger and a gentlemans grace.\n\n2010 saw the release of Dear’s watershed third album, Black City, a darkly playful sound-world that envelops the listener like the arms of a malevolent lover. Black City was met with near-unanimous critical praise, earning top marks from Mojo, Uncut, Q, URB, and the Village Voice, ending up on countless year-end lists, and earning Pitchfork’s coveted Best New Music nod. A worldwide tour followed, in which Dear and a newly expanded band continued to hone their live chops with vicious focus.\n\nMatthew Dear’s latest full-length, 2012’s Beams, is both a drastic departure from and worthy successor to Black City’s gothic masterwork. A suite of weird, wild, and queasily optimistic rhythm-driven pop songs, Beams is the latest chapter in the continuing evolution of one of music’s most fascinating minds. After over a decade of exploring pops outer limits, Matthew Dear now inhabits a rarified corner of the musical universe: no longer tethered to any one genre, respected by his peers, and blessed with a bottomless well of creative energy. Now is Matthew Dear’s moment, and it sounds like nothing else.\n\nOn stage, Matthew Dear performs with a multi-pieced live band, unraveling the tightly wound album tracks into kaleidoscopic walls of sound. They have supported Interpol, Hot Chip and Depeche Mode on their world tours, and have performed sold-out shows from London to New York City.", "date": "2016-01-23T21:00:00-05:00", "source": "Facebook", "name": "Matthew Dear (DJ Set) 1/23/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1665558407060284/", "description": "America's single bloodiest day was at the Battle of Antietam, and Michigan played a prominent role. Discover the state's connections to the Lost Order, one of the Civil War's greatest mysteries. Explore George A. Custer's role as a staff officer in combat. Mourn the extraordinary losses Michiganders suffered, including one regiment losing nearly half its strength at the epicenter of the battle. The Wolverine State's contributions to secure the Union and enable the Emancipation Proclamation are vast and worthy of a monument on the battlefield. Authors Jack Dempsey and Brian James Egen provide research and analysis that shed new insights on the role of Michigan soldiers and civilians during the epic struggle.", "date": "2016-01-24T15:00:00-05:00", "source": "Facebook", "name": "Meet Authors Jack Dempsey & Brian James Egen for a Discussion & Signing of 'Michigan at Antietam'"}, {"url": "https://www.facebook.com/events/1620983154780471/", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "date": "2016-01-24T19:30:00-05:00", "source": "Facebook", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show"}, {"url": "https://www.facebook.com/events/1661856117430745/", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "date": "2016-01-26T10:00:00-05:00", "source": "Facebook", "name": "Story Time with Ieva"}, {"url": "https://www.facebook.com/events/1657867854492206/", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "date": "2016-01-27T11:00:00-05:00", "source": "Facebook", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/201303576876889/", "description": "“Love & Vodka” is a unique hybrid of travel memoir and love story that seamlessly blends outlandish humor, cultural insight and a steady stream of romance. Anyone who has traveled abroad or is considering traveling will certainly connect to this book. The same can be said for anyone who is experiencing new love or pining for a love of their own. “Love & Vodka” is a faithful reminder that there is someone out there for everyone. The world is large and rife with potential; one just needs to be willing to take a gamble and explore the possibilities that exist.\n\nR.J. Fox is the award-winning writer of several short stories, plays, poems, and fifteen feature-length screenplays. He is also the writer and director of several award-winning short films. In addition his writing and filmmaking exploits—not to mention his talents as a saxophonist—Fox teaches English and Video Production in the Ann Arbor Public Schools where he uses his own dream of making movies to inspire his students to follow their own dreams", "date": "2016-01-27T19:00:00-05:00", "source": "Facebook", "name": "Meet Ann Arbor Author R.J. Fox for a Discussion & Signing of His Memoir 'Love & Vodka: My Surreal Adventures in Ukraine"}, {"url": "https://www.facebook.com/events/1020565857968750/", "description": "Wednesday, January 27, 2016, 7:30 pm\nMichigan Theater\n\nBy any measure of talent and accomplishment, Lisa Fischer is a superstar. Yet, if you do not know her name, it’s likely because she has spent the past 20 years as a backup singer for the Rolling Stones, Sting, Chris Botti, and countless others. Her name may not be on the marquee, but she doesn’t care. Her astonishing range, spot-on intonation, mastery of the stage, and infectious sweet smile make her the go-to singer for the likes of Tina Turner, Chaka Khan, Beyoncé, Bobby McFerrin, Lou Reed, Dionne Warwick, Aretha Franklin, and a host of others. As one of the top session and backup singers, she’s featured in the Oscar-winning documentary 20 Feet from Stardom and celebrated for her live concert duets with Mick Jagger during “Gimme Shelter” that have also received millions of hits on YouTube. After winning Grammy Awards for “Best Female R&B Performance” (1992) and “Best Music Film” (2015), she has decided to move forward from being a backup singer, putting together her own band and claiming her well-deserved place center stage. \n\nMore info: http://ums.org/performance/ms-lisa-fischer-and-grand-baton", "date": "2016-01-27T19:30:00-05:00", "source": "Facebook", "name": "Ms. Lisa Fischer and Grand Baton"}, {"url": "https://www.facebook.com/events/1673489232898555/", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2016-01-29T20:00:00-05:00", "source": "Facebook", "name": "Wine, Women, and Song XIV"}, {"url": "https://www.facebook.com/events/1070813002942671/", "description": "Friday, January 29 | 9:30pm | 18+ | $12 adv./ $14 day of\n\nProtomartyr (https://www.facebook.com/protomartyr)\nwith: Rebel Kind & Deadbeat Beat\n\nShow info: http://www.blindpigmusic.com/calendar.html#!/events/591", "date": "2016-01-29T21:30:00-05:00", "source": "Facebook", "name": "Protomartyr w/ Rebel Kind & Deadbeat Beat 1/29/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1710064412573793/", "description": "Join The Beer Grotto and Vault of Midnight for a day of drinking, gaming, laughter, and a little education. \n\nTimeline of the day - \n12:00 - Meet at Beer Grotto\n12:30 - Beer Tasting Education Starts / Beer Flights Are Served\n12:45 - 2:30 - Socializing / Drinking / Parlor Games\n2:30 - 3:30 - Dinner Break\n3:30 - 6:30 - Play All The Games at Vault of Midnight\n6:30 - Call A Cab and Let Vault Staff Clean The Shop\n\n\nTickets will be $15.00 and purchased at Vault of Midnight.\n\nThis price includes a tasting flight at Beer Grotto lead by one of their Well Seasoned Beer Drinkers, access to the legendary Vault of Midnight Game Library, and some wonderful company with fellow gaming enthusiasts.", "date": "2016-01-30T12:00:00-05:00", "source": "Facebook", "name": "Tactical Drinking"}, {"url": "https://www.facebook.com/events/1673489232898555/", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2016-01-30T20:00:00-05:00", "source": "Facebook", "name": "Wine, Women, and Song XIV"}, {"url": "https://www.facebook.com/events/1657867854492206/", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "date": "2016-02-01T11:00:00-05:00", "source": "Facebook", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/1673489232898555/", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2016-02-01T20:00:00-05:00", "source": "Facebook", "name": "Wine, Women, and Song XIV"}, {"url": "https://www.facebook.com/events/494458880715739/", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "date": "2016-02-02T10:00:00-05:00", "source": "Facebook", "name": "Story Time with Ieva"}, {"url": "https://www.facebook.com/events/1155115267866605/", "description": "Tuesday, February 2, 2016, 7:30 pm\nLydia Mendelssohn Theatre\n\nWith Tanya Tagaq, ancient meets modern in provocative, powerful ways. This spellbinding performance features the Inuit throat singer accompanying a screening of Nanook of the North (1922) with a live score. Tagaq’s mixed-media performance reclaims the controversial classic — considered the first feature-length documentary — capturing the sense of the sound of the Arctic spaces shown in the film and adding tremendous feeling and depth to what is a complex mix of beautiful representations and racially charged clichés.\n\nTanya Tagaq’s music is unnerving and exquisite, rooted in Inuit throat singing, but also influenced by electronica, industrial, and metal influences. It is a style that she has perfected with collaborators such as Björk and that reminds some of Meredith Monk’s vocal innovations. Winner of the 2014 Polaris Prize for “Album of the Year” (she beat out Drake and Arcade Fire), Tanya Tagaq makes her UMS debut in this one-night only event. “Nobody, anywhere, sounds like she does.” (Globe and Mail)\n\nMore info: http://ums.org/performance/tanya-tagaq/", "date": "2016-02-02T19:30:00-05:00", "source": "Facebook", "name": "Tanya Tagaq in concert with Nanook of the North"}, {"url": "https://www.facebook.com/events/157869774578366/", "description": "Come join the conversation about sustainability in Ann Arbor! The City and the Ann Arbor District Library are hosting the fifth annual Sustainable Ann Arbor series.  A think tank of local stakeholders, including community organizations, local government staff, businesses, and residents will join the public to discuss local sustainability efforts and challenges in our community. \n\nThe series will include four events with each focusing on a different element of sustainability from Ann Arbor's sustainability framework (www.a2gov.org/sustainability). The events will be held from 7 p.m. to 8:30 p.m. in the Ann Arbor District Main Library at 343 South Fifth Ave on the first Thursday of January, February, March, and April of 2016. \n\nEach event will include a series of short presentations followed by a question and answer session. The forums offered an opportunity to learn more about sustainability in the Ann Arbor community. If you have comments on the forums or suggestions, please send them to sustainability@a2gov.org or call Sustainability Associate Emily Drennen at 734.794.6430 x43726.\n\nFebruary 4, 2016 – Resource Management, including discussions about improving Ann Arbor's waste diversion rate and communitywide efforts to reduce different waste streams. Speakers will include:\n\n-Roger Bowser, Zingerman's \n-Eileen Spring, Food Gatherers\n-Noelle Bowman, Washtenaw County\n-Tracy Artley, UofM Sustainability\n-Matt Naud, Environmental Coordinator, City of Ann Arbor", "date": "2016-02-04T19:00:00-05:00", "source": "Facebook", "name": "Resource Management Sustainability Forum"}, {"url": "https://www.facebook.com/events/1673489232898555/", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2016-02-04T20:00:00-05:00", "source": "Facebook", "name": "Wine, Women, and Song XIV"}, {"url": "https://www.facebook.com/events/576089435876883/", "description": "Co-curated by John DeHoog and Ray Wetzel\n\nOPENING RECEPTION: FRIDAY, FEBRUARY 5, FROM 6:00 TO 9:00 PM\n\nZoku, in Japanese means a loosely affiliated tribe or clan.  The title, Mid-West Furniture Zoku, refers to our regional clan of furniture makers, designers, and educators.\n\nThis exhibition (at the 117 Gallery from February 5 to March 5) is but a small sampling of a much larger group of like-minded artists, designers, and educators working in the context of furniture. The works in the show represent a broad range of techniques, styles, and personal sensibilities, while at the same time demonstrating universal respect for materials, and deep interest in the integration of form and function. On display are objects that are familiar on one level, yet poke holes in our conventional views of how furniture should look and what role furniture plays in our daily lives.\n\nJoin us for the Opening Reception on Friday, February 5, from 6:00 to 9:00 pm at the 117 Gallery in the Ann Arbor Art Center. This is a free, drop-in event! \n\n---------\n\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC \nMid-West Furniture ZOKU Exhibition is presented by Three Chairs Co.", "date": "2016-02-05T18:00:00-05:00", "source": "Facebook", "name": "Mid-West Furniture ZOKU Exhibition"}, {"url": "https://www.facebook.com/events/1594841967471096/", "description": "Friday, February 5, 2016, 8:00 pm\nLydia Mendelssohn Theatre\n\nTaylor Mac is equal parts bedazzled shaman, searing social critic, radical angel, and Elizabethan fool. A critical darling of the New York downtown cabaret scene, he is beloved for his iconic beauty, disarming vulnerability, and soaring spirit. His 24-Decade History of Popular Music will eventually become an epic show performed over 24 continuous hours; in Ann Arbor, Taylor will focus on the 1960s, 70s, and 80s, connecting the decades to the vibrant music scene in Detroit. “Fabulousness can come in many forms, and Taylor Mac seems intent on assuming every one of them.” (New York Times) A UMS co-commission. \n\nMore info: http://ums.org/performance/taylor-mac-a-24-decade-history-of-american-popular-music-1960s-1980s/", "date": "2016-02-05T20:00:00-05:00", "source": "Facebook", "name": "Taylor Mac: A 24-Decade History of American Popular Music: 1960s–1980s"}, {"url": "https://www.facebook.com/events/934979649873085/", "description": "Detroit Is: An Essay in Photographs offers a very personal depiction of an often misrepresented and maligned place. It presents multiple, diverse, contrasting aspects of the complex city.\n\nJ. Gordon Rodwan’s photographs show sides of the city that many people – residents and non residents alike – often miss rather than reproducing images already widely seen. They don’t ignore the dilapidated parts of the city, but they don’t fetishise those elements either. Instead, Rodwan juxtaposes them with images capturing efforts to cultivate and sustain creativity and vibrancy in place where too many expect to see only relics or despair. Neither ‘ruin porn’ nor an equally distorted boosterish presentation of only the positive, Detroit Is offers a highly individual look at what it’s like to live in Detroit.\n\nComplementing the photographs are an introductory essay and poems by the photographer’s son, John G. Rodwan, Jr.", "date": "2016-02-06T15:00:00-05:00", "source": "Facebook", "name": "Meet Photographer J. Gordon Rodwan & Author John G. Rodwan, Sr for a Discussion & Signing of 'Detroit Is: an essay in photographs'"}, {"url": "https://www.facebook.com/events/1435582513413462/", "description": "Saturday, February 6, 2016, 8:00 pm\nHill Auditorium \n\n“His superb live performance confirmed the impression of his recording: A major new pianist has arrived.” (New York Times) Born in 1987, the Russian-German pianist Igor Levit received effusive praise for his two-disc debut album of Beethoven’s late piano sonatas. A relative newcomer to the United States, he makes his UMS debut with this recital appearance. \n\nMore info: http://ums.org/performance/igor-levit/", "date": "2016-02-06T20:00:00-05:00", "source": "Facebook", "name": "Igor Levit, piano"}, {"url": "https://www.facebook.com/events/449539918589830/", "description": "Help us celebrate Dr. Michael Petty’s release of his new book ‘Dr. Petty’s Pain Relief for Dogs’ and when you join us for this event please if you can bring dry dog or cat food with you for the Humane Society of Huron Valley’s Bountiful Bowls program.  The Bountiful Bowls program is a pet food assistance program that helps people with financial difficulties.  For more information regarding the program go to  bit.ly/1Ywz4TQ\n\nDr. Michael Petty is a veterinarian and pain management specialist. He is the owner of the Arbor Pointe Veterinary Hospital as well as the Animal Pain Center (www.animalpaincenter.com), both in Canton, Michigan. He is the immediate-past president of the International Veterinary Academy of Pain Management and the co-author of the 2014 American Animal Hospital Association Pain Guidelines. A frequent speaker and consultant, Petty has also published articles in veterinary journals and elsewhere. He lives in rural Michigan with his wife and two daughters, two dogs, a cat, and a hedgehog.\n\nYou love your dog, and hate to see him in pain. But you don t want to head to the vet's office for hundreds of dollars worth of tests that might prove useless. Dr. Mike Petty understands this. He's a pain vet working with cutting-edge research to find the best way to relieve your pet's pain. In this book, he guides readers in three critical points:\n\n1.\tHow to determine whether a dog is in pain\n\n2.\tHow to find a veterinarian capable of treating these pain issues.\n\n3.\tWhat treatments are available, and which are worth pursuing and which are not.\n\nDr. Petty offers clear descriptions of the treatments, both traditional and holistic. This guide offers the wisdom and support that dog owners crave in these situations.", "date": "2016-02-07T15:00:00-05:00", "source": "Facebook", "name": "Join Us for the Launch Party for Dr. Michael Petty & Fundraiser for HSHV Bountiful Bowls Program"}, {"url": "https://www.facebook.com/events/1673489232898555/", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2016-02-08T20:00:00-05:00", "source": "Facebook", "name": "Wine, Women, and Song XIV"}, {"url": "https://www.facebook.com/events/201462843528819/", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "date": "2016-02-09T10:00:00-05:00", "source": "Facebook", "name": "Story Time with Ieva"}, {"url": "https://www.facebook.com/events/941651205915732/", "description": "the style: the American craft beer market has an unfaltering affection for humulus lupulus and so do we. In February, come sample all the IPAs, pale ales, lagers, and other styles that feature your favorite little green cone.\n\nthe event: We'll gather brews worth sampling to bring you a novel and varied experience for your palates. We’ll pair beer samples with an appetizer buffet, provide a program with tasting notes, and top off the night with a door prize drawing.\n\nthe dets: ABC’s monthly tastings run from 7-9 PM on the 2nd Thursday of each month. Tickets are available at the pub or by phone at 734-213-1393. $25 in advance, $30 day of.", "date": "2016-02-11T19:00:00-05:00", "source": "Facebook", "name": "Beer Tasting: For the Love of Hops"}, {"url": "https://www.facebook.com/events/1655909208022221/", "description": "Thursday, Feb 11 | 9pm | 18+ | $10 Cover\n\nBroccoli Samurai is Cleveland, OH’s premiere jamtronica and EDM project. Broccoli Samurai features Ryan “Bruce” Hodson on keys and synth, Chris Walker on drums and percussion, and Josh Sebo on bass. Broccoli Samurai’s drum and bass influenced, progressive electronica has been thrilling audiences throughout the Midwest, winning the band spots at major events such as Rootwire, The Werk Out, Hyperion Fest, Summerdance, and The Mad Tea Party Jam, as well as direct support, club spots for such notable bands as Boombox, Lotus, Dopapod, Papadosio, Rusted Root, Big Gigantic, Conspirator, O.A.R., and Ozric Tentacles. Broccoli Samurai’s groove is the kind that keeps the crowd moving well into the wee hours of the morning. This band is making big moves and the time to take notice is now. \n\nWith: Liquid Monk\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/570", "date": "2016-02-11T21:00:00-05:00", "source": "Facebook", "name": "Broccoli Samurai w/ Liquid Monk 2/11/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/368546533344933/", "description": "Saturday, February 13, 2016, 8:00 pm\nPower Center\n\n“Every aspect of the dance-making here is thoroughly accomplished.” (New York Times) A prolific choreographer who danced with Ronald K. Brown’s Evidence, Rennie Harris’s Puremovement, and the Alvin Ailey American Dance Theater, Camille A. Brown brings her newest work to Ann Arbor for her UMS debut. Black Girl — Linguistic Play speaks to the complexities of carving out a positive identity as a Black female in urban American culture.\n\nIn a world where Black women are often portrayed only in terms of their strength, resiliency, or trauma, this work interrogates these narratives by presenting a fuller spectrum of the black female and the complexities of negotiating in this racially and politically charged world. The work uses elements of African-American social dancing, rhythmic play, and musical compositions to better illustrate who “Black Girl” knows herself to be. Brown’s choreography is “fun, inventive, and watchable.” (Times Square Chronicles) \n\nMore info: http://ums.org/performance/camille-a-brown-dancers/", "date": "2016-02-13T20:00:00-05:00", "source": "Facebook", "name": "Camille A. Brown & Dancers: Black Girl — A Linguistic Play"}, {"url": "https://www.facebook.com/events/1673489232898555/", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2016-02-13T20:00:00-05:00", "source": "Facebook", "name": "Wine, Women, and Song XIV"}, {"url": "https://www.facebook.com/events/1686749728236981/", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "date": "2016-02-16T10:00:00-05:00", "source": "Facebook", "name": "Story Time with Ieva"}, {"url": "https://www.facebook.com/events/442008155980033/", "description": "February 16, 18\nRackham Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "date": "2016-02-16T19:30:00-05:00", "source": "Facebook", "name": "Sir András Schiff, piano"}, {"url": "https://www.facebook.com/events/1579264365729837/", "description": "Don't miss Artini 2016*, which in its 8th edition will once again transform the Downtown Ann Arbor area into a festive competition between the finest bars and restaurants, where the goal is to design the city's most artful martini!\n\nArtini will be on Friday, February 19, from 7:00 to 10:00 pm. Tickets will be for sale on Monday, January 4th for members of the Ann Arbor Art Center and on Wednesday, January 6th for all! As usual tickets will be sold fast, so please make sure you purchase yours as soon as possible.\n\nWHAT IS ARTINI?\n\nArtini is an annual fundraiser hosted by the Ann Arbor Art Center in which local bars and restaurants are invited to compete to create the most artful and innovative martini cocktail. Guests purchase tickets to participate in a fun bar crawl amongst the participating venues and spend the evening walking in Downtown Ann Arbor for the search of the best tasting martini.\n\nPARTICIPATING ARTINI 2016 VENUES INCLUDE:\n\n- Aventura Ann Arbor\n- Babs' Underground Lounge\n- Mélange\n- The Ravens Club\n- Vinology Wine Bar and Restaurant\n- Felix Bistro & Bar\n- Conor O'Neills Ann Arbor\n... and more to come! \n\nThe 2016 winner will be selected by a jury of individuals unaffiliated with our participating venues. These judges include Andy Mohr (Two James, sponsor), Alex Milshteyn (Real Estate Associates, sponsor), Yen Azzaro (of studio Chin-Azzaro), Horace Bomar (long-time Art Center supporter), Jessica Webster (MLive, food critic), and Jorge Avellan (WEMU, reporter).\n\n*Attendees must be 21 or older. Ticket prices are $55.\n\n--------------\n\nArtini 2016 is sponsored by Alex Milshteyn Real Estate Associates\nBeverage sponsor Two James Spirits", "date": "2016-02-19T19:00:00-05:00", "source": "Facebook", "name": "Artini 2016"}, {"url": "https://www.facebook.com/events/1620380161539059/", "description": "Friday, February 19, 2016, 8:00 pm\nMichigan Theater\n\nA decade after it was first brought to the screen, Benoît Charest revives the music of the Oscar-nominated film The Triplets of Belleville with a remarkable cast of musicians in this silent movie-live concert event. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His near-sighted grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas.\n\nBut the true star of the animated film is the hot jazz score written by Canadian composer Benoît Charest. This screening of the beloved French film transports audiences to the exciting streets of 1920s Paris and Le Jazz Hot.\n\nMore info: http://ums.org/performance/the-triplets-of-belleville/", "date": "2016-02-19T20:00:00-05:00", "source": "Facebook", "name": "The Triplets of Belleville"}, {"url": "https://www.facebook.com/events/1673489232898555/", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2016-02-19T20:00:00-05:00", "source": "Facebook", "name": "Wine, Women, and Song XIV"}, {"url": "https://www.facebook.com/events/510894402424469/", "description": "Fri. February 19 | 9pm | 18+ | $12 adv./ $14 Day of\n\nMustard Plug with Askultura & 1592\n\nMustard Plug started out in the punk clubs, basements and dive bars of the Midwest, playing punk-influenced ska music before most people in the U.S. had ever heard of ska. They clung to a DIY work ethic that had been ingrained in them growing up in the 1980′s hardcore punk scene and applied it to everything they would ever do together as a band. Mustard Plug released their first cassette tape themselves (1992′s Skapocalypse Now!), and played constantly to earn enough money to record their first album – 1994′s Big Daddy Mulititude. Their debut full length was released on legendary NYC label Moon Records (home of Toasters, Hepcat, Dance Hall Crashers, and pretty much every other 90′s ska band of note). With their new found national distribution and exposure, the band climbed into their van and performed their music to new fans across North America. Twenty-one years, 1500 shows and 200,000 album sales later, it cannot be denied that the band has surpassed all expectations and permanently staked their claim in contemporary music.\n\nFor their new album, “Can’t Contain It”, Mustard Plug have returned to the DIY blueprint that the band was built upon, while at the same time embracing all the school of hard knocks craftsmanship and wisdom that the band has earned along the way. The band spent the last several years writing new material that was informed by 22 years of songwriting experience while retaining the youthful energy that has endeared them to their fans. They tracked the record at bassist Rick Johnson’s Cold War Studios, giving them the flexibility to experiment and add new layers and dimensions that were not possible given the time constraints on their previous recordings. Many of their musician friends(Dan Potthast, Sean Bonnett, Mark Petz, Corey Ruffin) were tapped to contribute, creating a denser, more intricate sound.\n\nOnce the recording process for Can’t Contain It was complete, the band turned to their fans to help finance the mixing and production of their record. Their Kickstarter campaign surpassed all their expectations, doubling their initial goal and re-confirming the support and love of their audience. The tracks were then sent to be mixed at Bill Stevenson’s Blasting Room Studios where Mustard Plug had recorded 3 of their previous albums (including 1997’s breakthrough “Evildoers Beware” and 2007’s “In Black and White”). The result is possibly their most diverse and best record to date.\n\nAfter tapping their friends and fans to help out with the recording, the band turned to more of their posse to collaborate on the artwork. Underground icon Jeff Rosenstock designed the album packaging, while noted artists Craig Horkey and Larry Kole created alternative limited edition album covers and posters. The final piece came together when at the last minute, No Idea record founder, Var Thelin heard the record and offered to partner with the band on its release. Mustard Plug is excited to be given the opportunity to collaborate with a label known for its’ strong punk rock ethics and underground credibility.\n\nUltimately, this release is about the community Mustard Plug has built during its’ 22 year existence. Coming full circle back to the DIY scene and the community that the were born out of has helped them to put out their best record to date.", "date": "2016-02-19T21:00:00-05:00", "source": "Facebook", "name": "Mustard Plug, Askultura & 1592 2/19/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/189689224712860/", "description": "Tell your friends! Tell your family! Tell your dog! (But don't bring your dog!) It's the Second Annual Wolverine State Ski & Snowboard trip! \n\nThe rundown: Meet at the brewery (2019 W. Stadium, Ann Arbor, MI) at 7:30 am on Saturday, February 20th for bagels and to grab the 2016 edition of the Ski & Snowboard Club shirt! Bus departs from the brewery at 8 am and arrives at Alpine Valley around 9 am. You'll receive your lift ticket as you exit the bus, and if you're renting equipment, you'll also receive a rental slip (separate payment for equipment rental is required, but you get a group discount for coming with the brewery!) Meet back at the bus between 5 and 5:30, bus departs after final head count at 5:45 pm. \n\nTrip cost: $65 (includes bagels at the brewery, transportation to and from Alpine Valley, an all-day 9am - 5:30 pm lift ticket, a commemorative t-shirt, and beer on the bus to and from Alpine Valley. There will be room on the bus to store your equipment! \n\nEquipment rental: $21 for skis or snowboard. \n\nPlease use the eventbrite link to register! Remember to select your t-shirt size and indicate whether or not you will require rentals! You will have the option to pay for rentals on the eventbrite page. \n\nSeating is limited to 50 participants, so get on it!", "date": "2016-02-20T07:30:00-05:00", "source": "Facebook", "name": "Wolverine State Ski & Snowboard Trip"}, {"url": "https://www.facebook.com/events/1611931089050428/", "description": "February 20\nHill Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "date": "2016-02-20T20:00:00-05:00", "source": "Facebook", "name": "Sir András Schiff, piano"}, {"url": "https://www.facebook.com/events/1285645741460846/", "description": "After Groundhog announces six more weeks of winter, half his animal friends are disappointed, while the other half are excited. Each animal asks Groundhog to make his prediction in their favor the following year. Rather than being truthful about the fact that he just “calls it like he sees it,” he leads them to believe he can control the weather, accepting their gifts of food and favor. On the next Groundhog Day, he finally admits he made promises he couldn’t keep because he was trying to please everyone and makes amends.\n\nKristen Remenar is a children's librarian, writer, teacher, and national speaker on literacy. She is married to author/illustrator Matt Faulkner. This is her first picture book.\n\nA graduate of Rhode Island School of Design, Matt Faulkner has written and illustrated a number of children's books. His work has won wide praise for its humor, exuberance and sensitivity. In addition, he is a contributing illustrator to such national periodicals as The New York Times, The Wall Street Journal and Forbes. Matt is married to author and children's librarian, Kristen Remenar. They live with their 3 kids and 3 cats on the lower right corner of the Michigan mitten. He teaches illustration at the Art Academy University in San Francisco", "date": "2016-02-21T15:00:00-05:00", "source": "Facebook", "name": "Meet Author Kristen Remenar & Illustrator Matt Faulkner for a Discussion & Signing of Their New Picture Book, 'Groundhog's Dilemma'"}, {"url": "https://www.facebook.com/events/1521814471451960/", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "date": "2016-02-23T10:00:00-05:00", "source": "Facebook", "name": "Story Time with Ieva"}, {"url": "https://www.facebook.com/events/526138584222040/", "description": "Discussion of this Year's Reads Book - \"The Book of Unknown Americans\"  Cristina Henriquez will be signing at the end of her presentation.  Books will be sold the night of the event by Nicola's Books.\n\nWriter Cristina Henriquez will discuss her work at a special appearance for the Ann Arbor / Ypsilanti Reads 2016. The public program will occur from 7:00 to 9:00 pm. Doors will open at 6 pm to offer the opportunity to connect with community agencies and representatives who will be staffing information tables in the lobby. Copies of \"The Book of Unknown Americans\" will be for sale and the event will include a book signing.\n\nTowsley Auditorium\nMorris Lawrence Building, Washtenaw Community College\n4800 E. Huron River Drive\nAnn Arbor, MI 48105\n\nAuthor: \n\nCristina Henríquez is also the author of the story collection Come Together, Fall Apart, which was a New York Times Editors’ Choice selection, and the novel The World in Half. Her work has appeared in The New Yorker, The Atlantic, The American Scholar, Glimmer Train, Virginia Quarterly Review, Ploughshares, TriQuarterly, AGNI, and Oxford American, as well as in various anthologies.\n\nBook: \n\nThe Book Of Unknown Americans centers on fifteen-year-old Maribel Rivera, who sustains a terrible injury. Her family leaves behind a comfortable life in Mexico and risks everything to come to the United States so that Maribel can have the care she needs. Once they arrive, it’s not long before Maribel attracts the attention of Mayor Toro, the son of one of their new neighbors, who sees a kindred spirit in this beautiful, damaged outsider. Their love story sets in motion events that will have profound repercussions for everyone involved.\n\nHenríquez seamlessly interweaves the story of these star-crossed lovers, and of the Rivera and Toro families, with the testimonials of men and women who have come to the United States from all over Latin America.", "date": "2016-02-23T19:00:00-05:00", "source": "Facebook", "name": "Ann Arbor/Ypsilanti Reads - Meet Author Cristina Henriquez for a Discussion & Signing"}, {"url": "https://www.facebook.com/events/1725536331010947/", "description": "Wed. February 24 | 18+ | 9pm | $15 / $65 VIP Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\nWSG: Dan Henig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/567", "date": "2016-02-24T21:00:00-05:00", "source": "Facebook", "name": "Aaron Carter 2/24/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1449897481978519/", "description": "Nashville-based, independent artist, Ron Pope, has stood at a crossroads where so many musicians find themselves — at the intersection of record label and independence. In an ever-evolving industry filled with rejection and compromise, he has plotted a new course for his music to reach loyal listeners, taking the industry-road-less-traveled in exchange for the ultimate payback, a league of devoted fans the world over. WSG: Tuett - http://www.truettofficial.com/\n\nVIP tix available here: http://www.etix.com/ticket/p/4574033/ron-pope-vip-meet-greet-ann-arbor-blind-pig-the-blind-pig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/446", "date": "2016-02-25T21:00:00-05:00", "source": "Facebook", "name": "Ron Pope & The Nighthawks w/ Truett 2/25/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1673489232898555/", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2016-02-26T20:00:00-05:00", "source": "Facebook", "name": "Wine, Women, and Song XIV"}, {"url": "https://www.facebook.com/events/1615405452043601/", "description": "Second Show Added for Friday, February 26th!\n\nDoors 9pm | 18+ | $15 General Admission / $65 Admission + Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\n\n\nWSG: Dan Henig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/573", "date": "2016-02-26T21:00:00-05:00", "source": "Facebook", "name": "Aaron Carter w/ Dan Henig - Night Two 2/26/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/152137558488266/", "description": "Vic Amato's sixteen tales in his Incoming: Collected Stories are literary explorations of the corridors of the human psyche, some familiar, some dark, all incorporating empathetic portraits of people, including married couples, young men on the cusp of adulthood, and even a sympathetic examination of the quirky among us.\n\nNearly every piece is set in the modern age; the one exception is \"Everyone Hates Malvolio,\" a sardonic takeoff on Twelfth Night.\n\nVic Amato holds a PhD in political science/public administration from Wayne State University, Detroit. He is a former journalist, mental health services administrator, and college instructor, and he served with the Third Infantry Division. He and his wife, Susan, live in Port Huron, Michigan.", "date": "2016-02-28T15:00:00-05:00", "source": "Facebook", "name": "Meet Michigan Author Vic Amato for a Discussion and Signing of His New Collection of Short Stories, 'Incoming: Collected Stories'"}, {"url": "https://www.facebook.com/events/788876821235695/", "description": "Yes, THE Michael Johnson, singer of the smash hit singles, \"Bluer Than Blue,\" \"This Night Won't Last Forever,\" \"That's That,\" and other landmark songs. Michael started playing at age 13; studied classical guitar in Barcelona; in 1968 joined the Chad Mitchell Trio with John Denver, touring for a year; and in 1969 toured for a year with the company of \"Jacques Brel Is Alive And Well And Living In Paris.\" In addition to his pop radio hits of the 1970's and '80's, he racked up top singles on the country charts with \"Give Me Wings\" and \"The Moon Is Still Over Her Shoulder.\" Michael's recent recordings feature duet partners Nanci Griffith and Alison Krauss. His music shows a diversity, depth and heart that only come from years of dedication to a labor of love. His amazing guitar work, humor and showmanship will make for a very special evening. Bring a friend! Michael's latest CD is \"Moonlight Deja Vu.\"\nhttp://www.mjblue.com/", "date": "2016-03-04T20:00:00-05:00", "source": "Facebook", "name": "Michael Johnson at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/1598997080377800/", "description": "Saturday, March 5, 2016, 8:00 pm\nHill Auditorium\n\nPaddy Malone and The Chieftains celebrated 50 years of performing in 2012, and their music remains as fresh and relevant as when they first began. Recognized for reinventing traditional Irish music on a contemporary and international scale, their ability to blend tradition with modern music has made them one of the most renowned and revered musical groups to this day. Back for their fifth UMS performance and their first in nearly a decade, “they seem ageless, and so does their Irish music. If common sense tells you they can’t go on forever, you wouldn’t know it from their electrifying performance.” (Boston Globe)\n\nMore info: http://ums.org/performance/the-chieftains/", "date": "2016-03-05T20:00:00-05:00", "source": "Facebook", "name": "The Chieftains"}, {"url": "https://www.facebook.com/events/1673489232898555/", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2016-03-05T20:00:00-05:00", "source": "Facebook", "name": "Wine, Women, and Song XIV"}, {"url": "https://www.facebook.com/events/998925893483957/", "description": "Sat. March 5 | 9pm | $15 Cover | 18+\n\nElectric Six -  Mortality. It’s the primary reason we don’t live forever. If not for our mortality, the number of years each of us would have to roam this earth would be as infinite as the sands of time running through the earth itself. When extraterrestrials eventually make first contact with us within the next twenty years, the first glaringly obvious thing they will notice…is that we die. They will come to our planet with sinister intentions and they will immediately have the upper hand because we die…and they don’t. It’s a simple as that. And it’s all because of our mortality.\n\nWhile aliens (and the government!!!!!) will always be there to kill us, we have for generations used our cold dead hands to clutch onto whatever silver lining we could sew into the dark cloud of our everlasting mortality. Specifically, we tell ourselves that we can live forever, not in corporeal form, but through our creations of art…and our expressions of love.\n\nThusly, art and love are more important than ever, because they are now the conduits that preserve our life forces. If you don’t create art and you don’t love nobody…well then, you will be forgotten, rather quickly. No one wants to be forgotten rather quickly. No one more so…than Electric Six.\n\nElectric Six understands all this stuff as it prepares to unveil its eleventh studio album Bitch, Don’t Let Me Die!, which will be released on October 6 on Metropolis Records. The album is steeped in themes of mortality, death, discorporation and discoloration…all while it tries to convince you it is actually a work of art, a labour of love.\n\nFrom the pounding, driving opener, “Drone Strikes”, through the 1970s guitar anthem “Two Dollar Two”, Bitch, Don’t Let Me Die! reveals that Electric Six knows that it is going to die, but will not go out quietly. From there, the album moves through the pop goodness of “Kids Are Evil” and “A Variation of Elaine”, the prog-rock showmanship of “Slow Motion Man”, and even a tribute to Elvis Presley in his more rotund years with “Dime Dime Penny Dime”.\n\n“Big Red Arthur” is the anchor track of the album, as it emits a rock-opera bombast that is reminiscent of Radiohead sodomizing David Bowie in the center of his mind. It, like most of the songs on this record, is about death…but it’s kind of funny because it’s only about the death of a fake, out-of-shape drunk Santa Claus who is too fucking stupid to make it down the chimney correctly. In this case, we just end up laughing at death. And that’s uplifting.\n\nTo summarize, mortality is everywhere, and this fall, thanks to their new record Bitch, Don’t Let Me Die!, Electric Six will be everywhere too. Everybody gonna die someday, but with Electric Six’s new album, you no longer have to worry about any of it. Bitch, Don’t Let Me Die is Electric Six’s brand new record for 2015 and it is available on Metropolis Records on Oct. 2. You can come see Electric Six play in your town on the I Wanna Lick The Screen tour, starting in their home state of Michigan on Sept. 25.\n\nWSG: Parlour Tricks", "date": "2016-03-05T21:00:00-05:00", "source": "Facebook", "name": "Electric Six w/ Parlour Tricks 3/5/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1520482404946720/", "description": "One day at a time, discover colorful Motor City moments in history spanning more than three centuries. On November 5, 1851, Voice of the Fugitive published a letter in support of escaped slaves. On July 3, 1904, Monk Parry became the first monkey to drive a car, and on January 16, 1919, the Statler Hotel menu offered whale meat for dinner. The legendary Steve Yzerman was named captain of the Red Wings on October 7, 1986. Local historian Bill Loomis covers the big events and remarkable stories of life and culture from Detroit’s founding to its recent struggles and rebirth.\n\nBill Loomis is the author of Detroit’s Delectable Past (2012), Detroit Food (2014) and numerous articles on culinary and social history. His writing has been published in the Detroit News, Michigan History Magazine, New York Times, Hour Detroit and more. Mr. Loomis was born in Detroit and lived for a number of years in the North Rosedale Park neighborhood in the city. Mr. Loomis now lives in Ann Arbor with his wife and children.", "date": "2016-03-06T15:00:00-05:00", "source": "Facebook", "name": "Meet Ann Arbor Author Bill Loomis for a Discussion & Signing of His New Book, 'On This Day in Detroit History'"}, {"url": "https://www.facebook.com/events/961213527303219/", "description": "In 1944 Italian officer Captain Francesco Verdi is captured by Allied forces in North Africa and shipped to a POW camp in Michigan s Upper Peninsula, where the senior POW, the ruthless Kommandant Vogel, demands that all prisoners adhere to his Nazi dictates. His life threatened, Verdi escapes from the camp and meets up with an American woman, Chiara Frangiapani, who helps him elude capture as they flee to the Lower Peninsula. By 1956 they have become Frank and Claire Green, a young married couple building a new life in postwar Detroit. When INS agent James Giannopoulos tracks them down, Frank learns that Vogel is executing men like Frank for their wartime transgressions. As a series of brutal murders rivets Detroit, Frank is caught between American justice and Nazi vengeance. In \"Wolf s Mouth, \" the recollections of Francesco Verdi/Frank Green give voice to the hopes, fears, and hard choices of a survivor as he strives to escape the ghosts of history.\"\n\nJohn Smolens has published nine works of fiction, including Cold, Quarantine, and The Schoolmaster’s Daughter. He lives in Marquette, Michigan.", "date": "2016-03-08T19:00:00-05:00", "source": "Facebook", "name": "Meet Michigan Author John Smolens for a Discussion & Signing of His New Novel, 'Wolf's Mouth'"}, {"url": "https://www.facebook.com/events/1017884834929568/", "description": "Tue. March 8 | 9pm | 18+ | $10 adv./ $12 day of\n\nNorthern California rapper, MC Lars, is set to release his 4th full-length studio album, the Zombie Dinosaur LP, at the end of this coming summer. He has returned home to the Bay Area after living in Los Angeles these past three years, and is self-producing his new album with help from friends in Berkeley and San Francisco. The Zombie Dinosaur LP revisits the satirical, funny, uptempo style of Lars’ 2004 debut album, the Laptop EP. It features guest appearances by Watsky, Kool Keith, and Less than Jake’s Roger Lima. Zombie Dinosaur tackles such topics as postfeminism, in a nod to Game of Thrones (“Dragon Blood”); disappointing reunion bands with very few of their original members (“Sublime with Rome is Not the Same thing as Sublime”); hipster parenting (“Hipster Mom”); and the current state of EDM (“Signing Dubstep”). The project was funded entirely by Lars’s third highly successful Kickstarter campaign, through which he raised over $42k to create and release Zombie Dinosaur under his own label, Horris Records. In the ten years that have followed his debut release, the Laptop EP, Lars has independently produced and released three other solo full-length albums, four EPs, and a number of mixtapes. He has collaborated with KRS-One, mentored and helped develop the career of fellow Stanford alum K.Flay (with whom he collaborated on the 2009 Single and Famous EP), opened for Nas and Snoop Dogg, and played multiple summers on the Vans Warped Tour. He has also headlined club shows across the US and in Canada, Japan, Australia, New Zealand, and Europe. Lars has spoken and presented at two different TEDx conferences, performed at Carnegie Hall with a live string section (at Scholastic’s 2012 Art and Writing Awards – where he debuted the video for his song, “Flow Like Poe,” which is the lead single on his 2012 Edgar Allan Poe EP). Lars has developed and grown Horris Records in this past decade, signing the label’s first artist, Weerd Science (the solo hip-hop project of Cohered & Cambria’s drummer, Josh Eppard). Lars has continued to produce music videos for himself and his friends, including a cameo credit on past musical collaborator “Weird Al” Yankovic’s 2014 “Lame Claim to Fame” (for which Lars was given a special shout out in the liner notes to Al’s Grammy Award winning album, Mandatory Fun). Having been labeled as one of the pioneers of the underground “nerdcore hip-hop” subgenre, Lars has recently expanded from the studio to the classroom. With visiting scholar/teacher residencies at USC, and in the UK, and across the US in Nantucket, Florida, California, Alaska, and Kansas, Lars has found joy in educating young people about “lit-hop,” a subject term he coined to highlight the connections between literature, classical poetry, and the cultural history of rap. Lars has continued to work closely with the American Foundation for Suicide Prevention, teaching workshops on preventing self-harm, and positive ways to use music as creative therapy for depression. He has also worked with the American Heart Association, promoting youth heart health. It’s been quite a decade. WSG: Mega Ran", "date": "2016-03-08T21:00:00-05:00", "source": "Facebook", "name": "MC Lars w/ Mega Ran 3/8/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/488544131294497/", "description": "March 11-12\nPower Center\n\n“You can’t help but leave with a fuzzy feeling inside.” (examiner.com) The globetrotting, Montreal-based scratch DJ and music producer Kid Koala presents a magical, multi-disciplinary and theatrical adaptation of his graphic novel and soundtrack, Nufonia Must Fall. This charming story centers around a headphones-sporting robot on the verge of obsolescence who falls in love with a lonely office girl. This live adaptation unfolds via real-time filming of more than a dozen miniature stages and a cast of puppets, while Kid Koala and the Aelos Quartet provide original live scoring on piano, strings, and turntables. The result? You’ll seem to be watching an animated picture, but simultaneously seeing puppets being filmed and projected in real time. Heartfelt, hand-made, and a very cool live experience. \n\nMore info: http://ums.org/performance/nufonia-must-fall/", "date": "2016-03-11T20:00:00-05:00", "source": "Facebook", "name": "Nufonia Must Fall"}, {"url": "https://www.facebook.com/events/1622992504617740/", "description": "$18 adv./ $20 day of | 18+ | 9pm\n\nSimply put, Tortoise has spent nearly 25 years making music that defies description. While the Chicago-based instrumental quintet has nodded to dub, rock, jazz, electronica and minimalism throughout its revered and influential six-album discography, the resulting sounds have always been distinctly, even stubbornly, their own.\n\nFull Bio - http://www.blindpigmusic.com/calendar.html#!/events/521", "date": "2016-03-11T21:00:00-05:00", "source": "Facebook", "name": "Tortoise 3/11/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/971816919508035/", "description": "Tuesday, March 15, 2016, 7:30 pm\nSt. Francis of Assisi\n\nFresh from their 2014 performance of Monteverdi’s Vespers, Apollo’s Fire & Singers returns to St. Francis of Assisi Church with one of their signature pieces, Bach’s St. John Passion. Bursting out of the gate from the agitated opening chorus, this work is considered Bach’s most dramatic and theatrical oratorio. In this acclaimed interpretation, the story’s action is highlighted by a dramatic approach: the roles are performed by true singing actors, staged on a special theatrical platform within the orchestra. The acclaimed Apollo’s Singers evoke the wild mob with fierce intensity. \n\nMore info: http://ums.org/performance/apollos-fire-st-john-passion/", "date": "2016-03-15T19:30:00-04:00", "source": "Facebook", "name": "Apollo’s Fire & Apollo’s Singers: Bach’s St. John Passion"}, {"url": "https://www.facebook.com/events/1948490602041931/", "description": "carlenecarter.net", "date": "2016-03-18T20:00:00-04:00", "source": "Facebook", "name": "Carlene Carter at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/1064114296941949/", "description": "A heart-pounding new Stevens and Windermere thriller from the award-winning author of \"The Stolen Ones \"and\" The Professionals.\" \n\nKirk Stevens and Carla Windermere of the joint BCA-FBI violent crime task force have handled shocking cases before, but this one is different. Stevens s daughter, Andrea, is distraught over a classmate s suicide, but what the two investigators find is even more disturbing an online suicide club of unhappy teenagers, presided over by an anonymous presence who seems to be spurring them on. Soon, it becomes apparent that the classmate wasn t the first victim and won t be the last, either, unless they can hunt down this psychopath once and for all.\n\nOwen Laukkanen was born in Vancouver. After graduating from university in 2006, he answered an ad on Craigslist for a summer job at the World Series of Poker in Las Vegas as a poker tournament reporter for a poker website. At the end of the summer, they offered him a full-time job. You wouldn t think you could make a living at this, but you would be wrong. For the next three years he traveled around the world, reporting from the most luxurious casinos of Monaco and Macau and Australia to the sketchiest card rooms of California and Atlantic City. In 2009, having seen his fill, Laukkanen quit to concentrate on fiction. He also spends summers as a deckhand on the boats of his father and his uncle, both commercial fishermen. He is at work on more novels. \n\nHis previous Stevens and Windermere novels are \"The Professionals,\" \"Criminal Enterprise,\" \"Kill Fee,\" and \"The Stolen Ones.\" \"The Professionals\" was nominated for the Barry Award and International Thriller Writers Award for best first novel, as well as the \"Spinetingler\" Award for Best Novel: New Voice. \"Criminal Enterprise\" was nominated for the ITW Award for best novel. Both books, as well as \"Kill Fee,\" appeared on several best-of-the-year lists.", "date": "2016-03-19T15:00:00-04:00", "source": "Facebook", "name": "Meet Canadian Thriller Author Owen Laukkanen for a Discussion & Signing of His Latest Stevens & Windermere Novel, 'The Watcher in the Wall'"}, {"url": "https://www.facebook.com/events/1582133688713673/", "description": "Saturday, March 19, 2016, 8:00 pm\nHill Auditorium\n\nThe Montreal Symphony returns to Ann Arbor for the first time since 1989, with American conductor Kent Nagano and pianist Daniil Trifonov both making their UMS debuts. “Hearing Trifonov is like having a deep-tissue massage: you keep wanting to pull away from the sheer intensity of it, and you come out feeling as if your reality had been slightly altered…a knockout.” (Washington Post) \n\nMore info: http://ums.org/performance/montreal-symphony-orchestra/", "date": "2016-03-19T20:00:00-04:00", "source": "Facebook", "name": "Montreal Symphony"}, {"url": "https://www.facebook.com/events/1663165150570187/", "description": "Saturday, March 26, 2016, 8:00 pm\nHill Auditorium\n\nBach’s complete Sonatas and Partitas have long been a “Mount Everest” of the violin repertoire — music that performers return to throughout their lives. In this special event, Gil Shaham collaborates with video artist David Michalek to open up new avenues for listening to and interpreting Bach’s towering masterpieces.\n\nVideo artist David Michalek, best known for his “Slow Dancing” installation at Lincoln Center, and in the capitals of Europe, says of the Bach Six Solos project: “As a contemporary artist with a particular interest in motion pictures and time, I’ve been compelled to consider how the addition of extreme slow motion might be applied to moving images of the face, the body, obliquely narrative tableaux, and also still life in ways that can both enhance and alter the meanings latent within them. As a visual strategy, extreme slowness creates a continuing sense of a pause in the action — as if the growth and evolution of the slow-moving image is itself a further manifestation of the deep and consuming absorptive state that often arises while observing it.”\n\nMore info: http://ums.org/performance/gil-shaham/", "date": "2016-03-26T20:00:00-04:00", "source": "Facebook", "name": "Bach Six Solos: Gil Shaham, violin"}, {"url": "https://www.facebook.com/events/1390173447979498/", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "date": "2016-03-31T19:30:00-04:00", "source": "Facebook", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"url": "https://www.facebook.com/events/1390173447979498/", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "date": "2016-04-01T19:30:00-04:00", "source": "Facebook", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"url": "https://www.facebook.com/events/453190221522442/", "description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "date": "2016-04-01T20:00:00-04:00", "source": "Facebook", "name": "Mariachi Vargas de Tecalitlán"}, {"url": "https://www.facebook.com/events/1390173447979498/", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "date": "2016-04-03T19:30:00-04:00", "source": "Facebook", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"url": "https://www.facebook.com/events/1390173447979498/", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "date": "2016-04-06T19:30:00-04:00", "source": "Facebook", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"url": "https://www.facebook.com/events/1064500826928164/", "description": "\"The most versatile and compelling performer this reviewer has ever seen\"—Pravda", "date": "2016-04-08T20:00:00-04:00", "source": "Facebook", "name": "John McCutheon"}, {"url": "https://www.facebook.com/events/827290400697161/", "description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "date": "2016-04-08T20:00:00-04:00", "source": "Facebook", "name": "Jerusalem Quartet"}, {"url": "https://www.facebook.com/events/1713063788906616/", "description": "tomchapin.com", "date": "2016-04-08T20:00:00-04:00", "source": "Facebook", "name": "Tom Chapin at  Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/554988117991170/", "description": "Friday, April 8 | 9pm | 18+ | $22 Adv./ $25 Day of\n\nthe Mountain Goats - One thing that happened this past year was at City Winery, in April, where we did a session down in the cellar between soundcheck and the show. We hadn’t really thought a whole lot about the session in advance—on tour, your default response to things is “let’s just show up and play”—and we were kind of under the gun time-wise when we got to the club. So we decided to just do it quick and dirty, old-school style. Like the open mic nights I used to play: unamplified guitar and vocals, friends with their axes playing along, arrangements arrived at on the fly and infinitely flexible. Four songs later we felt really inspired—me and Matt played a song or two without anybody else around because we’d gotten down to the basement before the others, the total song choice was strictly “what do you figure we should play now?”, the mood was relaxed and free…we loved it. Later that night, we decided to strip down the drum kit to essentials and play a choke-the-motor set echoing and elaborating on what we’d done downstairs: a sort of small-ensemble feel, lower in volume but actually higher in intensity. Like what we do in concentrate. It was one of our two favorite performances of the year, the other being the second night at the Fillmore. It felt like acres of new terrain opening up atop an ancient foundation. As soon as it was over, we all wanted to do it again. So in 2016 we’re taking that set on the road. Not that exact set, obviously; the particulars will vary from night to night. But smaller rooms, audible frequencies, up close and personal: this is the general plan. Making eye contact with people in the back row, being able to go off-mic when I want to and still be heard. Total visibility. We couldn’t be more excited about this tour. I love the big album release shows as much as anybody, but that City Winery feel of just playing together with bare essentials in close quarters…there’s nothing like it, and when the whole room locks onto the signal, it’s really special.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/581", "date": "2016-04-08T21:00:00-04:00", "source": "Facebook", "name": "The Mountain Goats 4/8/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/495921443927297/", "description": "\"Look no farther to find a new pairing to be jealous of.\"—Matt Mansfield, Z93 FM, Grand Rapids", "date": "2016-04-09T20:00:00-04:00", "source": "Facebook", "name": "The Accidentals"}, {"url": "https://www.facebook.com/events/1513669432294818/", "description": "A unique engima from Bermuda", "date": "2016-04-11T20:00:00-04:00", "source": "Facebook", "name": "Heather Nova"}, {"url": "https://www.facebook.com/events/1602568673339827/", "description": "South Africa's legendary breaker of walls", "date": "2016-04-13T20:00:00-04:00", "source": "Facebook", "name": "The Johnny Clegg Band"}, {"url": "https://www.facebook.com/events/1621365181438631/", "description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "date": "2016-04-14T19:30:00-04:00", "source": "Facebook", "name": "Mnozil Brass"}, {"url": "https://www.facebook.com/events/1662156430732435/", "description": "American Idol's Season 8 winner, up close and personal!", "date": "2016-04-14T20:00:00-04:00", "source": "Facebook", "name": "Kris Allen"}, {"url": "https://www.facebook.com/events/933628040025902/", "description": "Much-awaited new music from a performer bridging bluegrass and folk", "date": "2016-04-15T20:00:00-04:00", "source": "Facebook", "name": "Tim O'Brien"}, {"url": "https://www.facebook.com/events/419604171550681/", "description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus, where it blended with elements of Spanish music, then was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed Tunisian singer Sonia M’barek, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "date": "2016-04-15T20:00:00-04:00", "source": "Facebook", "name": "Zafir: Musical Winds from North Africa to Andalucía"}, {"url": "https://www.facebook.com/events/506775856161991/", "description": "http://cattailmusic.com/", "date": "2016-04-15T20:00:00-04:00", "source": "Facebook", "name": "Scott Ainslie at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/1512513839062559/", "description": "Legendary guitar mastery", "date": "2016-04-16T20:00:00-04:00", "source": "Facebook", "name": "Leo Kottke"}, {"url": "https://www.facebook.com/events/1579924995611394/", "description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "date": "2016-04-16T20:00:00-04:00", "source": "Facebook", "name": "Bavarian Radio Orchestra"}, {"url": "https://www.facebook.com/events/788218501301041/", "description": "Small-town dreams from a Grammy-nominated country and rock Nashville songwriter", "date": "2016-04-17T19:30:00-04:00", "source": "Facebook", "name": "Will Hoge"}, {"url": "https://www.facebook.com/events/769930223136488/", "description": "Monday, April 18 | 8pm | 18+ | $15 adv./ $17 day of\n\nPolica with MOTHXR \n\nUnited Crushers (out March 4, 2016) is POLIÇA’s third full-length release and most remarkable album to date. The band, which includes Channy Leaneagh, dual drummers, Drew Christopherson and Ben Ivascu and Chris Beirden on bass with producer Ryan Olson at the helm, collectively wrote the album in Minneapolis in the winter of 2015 during their first true break from two straight years of touring. The new album builds on POLIÇA’s signature synthesizer and percussion-heavy sounds with more complex arrangements and a bigger, crisper hi-fi punch due to the new approach they took to writing and recording: together, all in the same room. There's a tighter groove to these songs and a more vulnerable quality to them, especially in Leaneagh's singing. Her incredible vocal range is consistently on display throughout, beautifully raw and less electronically effected than on previous recordings. United Crushers is the follow up to 2013’s Shulamith which EW called \"propulsive enough for dance floors, and dreamy enough for headphones\" andMOJO said \"proves that intelligent pop music still has the ability to seduce and enthral.\" Their debut, 2012's Give You The Ghost, also garnered international acclaim, with Rolling Stone hailing it as \"the sound of heartbreak and celebration happening simultaneously\" and Q praising it as \"a bewitching, urgent, magical debut.\" The band has conquered massive festivals around the world from Coachella to Glastonbury in addition to performing on Late Night With Jimmy Fallon, Later With Jools Holland and more.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/564", "date": "2016-04-18T20:00:00-04:00", "source": "Facebook", "name": "Polica w/ Mothxr 4/18/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1088535237838163/", "description": "\"Lush, introspective, elegant\"—Boston Globe. Photo by Asia Kepka.", "date": "2016-04-21T20:00:00-04:00", "source": "Facebook", "name": "Anne Heaton"}, {"url": "https://www.facebook.com/events/937454106322981/", "description": "\"Nora Jane Struthers has been creating quite a buzz.\"—The Tennessean, Nashville", "date": "2016-04-22T20:00:00-04:00", "source": "Facebook", "name": "Nora Jane Struthers"}, {"url": "https://www.facebook.com/events/1943009162591226/", "description": "Warm as summer sunshine, real as the truth, intimate as a long overdue visit between old friends … such is a Jonathan Edwards concert. Four decades into a stellar career of uncompromising musical integrity, the man simply delivers, night after night – songs of passion, songs of insight, songs of humor, all rendered in that pure and powerful tenor which, like fine wine, has only grown sweeter with age.\nThis is one veteran performer who is neither grizzled nor nostalgic. These days Jonathan is likely to be found on the road. I've been...doing what I do best, which is playing live in front of people. I've been concentrating on that and loving it,\" he says.\nAn artist who measures his success by his ability to attract and take good care of an audience for four decades, Jonathan maintains that it is the feedback he receives after his shows that keeps him going. “It is really gratifying to hear [someone say], ‘Your stuff has meant a lot to me over the years.’”\nThe “stuff” he’s referring to is a highly respected repertoire that includes such classics as “Honky Tonk Stardust Cowboy,” “Sometimes,” “One Day Closer,” “Don’t Cry Blue,” “Emma,” “Everybody Knows Her,” “Athens County,” and everyone’s favorite ode to putting a good buzz on, “Shanty.” And then, of course, there’s the anthemic “Sunshine (Go Away Today),” that fierce proclamation of protest and independence that resonated with thousands and thousands of frustrated and angry young men and women when it was first released in 1971. Almost 40 years later, at show after show, the song continues to be embraced by faithful followers and new fans alike.\nSince 1971, Jonathan has released 15 albums, including Blue Ridge, his standard-setting collaboration with bluegrass favorites the Seldom Scene, and Little Hands, his collection of children’s songs, which was honored with a National Library Association award.\nwww.jonathanedwards.net", "date": "2016-04-22T20:00:00-04:00", "source": "Facebook", "name": "Jonathan Edwards at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/423521121176906/", "description": "A blues and boogie summit! Note special start time.", "date": "2016-04-23T19:30:00-04:00", "source": "Facebook", "name": "Mr. B's Blues and Boogie Celebration"}, {"url": "https://www.facebook.com/events/1589849627952742/", "description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "date": "2016-04-23T20:00:00-04:00", "source": "Facebook", "name": "The Bad Plus Joshua Redman"}, {"url": "https://www.facebook.com/events/831801416940807/", "description": "New music from an expat Australian trio", "date": "2016-04-27T20:00:00-04:00", "source": "Facebook", "name": "The Waifs"}, {"url": "https://www.facebook.com/events/991272244292924/", "description": "Wed. April 27 | 9pm | 18+ | $28 Cover\n\nReverend Horton Heat with: Unknown Hinson, Nashville Pussy & Lucky Tubb & the Modern Day Troubadours Live in Concert!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/612", "date": "2016-04-27T21:00:00-04:00", "source": "Facebook", "name": "Rev. Horton Heat & Company 4/27/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/480751802102134/", "description": "Michigan's cult hero of comedy", "date": "2016-04-29T20:00:00-04:00", "source": "Facebook", "name": "Heywood Banks"}, {"url": "https://www.facebook.com/events/930690620345924/", "description": "Don Campbell is a contemporary/country crossover and folk-rock singer/songwriter whose clear and well-delivered presentation of music supports the story in the song and welcomes the audience on board for the ride. Often compared to the sounds of Dan Fogelberg, Vince Gill, and Chris Isaak, Don and his ensembles are based out of New England. In 2012, Don released a double CD, Kites To Fly: Celebrating the Music of Dan Fogelberg, and in 2013 began presenting live performances of this music around his own busy schedule of Don Campbell shows.\nwww.doncampbellmusic.com", "date": "2016-04-29T20:00:00-04:00", "source": "Facebook", "name": "Don Campbell at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/530159733818023/", "description": "\"A welcome gearshift\"—Real Detroit Weekly", "date": "2016-04-30T20:00:00-04:00", "source": "Facebook", "name": "The Ben Daniels Band"}, {"url": "https://www.facebook.com/events/1650789915178155/", "description": "Genre-crossing jazz virtuosity", "date": "2016-05-02T20:00:00-04:00", "source": "Facebook", "name": "The Julian Lage Trio"}, {"url": "https://www.facebook.com/events/986462064751963/", "description": "An American master of solo songwriting and blues", "date": "2016-05-06T20:00:00-04:00", "source": "Facebook", "name": "Chris Smither"}, {"url": "https://www.facebook.com/events/919947144747827/", "description": "carlacooke.com", "date": "2016-05-06T20:00:00-04:00", "source": "Facebook", "name": "An Evening of Sam Cook by Daughter Carla Cooke"}, {"url": "https://www.facebook.com/events/916584281712332/", "description": "\"Her songs are about living, breathing people.\"—No Depression", "date": "2016-05-07T20:00:00-04:00", "source": "Facebook", "name": "Lucy Kaplansky"}, {"url": "https://www.facebook.com/events/483349811834793/", "description": "\"Her songs are about living, breathing people.\"—No Depression", "date": "2016-05-07T20:00:00-04:00", "source": "Facebook", "name": "Lucy Kaplansky"}, {"url": "https://www.facebook.com/events/1569905103231931/", "description": "\"A profound lyricist and respected composer\"—Toronto Star", "date": "2016-05-13T20:00:00-04:00", "source": "Facebook", "name": "Garnet Rogers"}, {"url": "https://www.facebook.com/events/1637106023218709/", "description": "Harmony Bones is a quartet of long-time veterans of the Ann Arbor folk music scene. The band consists of Jeanne Mackey, Tom Voiles, Linda Teaman, and Laz Slomovits. The name Harmony Bones comes from an acupuncture point that harmonizes imbalances and promotes clear thinking, seeing, and hearing.\nJeanne, Tom, Linda and Laz have joined forces to explore a wide range of traditional, contemporary and original folk songs. Rich vocal harmonies and an array of instruments -- guitar, mandolin, flute, pennywhistle, fiddle, banjo, percussion, sitar -- combine to make Harmony Bones.\nSinger/songwriter Jeanne Mackey offers a blend of emotional intensity, wry humor, and global consciousness. In addition to original tunes, her repertoire ranges from Dar Williams to Patsy Cline, from Pete Seeger to Irving Berlin. A seasoned guitarist, she draws on a variety of styles -- folk, classic swing, funky blues, and more -- with the occasional sprinkle of mandolin, accordion, or banjo. Mackey rocked the 1970s East Coast topical music circuit as a young musician advocating feminist values and social justice.  In 2010, Mackey created \"Drop The Knife: A Memoir-in-Song,\" an evening of original songs and stories exploring the meaning of homeland, curses, death, and magic.\nLinda Teaman and Tom Voiles do much of their singing and playing with Nutshell, an Ann Arbor-based Celtic roots band. Nutshell plays for contra-dances and performs at festivals across North America.\nLinda is a singer who brings depth of understanding, warmth and sensitivity to the music. In 2005, her graduation recital for a degree in k-12 choral music had her singing in five languages, encompassing musical forms such as Irish sean nos singing and Italian and German arias by composers Purcell, Mozart and Brahms. She leads the Rudolf Steiner Community Singers, a small choir that sings uncommon Christmas and seasonal songs of celebration.  She hopes you'll forgive her classical background and that she is redeemed by her love of folk music.  In addition to vocals, she adds light percussion to the mix.\nTom consumes a well-rounded musical diet that ranges from Celtic to Indian to rock and roll. He enjoys mixing different styles while maintaining a respect for the traditions from which they spring. Tom has studied North Indian Classical music, Moroccan folk drumming and western classical flute. He has worked with performance artists, dancers, mimes and poets, including Hosain Mosavat, Gerry the Fool, Matthew Smith, ML Liebler and the Magic Poetry Band.\nLaz Slomovits is one of the twin brothers in Ann Arbor’s nationally-known children’s music duo, Gemini. A fine singer and multi-instrumentalist, Laz is starting his 41st year playing music. His songs are featured in songbooks used by music teachers throughout the country, and Gemini's recordings have won numerous awards. In addition, Laz has had a notable solo career. In his solo work, Laz is best known for his powerful musical settings of the poetry of ancient Sufi mystics Rumi and Hafiz, as well as that of contemporary American poets. He is currently at work on new recordings for both children and adults, as well as a musical play that will be produced by Wild Swan Theater in its upcoming season.", "date": "2016-05-13T20:00:00-04:00", "source": "Facebook", "name": "Harmony Bones at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/1080836985282330/", "description": "The ears and eyes of America!", "date": "2016-05-15T19:30:00-04:00", "source": "Facebook", "name": "The Corn Potato String Band"}, {"url": "https://www.facebook.com/events/148870615480384/", "description": "http://www.patdonohue.com/", "date": "2016-05-20T20:00:00-04:00", "source": "Facebook", "name": "Pat Donahue at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/200517660293245/", "description": "\"The best live performer I've ever seen\"—John Mayer", "date": "2016-05-21T20:00:00-04:00", "source": "Facebook", "name": "Martin Sexton"}, {"url": "https://www.facebook.com/events/1513930968936295/", "description": "Finding the point where blues and the jam bands meet", "date": "2016-05-26T20:00:00-04:00", "source": "Facebook", "name": "Nick Moss"}, {"url": "https://www.facebook.com/events/1698056820481625/", "description": "A direct link to the early days of folk and the blues", "date": "2016-06-10T20:00:00-04:00", "source": "Facebook", "name": "Josh White Jr."}, {"url": "https://www.facebook.com/events/927935930621496/", "description": "October Project's lead vocalist returns", "date": "2016-06-11T20:00:00-04:00", "source": "Facebook", "name": "Mary Fahl"}, {"url": "https://www.facebook.com/events/1124052387614735/", "description": "Newfound Road's amazing lead vocalist steps out with music by Jackson Browne and more. This show has been rescheduled from June 16.", "date": "2016-07-10T19:30:00-04:00", "source": "Facebook", "name": "Tim Shelton"}, {"url": "https://www.facebook.com/events/1690454564522707/", "description": "THIS EVENT HAS BEEN POSTPONED TO LATER IN THE POLITICAL SEASON.  PLEASE CHECK OUT THE NEW NOVEMBER 1ST PROGRAM, \"JOKES IN PROCESS\" THAT WE HAVE PUT INTO ITS PLACE.  \n\nThe presidential candidates have been HILARIOUS this year, but now let's see how the professionals do.\nJoin the Emergent Art's Theater and the UnClub as they present \"UnDebateable, the UnPresidential Debates\".\n\nIf you would like to be a part of this historic event, either as a moderator, an interview, and audience reporter, or an actual campaign spokeperson, or if you can do an impression of a candidate, please click the 'Going' button.  If you can't commit, but you are interested in following this event, click 'Maybe' and we will keep you informed.\n\nWe are also looking for folks who can help us stream a webcast of this event.\n\nWant to be a sponsor?  We'll take that too.", "date": "2016-09-18T21:00:00-04:00", "source": "Facebook", "name": "UnDebateable, the UnPresidential Debates - Clown Car to the White House"}]