[{"source": "Facebook", "date": "2015-09-25T16:00:00-04:00", "url": "https://www.facebook.com/events/1634095426838237/", "description": "Everybody’s working for the weekend!!! \n\nEach Friday we will release a cask conditioned pin - a super limited 4.5 gallon cask – at the bar to kick off whatever you have in store for the weekend. Whether you're going off the deep end, want a new romance or simply need a second chance, these beers are sure to satisfy.  \n\nTypically they will be one-off of a standard brew but accentuated with new and interesting ingredients. It's special, it's unique, it's only on the back of our bar. \n\nThis week’s featured brew is a pin of Sacred Cow IPA, dry hopped with amarillo for an spicy, flowery, distinct orange bouquet aroma.\nGet it.\nTapped@4", "name": "Quitting Time Cask"}, {"source": "Facebook", "date": "2015-09-25T17:30:00-04:00", "url": "https://www.facebook.com/events/1447838492191448/", "description": "The Heidelberg Project is an outdoor art environment in the heart of an urban community on Detroit’s near-east side. The installation was started in 1986 by artist and local resident Tyree Guyton who covered abandoned houses, the street, and the surrounding area with found objects and paintings that express vivid personal, social, and sometimes political themes. The street was gradually transformed into a lively, visually arresting, and often controversial work of art that not only energized the local community but attracted visitors from around the world. Over the last three decades, the project has morphed from the work of a single artist into a broad-based collaboration between Guyton, Executive Director Jenenne Whitfield, and their team of volunteers.\n\t\nOn the occasion of the 30-year anniversary of the Heidelberg Project, Tyree Guyton and Jenenne Whitfield look back over their dramatic journey as they contemplate new possibilities for the future. Exhibition curator MaryAnn Wilkinson will offer remarks about the exhibition at UMMA and Mr. Guyton’s work within the context of the global art community.", "name": "UMMA Dialogue: A Thirty-Year Journey with Tyree Guyton and Jenenne Whitfield"}, {"source": "Facebook", "date": "2015-09-25T18:30:00-04:00", "url": "https://www.facebook.com/events/1633622073571300/", "description": "Join us at the Hands On Museum for a night of boozy exploration! Make an alcohol-ink tile, enjoy three different selections of Wolverine State lagers, and learn about the brewing process! Dave and Marty, pilot brewers at Wolverine State, along with the People's Food Co-op's Bridget O'Brien, will be on hand to present the science behind fermentation and brewing. Sliders will be available from Knight's, and additional refreshments will be provided by the People's Food Co-op. \n\nTickets are $25 for members, $30 for non-members. Register and purchase your tickets on Eventbrite! http://www.eventbrite.com/e/a-pint-at-the-museum-tickets-17835548606?aff=es2", "name": "A Pint at the Museum"}, {"source": "Facebook", "date": "2015-09-25T19:00:00-04:00", "url": "https://www.facebook.com/events/1063994200280399/", "description": "Literati is pleased to welcome friend of the store Robert James Russell to launch his western novel, Mesilla. Reading with Robert will be Chicago-based author Ben Tanzer.\n\n1863, New Mexico Territory. Shot full of holes and on the run from the relentless pursuit of his one-time friend now intent on retribution, Confederate deserter Everett Root finds himself navigating the brutal desert headed to the town of Mesilla.\n\n“In a mounting gush of sumptuous prose, Robert James Russell’s Mesilla scrubs bare the elements of the classic Western—the wounded, questing hero, the damsel in distress, the phantasmal villain in hot pursuit—and reinvents them as existential meditation.”—Matthew Gavin Frank\n\n“A shotgun marriage between classic and revisionist Western, Mesilla sings a hard-bitten practicality and brutal authenticity.” —Emily Schultz, author of The Blondes\n\nA born and bred Michigander, Robert James Russell is the co-founding editor of the literary journal Midwestern Gothic, which aims to catalog the very best fiction of the Midwestern United States (an area he believes is ripe with its own mythologies and tall tales, yet often overlooked), as well as the micro-press MG Press. In 2013 he launched the online literary journal CHEAP POP, which publishes micro-fiction, 500 words or less.\n\nFascinated by regionalist literature and the intersection of place and relationships, his work has appeared in numerous publications, both print and online. His first novel, Sea of Trees, was published by Winter Goose Publishing in 2012. His first collection of stories, Don’t Ask Me to Spell It Out, was released in April 2015 by WhiskeyPaper Press.  His Western novel, Mesilla, will be released in September 2015 by Dock Street Press. He’s been nominated three times for the Pushcart Prize, and was awarded an artist residency with the University Musical Society for the 2014-2015 performance season.\n\nBen Tanzer is the author of the books My Father’s House, You Can Make Him Like You, So Different Now, Orphans and Lost in Space, among others. Ben can be found online at This Blog Will Change Your Life, the center of his growing lifestyle empire. He lives in Chicago with his wife and two sons.", "name": "Robert James Russell, ft. Ben Tanzer"}, {"source": "Facebook", "date": "2015-09-26T09:00:00-04:00", "url": "https://www.facebook.com/events/1535272080092255/", "description": "Join us to celebrate National Public Lands Day by volunteering at Oakwoods Nature Area. We'll be cutting and removing invasive shrubs such as buckthorn and honeysuckle to restore the habitat in this area. These invasive species crowd out native wildflowers and tree seedlings.", "name": "Stewardship Workday at Oakwoods Nature Area"}, {"source": "Facebook", "date": "2015-09-26T09:00:00-04:00", "url": "https://www.facebook.com/events/900096393412738/", "description": "Join us to celebrate National Public Lands Day by volunteering at Wurster Park. Bring friends and family out to lend a hand removing invasive shrubs from this quaint 5-acre park! While you're there you can admire Wurster’s own champion Chinquapin Oak and the hilltop view of Ann Arbor.", "name": "Stewardship Workday at Wurster Park"}, {"source": "Facebook", "date": "2015-09-26T11:00:00-04:00", "url": "https://www.facebook.com/events/504714833012958/", "description": "During the 1920s the Soviet Union emerged on the world stage. The first decade was full of hope for a new social order that would reject the values and traditions of Tsarist rule. Centered in Moscow, a group of young artists, spearheaded in part by Vladimir (1899-1982) and Georgy Stenberg (1900-1933), championed an art that promoted the egalitarian ideals of the New Order and contributed to the growth of the Soviet Union. Known as the Constructivists, they advocated for utilitarian art that was easily accessible and spoke to the masses. Among their most provocative and visionary works were posters advertising Soviet films.\n\t\nUMMA’s exhibition, Soviet Constructivist Posters: Branding the New Order features a selection of posters by the Stenbergs and other Constructivists for some of early cinema’s most inventive films including, Sergei Eisenstein’sOctober and Dziga Vertov’s Man with a Movie Camera.\n\t\nUsing dynamic compositions, bold colors, and emblematic images, these posters announced that the Soviet Union was a progressive nation that could propel society into a utopian future. Their revolutionary aesthetic became associated with the workers’ movement and helped to shape how it was understood both at home and abroad. Though Constructivism went out of favor in the 1930s with the rise of Joseph Stalin (1878–1953), Constructivist designs continued to have an influence abroad. Today, their legacy can be seen in advertisements and other promotional materials made for the public eye.\n\t\nLead support for this exhibition is provided by the University of Michigan Weiser Center for Emerging Democracies and the Center for Russian, East European, and Eurasian Studies.", "name": "Soviet Constructivist Posters: Branding the New Order"}, {"source": "Facebook", "date": "2015-09-26T11:15:00-04:00", "url": "https://www.facebook.com/events/1603511863232037/", "description": "Children ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. The story on September 26 will introduce children to UMMA’s exhibition The Art of Tyree Guyton: A Thirty-Year Journey. Meet in front of the UMMA Store.\n\t\nStorytime at the Museum is generously supported by the University of Michigan Credit Union, UMMA's Lead Sponsor for Student and Family Engagement. \n\t\nLead support for The Art of Tyree Guyton: A Thirty-Year Journey is provided by the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, the Andy Warhol Foundation for the Visual Arts, Lisa Applebaum, and the University of Michigan Taubman College of Architecture and Urban Planning and School of Social Work.", "name": "Storytime at the Museum"}, {"source": "Facebook", "date": "2015-09-26T16:30:00-04:00", "url": "https://www.facebook.com/events/133881643624053/", "description": "A2D2's Season Closer is a triple header! \nDoors at 4:30, first bout at 4:50:\n\nFirst bout: Ann Arbor Brawlstars vs Killamazoo Kill Stars\n\nSecond bout: Wave 10 Premiere Mini Bout - A2D2's most recent \"fresh-meat\" bootcamp graduates make their first public appearance in a mini bout, consisting of two mixed teams comprised of the graduates. \n\nThird bout: Arbor Bruising Co. vs Killamazoo Kill Crew\n\nAdmission $12 pre-sale, $15 at the door. Kids under 12 FREE with paid admission (2 for each paying adult).\n\nTasty concessions from Ray's Red Hots, and Sweetwaters Coffee & Tea.\n\nAfter party open to guests 18+ at MAIZ Mexican Cantina - 36 E Cross St, Ypsilanti, MI 48198 \n\nBuy tickets: http://bpt.me/1220041", "name": "Ann Arbor Roller Derby Triple Header"}, {"source": "Facebook", "date": "2015-09-27T12:30:00-04:00", "url": "https://www.facebook.com/events/677018942398030/", "description": "It's Easy Being Green is a day-long learning, local buying, and eating celebration of living a life that’s better for the planet and not so hard on the wallet. From supporting efforts to reduce your carbon footprint to learning homesteading skills for living a more hands-on, DIY life, It's Easy Being Green has you covered!\nhttp://www.aadl.org/green", "name": "It's Easy Being Green: A Sustainable Living Expo"}, {"source": "Facebook", "date": "2015-09-27T13:00:00-04:00", "url": "https://www.facebook.com/events/823986854374892/", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour: Engaging with Art"}, {"source": "Facebook", "date": "2015-09-27T13:00:00-04:00", "url": "https://www.facebook.com/events/840766116021739/", "description": "What two words sound the most glorious when said together? FREE BEER, of course!\nJoin us in our Beer and Wine department for a spectacular sampling event featuring some of the best breweries around. We can't think of a better start to a Sunday afternoon!\nMust be 21 years old with valid state ID to taste.", "name": "Mini Vendor Fair- Beer!"}, {"source": "Facebook", "date": "2015-09-27T14:00:00-04:00", "url": "https://www.facebook.com/events/1623348677919834/", "description": "Known for an iconoclastic pictorial language of eccentric materials and radically unconventional techniques, New York painter and filmmaker Julian Schnabel (born 1951) has been a pioneering, and controversial figure in the art world. Featuring works from the mid-1970s to the present, including pieces from Schnabel’s most well-known series, the Plate Paintings and Wax Paintings, this exhibition explores the artist’s use of found materials, his experimentation with chance operations, and his idiosyncratic and inventive mark-making. Enjoy Schnabel’s unorthodox art with an UMMA docent tour. \n\t\nThis exhibition was organized by the Brant Foundation Art Study Center. Lead support for UMMA’s installation is provided by Joseph and Annette Allen, the University of Michigan Office of the Provost, the University of Michigan Health System, the Richard and Rosann Noel Endowment Fund, and Retirement Income Solutions.", "name": "Gallery Tour: Julian Schnabel"}, {"source": "Facebook", "date": "2015-09-27T17:00:00-04:00", "url": "https://www.facebook.com/events/1026006787440432/", "description": "Literati is pleased to welcome Jon Fine, author of Your Band Sucks: What I Saw at Indie Rock's Failed Revolution (But Can No Longer Hear).\n\n“[E]verything a cult-fave musician’s memoir should be: It’s a seductively readable book that requires no previous knowledge of the author, Bitch Magnet or any other band with which he’s played.”\n—Janet Maslin, The New York Times\n\nJon Fine spent nearly thirty years performing and recording with bands that played various forms of aggressive and challenging underground rock music, and, as he writes in this memoir, at no point were any of those bands “ever threatened, even distantly, by actual fame.” Yet when members of his first band, Bitch Magnet, reunited after twenty-one years to tour Europe, Asia, and America, diehard longtime fans traveled from far and wide to attend those shows, despite creeping middle-age obligations of parenthood and 9-to-5 jobs, testament to the remarkable staying power of the indie culture that the bands predating the likes of Bitch Magnet–among them Black Flag, Mission of Burma, and Sonic Youth –willed into existence through sheer determination and a shared disdain for the mediocrity of contemporary popular music.\n \nIn indie rock’s pre-Internet glory days of the 1980s, such defiant bands attracted fans only through samizdat networks that encompassed word of mouth, college radio, tiny record stores and ‘zines. Eschewing the superficiality of performers who gained fame through MTV, indie bands instead found glory in all-night recording sessions, shoestring van tours and endless appearances in grimy clubs. Some bands with a foot in this scene, like REM and Nirvana, eventually attained mainstream success. Many others, like Bitch Magnet, were beloved only by the most obsessed fans of this time.\n \nLike Anthony Bourdain’s Kitchen Confidential, Your Band Sucks is an insider’s look at a fascinating and ferociously loved subculture. In it, Fine tracks how the indie-rock underground emerged and evolved, how it grappled with the mainstream and vice versa, and how it led many bands to an odd rebirth in the 21 st  Century in which they reunited, briefly and bittersweetly, after being broken up for decades. Like Patti Smith’s Just Kids, Your Band Sucks is a unique evocation of a particular aesthetic moment. With backstage access to many key characters in the scene—and plenty of wit and sharply-worded opinion—Fine delivers a memoir that affectionately yet critically portrays an important, heady moment in music history.\n\nJon Fine is the executive editor of Inc. magazine. As a guitarist—in Bitch Magnet, Coptic Light, and Don Caballero, among others–he’s performed around the world and appeared on MTV. As a writer, Fine’s long-running BusinessWeek column “Media Centric” won both American Society of Business Publication Editors and National Headliner awards, and his work for Food & Wine won a James Beard Award. He has served as an on-air contributor to CNBC, and his work has also appeared in The Atlantic, GQ, and Details.", "name": "Jon Fine"}, {"source": "Facebook", "date": "2015-09-30", "url": "https://www.facebook.com/events/463341333828385/", "description": "Need a fantastic end-of-year gift for your fave teacher? Grab a bag of Sweetwaters' new blend, Scholar Joe, in stock right now! For every bag you buy, Lucky's Market will make a donation to the Ann Arbor Public Schools Educational Foundation!", "name": "Scholar Joe- Supporting the AAPSEF"}, {"source": "Facebook", "date": "2015-09-30T18:00:00-04:00", "url": "https://www.facebook.com/events/493151567529254/", "description": "In May, 2014, voters in the greater Ann Arbor and Ypsilanti areas approved funding for TheRide’s Five-Year Transportation Improvement Program (5YTIP).  As promised, TheRide will implement a major portion of those service improvements in May, 2016, and is seeking public input from residents in the greater Ann Arbor and Ypsilanti areas on the proposed refinements.  For more details on the proposed refinements, please visit the TheRideYourWay.org.\n \nResidents unable to attend a meeting can submit comments between September 18 and October 18 by email, phone, and mail:\nEmail: TellUs@TheRide.org (subject line should read “May, 2016 service changes”)\nPhone: 734-794-1880\nFax: 734-973-6338\nMail:\nTheRide – May, 2016 Service Changes\n2700 S. Industrial Hwy.\nAnn Arbor, MI 48104", "name": "Public input meeting for proposed May, 2016 5YTIP improvements"}, {"source": "Facebook", "date": "2015-09-30T19:00:00-04:00", "url": "https://www.facebook.com/events/910676398998635/", "description": "Literati is thrilled to welcome Claire Vaye Watkins in support of her first novel, Gold Fame Citrus.\n\n“An extraordinary novel: relentlessly brilliant, utterly fearless, and often savagely funny. Watkins explores the maze of human thirst in all its forms. Here’s a love story that tracks the mutating hopes of two lost souls, in prose that is fever-bright and ferociously assured, against the backdrop of the Great American Desert. More confirmation that Watkins is one of the brightest stars in our firmament.”\n–Karen Russell\n\nIn 2012, Claire Vaye Watkins’s story collection, Battleborn, swept nearly every award for short fiction. Now this young writer, widely heralded as a once-in-a-generation talent, returns with a first novel that harnesses the sweeping vision and deep heart that made her debut so arresting to a love story set in a devastatingly imagined near future:\n\nUnrelenting drought has transfigured Southern California into a surreal, phantasmagoric landscape. With the Central Valley barren, underground aquifer drained, and Sierra snowpack entirely depleted, most “Mojavs,” prevented by both armed vigilantes and an indifferent bureaucracy from freely crossing borders to lusher regions, have allowed themselves to be evacuated to internment camps. In Los Angeles’ Laurel Canyon, two young Mojavs—Luz, once a poster child for the Bureau of Conservation and its enemies, and Ray, a veteran of the “forever war” turned surfer—squat in a starlet’s abandoned mansion. Holdouts, they subsist on rationed cola and whatever they can loot, scavenge, and improvise.\n\nThe couple’s fragile love somehow blooms in this arid place, and for the moment, it seems enough. But when they cross paths with a mysterious child, the thirst for a better future begins. They head east, a route strewn with danger: sinkholes and patrolling authorities, bandits and the brutal, omnipresent sun. Ghosting after them are rumors of a visionary dowser—a diviner for water—and his followers, who whispers say have formed a colony at the edge of a mysterious sea of dunes.\n\nImmensely moving, profoundly disquieting, and mind-blowingly original, Watkins’s novel explores the myths we believe about others and tell about ourselves, the double-edged power of our most cherished relationships, and the shape of hope in a precarious future that may be our own.\n\nClaire Vaye Watkins is the author of Battleborn, winner of the Story Prize, the Rosenthal Family Foundation Award from the American Academy of Arts and Letters, and a Silver Pen Award from the Nevada Writers Hall of Fame. Battleborn was named a Best Book of 2012 by the San Francisco Chronicle, Boston Globe, Time Out New York, and Flavorwire, and a Best Short Story Collection by NPR.org.  An assistant professor at Bucknell University, Claire is also the co-director, with Derek Palacio, of the Mojave School, a free creative writing workshop for teenagers in rural Nevada.", "name": "Claire Vaye Watkins"}, {"source": "Facebook", "date": "2015-09-30T19:30:00-04:00", "url": "https://www.facebook.com/events/185155728485856/", "description": "Please join us for the last Poto MBA Chapter meeting of the year.  With serious Waterloo Trail work about to begin, we'll be giving a thorough update on all the latest news there.  We'll also be discussing winter trail grooming, advocacy representation at the state level, format for meetings next year and more.", "name": "Poto MBA Chapter Meeting"}, {"source": "Facebook", "date": "2015-09-30T20:00:00-04:00", "url": "https://www.facebook.com/events/994489937280837/", "description": "The Dimes want YOU to join us for our end of season party!\n\nWe're leaving our skates at home, packing our vans full of fans, friends and strangers we find on the street and heading over to the Necto to celebrate the end of the 2015 home season.\n\nSpecial drink menu and food available\n\nDJ Selina Style will keep the tunes flowing all night long\n\nA2D2 Merch will be available for purchase\n\n18+ welcome. Doors open at 8pm\n\nTickets are $5 at the door OR $5 at our final home bout of the season at Buhr Park on Saturday, September 26th!\n\nThis event is open to the public.", "name": "A2D2 Bout Out"}, {"source": "Facebook", "date": "2015-10-01T07:00:00-04:00", "url": "https://www.facebook.com/events/1501167343526834/", "description": "Celebrate our October Community Impact Partner, the Ann Arbor Public Schools Educational Foundation. 10% of all daily sales will go to support their programs in our community.\n\nThe AAPSEF gives grants to schools, and scholarships and awards to students.  Their grants inspire innovative, creative approaches to learning from pre-K through high school. They help keep AAPS points of distinction stay cutting edge. Increasingly, they help enhance programs that could be impacted by budget forces and boost innovative programs to help maintain education excellence.", "name": "Community Impact Day- Benefiting the AAPSEF"}, {"source": "Facebook", "date": "2015-10-01T17:30:00-04:00", "url": "https://www.facebook.com/events/153946911615464/", "description": "Cathy Park Hong's first book, Translating Mo'um was published in 2002 by Hanging Loose Press. Her second collection, Dance Dance Revolution, was chosen for the Barnard Women Poets Prize and was published in 2007 by W.W. Norton. Her third book of poems, Engine Empire, was published in Spring 2012 by W.W. Norton. Hong is also the recipient of a Fulbright Fellowship, a National Endowment for the Arts Fellowship, and the New York Foundation for the Arts Fellowship. Her poems have been published in A Public Space, Poetry, Paris Review, Conjunctions, McSweeney's, APR, Harvard Review, Boston Review, The Nation, and other journals. She is an Associate Professor at Sarah Lawrence College and is regular faculty at the Queens MFA program in Charlotte, North Carolina.\n\tThe Zell Visiting Writers Series is presented by the Helen Zell Writers’ Program in partnership with the University of Michigan Museum of Art, with support from the Department of English Language & Literature, the Office of the Vice President for Research, and Janey Lack. For additional information visit lsa.umich.edu/writers.", "name": "Cathy Park Hong Poetry Reading"}, {"source": "Facebook", "date": "2015-10-01T18:00:00-04:00", "url": "https://www.facebook.com/events/1639454666285655/", "description": "The music of The Growlers is unmistakable.\n\nSure, you can hone in on some influences baked into the work of this California-bred band. Heck, even they’d cop to a few, like Ricky Nelson and The Clash. But once those same RIYL tags have been filtered through the minds and hands and voices of this five-piece, there’s simply nothing else like it.\n\nThe Growlers took the phrase “Beach Goth” as an apt descriptor of their music. Sunburned and salty, that term perfectly describes their distinctive melding of reverb heavy surf guitar and Bakersfield-style honky tonk with ‘80s post-punk.\n\nThis is especially true of Chinese Fountain, The Growlers’ fifth full-length set to be released on September 23rd via Everloving Records. The 11 songs found on it are some of the strongest that they’ve committed to tape yet; a byproduct not only of eight years in the trenches together, but finely honing their gypsy folk dirges and psychedelic sea shanties to fans at close to 150 shows each year. The connection between vocalist Brooks Nielsen and guitarist Matt Taylor (the principal songwriters of the group) has only grown deeper.\n\n“The band played better than they’ve ever played,” says Nielsen. “We’ve got the process down now. There’s less screwing around to get the songs laid out and we weren’t waiting around for take after take. We knew it and we played without much time to spare.”\nThat confidence bleeds through every track on Chinese Fountain, with the band assured enough to layer in shades of many new influences: the loping ska beat of “Dull Boy” and “Going Gets Tuff,” the playful disco beat behind the title track, or the Teardrop Explodes-like agitation of “Good Advice.”\n\nNot that the band left themselves much room to second-guess anything. The five spent about three weeks writing the tracks, and about half that time in the studio recording them. That may sound rushed, but it’s not as if you can hear any strain on the finished product; Chinese Fountain is as rock solid and watertight as anything in their still-growing discography.\n\nThere’s evolution to be heard in Chinese Fountain as well, courtesy of some of Nielsen’s most pointed and poignant lyrics to date. He takes our obsession with the online world to task on the funky title track. When he drops the bomb that obliterates that most famous of Beatles’ claims with \"The internet is bigger than Jesus or John Lennon” he re-contextualizes Marshall McLuhan's \"the medium is the message\" in the same breath. He urges positivity no matter the obstacles (“Going Gets Tuff”). Too, he reveals a tattered heart to the world on tracks like “Rare Hearts” and “Love Test.”\n\n“This is my chance to let it all out,” Nielsen says of these songs. “I kind of bottle things up and don’t really get emotional. But I think if I don’t open up, I’d be a really stale person.”\n\nWSG: The Babe Rainbow\n& The Super Duper Sounds of DJ Johnny Basil - www.johnnybasil.com\n\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/392", "name": "The Growlers 10/1/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-01T20:00:00-04:00", "url": "https://www.facebook.com/events/819142474860659/", "description": "In celebration of WEMU’s 50th anniversary, the Ann Arbor Summer Festival and WEMU co-present NPR’s Wait Wait…Don’t Tell Me!\n\nBe a part of the live audience recorded for broadcast on the following Saturday, in the iconic Hill Auditorium.\n\nNow in its 17th season, Wait Wait… Don’t Tell Me! is National Public Radio’s Peabody Award-winning quiz show. Host Peter Sagal leads a rotating panel of comedians, humorists and journalists, listener contestants and celebrity guests through a comic review of the week’s news. Contestants vie for the most coveted prize in all of public radio: a custom-recorded greeting by scorekeeper emeritus Carl Kasell for their voicemail.", "name": "NPR Presents: Wait Wait … Don’t Tell Me!"}, {"source": "Facebook", "date": "2015-10-02T19:00:00-04:00", "url": "https://www.facebook.com/events/1504020063224700/", "description": "Literati is pleased to welcome Amelia Gray and Colin Winnette as part of our ongoing Fiction at Literati Series.\n\nAmelia Gray is the author of four books: AM/PM, Museum of the Weird, THREATS, and Gutshot. Her fiction and essays have appeared in The New Yorker, The New York Times, The Wall Street Journal, Tin House, and VICE. She lives in Los Angeles.\n\nColin Winnette is the author of Revelation, Animal Collection, Fondly, Coyote, and Haints Stay. His work has appeared in The Believer, The American Reader, Gulf Coast, Buzzfeed, and many other publications. He conducts a semi-regular interview series for Electric Literature, and he is an associate editor of PANK.\n\nAaron Burch is the founding editor of Hobart and the author of three books, most recently Backswing (Queen’s Ferry Press). He lives in Ann Arbor, MI, where he teaches at the University of Michigan and Eastern Michigan University.", "name": "Amelia Gray, Colin Winnette, & Aaron Burch"}, {"source": "Facebook", "date": "2015-10-02T19:00:00-04:00", "url": "https://www.facebook.com/events/948644511846117/", "description": "OUTFest, an annual event marking National Coming Out Day, returns to Ann Arbor's Kerrytown District with an array of activities for the lesbian, gay, bisexual, transgender (LGBT) and allied communities of Washtenaw County area. Weekend events are open to all attendees! \n\n*Note that registration is required for educational workshops.\nVisit http://www.a2outfest.com for full event details!\n\nFriday, October 2nd\n\n- 7:00pm: Time Warp in Braun Court - outdoor movie screening and costume contest\n*https://www.facebook.com/events/556802067806869/\n\n- 9:00pm-1:00am: OUTFest Pride Night at Necto*\n\nSaturday, October 3rd\n\n- 9:30-10:30am: Community Yoga with Breathe Yoga\n*https://www.facebook.com/events/708997365903890/\n\n- 11:00am-4:00pm: OUTFest Expo - Community resource tables and children's activities in the courtyard\n*https://www.facebook.com/events/1485623321738360/\n\n- 12:00-4:00pm: Educational Workshops - Legal, Insurance, Mental Health, and Queer and Trans Persons of Color\nRegistration: http://a2outfest.com/event/workshops-expo/\n\n- 12:00-6:00pm: Music in the courtyard - Kate Peterson, Tracy Mack, Gwenyth Hayes, and Markita Moore from Elemental Meaning!\n\n- 6:00-7:00pm: OUTSpoken Poetry Slam Hour, hosted by Jason Crawford\n\n- 7:00pm-11:00pm: Game Night and Brillig Dry Bar at Mighty Good Coffee \n*https://www.facebook.com/events/749480941847056/\n\n- 8:00pm-2:00am: Necto Night in Braun Court, featuring Boylesque Drag Show\n*https://www.facebook.com/events/861916100571384/\n\n***$5.00 suggested donation for all events.  All proceeds benefit the Jim Toy Community Center.", "name": "OUTFest"}, {"source": "Facebook", "date": "2015-10-02T19:00:00-04:00", "url": "https://www.facebook.com/events/556802067806869/", "description": "Costume contest begins at 7:00PM with guest judge and emcees!  Free pizza provided by Domino’s!\n\nScreening beings at 7:30PM!\nJoin us as we screen this cult classic that brought you the Time Warp!\n\nSuggested donation of $5.  Proceeds benefit the Jim Toy Community Center.\n\nPlease stay tuned for any rain location details via www.a2outfest.com!\n\n\nWHAT TO BRING\n\nProp List: OK to Bring!\nRice, newspapers, toast, water pistols, flashlights, rubber gloves, noise makers, confetti, party hats, bells, and playing cards.  \n\nFor sanitary and safety reasons, we ask that you do not bring any unlisted props.\n\n\nBe sure to bring a blanket to keep warm and for seating!", "name": "Time Warp in Braun Court"}, {"source": "Facebook", "date": "2015-10-03T09:30:00-04:00", "url": "https://www.facebook.com/events/708997365903890/", "description": "OUTFest presents Community Yoga with Breathe Yoga of Chelsea.  This class is open to the public and accessible to all levels of yoga experience!  The class features Chelsea yogis, Sue Whitmarsh & Marie Brooks.    \n\nSuggested Donation: $5.  All proceeds benefit the Jim Toy Community Center.\n\nWhat to bring?\n- Yoga mat\n- Water bottle\n\n\nFor more information on Breathe Yoga, please visit breatheyogachelsea.com.\n\nFor more information on OUTFest, please visit a2outfest.com.", "name": "OUTFest Community Yoga with Breathe Yoga"}, {"source": "Facebook", "date": "2015-10-03T11:00:00-04:00", "url": "https://www.facebook.com/events/1485623321738360/", "description": "OUTFest continues into Saturday with a community celebration and expo!  \n\n11am-4pm NETWORK! Tables & Community Sponsors\n12-4pm      LEARN! Workshops & Safe Spaces\n12-7pm      LIVE PERFORMANCES! Music & Entertainment\n\nNETWORK!  11AM-4PM\n\nFeaturing our OUTFest Workshops & Expo in Braun Court.  Take the chance and connect with partnering organizations and non-profits who will be tabling at OUTFest.  Expo participants will be located opposite of the Kerrytown Farmers Market on the Braun Court side of the street.\n\n\nLEARN! 12-4PM\n\nAll workshops will be taking place in Braun Court’s Jim Toy Community Center & the Kerrytown Concert House.   Registration is required at: http://goo.gl/forms/oghuH0dp5O.  \n\n\n\nLIVE PERFORMANCES!  12-7PM\n\nFeaturing live performances by Markita Moore from Elemental Meaning, Gwenyth Hayes, Tracy Mack, Kate Peterson from Nervous but Excited, and the OUTSpoken Poetry Slam with Jason Crawford.\n \nFor a full schedule, please visit a2outfest.com.", "name": "OUTFest Community Celebration and Expo"}, {"source": "Facebook", "date": "2015-10-03T19:00:00-04:00", "url": "https://www.facebook.com/events/749480941847056/", "description": "OUTFest 2015 proudly announces \"Game Night at Brillig Dry Bar\"!\n\nCome join us for a night out with handcrafted non-alcoholic drinks, good community, and games! Some games will be provided; you are welcome to bring your own as well.  Attendance prizes will be available! \n\nThis event is sponsored by the Vault of Midnight & Brillig Dry Bar.  Suggested event donation is $5.  Event donations/proceeds help benefit the Jim Toy Community Center.\n\nMore event information can be found at www.a2outfest.com!\n\nVault of Midnight\nwww.vaultofmidnight.com/store\n\nBrillig Dry Bar\nbrilligdrybar.com\n\nJim Toy Community Center\njimtoycenter.org", "name": "OUTFest presents Game Night at Brillig Dry Bar"}, {"source": "Facebook", "date": "2015-10-03T20:00:00-04:00", "url": "https://www.facebook.com/events/861916100571384/", "description": "Closing out OUTFest weekend... party like you need to!  Necto in Braun Court Drag Show hosted by the amazing Boylesque and DVJ Mark - Necto Red Room!\n\nCelebrate and enjoy this evening outside in Braun Court!  Invite your friends!  Suggested cover donation is $5.  Proceeds help benefit the Jim Toy Community Center.  \n\nEvent is 18 plus!  Stay tuned to a2outfest.com for more information.", "name": "OUTFest presents Necto In Braun Court Drag Show & DJ"}, {"source": "Facebook", "date": "2015-10-03T21:00:00-04:00", "url": "https://www.facebook.com/events/917223334986199/", "description": "Sat. October 3 | 9pm | 18+ | $14 Cover\n\nRub-ble-buck-et [ru-bul-buck-it] Noun 1. A vessel in which workers collect waste materials on a construction site; We need a rubblebucket for all this rubble. 2. A wild art-pop band from Brooklyn, NY; I’m jonesing for the new Rubblebucket album ‘Survival Sounds’. 3. The condition of having hard nipples, or riding a mean yes wave; He has great Rubblebucket. Verb 4. The act of uncrossing one’s arms and letting loose, while strange, new feelings and sounds flood mind and body, leading to uncontrollable dancing, possible injury and definite sweat; Man, we really put the rubble in the bucket last night. WSG: ELEL\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/457", "name": "Rubblebucket w/ ELEL 10/3/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-04T11:00:00-04:00", "url": "https://www.facebook.com/events/444473625739142/", "description": "Vault of Midnight is excited to announce that Gene Yang will be visiting both Vault locations for signings and to promote his new book Secret Coders, which will be available for purchase September 29th! \n\nYang is one of the most celebrated comic book creators of his generation, and was the first graphic novelist to be nominated for the National Book Award for his 2006 book \"American Born Chinese\". That work would go on to win the American Library Association’s Printz Award (the first graphic novel to receive that honor) as well as an Eisner Award (the comic industry’s most prestigious commendation). \n\nIn addition to a slew of other original graphic novels including Boxers and Saints, Level Up, and Shadow Hero, Yang is additionally and currently the writer for DC Comics’ Superman as well as the Dark Horse Comics’ \"Avatar: The Last Airbender\", which sequels the television show.\n\nGene will be signing in the Ann Arbor Location on October 4th from 11:00 am - 2:00 pm, and in the Grand Rapids location from 6:00 pm - 8:00 pm.\n\nVault of Midnight has worked hard to make sure that Yang's collected works will be available building up to and during his appearances. \n\nThis is sure to be an amazing opportunity to meet one of the world's most renowned comic creators!", "name": "Gene Yang Signing"}, {"source": "Facebook", "date": "2015-10-04T11:00:00-04:00", "url": "https://www.facebook.com/events/444473625739142/", "description": "Vault of Midnight is excited to announce that Gene Yang will be visiting both Vault locations for signings and to promote his new book Secret Coders, which will be available for purchase September 29th! \n\nYang is one of the most celebrated comic book creators of his generation, and was the first graphic novelist to be nominated for the National Book Award for his 2006 book \"American Born Chinese\". That work would go on to win the American Library Association’s Printz Award (the first graphic novel to receive that honor) as well as an Eisner Award (the comic industry’s most prestigious commendation). \n\nIn addition to a slew of other original graphic novels including Boxers and Saints, Level Up, and Shadow Hero, Yang is additionally and currently the writer for DC Comics’ Superman as well as the Dark Horse Comics’ \"Avatar: The Last Airbender\", which sequels the television show.\n\nGene will be signing in the Ann Arbor Location on October 4th from 11:00 am - 2:00 pm, and in the Grand Rapids location from 6:00 pm - 8:00 pm.\n\nVault of Midnight has worked hard to make sure that Yang's collected works will be available building up to and during his appearances. \n\nThis is sure to be an amazing opportunity to meet one of the world's most renowned comic creators!", "name": "Gene Yang Signing"}, {"source": "Facebook", "date": "2015-10-04T13:00:00-04:00", "url": "https://www.facebook.com/events/1646598688947911/", "description": "To register for this free program, email umma-program-registration@umich.edu or call 734.647.0522 for more information. Please include date and title of program in the subject line of your email.\n\tMeet Me at UMMA invites people with mild memory loss to enjoy a guided gallery experience along with family members or care partners. This program is designed for people who live at home and their companions.\n\tIf you or someone you care about is experiencing mild memory loss, research has shown that the visual and expressive arts can be good for your mind. In addition, great enjoyment is to be found in seeking out the sights, sounds, textures, and good feelings that come with looking at, learning, and sharing feelings about paintings, music, and other creative arts.\n\tUMMA's trained docents will accompany small groups for a guided tour and provide the opportunity for everyone to experience different kinds of art and share their responses.\n\tMeet Me at UMMA is generously supported by individual donors, and as part of the Museum’s Docent Program, it is made possible in part by the Katherine Tuck Enrichment Fund and the Doris Sloan Memorial Fund.", "name": "Meet Me at UMMA: A Museum Arts Experience for Persons with Mild Memory Loss and Their Care Partners"}, {"source": "Facebook", "date": "2015-10-04T13:00:00-04:00", "url": "https://www.facebook.com/events/866245306797790/", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour: Engaging with Art"}, {"source": "Facebook", "date": "2015-10-04T14:00:00-04:00", "url": "https://www.facebook.com/events/789591651153395/", "description": "The Heidelberg Project, celebrating its 30th anniversary in 2016, is one of the largest, best-known, and longest-running site-specific art installations in the country. Occupying more than two blocks along Heidelberg Street on Detroit’s East Side it has been the life’s work of artist Tyree Guyton who grew up on Heidelberg Street. Encouraged by his housepainter grandfather to become an artist, and with the help of neighborhood children, the project has transformed its neighborhood. Join UMMA docents as they explore this installation, including the two new works created specifically for this exhibition.\n\tLead support for the exhibition The Art of Tyree Guyton: A Thirty-Year Journey is provided by the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, the Andy Warhol Foundation for the Visual Arts, Lisa Applebaum, and the University of Michigan Taubman College of Architecture and Urban Planning and School of Social Work.", "name": "Guided Tour: The Art of Tyree Guyton: A Thirty-Year Journey"}, {"source": "Facebook", "date": "2015-10-04T18:30:00-04:00", "url": "https://www.facebook.com/events/1634542646821206/", "description": "tl;dr: \nnew place: Espresso Royale on State St.\nnew time: 7pm [sign-ups open at 6:30]\nnew model: bi-weekly on 1st and 3rd Sundays\n\n\nBring your friends and join us for our first show of the new slam season! This weekend, come out to one of the most intimate and longest-running poetry slam scenes in the nation. \n\nWe meet up every week, but only put on a show on 1st and 3rd Sundays. This will be our first event in our new home at Espresso Royale on State St, and at our new time of 7pm!\n\nThis is an ancient, yet fresh and timeless experience: you, a stage, and everything you need to say for an audience who is ready to hear it. Bring yourself, bring your story, and we'll bring the love.\n\nFREE [$5 Suggested Donation]\n\nMORE ABOUT THE FEATURE:\n\nRJ Walker is a performance poet from Salt Lake City, Utah. RJ Has performed at the national poetry slam thrice, representing Salt Lake City, and Sugar House Utah. He has also represented Sugar House twice at the Individual world poetry slam, where he was runner up for the IWPS 2014 Haiku Death Match , and he was currently ranked 23rd at IWPS 2014. \n\nHe has performed at the Texas Grand Slam poetry competition as well as the Southwest Shootout and Denver 40oz poetry competitions, where he has been a finalist. He is the host and operator of The Greenhouse Effect Open Mic, SLC’s most diverse and most popular open mic. He is the president of the Wasatch Wordsmiths, a nonprofit organization that operates SLC's spoken word scene. \n\nHe has distinguished himself by writing by writing poems about cartoons, comics, and video games that are too trivial to win competitions, but also too charming and silly to lose competitions. Also, warning, his depression might be contagious, because sometimes he spits and people and they become sad.\n\nMORE ABOUT THE EVENT:\n\nOpen Mic starts at 7pm, and the Slam starts whenever the open session ends. Sign-up for both opens at 6:30, so get there early to guarantee a spot. \n\nA maximum of 10 poets compete each week [spots are guaranteed for the first 8 slammers to arrive]. All poets who get into the Slam earn points qualifying toward the City Finals in April, and a chance to be one of four poets to represent Ann Arbor at the National Poetry Slam this August in California. Poems must be the performer's original work. Come prepared with two poems [one if you're just doing the open mic], and keep it around three minutes or less. No costumes or props are allowed.", "name": "A2 Poetry Open Mic & Slam featuring RJ Walker"}, {"source": "Facebook", "date": "2015-10-05T19:30:00-04:00", "url": "https://www.facebook.com/events/834283343357474/", "description": "Literati is pleased to welcome Rebecca Wolff in support of One Morning— as part of our Poetry at Literati series.\n\nPoet, novelist, and Fence founder Rebecca Wolff’s internal monologue made external in poetry is uncanny. Her musical and darkly funny fourth collection, One Morning—, spans language, culture, art history, love, passion, grief, consumerism, environmental devastation, and the ekphrastic experience of pop and high culture. She experiments with torque, energy, narrative—two steps ahead of herself with the reader on her heels.\n\n\nRebecca Wolff is the author of four collections of poetry, one novel, and numerous pieces of occasional prose. Her first book, Manderley, was selected for the National Poetry Series by Robert Pinsky. Her second, Figment, was selected for the Barnard Women Poets Prize by Claudia Rankine and Eavan Boland. Her third, The King, was published by W. W. Norton in 2009. Her novel The Beginners was published by Riverhead in 2011. Her latest collection, One Morning—, is forthcoming from Wave Books in September of 2015. She is a graduate of the Iowa Writers Workshop and has been a fellow at the MacDowell Colony and the Millay Colony for the Arts. In 1998, Wolff founded the influential literary journal Fence; in 2001 she founded Fence Books and launched The Constant Critic website. Wolff lives in Hudson, New York, and is currently a fellow at the New York State Writers Institute at the University at Albany.", "name": "Poetry at Literati: Rebecca Wolff"}, {"source": "Facebook", "date": "2015-10-05T20:00:00-04:00", "url": "https://www.facebook.com/events/577944782309088/", "description": "Mon. October 5 | 8pm | 18+ | $16 adv./ $18 day of\n\nGeneWeen was a scientist, ambassador, philosopher, statesmen, writer, businessman and celebrated freethinker and wit. He has often been referred to as ‘America’s renaissance man’ and was emblematic of the fledgling American nation.\n\nGene Ween was born March 17, 1970 into a large and poor family. His father had 17 children by 2 different wives. Gene was brought up in the family business of candle making and his brother’s printing shop. Whenever he could Gene would take the opportunity to read and learn about a wide range of subjects, from Sophocles to modern science. Whilst co-workers would take a leisurely lunch break, Gene would pour over books from the bookshop munching on some raisins.\n\nAt an early age, he also started writing articles, which were published in the New Boognish Coureant under a pseudonym; Gene wrote under pseudonyms throughout his life. After several were published, he admitted to his father that he had written them under “Eddie Dingle.” Rather than being pleased his father beat him for his impudence. Therefore, aged 17, the young Gene Ween left the family business and travelled to Philadelphia.  WSG: Scotty Karate [http://www.scottykaratetime.com/ ]\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/453", "name": "Gene Ween (of Ween) w/ Scotty Karate 10/5/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-06T18:00:00-04:00", "url": "https://www.facebook.com/events/1638363336451414/", "description": "In May, 2014, voters in the greater Ann Arbor and Ypsilanti areas approved funding for TheRide’s Five-Year Transportation Improvement Program (5YTIP).  As promised, TheRide will implement a major portion of those service improvements in May, 2016, and is seeking public input from residents in the greater Ann Arbor and Ypsilanti areas on the proposed refinements.  For more details on the proposed refinements, please visit the TheRideYourWay.org.\n \nResidents unable to attend a meeting can submit comments between September 18 and October 18 by email, phone, and mail:\nEmail: TellUs@TheRide.org (subject line should read “May, 2016 service changes”)\nPhone: 734-794-1880\nFax: 734-973-6338\nMail:\nTheRide – May, 2016 Service Changes\n2700 S. Industrial Hwy.\nAnn Arbor, MI 48104", "name": "Public input meeting for proposed May, 2016 5YTIP improvements"}, {"source": "Facebook", "date": "2015-10-06T19:00:00-04:00", "url": "https://www.facebook.com/events/917080171692293/", "description": "Literati Bookstore is pleased to welcome Gwendolyn Calvert Baker in support of her memoir, Hot Fudge Sundae in a White Paper Cup: A Spirited Black Woman in a White World. Gwendolyn will be joined by Deborah Loewenberg Ball, the dean of UM's School of Education.\n\nGwendolyn Calvert Baker has had an extraordinary career and has witnessed a dramatic change in the ways that U.S. schools provide education to and about our multiethnic, multicultural society. But Baker hasn’t just lived through the progression of multicultural considerations—she has been singularly instrumental in the creation and acceptance of multicultural education. In Hot Fudge Sundae in a White Paper Cup, she shares her memories and experience of a lifetime spent serving and leading the causes for multicultural education.\n\n“Gwen Baker’s bounty of vision, intelligence, steadfast integrity, political prowess, and humanity simply flows from her to everything and everyone she touches. She has lived many lives and left many more legacies—in education, the nonprofit world—which will benefit us all long into the future. One of our greatest unsung heroes, Gwen Baker is my hero.”\n—Eddy Bayardelle, Former President of the Merrill Lynch Foundation\n\n“This book is a beautifully written, inspiring, courageous, and deeply moving chronicle of resilience, hope, and possibilities. Baker’s experiences with racism and other life challenges—epitomized by having a hot fudge sundae served to her in a paper cup while the glass dish was reserved for Whites—enabled her to develop the fortitude, wisdom, and quiet dignity that are evident on every page of this elegantly written, timely, and engaging book. Baker connects with her readers in deeply personal ways, which makes her life story authentic, inspiring, and compelling.”\n—James A. Banks, Director of the Center for Multicultural Education, University of Washington, Seattle\n\n“Having served as a volunteer for the YWCA of the USA for over several decades, I along with the National Board looked forward to having Gwendolyn C Baker serve as our National Executive Director as of 1981. We were eager to work with her to assist us in our efforts to achieve our Mission and Imperative: To eliminate racism. Through her leadership we made great strides and are extremely proud of the work we did with Avon Corporation in the creation of the \"Pink Ribbon\". The proceeds for the sale of this piece of jewelry has not only helped support work for breast cancer throughout the nation but the symbol gives hope to all who employ it. For this we are grateful to Avon, the YWCA, and Gwen Baker's leadership.”\n—Glendora Putman, President of the YWCA National Board (1985-1991)\n\n“I have had the honor and privilege of working with Dr. Baker while she was the President of UNICEF (USC) during the time I was serving on the National Board. Under her leadership, Gwen's vision became a reality. She transformed the United States Committee into an organization that truly was multicultural, living its mission to help the children of the underserved world.”\n—Neale Godfrey, CEO and Chairman of Children’s Financial Network", "name": "Gwendolyn Calvert Baker"}, {"source": "Facebook", "date": "2015-10-07T12:00:00-04:00", "url": "https://www.facebook.com/events/1705417453024762/", "description": "In May, 2014, voters in the greater Ann Arbor and Ypsilanti areas approved funding for TheRide’s Five-Year Transportation Improvement Program (5YTIP).  As promised, TheRide will implement a major portion of those service improvements in May, 2016, and is seeking public input from residents in the greater Ann Arbor and Ypsilanti areas on the proposed refinements.  For more details on the proposed refinements, please visit the TheRideYourWay.org.\n \nResidents unable to attend a meeting can submit comments between September 18 and October 18 by email, phone, and mail:\nEmail: TellUs@TheRide.org (subject line should read “May, 2016 service changes”)\nPhone: 734-794-1880\nFax: 734-973-6338\nMail:\nTheRide – May, 2016 Service Changes\n2700 S. Industrial Hwy.\nAnn Arbor, MI 48104", "name": "Public input meeting for proposed May, 2016 5YTIP improvements"}, {"source": "Facebook", "date": "2015-10-08T11:30:00-04:00", "url": "https://www.facebook.com/events/1501134800211821/", "description": "In May, 2014, voters in the greater Ann Arbor and Ypsilanti areas approved funding for TheRide’s Five-Year Transportation Improvement Program (5YTIP).  As promised, TheRide will implement a major portion of those service improvements in May, 2016, and is seeking public input from residents in the greater Ann Arbor and Ypsilanti areas on the proposed refinements.  For more details on the proposed refinements, please visit the TheRideYourWay.org.\n \nResidents unable to attend a meeting can submit comments between September 18 and October 18 by email, phone, and mail:\nEmail: TellUs@TheRide.org (subject line should read “May, 2016 service changes”)\nPhone: 734-794-1880\nFax: 734-973-6338\nMail:\nTheRide – May, 2016 Service Changes\n2700 S. Industrial Hwy.\nAnn Arbor, MI 48104", "name": "Public input meeting for proposed May, 2016 5YTIP improvements"}, {"source": "Facebook", "date": "2015-10-08T19:00:00-04:00", "url": "https://www.facebook.com/events/554194764736574/", "description": "Come and enjoy the taste of fall featuring a selection of our favorite Oktoberfests, Pumpkin Beers, and a variety of autumnal releases including our own Hoptown Brown, Oktoberfest and Violin Monster Autumn Ale. \n\n$25 advance tickets include beer samples, an appetizer buffet, a complete event program with tasting notes, and entry in our door prize drawing. Advance tickets recommended as tastings often sell out. Call 734-213-1393 to order tickets over the phone. Day of tickets are $30.\n\nArbor Brewing Company Beer Tastings are a year-long celebration of the rich and varied tastes and traditions of beers from across the globe. Tastings are the second Thursday of each month. Each tasting focuses on a specific style and features two dozen or so of the best examples available in the style of the month.", "name": "Beer Tasting: Fall & Fest"}, {"source": "Facebook", "date": "2015-10-09T17:00:00-04:00", "url": "https://www.facebook.com/events/1680505488834959/", "description": "Literati is thrilled to partner with our neighbors at 826michigan for this one-of-a-kind event! Join us for an evening of bedtime tales, all expertly written by 826michigan students from Huron High School, illustrated by world-renowned artists, and read (this one night only!) by our caring supporters. We are celebrating the release of A Lantern of Fireflies, our latest Young Authors Publishing Project, a collection of stories that range from the suspenseful to the hilarious to the action-packed adventure, all designed to hook young readers in and then lull them to sleep. We'll hear these stories come to life from our partnering teacher Sarah Andrew-Vaughn, illustrators Phil and Erin Stead, Oliver Uberti, 826michigan volunteers Alex Bernard and Abby Ruehlmann, and 826 National Founder Dave Eggers. Readers young and old are invited to come dressed for bedtime, too.", "name": "826michigan Reading and Pajama Party w/ Dave Eggers"}, {"source": "Facebook", "date": "2015-10-09T21:00:00-04:00", "url": "https://www.facebook.com/events/1611450162462333/", "description": "Fri. October 9 | 9pm | 18+ | $16 Cover\n\nRussian Circles wsg: Cloakroom\n\nPerhaps the most immediately apparent characteristic of the fifth Russian Circles album, Memorial is its wide range of emotion. Vacillating from somber-yet-soaring melodies on one track to pummeling metal heft on the next, Memorial sounds like an album with split personalities. \n \nWhere one song showcases guitarist Mike Sullivan, drummer Dave Turncrantz and bassist/keyboardist Brian Cook's mastery of lush melancholic melody, the next exhibits their most abrasive underground metal leaning sound, with washed-out 16th-note riffs and crushing rhythms. The band's penchant for endless hooks remains a constant, but Memorial embodies their most dramatic ranges in tone.  \n \n\"We've always tried to balance our metal-influenced sounds with more nuanced, pretty, orchestral elements,\" Cook says. \"But this time, it's far more polarized in that the heavy parts are much more blown out and exaggerated while the pretty moments are far more restrained, delicate, and atmospheric.\" In the two years since Russian Circles released their landmark fourth album Empros, the Chicago trio toured worldwide nearly incessantly, encountering many heavy acts whose music seemed needlessly complicated. \"We set out to make a straightforward, intense, heavy record,\" Cook explains. \"We subconsciously gravitated toward darker and more somber sounds. We wanted to get away from the overtly flashy.\" \n \n\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/450", "name": "Russian Circles w/ Cloakroom 10/9/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-10T09:00:00-04:00", "url": "https://www.facebook.com/events/152629418415220/", "description": "Volunteers (like you!) will collect seeds of native wildflowers in this open oak-hickory woodland. This work will help maintain the diversity of native species in this park. Bring your friends and family to learn about native plants and lend a hand in this beautiful nature area", "name": "Stewardship Workday at Huron Parkway Nature Area"}, {"source": "Facebook", "date": "2015-10-10T12:00:00-04:00", "url": "https://www.facebook.com/events/514996681995673/", "description": "It might be an ale festival, but we're bringing the lagers! Join us and other breweries at the Chelsea Smoke and Ale Festival on Saturday, October 10! A BBQ cookoff kicks off the day at noon followed by beer, live music, food trucks, a cornhole tournament, and kids' activities. Come celebrate fall in Southeast Michigan! $5 entry fee.", "name": "Chelsea Smoke & Ale Festival"}, {"source": "Facebook", "date": "2015-10-10T13:00:00-04:00", "url": "https://www.facebook.com/events/871074556307899/", "description": "Help remove invasive shrubs and keep this mature woodland beautiful and accessible. Please plastic sleds to help haul wood chips for the trails.", "name": "Stewardship Workday at Scarlett-Mitchell Nature Area"}, {"source": "Facebook", "date": "2015-10-10T21:30:00-04:00", "url": "https://www.facebook.com/events/881813398534383/", "description": "Sat. October 10 | 9:30pm | 18+ | $8 adv./ $10 day of\n\nTunde Olaniran - http://tundeolaniran.com/\nw/ James Linck  - https://soundcloud.com/jameslinck\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/509", "name": "Tunde Olaniran with James Linck 10/10/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-11T13:00:00-04:00", "url": "https://www.facebook.com/events/518055381706175/", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour: Engaging with Art"}, {"source": "Facebook", "date": "2015-10-11T14:00:00-04:00", "url": "https://www.facebook.com/events/471997146295656/", "description": "“The unifying core of my work stems from encountering the world as it unfolds,” explains Jem Cohen. “It is through close observation, careful listening, and an embrace of chance that I establish the bedrock. . . . Regardless of the tools and the form, the project is . . . life drawing.” Join UMMA docents as they explore Cohen’s dual-gallery presentation including Polaroid and digital images of a variety of locations, from New York to Tangier, in the Photography Gallery, and a multi-media component that has been called a cinematic love letter to Nova Scotia's Cape Breton, in the Media Gallery.\n\tLead support for Jem Cohen at UMMA is provided by the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the Susan and Richard Gutow Fund and the Robert and Janet Miller Fund.", "name": "Jem Cohen: Life Drawing"}, {"source": "Facebook", "date": "2015-10-12T19:00:00-04:00", "url": "https://www.facebook.com/events/853444468096424/", "description": "“My music has long been grounded in the physical, cultural, and spiritual landscapes of the North and in an ideal of sonic geography – place as music, and music as place.” ~John Luther Adams\n\tAcclaimed in The New Yorker as “One of the most original musical thinkers of the century,”  2014 Pulitzer Prize winner John Luther Adams is a composer, an author, an artist, and an activist.  He joins musicologist and U-M Professor of Music Mark Clague, the University of Michigan Flute Ensemble, Contemporary Directions Ensemble, and Chamber Choir, in an evening of performance and conversation about art and environment.\n\tPresented in conjunction with the UMMA exhibition of Jem Cohen: Life Drawing which shares an affinity for place and an interest in the connections between art and nature. Cohen's work We Have an Anchor, which has been described as \"a cinematic love letter to Nova Scotia's Cape Breton,\" will be on view during the performance.\n\tMr. Adams' appearance is made possible through the William Bolcom Residency in Composition.\n\tThe SMTD@UMMA performance series is made possible in part by the Katherine Tuck Enrichment Fund.\n\tLead support for Jem Cohen at UMMA is provided by the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the Susan and Richard Gutow Fund and the Robert and Janet Miller Fund.", "name": "SMTD@UMMA: Strange and Sacred Noise: an evening with John Luther Adams"}, {"source": "Facebook", "date": "2015-10-12T21:00:00-04:00", "url": "https://www.facebook.com/events/485997918227999/", "description": "Mon. October 12 | 9pm | 18+ | $10 Cover\n\nWIDOWSPEAK has grown up in a lot of ways.The band’s third album, All Yours, is one that could only come from Molly Hamilton and Robert Earl Thomas: a honed and elegant interweaving of dream-pop and slowcore rock and roll, easygoing melodies and dusty, snaking guitars. It’s also their finest release to date: ten beautiful songs that are refreshingly straightforward yet built from the same well-chosen and deftly-used tools the band has always worked with. All Yours is ambitious without feeling labored-over, anchored in the strengths of Widowspeak’s consistent influences.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/465", "name": "Widowspeak 10/12/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-13T21:00:00-04:00", "url": "https://www.facebook.com/events/508479992638842/", "description": "Tue. October 13 | 9pm | 18+ | $12 Cover\n\nFortunate Youth is a collaboration of South Bay reggae stand-outs. Rising from various bands, they've created a phenomenal 6-piece masterpiece bringing more fire to the stage than ever before. Combining rootsy vibes and unique bass lines united with multiple harmonies, boisterous guitar solos, and heavy keys separates Fortunate Youth from every other mainstream reggae band. With their high energy approach and positive stage presence they provide an unforgettable show to every music fan. Fortunate Youth's objective is to ensure a performance that leaves you feeling euphoric and curious of what might happen at the next show.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/428", "name": "Fortunate Youth 10/13/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-14T18:00:00-04:00", "url": "https://www.facebook.com/events/617171001718746/", "description": "In May, 2014, voters in the greater Ann Arbor and Ypsilanti areas approved funding for TheRide’s Five-Year Transportation Improvement Program (5YTIP).  As promised, TheRide will implement a major portion of those service improvements in May, 2016, and is seeking public input from residents in the greater Ann Arbor and Ypsilanti areas on the proposed refinements.  For more details on the proposed refinements, please visit the TheRideYourWay.org.\n \nResidents unable to attend a meeting can submit comments between September 18 and October 18 by email, phone, and mail:\nEmail: TellUs@TheRide.org (subject line should read “May, 2016 service changes”)\nPhone: 734-794-1880\nFax: 734-973-6338\nMail:\nTheRide – May, 2016 Service Changes\n2700 S. Industrial Hwy.\nAnn Arbor, MI 48104", "name": "Public input meeting for proposed May, 2016 5YTIP improvements"}, {"source": "Facebook", "date": "2015-10-15T16:00:00-04:00", "url": "https://www.facebook.com/events/515977888562002/", "description": "In May, 2014, voters in the greater Ann Arbor and Ypsilanti areas approved funding for TheRide’s Five-Year Transportation Improvement Program (5YTIP).  As promised, TheRide will implement a major portion of those service improvements in May, 2016, and is seeking public input from residents in the greater Ann Arbor and Ypsilanti areas on the proposed refinements.  For more details on the proposed refinements, please visit the TheRideYourWay.org.\n \nResidents unable to attend a meeting can submit comments between September 18 and October 18 by email, phone, and mail:\nEmail: TellUs@TheRide.org (subject line should read “May, 2016 service changes”)\nPhone: 734-794-1880\nFax: 734-973-6338\nMail:\nTheRide – May, 2016 Service Changes\n2700 S. Industrial Hwy.\nAnn Arbor, MI 48104", "name": "Public input meeting for proposed May, 2016 5YTIP improvements"}, {"source": "Facebook", "date": "2015-10-16T20:00:00-04:00", "url": "https://www.facebook.com/events/916322731747958/", "description": "That 1 Guy live in concert!\n\nWith an extensive and amazing track record of unique and imaginative performances featuring his curious instrument and copious amounts of originality, Mike Silverman, a/k/a That1Guy, has set himself apart as a true one-of-a-kind talent that rivals any other artist currently in the entertainment industry. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/403", "name": "That 1 Guy 10/16/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-16T21:00:00-04:00", "url": "https://www.facebook.com/events/719914338112732/", "description": "Fri. October 16 | 9pm | 18+ |  $10 Cover\n\nSaintseneca’s powerful new album Such Things is the band’s most cohesive, catchy and accessible output, and a work that solidifies the group’s singer and songwriter Zac Little’s status as one of modern indie music’s most thoughtful and talented artists. The record arrives October 9th via Anti-.\n\nThe first single, “Sleeper Hold” is a pulsating and infectious rock song that utilizes elements of punk, folk and straight up rock and roll, all centered around a soaring and beautifully anthemic chorus.\n\nSuch Things is the anticipated follow up to Saintseneca’s acclaimed album Dark Arc, which Stereogum celebrated writing, “Dark Arc shines in all the ways Saintseneca always has — gorgeous harmonies, rampant strumming, glimpses of both humanity’s fragility and power — but it also finds the band branching out into fuller arrangements and wilder instrumentation. (Wilder, even, than the plastic trash can they used to beat on.) It’s what an underground folk band stepping into the spotlight should sound like.”\n\nMoving away from the cinematic, linear quality of Dark Arc, Little sought even higher ground for the new songs, and to incorporate the synapses and charges of his fellow members. “I was pushing myself with Such Things to try to explore the pop motif further, to try to use and bend that formula of having a groove, a beat, locking in and using that as scaffolding to build a song,” he says. “And even though it oftentimes might seem like this singular vision, at the core my creative strategy for the band is one that inherently involves other people. I think the best work I’ll make involves working that way.”\n\nThose disparate pieces and parts have come together, like so many molecules, to form a solid rock object called Such Things. You can hold it in your hands and hear it in your head, this culmination of tiny, beautiful moments and fluctuations of energy and information, compressed and etched into an LP sleeve and eternity and all tied up in a rock and roll record.\n\n“It’s definitely a new way of songs manifesting, and it feels like a step forward,” Little says. “I’m gonna push myself and try this thing I’ve wanted to try. I think it’s the best thing we’ve done so far, but then again I won’t write a song that I don’t think isn’t the best thing I’ve done. When I finish it I have to feel like it’s the best thing I’ve made. And if I don’t feel that way, it’s like, why bother?”\nwith: The Sidekicks & Yowler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/464", "name": "SAINTSENECA with The Sidekicks and Yowler 10/16/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-17T09:00:00-04:00", "url": "https://www.facebook.com/events/982893591742365/", "description": "Ypsilanti: Saturday, October 17th, 2015, 9am-2pm\n799 N. Hewitt Rd @ the Eastern Michigan University Rynearson Stadium Parking Lot\n\nSuggested Donation of $10.00\n\nAcceptable Materials Include:\n-Traditional recyclable materials – glass, cardboard, plastic, paper, scrap metal\n-Freon appliances\n-Household hazardous materials – cleaning supplies, motor oil, oil-based and latex paints, pesticides, sharps, etc. \n-Furniture\n-Old tires\n-Electronic equipment\n\nResidents may bring up to 4 tires for free, but will be asked for a $5 donation for each additional tire. Residents may bring 1 of the following items for free: television, washer, dryer, freon containing appliance or computer. Residents will be asked to donate $10 for each additional item.\n\nBusinesses and out-of-county residents are restricted from attending.\n\nNo household garbage will be accepted!\n\nPlease contact 734.222.3827 or visit www.recycle.ewashtenaw.org for further information.", "name": "Washtenaw County Clean Up Day"}, {"source": "Facebook", "date": "2015-10-17T21:00:00-04:00", "url": "https://www.facebook.com/events/125351747800708/", "description": "Saturday, Oct. 17 | 9pm | 18+ | $20 Cover\n\nThe Underachievers w/ Pouyan and the Buffet Boys, Kirk Knight and Bodega Bamz\n\nVIP Tickets: http://www.etix.com/ticket/p/6732395/the-underachievers-vip-tickets-ann-arbor-blind-pig-the-blind-pig\n\nAs members of the Beast Coast movement, which includes Joey Bada$$, the Pro Era crew and Flatbush Zombies, The Underachievers are part of the new wave of rappers that have been coming out of New York. Rapper AK started rapping at 11 years old and his partner Issa Gold started 6 years ago. Raised together in Flatbush, Brooklyn, they established THE UNDERACHIEVERS in 2011 and have been creating music together ever since. In May 2012, the group released their debut video for \"So Devilish\" and everything began to take off from there. Since then, the group has gained more than 24 million views on YouTube, 125,000+ YouTube subscribers and solid reviews from all of the top music publications. The Underachievers released the critically acclaimed INDIGOISM in February of 2013. The debut mix tape received an eight out of ten from Pitchfolk.com and has since gone PLATINUM on DatPiff. The mix tape has been downloaded over 300k times and has accumulated over 745k views on the unique website. It has been heralded as one of the best projects of 2013 and it has served as an excellent tool to establish the reputation of the group. In August of 2013, UA released their second project \"The Lords of Flatbush\" produced entirely by the extraordinary producer LEX LUGER. Again the mix tape was released on DatPiff and it amassed over 155k downloads making it a GOLD release on the site. In 2014, the group headlined their first tour “Eyes of the World” across North America, Canada & Europe. In August of the same year, UA also released their debut album on the RPM MSC label entitled \"Cellar Door: Terminus Ut Exordium\". The album charted #16 on R&B/Hip-Hop Album chart, #12 on INDI Album chart, #11 on Rap Album chart and #86 on the Billboard 200 album chart in its first week. The main purpose of UA’s music is to aide in the enlightenment of their generation by providing music from a perspective that all can appreciate and enjoy but still keeping it positive and as \"true to hip hop\" as they can. By combining their strong points they have been able to establish themselves as a rising reputable force in Hip Hop and the music Industry. The Underachievers wrapped up 2014 with a co-headline tour across North America & Canada joining Flatbush Zombies for a jaunt dubbed \"Clockwork Indigo Presents The Electric Koolade Experience\". The Duo is set to pick up the second leg of \"The Electric Koolade Experience\" tour in Europe from March through April 2015.", "name": "Forevermore Express Tour feat. The Underachievers & More 10/17/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-17T23:00:00-04:00", "url": "https://www.facebook.com/events/746267175484840/", "description": "Come as You Are: Art of the 1990s, the first major museum survey to examine the art of this pivotal decade in its historical context, showcases over 64 works by 46 artists born or practicing in the United States. The exhibition, whose title references the 1992 Nirvana song (considered by many an anthem for the decade), focuses on three principal themes—debates over “identity politics,” the digital revolution, and globalization—and explores a range of geopolitical milestones and social issues through the perspective of artists working at that time. The exhibition also illustrates the diverse ways in which the developments of the 1990s redefined contemporary approaches to artistic practice and, in the words of exhibition curator Alexandra Schwartz, “writes a history of the ’90s through the lens of the visual arts.” \n\n\tCome as You Are looks at the dramatic changes in the art world itself, including the ongoing culture wars; issues of artistic freedom and censorship; the impact of new media and the emergence of video, sound, and digital art; the expansion of the global art market; and the explosion of art fairs and biennials. It also investigates the art world’s increasing heterogeneity as artists of color, women artists, and LGBT artists attained increased prominence. Artists include Doug Aitken, Felix Gonzalez-Torres, Glenn Ligon, Julie Mehretu, Prema Murthy, Shirin Neshat, Catherine Opie, Gabriel Orozco, Diana Thater, Rirkrit Tiravanija, and Kara Walker in a wide range of works including installations, paintings, sculptures, drawings, prints, photography, video, and digital art. \n\n\tCome as You Are: Art of the 1990s is organized by the Montclair Art Museum and curated by Alexandra Schwartz, curator of contemporary art, with Kimberly Siino, curatorial assistant. This exhibition is made possible with generous support from The Andy Warhol Foundation for the Visual Arts. \n\t\nLead support for this exhibition is provided by the University of Michigan Health System. Additional support is provided by Samantha and Ross Partrich, Andrea and Joel Brown, and the Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund.", "name": "Come as You Are: Art of the 1990s"}, {"source": "Facebook", "date": "2015-10-18T13:00:00-04:00", "url": "https://www.facebook.com/events/1644775702405221/", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour: Engaging with Art"}, {"source": "Facebook", "date": "2015-10-18T14:00:00-04:00", "url": "https://www.facebook.com/events/1493650667621647/", "description": "The Heidelberg Project, celebrating its 30th anniversary in 2016, is one of the largest, best-known, and longest-running site-specific art installations in the country. Occupying more than two blocks along Heidelberg Street on Detroit’s East Side it has been the life’s work of artist Tyree Guyton who grew up on Heidelberg Street. Encouraged by his housepainter grandfather to become an artist, and with the help of neighborhood children, the project has transformed its neighborhood. Join UMMA docents as they explore this installation, including the two new works created specifically for this exhibition.\n\tLead support for this exhibition is provided by the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, the Andy Warhol Foundation for the Visual Arts, Lisa Applebaum, and the University of Michigan Taubman College of Architecture and Urban Planning and School of Social Work.", "name": "Guided Tour: The Art of Tyree Guyton: A Thirty-Year Journey"}, {"source": "Facebook", "date": "2015-10-19T20:00:00-04:00", "url": "https://www.facebook.com/events/398616826996922/", "description": "Mon. October 19 | 8pm | 18+ | $15 Cover\n\nBoys Life\nhttps://www.facebook.com/pages/BOYS-LIFE\nwith: All Eyes West\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/422\n\nConceived in 1993 by four friends, Boys Life became known for passionate and dissonant guitar-driven rock with DIY roots and a distinctly Midwestern sound. They sought to make the kind of music they wanted to hear and in the process created something uniquely their own.\n\nBy 1995 they released their self-titled debut and toured the underground scene in nonstop support of their work, playing everywhere from basements and coffee shops to Gilman Street with bands such as Knapsack, Giant’s Chair, and Christie Front Drive. The following year brought further collaboration with Front Drive in a split 10”. With a growing fan base in an emerging genre, they were ready to create their second album, Departures and Landfalls.\n\nWhile on tour, the band became a tighter unit and developed focus by talking about music and planning their future creative direction. They all saw Departures as their first opportunity to document new songs that could help define an original sound. With stronger songcraft, a refined tone, and a solid creative process, the work they created remained abrasive but also incorporated warmth and depth.\n\nGeography and seasons affected the process; some songs were written on the road, with an ever-changing landscape, and many during the springtime and early summer. Late nights of long drives, longer talks, and doing what you love are what made Departures Boys Life’s first real record, full of new but classic sounds. They had made something of their own.\n\nDuring five days of a hot summer in Chicago in 1996, they recorded with Bob Weston in the home studio of Steve Albini. In the band’s maturity, they were rehearsing almost daily and decided to record the album live. Several first takes made the final cut, and the resulting songs sounded natural and organic, reflecting the true dynamic of the band and their live performance.\n\nAfter the record’s release, Boys Life co-headlined tours with Kerosene 454 and Bluetip. Their performances were loud, enthusiastic, and genuine, and the experience strengthened the band’s newfound bonds with those in DC sharing the same postpunk ethic. By the end of that touring cycle, however, citing exhaustion, they called it a day in the summer of 1997.\n\nNow, nearly twenty years later, Boys Life is ready to revisit their records with renewed energy. Both the band and their songs were products of a special time that can’t be replicated, only revisited. But then and now, both Boys Life and Departures and Landfalls reflect something more than nostalgia—creativity, the power of music, the roar of a thunderstorm, and the lonesome sound of a train whistle.", "name": "Boys Life 10/19/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-22T17:30:00-04:00", "url": "https://www.facebook.com/events/899509186790774/", "description": "Sarah Shun-lien Bynum is the author of two novels, Ms. Hempel Chronicles, a finalist for the 2009 PEN/Faulkner Award, and Madeleine is Sleeping, a finalist for the 2004 National Book Award and winner of the Janet Heidinger Kafka Prize. Her fiction has appeared in many magazines and anthologies, including The New Yorker, Ploughshares, Tin House, the Georgia Review, and the Best American Short Stories 2004 and 2009. The recipient of a Whiting Writers’ Award and an NEA Fellowship, she was named one of “20 Under 40” fiction writers by The New Yorker. She lives in Los Angeles and teaches in the Graduate Writing Program at Otis College of Art and Design.\n\tThe Zell Visiting Writers Series is presented by the Helen Zell Writers’ Program in partnership with the University of Michigan Museum of Art, with support from the Department of English Language & Literature, the Office of the Vice President for Research, and Janey Lack. For additional information visit lsa.umich.edu/writers.", "name": "Sarah Shun-lien Bynum Fiction Reading"}, {"source": "Facebook", "date": "2015-10-22T19:00:00-04:00", "url": "https://www.facebook.com/events/1634533963488597/", "description": "Welcome Back!\n \nThe NEXT Entre-SLAM is Thursday, October 22nd\nfrom 7-9pm at Bar Louie\n\nYour storytellers are working hard and the judges are sharpening their knives (just kidding). This is the 3rd and final round folks before the Grand Finale where we'll award the top storyteller $10,000!! \n\nMeet the Storytellers:\nPaul Hickman and Calvin Evans from Urban Ashes\nBethany 'Bee' Roll from Beezy's Cafe\nDavid Silver from Detroit Horse Power\nAlex Kazerooni from Eagle Fish Technology\nBryant and Kummbareh Owens from Ever Butter\nCheck out their bios and detailed info here\n\nMeet the Judges:\nStefan Sysko from Sysko Thinking\nAnn Hanson from brannds\nDaniel Rivkin, Rmedia Ventures\n\nCheck out their bios and detailed info here\n\nNEW Stuff:\nFriends and Family Discounts ($15 ticket)\nIf you have a friend or loved one who is one of the storytellers, I'm sure that they would love to have your support in the audience. We now have a Friends and Family tickets available until September 20th.\n\nSocial Media Discount ($10 ticket)\n10 of your friends likes our page? Grab your $10 ticket.", "name": "Entre-SLAM: Round Three"}, {"source": "Facebook", "date": "2015-10-22T20:00:00-04:00", "url": "https://www.facebook.com/events/386339161563522/", "description": "Organized by U-M students for U-M students, and inspired by UMMA’s exhibition Come as You Are: Art of the 1990s, the 7th annual Student Late Night event at UMMA will be a fun-filled creative explosion featuring '90s-themed art-making activities, original performances, '90s jams courtesy of WCBN DJs, a photo booth, free food, and more.\n\tHosted by the UMMA Student Programming and Advisory Council, cosponsored by Arts at Michigan and WCBN.\n\tLead support for this exhibition is provided by the University of Michigan Health System. Additional support is provided by Samantha and Ross Partrich, Andrea and Joel Brown, and the Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund.", "name": "COME AS YOU ARE: STUDENT LATE NIGHT AT UMMA"}, {"source": "Facebook", "date": "2015-10-23T17:30:00-04:00", "url": "https://www.facebook.com/events/833413486749302/", "description": "Come as You Are: Art of the 1990s provides a fresh look at the art of the pivotal decade between the fall of the Berlin Wall and 9/11. Join exhibition curator Alexandra Schwartz for an exploration of the themes of the show, namely identity politics, the digital revolution, and globalization. She will also consider the diverse ways in which the developments of the 1990s—the ongoing culture wars, issues of artistic freedom and censorship, the impact of new media, and the increase of artists of color, women artists, and LGBT artists—redefined contemporary approaches to artistic practice and, in her words, “writes a history of the ’90s through the lens of the visual arts.”\n\tAlexandra Schwartz is the founding Curator of Contemporary Art at the Montclair Art Museum. Previously she was a curator at the Museum of Modern Art, where her exhibitions included Mind and Matter: Alternative Abstractions, 1940s to Now and Modern Women: Single Channel at MoMA PS1. She is the author of Ed Ruscha’s Los Angeles (MIT Press, 2010). An editor and contributor to numerous publications, Schwartz has taught at Columbia University and the University of Michigan, and in the Education Departments at MoMA and the Whitney Museum of American Art. She received an AB from Harvard University and an MA and PhD from the University of Michigan.\n\tBrowse the exhibition and enjoy light refreshments after the program.\n\tLead support for the exhibition Come as You Are: Art of the 1990s is provided by the University of Michigan Health System. Additional support is provided by Samantha and Ross Partrich, Andrea and Joel Brown, and the Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund.", "name": "Curator lecture with Alexandra Schwartz: Come as You Are: Art of the 1990s"}, {"source": "Facebook", "date": "2015-10-24T10:00:00-04:00", "url": "https://www.facebook.com/events/475115399324886/", "description": "Held in connection with the exhibition Come as You Are: Art of the 1990s at UMMA, this symposium explores art in the 1990s from a variety of different perspectives.  As was the case in the 1980s, contemporary art in the 1990s continued to diversify itself in terms of medium, materiality, and concept.  And, like before, many artists concerned themselves with “identity,” the social and libidinal construction of what was formerly called the “subject.”   But even more intensely than before, artists began to engage with digital technologies, including photography, video, computers, and the Internet; and through these media, a new fluidity, immersiveness, and interest in the world and politics entered art.  In addition, the art world globalized during the 1990s, its conversation growing to include a variety of perspectives that previously had not been heard.  Symposium participants, including Come as You Are exhibition curator Alexandra Schwartz, have been selected to represent the diversity and range of art in the 1990s. They include both those who came of age in the 1990s as well as those whose professional careers took root amidst the struggles over multiculturalism, freedom of expression, and personal choice in the 1980s.  Accordingly, this symposium is intended to historicize the visual art of the 1990s by placing it within a longue durée of multiple, overlapping filaments whose implications are only just being realized today.\n\nHuey Copeland\nAssociate Professor of Art History and Associate Dean for Academic Affairs, Northwestern University\n\nHolly Hughes\nPerformance Artist and Playwright, Professor of Art and Design, Theatre and Drama at the University of Michigan\n\nSuzanne Hudson\nAssociate Professor of Art History and Fine Arts, University of Southern California\n\nLane Relyea\nAssociate Professor and Chair, Department of Art Theory & Practice, Northwestern University\n\nAlexandra Schwartz\nCurator of Contemporary Art, The Montclair Art Museum, and curator of the exhibition Come as You Are: Art of the 1990s on view at UMMA October 17, 2015–January 31, 2016.\n\nEve Sussman\nArtist\n\nJohn Tain\nCurator of Modern and Contemporary Art, Collections Development, The Getty Research Institute\n\t\n\tThis symposium is presented by the U-M History of Art Department and co-sponsored by UMMA.\n\tLead support for the exhibition Come as You Are: Art of the 1990s is provided by the University of Michigan Health System. Additional support is provided by Samantha and Ross Partrich, Andrea and Joel Brown, and the Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund.", "name": "U-M History of Art Symposium \"The Things You Own End Up Owning You: Art in the 1990s\""}, {"source": "Facebook", "date": "2015-10-24T21:00:00-04:00", "url": "https://www.facebook.com/events/843147115782248/", "description": "Sat. October 24 | 18+ | 9pm | $12 adv. $14 Day of \n\nThere is nothing like the challenges and camaraderie of the road to inspire a songwriter who thrives upon the emotional energy and exhilaration only travel can deliver. Some singers are devoted to the pursuit of perpetual motion, and Langhorne Slim releases his wild soul in ways that come out of the discipline of live performance.\n\nThe 13 songs that compose Langhorne Slim & The Law's new \"The Way We Move\" are road-tested, rollicking and very rock 'n' rolling tunes that the songwriter perfected with his loyal band, and come out of the kind of good times and bad experiences that songwriters of Langhorne's lofty stature can turn into life-affirming rock 'n' roll. You could also call what Langhorne Slim does folk music, but then there's his sly, charming and open-hearted feel for pop music -- those summertime melodies that nudge you into a grin even when the song is about something bad.\n\nFor Langhorne Slim -- Pennsylvania-born self-taught guitarist who moves to Brooklyn at 18, begins feeling out his place in a burgeoning punk-folk scene, wends his way to the West Coast, and finds himself celebrated from Newport to Portland as one of today's most original singers and songwriters -- \"The Way We Move\" represents the sound of a band devoted to living in the moment. Riding the success of his 2009 full-length Be Set Free, Langhorne went through some changes over the last three years -- he lost his beloved grandfather, who is the subject of the new record's moving \"Song for Sid,\" and moved on from a relationship that had lasted five years.\n\nAnd there was the physical moving -- the literal side of the record's title. Pulling up stakes from his home of two years, Portland, Ore., Langhorne also has been touring non-stop with The Law. As he says, \"I'm in a bit of a transitional period -- currently, the road will be home. That's just kind of my spirit, to be slightly restless.\" Perfecting their rangy sound out on the endless grey ribbon, Langhorne and The Law -- bassist Jeff Ratner, drummer Malachi DeLorenzo and banjo player and keyboardist David Moore -- went down to rural Texas in the summer of 2011 to work on new material. With some 30 tunes to consider, the quartet soaked up the Lone Star sunshine and developed arrangements and approaches for Langhorne's latest batch of songs.", "name": "Ann Arbor's 107one Presents: Langhorne Slim & The Law 10/24/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-25T13:00:00-04:00", "url": "https://www.facebook.com/events/1682341018652496/", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour: Engaging with Art"}, {"source": "Facebook", "date": "2015-10-25T14:00:00-04:00", "url": "https://www.facebook.com/events/1639368179634669/", "description": "Come as You Are: Art of the 1990s, is the first major museum survey to examine the art of this pivotal decade in its historical context. The exhibition, organized by the Montclair Art Museum, whose focuses on three principal themes—debates over “identity politics,” the digital revolution, and globalization—and explores a range of geopolitical milestones and social issues through the perspective of artists working at that time. It also illustrates the diverse ways in which the developments of the 1990s redefined contemporary approaches to artistic practice. UMMA docents will explore the themes of this pivotal decade. \n\tLead support for the exhibition Come as You Are: Art of the 1990s is provided by the University of Michigan Health System. Additional support is provided by Samantha and Ross Partrich, Andrea and Joel Brown, and the Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund.", "name": "Guided Tour: Come as You Are: Art of the 1990’s"}, {"source": "Facebook", "date": "2015-10-26T21:00:00-04:00", "url": "https://www.facebook.com/events/1655017594775528/", "description": "Monday, October 26 | 9pm | 18+ | $12 adv./ $14 day of\n\nTelekinesis - We've all heard plenty about the astonishing debut and the \"difficult\" sophomore release. But let's pause for a moment to consider the role of album four in rock and roll history. A few key examples: Radiohead – Kid A, R.E.M. – Lifes Rich Pageant, Talking Heads – Remain in Light, Wilco – Yankee Hotel Foxtrot, David Bowie – Hunky Dory ... you see where we're going with this. Album four is an opportunity for artists to reinvent, and frequently revitalize, themselves. The willingness to abandon familiar work habits and signature sounds can be risky, but it's often the difference between a safe, predictable career and a bold transformation that signals the beginning (to quote another pretty amazing fourth LP) of a new age for artist and audience alike. WSG: Say Hi & Girls Who Care\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/482", "name": "Telekinesis w/ Say Hi & Girls Who Care 10/26/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-27T19:00:00-04:00", "url": "https://www.facebook.com/events/1613304408933212/", "description": "Louise Glück is one of America’s finest contemporary poets. Winner of the Pulitzer Prize, Glück is a former Poet Laureate of the United States and the author of a dozen widely acclaimed books. Stephen Dobyns, writing in the New York Times Book Review, said “no American poet writes better than Louise Glück, perhaps none can lead us so deeply into our own nature.” Pulitzer Prize winner Robert Hass has called her “one of the purest and most accomplished lyric poets now writing.”\n\tEvocative and lyrically graceful, Glück's work is noted for its emotional intensity and technical precision. Glück's considerable accomplishments as a poet are apparent in her latest volume, Poems: 1962-2012. Her new collection of poems, Faithful and Virtuous Night, won the 2014 National Book Award for Poetry.\n\tGlück's recent books are A Village Life (2009), which was shortlisted for the International Griffin Poetry Prize, and Averno (2006), which was nominated for the National Book Award, won the L.L. Winship/PEN New England Award, and was listed by The New York Times Book Review as one of the 100 Notable Books of the Year.\n\tHer earlier work includes The Seven Ages (2001); Vita Nova (1999), winner of The New Yorker Magazine’s Book Award in Poetry; Meadowlands (1996); The Wild Iris (1992), which received the Pulitzer Prize and the Poetry Society of America's William Carlos Williams Award; Ararat (1990), which received the Rebekah Johnson Bobbitt National Prize for Poetry; and The Triumph of Achilles (1985), which received the National Book Critics Circle Award, Boston Globe Literary Press Award, and the Poetry Society of America's Melville Kane Award.The First Four Books of Poems (1999) collects the early work that helped establish Glück as one of America's most original poets. Her book of essays, Proofs and Theories (1994), was awarded the PEN/Martha Albrand Award for Nonfiction.\n\tIn 2003, Glück was named the 12th Poet Laureate Consultant in Poetry by the Library of Congress. That same year, she was named the judge for the Yale Series of Younger Poets, and served in that position through 2010.\n\tIn addition to the Pulitzer Prize and National Book Critics Circle Award, Glück has received many honors. In 2001, she was awarded the Bollingen Prize, given biennially for a poet's lifetime achievement. And in 2008, Glück received the Wallace Stevens Award for “outstanding and proven mastery in the art of poetry.” Her other honors include the Lannan Literary Award for Poetry, Sara Teasdale Memorial Prize, M.I.T. Anniversary Medal, the Pushcart Prize, and a fellowship from the National Endowment for the Arts.\n\tGlück taught at Williams College for 20 years and is currently Rosenkranz writer-in-residence at Yale University. She is a member of the American Academy and Institute of Arts and Letters, and in 1999 was elected a Chancellor of the Academy of American Poets.\n\tThe Zell Visiting Writers Series is presented by the Helen Zell Writers’ Program in partnership with the University of Michigan Museum of Art, with support from the Department of English Language & Literature, the Office of the Vice President for Research, and Janey Lack. For additional information visit lsa.umich.edu/writers.", "name": "Louise Glück Zell Distinguished Poet in Residence Poetry Reading"}, {"source": "Facebook", "date": "2015-10-27T21:00:00-04:00", "url": "https://www.facebook.com/events/1481526608833799/", "description": "Cosmos-wrangling Americana upstart Israel Nash [http://www.israelnash.com/] returns from Texas Hill Country with his Silver Season, a deeply gorgeous and wholly immersive nine-song set that plays less like an album, and more like a cross section of time and space. The man's fourth LP ventures farther down the acid-soaked trail blazed by 2013's Rain Plans, arriving in lush and expansive territory. Here, this Missouri son sounds more assured than ever, supported by his highly capable band and production inspired by psychedelic greats. Israel Nash's Silver Season is best played loudly, and sounds wonderful in headphones. \n\nw/ Caroline Reese - http://www.carolinereesemusic.com\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/477", "name": "Israel Nash 10/27/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-10-29T17:30:00-04:00", "url": "https://www.facebook.com/events/425093224345197/", "description": "Louise Glück is one of America’s finest contemporary poets. Winner of the Pulitzer Prize, Glück is a former Poet Laureate of the United States and the author of a dozen widely acclaimed books. Stephen Dobyns, writing in the New York Times Book Review, said “no American poet writes better than Louise Glück, perhaps none can lead us so deeply into our own nature.” Pulitzer Prize winner Robert Hass has called her “one of the purest and most accomplished lyric poets now writing.”\n\tEvocative and lyrically graceful, Glück's work is noted for its emotional intensity and technical precision. Glück's considerable accomplishments as a poet are apparent in her latest volume, Poems: 1962-2012. Her new collection of poems, Faithful and Virtuous Night, won the 2014 National Book Award for Poetry.\n\tGlück's recent books are A Village Life (2009), which was shortlisted for the International Griffin Poetry Prize, and Averno (2006), which was nominated for the National Book Award, won the L.L. Winship/PEN New England Award, and was listed by The New York Times Book Review as one of the 100 Notable Books of the Year.\n\tHer earlier work includes The Seven Ages (2001); Vita Nova (1999), winner of The New Yorker Magazine’s Book Award in Poetry; Meadowlands (1996); The Wild Iris (1992), which received the Pulitzer Prize and the Poetry Society of America's William Carlos Williams Award; Ararat (1990), which received the Rebekah Johnson Bobbitt National Prize for Poetry; and The Triumph of Achilles (1985), which received the National Book Critics Circle Award, Boston Globe Literary Press Award, and the Poetry Society of America's Melville Kane Award.The First Four Books of Poems (1999) collects the early work that helped establish Glück as one of America's most original poets. Her book of essays, Proofs and Theories (1994), was awarded the PEN/Martha Albrand Award for Nonfiction.\n\tIn 2003, Glück was named the 12th Poet Laureate Consultant in Poetry by the Library of Congress. That same year, she was named the judge for the Yale Series of Younger Poets, and served in that position through 2010.\n\tIn addition to the Pulitzer Prize and National Book Critics Circle Award, Glück has received many honors. In 2001, she was awarded the Bollingen Prize, given biennially for a poet's lifetime achievement. And in 2008, Glück received the Wallace Stevens Award for “outstanding and proven mastery in the art of poetry.” Her other honors include the Lannan Literary Award for Poetry, Sara Teasdale Memorial Prize, M.I.T. Anniversary Medal, the Pushcart Prize, and a fellowship from the National Endowment for the Arts.\n\tGlück taught at Williams College for 20 years and is currently Rosenkranz writer-in-residence at Yale University. She is a member of the American Academy and Institute of Arts and Letters, and in 1999 was elected a Chancellor of the Academy of American Poets.\n\tThe Zell Visiting Writers Series is presented by the Helen Zell Writers’ Program in partnership with the University of Michigan Museum of Art, with support from the Department of English Language & Literature, the Office of the Vice President for Research, and Janey Lack. For additional information visit lsa.umich.edu/writers.", "name": "Louise Glück Zell Distinguished Poet in Residence Poetry Reading"}, {"source": "Facebook", "date": "2015-10-30T19:00:00-04:00", "url": "https://www.facebook.com/events/1490496491271759/", "description": "The annual Devils Night Nite ride is back again for another fun filled adventure!\n\nDue to the difficulty of night riding and the nature of the Local Loop, this will be an advanced level ride.  If you would not be comfortable riding Poto, Highland, or Brighton at Night, this may not be the best choice in rides. It is recommended that you have two working and fully charged front lights, and a rear red light, the ride can last up to 3 hours (based on group preferences).  \n\nWe'll meet at 7pm and wheels turning at 7:30pm.\n\nStay tuned for the meeting location, but near Bluffs/Kuebler-Langford.  Bonfire and/or Bar afterwards.\n\nCostumes Strongly Recommended.  \n\nBonus points for coming to this and the PSSWC the following day, on Halloween!!!", "name": "Ann Arbor Local Loop Devils Night Nite Ride"}, {"source": "Facebook", "date": "2015-11-05T17:10:00-05:00", "url": "https://www.facebook.com/events/1631299103808637/", "description": "This event takes place at the Michigan Theater, 603 E Liberty St, Ann Arbor, MI 48104.\n\t\nCelebrated for a visual language that brings together unexpected materials and radically unconventional techniques, artist Julian Schnabel has been a pioneering, and controversial, figure since his first solo exhibition in 1979. As part of a group of 1980s artists known as Neo-Expressionists (a term that he would reject), Schnabel wanted to return to painting pre-abstraction, and forged a practice that encompassed figuration, personal narratives, and references to history and mythology.  His paintings, sculptures, and works on paper have been the subject of numerous exhibitions at museums worldwide, including the current exhibition of his work at the University of Michigan Museum of Art (on view through September 27). Also a renowned filmmaker, in 1996 Schnabel wrote and directed the feature film Basquiat about artist Jean-Michel Basquiat, produced by Peter Brant. Brant Publications, Inc., is a leading art publisher whose titles include Art in America and Interview, among other important art magazines. Mr. Brant is also an entrepreneur, manufacturing executive, philanthropist, sportsman, and art collector who has a personal passion for contemporary art.\n\t\nThe exhibition Julian Schnabel was organized by the Brant Foundation Art Study Center.  Lead support for UMMA’s installation is provided by Joseph and Annette Allen, the University of Michigan Office of the Provost, the University of Michigan Health System, the Richard and Rosann Noel Endowment Fund, and Retirement Income Solutions.", "name": "UMMA & Penny W. Stamps Speaker Series Present: Julian Schnabel in Dialogue with Peter Brant"}, {"source": "Facebook", "date": "2015-11-11T21:00:00-05:00", "url": "https://www.facebook.com/events/832974296787302/", "description": "Wed. November 11 | 9pm | 18+ \n\nWith over 1400 legendary late nights, sold-out clubs and triumphant festivals under their belts, The New Deal returns with a passion in 2015. Recently releasedtracks “Mercury Switch” and “Sabotage the System”offera preview of their upcoming fall studio releasewhich bassist Dan Kurtz describes as their “most creative” endeavor to date. “In the last few months we've been pushing ourselves to work with new sounds, new styles, new ways of arranging jams, and the stuff we've come up with has felt great and exciting to us as a result. We're listening back to the board tapes of all the shows and finding the parts, even if they're just a couple of seconds long, that sound the most inspiring and then building studio recordings around them. In some cases we'll glue a bit from one show in one city to another completely unrelated piece from another town, and create something we'd never have come up with in either just a live or just a studio setting.” WSG: Turbo Suit\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/423", "name": "theNEWDEAL w/Turbo Suit @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-11-12T21:00:00-05:00", "url": "https://www.facebook.com/events/929976707046058/", "description": "Thursday, November 12 | 9pm | $10 adv./ $12 day of | 18+\nThe Bright Light Social Hour with: SWIMM & Buffalo Coven Party \n\nQuestions bring art to life. Songs can still ponder socio-political issues, the fragility and isolation of the human condition, and what lies ahead for earth. Moreover, music possesses the potential and gravitas to incite change, while reflecting the world’s faults and follies. The Bright Light Social Hour contemplate a “Future South” on their second full-length album, Space Is Still the Place [Frenchkiss Records]. The Austin artists—Curtis Roush [guitar, vocals, synths], Jack O’Brien [bass, vocals, synths], Joseph Mirasole [drums, synths]—offer a different interpretation of the space around them throughout ten thematically connected songs. They tackle a myriad of issues head on during tracks such as “Ghost Dance” and “Ouroboros,” while “Infinite Cities” contemplates loneliness and “Escape Velocity” subtly hints at a orgiastic ending. The album will pose a few questions, but you may leave with an answer or two as well.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/449\n\nSurcharge free tix at The 8 Ball Saloon", "name": "The Bright Light Social Hour with SWIMM 11/12/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-11-13T21:00:00-05:00", "url": "https://www.facebook.com/events/1651671698445679/", "description": "Fri. Nov. 13 | 9pm | 18+ | $25 adv./ $30 day of\n\nVanessa Carlton - http://www.vanessacarlton.com/\n\nAn unusual light shines through Liberman, Vanessa Carlton’s fifth album. Its ten songs, built on ethereal melodies and lush orchestration, seem to climb out of the shadows, each resonating with a sense of haunting positivity.  The opening track, “Take It Easy,” instantly sets the tone, inviting the listener into a sort of sonic euphoria: each note and lyric thereafter builds on that aesthetic, creating an ongoing narrative that unfurls over its classic side A and side B. \n\n“It’s a calm record,” Carlton says. “I didn’t want any angst in there. I thought, ‘What would I want to hear back? What would make me feel better in my darker times?’ Even a phrase like ‘take it easy,’ which is in a million songs, brings happiness. This album leans toward seeing the good in humans and in the world.”  \n\nCarlton began writing in the summer of 2012, beginning with “Unlock The Lock,” an evocative piano-driven track that set the tone for the songs to come. She’d recently finished touring 2011’s Rabbits On The Run, an album conceived through inspiration from Stephen Hawking’s A Brief History of Time and Richard Adam’s Watership Down. Carlton found herself in the desert and the song emerged, reflecting a newly revealing songwriting sensibility for the artist. “I imagined a group of people listening to it,” she says. “It was the first time I ever wanted to make something like séance music – something that would make a human brain feel at ease, something that would feel right in an everyday ritual. I also realized I wanted the record to be really soothing lyrically and not so much a reveal of me.”\n\nThe musician followed that thread as she continued writing for the next year and a half, this time inspired by books like Joseph Campbell’s The Power of Myth and Aldous Huxley’s The Doors of Perception. Carlton’s primary influence, however, was a colorful oil painting by her grandfather Alan J. Lee, who was originally named Liberman. The painting, created in 1963, hangs in Carlton’s home and showcases three woman captured in swirling pastel colors. She wrote many songs while looking at the image, eventually deciding to call the album after her grandfather. \n\n“The swirly colors of that painting reminded me of the music and the music reminds me of those colors” Carlton notes. “Then I looked up what Liberman means and it’s ‘honorable man’ and ‘my beloved’ – all these things that just felt right to me. It’s a strong family name that, in a weird way, describes the music to me.”\n\nAt the end of 2013, Carlton gathered her songs and decamped to Real World Studio in Box, England to work with producer Steve Osborne, who’d helmed Rabbits On The Run. In the studio, Carlton and Osborne focused on the sound, on creating layers of instrumentation with classic gear that veer away from crisp pop production and reference artists like Air. For Carlton, who began her career with several albums at the mercy of prescribed aesthetics, emphasizing the art of space and sonic beauty felt like the next step. This shift is revealed particularly in the trippy ambience of “House of Seven Swords” and the moody “Ascension,” which builds a soundscape outward from the piano at its center. \n\nCarlton rounded out the album in Nashville, the city she now calls home, with producer Adam Landry who worked on three tracks. Carlton’s husband, Deer Tick front man John McCauley, played on several songs throughout the process, including “Take it Easy,” \"Ascension\" and “Matter of Time.” The latter is stripped of instrumentation and highlights Carlton’s voice as it soars over McCauley’s delicately plucked electric guitar, reminiscent of the old school vocal recordings of Dusty Springfield.  As a whole, Liberman feels like a new chapter in Carlton’s storied career, revealing new facets of her musical skill and instigating fresh inspirations. Stagnancy, she knows, is the antithesis to creativity. \n\n“Martin Scorsese said sometimes your greatest challenge is not your failure but your success,” Carlton says. “In a way I was able to persevere after having a success out of the gate and figure out a path that feels really pure to me. But I had to create this environment where I felt comfortable changing. When I was first doing records I was so young and I wanted to please everyone. But now I sort of feel ancient and I love it and I just want to make art for its own sake. Whether I fall on my face or not at least I know I did it. Everything I’ve done and everything I am is there in the songs.”", "name": "Vanessa Carlton 11/13/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-11-14T19:00:00-05:00", "url": "https://www.facebook.com/events/1610852672500873/", "description": "Turquoise Jeep Records rollin' through November 14th wsg: Lt.baD\nDoors 10pm | 18+ | $15 Cover\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/478", "name": "Turquoise Jeep (Late Show 10pm) 11/14/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-11-14T19:00:00-05:00", "url": "https://www.facebook.com/events/453982398116816/", "description": "Sat. November 14 | 7pm | 18+ | $14 Cover\n\n“It’s all in our minds / Planted over time / Grew into a vine / That became intertwined” – from “All In Our Minds”\n\nThis lyric is the source of the title to Passafire’s fifth studio album, Vines. Though it wasn’t written with this intention, it was in retrospect that the band members – singer/guitarist Ted Bowne, drummer Nick Kubley, bassist/vocalist Will Kubley and keyboardist Mike DeGuzman – realized that it aptly described the current state of the band. Vines is a record that finds its makers at a creative peak, thanks in large part to the comfort of the current line-up, which has been solidified for a few years. They have grown up together, and over the years, as their individual stylistic preferences have changed, they’ve intertwined until the music becomes stronger like vines growing around each other. These four have become a super tight unit, which has led to a comfort level on stage and in the studio that Passafire has never achieved before.  WSG: LIONIZE\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/462", "name": "Passafire w/ Lionize 11/14/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-11-15T20:00:00-05:00", "url": "https://www.facebook.com/events/476972239143336/", "description": "$15 Adv./ $18 day of | 18+ | Doors 8pm / Show 9pm\n\nJonathan Richman has been writing music, recording and touring for most of his life, gathering the loyalty of fans and fellow artists with his warmth, humor and insightful lyrics. In the early 1970s he formed the Modern Lovers, a major progenitor of punk music. Tommy Larkins was in the groups Naked Prey, Giant Sand and other popular bands in Tucson, Arizona. Jonathan and Tommy continue to record, write music together and tour across the US. Tommy’s drumming along with Jonathan’s guitar and singing create a live experience that is hard to forget.\n\n“Playing shows and making records keeps getting easier and more fun,” Jonathan states, adding, “…me and Tommy play totally different than we played two years ago. We already play a different style than we played on that live DVD, and the way we played then was totally different from the way we played three years before that. I still feel like we’re just starting out, and I still learn new stuff every night.” -Jonathan\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/503", "name": "Jonathan Richman Featuring Tommy Larkins on the Drums 11/15/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-11-18T21:00:00-05:00", "url": "https://www.facebook.com/events/820090691422005/", "description": "Wed. Nov. 18 | 9pm | 18+ | $10 Cover\n\nUnder the moniker, Alex Bleeker & the Freaks, Jersey­bred songwriter Alex Bleeker has developed a solo career outside of his bass playing duties for Real Estate. Bringing together like­minded players and friends, he and his able­minded Freaks crafted two separate albums of material, a low­key self­titled release in 2009 and a more full­bodied 2013 record entitled How Far Away.\n\nAlex Bleeker and the Freaks’ third album Country Agenda is the culmination of Bleeker’s songwriting, as well as the gelling together of a fully formed band. With the full­time inclusion of guitarist Alex Steinberg, bassist Nick Lenchner, drummer Dylan Shumaker and keyboardist Jacob Wolf, along with occasional guest vocals from Mountain Man singer Molly Sarle, The Freaks’ vibe has coalesced considerably.\n\nNo longer the work of a single director, this version of the band gives the songs more room to breathe, allowing the tunes to move in unexpected directions. A wholly collaborative effort, Country Agenda features multiple songwriters and ensemble playing that stretches out in unhurried passages of glowing musical interplay. The songs wander in slow motion like a coastline drive, drawing on the same wizened energy and brilliant restraint as Crazy Horse, the Dead, Moby Grape and other like­minded cosmic travelers. Easily the most realized and best sounding set of tunes from the project, the strengths of the album are magnified by a cohesive feeling that was absent on previous Freaks records. The sound here is undeniably the birth of a solid band playing together, locked in the groove, and moving down the road in unison.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/502", "name": "Alex Bleeker & The Freaks 11/18/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-11-21T21:00:00-05:00", "url": "https://www.facebook.com/events/1663435883900279/", "description": "The Rev. Peyton’s Big Damn Band bridges genres and eras with an intensity and effortlessness few contemporary artists possess. And their new album So Deliciouselevates the trio’s work to a new level. Produced by Rev. Peyton, So Delicious offers the band’s most diverse collection of songs buoyed by the Rev.’s supercharged six-string virtuosity — a unique style of fingerpicking inspired by his Delta blues heroes, but taken to new, original heights.\n\nThe fifth full-length original album by the group — which includes Breezy Peyton on washboard and supporting vocals and Ben Bussell on drums and supporting vocals — is their debut on Yazoo Records, a label known for the historic reissues of blues and other old time American music that are the bedrock inspiration for the Rev.’s sound and approach.\n\n“Yazoo was my favorite record label growing up,” he explains. “For fans of old country blues and all manner of early American music, they are the quintessential label. And for me, it’s like being on the same label as Charley Patton and ‘Mississippi’ John Hurt. To think that Yazoo believes we are authentic enough to stand with the other people in their catalog means a lot.”\n\nThe Rev. Peyton’s Big Damn Band has always been strong on authenticity, playing music that blends blues, ragtime, folk, country and other traditional styles with the sleek modern energy of do-it-yourself, homespun, punk fueled rock. And performing tunes plucked from their lives, their community or from the canonical songbook that fed the Rev. Peyton’s formative creative identity. It’s a mix that’s allowed the band to win fans from all corners of the Americana and rock worlds, and bring a new generation to blues and other forms of American roots music.\n\nSo Delicious is a perfect Rev. Peyton’s Big Damn Band album, with songs that speak from the heart and capture the trio — whose sound has been honed over 250 annual tour dates during the last eight years — playing at their peak. The charging, anthemic “Raise a Little Hell,” also the set’s first video, lays out the band’s live modus operandi, thriving on Bussell’s and Breezy’s chugging beat and the Rev.’s resonator guitar riffs and mantra-like singing. The song was inspired by a show at a folk festival, where one of the promoters — struck by the Big Damn Band’s raucous, juke joint power — told the Rev., “Y’all sure raise a lot of hell.”\n\n“I said, ‘Naw we don’t,’ “ the Rev. recalls. “And then I thought, ‘Well, maybe we do raise a little hell.’\n\n\n\n“The sweet, joyful “Pot Roast & Kisses,” which the band has also committed to video, was written for Breezy. The Rev. was developing the finger-busting main riff after enjoying one of her pot roast dinners when the lyrics naturally fell into place. “Some people don’t believe that we really live the way we sing about in our songs,” he explains, “but it’s true. Breezy and me are together and really love each other. We try to keep things simple, like people have in Brown County, Indiana for a long", "name": "Reverend Peyton's Big Damn Band w/ The Erers 11/21/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-12-02T21:00:00-05:00", "url": "https://www.facebook.com/events/887650744615581/", "description": "Wed. December 2 | 9pm | 18+ | $10 Adv./ $12 Day of\n\nWhat The Sound Presents: Beat Connection\n\nBeat Connection is Reed Juenger, Tom Eddy, Jarred Katz and Mark Hunter. Formed in 2010, Beat Connection has undergone numerous changes, finally stabilizing in its current form. The band has already shared the stage with Jungle, Toro y Moi, STRFKR, Washed Out, Holy Ghost! & ODESZA; and has garnered positive looks from Pitchfork, The Fader and The Guardian. With performances scheduled this year at ACL & CHBP, Beat Connection now looks to the future to focus on constantly bringing something new to their audience by bridging the gap between the mundane and the transcendent, the pop and the avant-garde. Expect something new at every turn.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/479", "name": "What The Sound Presents: Beat Connection 12/2/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-12-10T18:00:00-05:00", "url": "https://www.facebook.com/events/690897114388628/", "description": "Thu. December 10 | 9pm | 18+ | $20 Cover\n\nThe Sword is a bladed weapon used primarily for cutting or thrusting. WSG: ROYAL THUNDER & Blue Snaggletooth\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/480", "name": "The Sword High Country Tour wsg Royal Thunder & Blue Snaggletooth 12/10/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2015-12-11T20:00:00-05:00", "url": "https://www.facebook.com/events/136583806684600/", "description": "Two Nights—December 11 & 12!", "name": "The Ragbirds Present—Ebird and Friends Holiday Show Night 1"}, {"source": "Facebook", "date": "2015-12-12T20:00:00-05:00", "url": "https://www.facebook.com/events/114890398861731/", "description": "Two nights—December 11 & 12!", "name": "The Ragbirds Present: Ebird & Friends Holiday Show Night 2"}, {"source": "Facebook", "date": "2015-12-13T19:30:00-05:00", "url": "https://www.facebook.com/events/1627782970844802/", "description": "\"Puts the heart in heartland\"—Knoxville News-Sentinel", "name": "Griffin House"}, {"source": "Facebook", "date": "2015-12-16T20:00:00-05:00", "url": "https://www.facebook.com/events/899661113444014/", "description": "The king of Texas honky-tonk blues", "name": "Delbert McClinton"}, {"source": "Facebook", "date": "2015-12-19T20:00:00-05:00", "url": "https://www.facebook.com/events/1598739690348383/", "description": "A musical ramble across Ireland", "name": "Blackthorn"}, {"source": "Facebook", "date": "2015-12-20T19:30:00-05:00", "url": "https://www.facebook.com/events/1123793354317511/", "description": "A veteran rock and roller goes back to the roots", "name": "Jorma Kaukonen"}, {"source": "Facebook", "date": "2015-12-26T19:30:00-05:00", "url": "https://www.facebook.com/events/455656784607726/", "description": "The Celtic event of the season in metro Detroit. Note special start time! Dinner-show ticket at Conor's O'Neill's avaiable!", "name": "Crossroads Ceili—Night 1"}, {"source": "Facebook", "date": "2015-12-27T19:30:00-05:00", "url": "https://www.facebook.com/events/1613884542207213/", "description": "The Celtic event of the season in metro Detroit! Dinner-show ticket with dinner at Conor O'Neill's available. Bhliain nua sásta!", "name": "Crossroads Ceili—Night 2"}, {"source": "Facebook", "date": "2016-01-02T20:00:00-05:00", "url": "https://www.facebook.com/events/410480645829575/", "description": "Start the year off right with new music by Ann Arbor's songwriting collective!", "name": "The Yellow Room Gang"}, {"source": "Facebook", "date": "2016-01-03T19:30:00-05:00", "url": "https://www.facebook.com/events/765902406876129/", "description": "A show for adults from Michigan's beloved children's musicians", "name": "Gemini w/sg Mosaic"}, {"source": "Facebook", "date": "2016-01-08T20:00:00-05:00", "url": "https://www.facebook.com/events/1469636516699307/", "description": "\"A ... lo-fi sound in the vein of Amos Lee or Brandi Carlile.\"—The Onion", "name": "The Understorey"}, {"source": "Facebook", "date": "2016-01-09T20:00:00-05:00", "url": "https://www.facebook.com/events/128024594215242/", "description": "\"Her voice can soar like an opera and smoke like the blues.\"—Detroit Free Press", "name": "The Jill Jack Birthday Bash"}, {"source": "Facebook", "date": "2016-01-11T19:30:00-05:00", "url": "https://www.facebook.com/events/780337908747994/", "description": "Monday, January 11, 2016, 7:30 pm\nHill Auditorium\n\nFounded by Sir Thomas Beecham in 1946, the Royal Philharmonic Orchestra made its UMS debut in 1950 and last performed in Hill Auditorium in 1992. This concert features Pinchas Zukerman both at the helm and as the featured soloist. \n\nMore info: http://ums.org/performance/royal-philharmonic-orchestra/", "name": "Royal Philharmonic Orchestra"}, {"source": "Facebook", "date": "2016-01-15T20:00:00-05:00", "url": "https://www.facebook.com/events/1496989627284184/", "description": "Fine Mitten spirits!", "name": "Dragon Wagon"}, {"source": "Facebook", "date": "2016-01-20T19:30:00-05:00", "url": "https://www.facebook.com/events/1604747733142781/", "description": "Wednesday, January 20, 2016, 7:30 pm\nHill Auditorium\n\n“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas) Since 1988, Wynton Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, sophisticated to spirited, it’s all sheer jazz perfection — no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/1516-jazz-at-lincoln-center-orchestra/", "name": "Jazz at Lincoln Center Orchestra with Wynton Marsalis"}, {"source": "Facebook", "date": "2016-01-21T19:30:00-05:00", "url": "https://www.facebook.com/events/1620983154780471/", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show"}, {"source": "Facebook", "date": "2016-01-21T20:00:00-05:00", "url": "https://www.facebook.com/events/1621661494783572/", "description": "\"A skilled purveyor of lovely gloom\"—NPR", "name": "Chris Bathgate w/Bear Medicine"}, {"source": "Facebook", "date": "2016-01-22T20:00:00-05:00", "url": "https://www.facebook.com/events/1453480484950039/", "description": "Friday, January 22, 2016, 8:00 pm\nRackham Auditorium\n\nThe Chamber Music Society of Lincoln Center presents chamber music of every instrumentation, style, and historical period. The six musicians performing in this concert include violinist Benjamin Beilman, an Ann Arbor native whose career has been burnished by a series of major awards recognizing his extraordinary musical talent. \n\nMore info: http://ums.org/performance/chamber-music-society-of-lincoln-center", "name": "Chamber Music Society of Lincoln Center"}, {"source": "Facebook", "date": "2016-01-22T20:00:00-05:00", "url": "https://www.facebook.com/events/1452156068412417/", "description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "name": "Young Jean Lee Theater Company: Straight White Men"}, {"source": "Facebook", "date": "2016-01-23T20:00:00-05:00", "url": "https://www.facebook.com/events/1711386249095948/", "description": "Now featuring Molly Cherryholmes on fiddle!", "name": "Mountain Heart"}, {"source": "Facebook", "date": "2016-01-24T19:30:00-05:00", "url": "https://www.facebook.com/events/1008141132558808/", "description": "\"Sophisticated intelligence and provocative originality\"—Boston Globe", "name": "John Gorka"}, {"source": "Facebook", "date": "2016-01-27T19:30:00-05:00", "url": "https://www.facebook.com/events/1020565857968750/", "description": "Wednesday, January 27, 2016, 7:30 pm\nMichigan Theater\n\nBy any measure of talent and accomplishment, Lisa Fischer is a superstar. Yet, if you do not know her name, it’s likely because she has spent the past 20 years as a backup singer for the Rolling Stones, Sting, Chris Botti, and countless others. Her name may not be on the marquee, but she doesn’t care. Her astonishing range, spot-on intonation, mastery of the stage, and infectious sweet smile make her the go-to singer for the likes of Tina Turner, Chaka Khan, Beyoncé, Bobby McFerrin, Lou Reed, Dionne Warwick, Aretha Franklin, and a host of others. As one of the top session and backup singers, she’s featured in the Oscar-winning documentary 20 Feet from Stardom and celebrated for her live concert duets with Mick Jagger during “Gimme Shelter” that have also received millions of hits on YouTube. After winning Grammy Awards for “Best Female R&B Performance” (1992) and “Best Music Film” (2015), she has decided to move forward from being a backup singer, putting together her own band and claiming her well-deserved place center stage. \n\nMore info: http://ums.org/performance/ms-lisa-fischer-and-grand-baton", "name": "Ms. Lisa Fischer and Grand Baton"}, {"source": "Facebook", "date": "2016-02-02T19:30:00-05:00", "url": "https://www.facebook.com/events/1155115267866605/", "description": "Tuesday, February 2, 2016, 7:30 pm\nLydia Mendelssohn Theatre\n\nWith Tanya Tagaq, ancient meets modern in provocative, powerful ways. This spellbinding performance features the Inuit throat singer accompanying a screening of Nanook of the North (1922) with a live score. Tagaq’s mixed-media performance reclaims the controversial classic — considered the first feature-length documentary — capturing the sense of the sound of the Arctic spaces shown in the film and adding tremendous feeling and depth to what is a complex mix of beautiful representations and racially charged clichés.\n\nTanya Tagaq’s music is unnerving and exquisite, rooted in Inuit throat singing, but also influenced by electronica, industrial, and metal influences. It is a style that she has perfected with collaborators such as Björk and that reminds some of Meredith Monk’s vocal innovations. Winner of the 2014 Polaris Prize for “Album of the Year” (she beat out Drake and Arcade Fire), Tanya Tagaq makes her UMS debut in this one-night only event. “Nobody, anywhere, sounds like she does.” (Globe and Mail)\n\nMore info: http://ums.org/performance/tanya-tagaq/", "name": "Tanya Tagaq in concert with Nanook of the North"}, {"source": "Facebook", "date": "2016-02-05T20:00:00-05:00", "url": "https://www.facebook.com/events/1594841967471096/", "description": "Friday, February 5, 2016, 8:00 pm\nLydia Mendelssohn Theatre\n\nTaylor Mac is equal parts bedazzled shaman, searing social critic, radical angel, and Elizabethan fool. A critical darling of the New York downtown cabaret scene, he is beloved for his iconic beauty, disarming vulnerability, and soaring spirit. His 24-Decade History of Popular Music will eventually become an epic show performed over 24 continuous hours; in Ann Arbor, Taylor will focus on the 1960s, 70s, and 80s, connecting the decades to the vibrant music scene in Detroit. “Fabulousness can come in many forms, and Taylor Mac seems intent on assuming every one of them.” (New York Times) A UMS co-commission. \n\nMore info: http://ums.org/performance/taylor-mac-a-24-decade-history-of-american-popular-music-1960s-1980s/", "name": "Taylor Mac: A 24-Decade History of American Popular Music: 1960s–1980s"}, {"source": "Facebook", "date": "2016-02-06T20:00:00-05:00", "url": "https://www.facebook.com/events/1435582513413462/", "description": "Saturday, February 6, 2016, 8:00 pm\nHill Auditorium \n\n“His superb live performance confirmed the impression of his recording: A major new pianist has arrived.” (New York Times) Born in 1987, the Russian-German pianist Igor Levit received effusive praise for his two-disc debut album of Beethoven’s late piano sonatas. A relative newcomer to the United States, he makes his UMS debut with this recital appearance. \n\nMore info: http://ums.org/performance/igor-levit/", "name": "Igor Levit, piano"}, {"source": "Facebook", "date": "2016-02-13T20:00:00-05:00", "url": "https://www.facebook.com/events/368546533344933/", "description": "Saturday, February 13, 2016, 8:00 pm\nPower Center\n\n“Every aspect of the dance-making here is thoroughly accomplished.” (New York Times) A prolific choreographer who danced with Ronald K. Brown’s Evidence, Rennie Harris’s Puremovement, and the Alvin Ailey American Dance Theater, Camille A. Brown brings her newest work to Ann Arbor for her UMS debut. Black Girl — Linguistic Play speaks to the complexities of carving out a positive identity as a Black female in urban American culture.\n\nIn a world where Black women are often portrayed only in terms of their strength, resiliency, or trauma, this work interrogates these narratives by presenting a fuller spectrum of the black female and the complexities of negotiating in this racially and politically charged world. The work uses elements of African-American social dancing, rhythmic play, and musical compositions to better illustrate who “Black Girl” knows herself to be. Brown’s choreography is “fun, inventive, and watchable.” (Times Square Chronicles) Program will also include other repertoire.\n\nMore info: http://ums.org/performance/camille-a-brown-dancers/", "name": "Camille A. Brown & Dancers: Black Girl — A Linguistic Play"}, {"source": "Facebook", "date": "2016-02-16T19:30:00-05:00", "url": "https://www.facebook.com/events/442008155980033/", "description": "February 16, 18\nRackham Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "name": "Sir András Schiff, piano"}, {"source": "Facebook", "date": "2016-02-19T20:00:00-05:00", "url": "https://www.facebook.com/events/1620380161539059/", "description": "Friday, February 19, 2016, 8:00 pm\nMichigan Theater\n\nA decade after it was first brought to the screen, Benoît Charest revives the music of the Oscar-nominated film The Triplets of Belleville with a remarkable cast of musicians in this silent movie-live concert event. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His near-sighted grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas.\n\nBut the true star of the animated film is the hot jazz score written by Canadian composer Benoît Charest. This screening of the beloved French film transports audiences to the exciting streets of 1920s Paris and Le Jazz Hot.\n\nMore info: http://ums.org/performance/the-triplets-of-belleville/", "name": "The Triplets of Belleville"}, {"source": "Facebook", "date": "2016-02-20T20:00:00-05:00", "url": "https://www.facebook.com/events/1611931089050428/", "description": "February 20\nHill Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "name": "Sir András Schiff, piano"}, {"source": "Facebook", "date": "2016-02-24T20:00:00-05:00", "url": "https://www.facebook.com/events/711839748946653/", "description": "\"The world's greatest flatpicker\"—Oklahoma Gazette", "name": "Tommy Emmanuel"}, {"source": "Facebook", "date": "2016-02-25T21:00:00-05:00", "url": "https://www.facebook.com/events/1449897481978519/", "description": "Nashville-based, independent artist, Ron Pope, has stood at a crossroads where so many musicians find themselves — at the intersection of record label and independence. In an ever-evolving industry filled with rejection and compromise, he has plotted a new course for his music to reach loyal listeners, taking the industry-road-less-traveled in exchange for the ultimate payback, a league of devoted fans the world over.\n\nVIP tix available here: http://www.etix.com/ticket/p/4574033/ron-pope-vip-meet-greet-ann-arbor-blind-pig-the-blind-pig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/446", "name": "Ron Pope & The Nighthawks 2/25/15 @ Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-02-26T20:00:00-05:00", "url": "https://www.facebook.com/events/1538895803015696/", "description": "\"Music to cure what ails you\"—Michigan Times", "name": "Mustard's Retreat"}, {"source": "Facebook", "date": "2016-02-27T19:30:00-05:00", "url": "https://www.facebook.com/events/1112577285437513/", "description": "A journey to the land of the mind's eye. Note special start time!", "name": "The Ark's 29th Annual Storytelling Festival feat. Kevin Kling"}, {"source": "Facebook", "date": "2016-02-28T13:00:00-05:00", "url": "https://www.facebook.com/events/1067500173261475/", "description": "Storytelling for the family", "name": "Storytelling for Kids"}, {"source": "Facebook", "date": "2016-03-05T20:00:00-05:00", "url": "https://www.facebook.com/events/1598997080377800/", "description": "Saturday, March 5, 2016, 8:00 pm\nHill Auditorium\n\nPaddy Malone and The Chieftains celebrated 50 years of performing in 2012, and their music remains as fresh and relevant as when they first began. Recognized for reinventing traditional Irish music on a contemporary and international scale, their ability to blend tradition with modern music has made them one of the most renowned and revered musical groups to this day. Back for their fifth UMS performance and their first in nearly a decade, “they seem ageless, and so does their Irish music. If common sense tells you they can’t go on forever, you wouldn’t know it from their electrifying performance.” (Boston Globe)\n\nMore info: http://ums.org/performance/the-chieftains/", "name": "The Chieftains"}, {"source": "Facebook", "date": "2016-03-11T20:00:00-05:00", "url": "https://www.facebook.com/events/488544131294497/", "description": "March 11-12\nPower Center\n\n“You can’t help but leave with a fuzzy feeling inside.” (examiner.com) The globetrotting, Montreal-based scratch DJ and music producer Kid Koala presents a magical, multi-disciplinary and theatrical adaptation of his graphic novel and soundtrack, Nufonia Must Fall. This charming story centers around a headphones-sporting robot on the verge of obsolescence who falls in love with a lonely office girl. This live adaptation unfolds via real-time filming of more than a dozen miniature stages and a cast of puppets, while Kid Koala and the Aelos Quartet provide original live scoring on piano, strings, and turntables. The result? You’ll seem to be watching an animated picture, but simultaneously seeing puppets being filmed and projected in real time. Heartfelt, hand-made, and a very cool live experience. \n\nMore info: http://ums.org/performance/nufonia-must-fall/", "name": "Nufonia Must Fall"}, {"source": "Facebook", "date": "2016-03-15T19:30:00-04:00", "url": "https://www.facebook.com/events/971816919508035/", "description": "Tuesday, March 15, 2016, 7:30 pm\nSt. Francis of Assisi\n\nFresh from their 2014 performance of Monteverdi’s Vespers, Apollo’s Fire & Singers returns to St. Francis of Assisi Church with one of their signature pieces, Bach’s St. John Passion. Bursting out of the gate from the agitated opening chorus, this work is considered Bach’s most dramatic and theatrical oratorio. In this acclaimed interpretation, the story’s action is highlighted by a dramatic approach: the roles are performed by true singing actors, staged on a special theatrical platform within the orchestra. The acclaimed Apollo’s Singers evoke the wild mob with fierce intensity. \n\nMore info: http://ums.org/performance/apollos-fire-st-john-passion/", "name": "Apollo’s Fire & Apollo’s Singers: Bach’s St. John Passion"}, {"source": "Facebook", "date": "2016-03-19T20:00:00-04:00", "url": "https://www.facebook.com/events/1582133688713673/", "description": "Saturday, March 19, 2016, 8:00 pm\nHill Auditorium\n\nThe Montreal Symphony returns to Ann Arbor for the first time since 1989, with American conductor Kent Nagano and pianist Daniil Trifonov both making their UMS debuts. “Hearing Trifonov is like having a deep-tissue massage: you keep wanting to pull away from the sheer intensity of it, and you come out feeling as if your reality had been slightly altered…a knockout.” (Washington Post) \n\nMore info: http://ums.org/performance/montreal-symphony-orchestra/", "name": "Montreal Symphony"}, {"source": "Facebook", "date": "2016-03-20T19:30:00-04:00", "url": "https://www.facebook.com/events/1488521474793961/", "description": "Appalachia gone Brazilian! Photo by Vincent Soyez. This show is FREE to Ark members at the door.", "name": "Matuto"}, {"source": "Facebook", "date": "2016-03-23T20:00:00-04:00", "url": "https://www.facebook.com/events/962546740435420/", "description": "Indian classical music and multicultural fusion", "name": "Maestro Khan"}, {"source": "Facebook", "date": "2016-03-24T20:00:00-04:00", "url": "https://www.facebook.com/events/119883711695876/", "description": "New music from Patty!", "name": "Patty Larkin"}, {"source": "Facebook", "date": "2016-03-26T20:00:00-04:00", "url": "https://www.facebook.com/events/1663165150570187/", "description": "Saturday, March 26, 2016, 8:00 pm\nHill Auditorium\n\nBach’s complete Sonatas and Partitas have long been a “Mount Everest” of the violin repertoire — music that performers return to throughout their lives. In this special event, Gil Shaham collaborates with video artist David Michalek to open up new avenues for listening to and interpreting Bach’s towering masterpieces.\n\nVideo artist David Michalek, best known for his “Slow Dancing” installation at Lincoln Center, and in the capitals of Europe, says of the Bach Six Solos project: “As a contemporary artist with a particular interest in motion pictures and time, I’ve been compelled to consider how the addition of extreme slow motion might be applied to moving images of the face, the body, obliquely narrative tableaux, and also still life in ways that can both enhance and alter the meanings latent within them. As a visual strategy, extreme slowness creates a continuing sense of a pause in the action — as if the growth and evolution of the slow-moving image is itself a further manifestation of the deep and consuming absorptive state that often arises while observing it.”\n\nMore info: http://ums.org/performance/gil-shaham/", "name": "Bach Six Solos: Gil Shaham, violin"}, {"source": "Facebook", "date": "2016-03-31T19:30:00-04:00", "url": "https://www.facebook.com/events/1390173447979498/", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"source": "Facebook", "date": "2016-04-01T20:00:00-04:00", "url": "https://www.facebook.com/events/453190221522442/", "description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "name": "Mariachi Vargas de Tecalitlán"}, {"source": "Facebook", "date": "2016-04-06T19:30:00-04:00", "url": "https://www.facebook.com/events/1617523538522455/", "description": "Note special start time!", "name": "Micah Smiles Benefit Concert for C.S. Mott Children's Hospital"}, {"source": "Facebook", "date": "2016-04-08T20:00:00-04:00", "url": "https://www.facebook.com/events/827290400697161/", "description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "name": "Jerusalem Quartet"}, {"source": "Facebook", "date": "2016-04-13T20:00:00-04:00", "url": "https://www.facebook.com/events/1602568673339827/", "description": "South Africa's legendary breaker of walls", "name": "The Johnny Clegg Band"}, {"source": "Facebook", "date": "2016-04-14T19:30:00-04:00", "url": "https://www.facebook.com/events/1621365181438631/", "description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "name": "Mnozil Brass"}, {"source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "url": "https://www.facebook.com/events/419604171550681/", "description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus, where it blended with elements of Spanish music, then was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed Tunisian singer Sonia M’barek, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "name": "Zafir: Musical Winds from North Africa to Andalucía"}, {"source": "Facebook", "date": "2016-04-16T20:00:00-04:00", "url": "https://www.facebook.com/events/1579924995611394/", "description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "name": "Bavarian Radio Orchestra"}, {"source": "Facebook", "date": "2016-04-23T20:00:00-04:00", "url": "https://www.facebook.com/events/1589849627952742/", "description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "name": "The Bad Plus Joshua Redman"}]