[{"description": "This weekend, we're dipping sweet strawberries in delicous melted chocolate for you- our 6-packs are $6.99, 4-packs are $3.99, and $1.29 for just one. We love these berry much ♥", "url": "https://www.facebook.com/events/1534925953474956/", "source": "Facebook", "name": "Strawberry Dipping!", "date": "2016-02-14T11:00:00-05:00"}, {"description": "Valentine's Day falls on a Sunday this year -- kinda lame, yes, but that means you've got a whole weekend to celebrate loving someone special: your partner, your dog, yourself! Whatever and whomever you're celebrating, we hope you make your way to Wolverine State for some great beer, great food, and great company. \n\nAs usual, Revilo, our India Red Lager, will be February's Beer of the Month, and you can get your hands on that for a special price all Valentine's Day weekend! 15-oz pours are only $3, so buy one for your sweetie. \n\nAnd don't even get us started on food specials. Ever had a hot date with a chicken? Well, you're about to. \"Hot Date with a Chicken\" is on the menu -- an entree for two! Dates, apricots, and cayenne combine as the filling for tender smoked chicken breast. \n\nFor dessert, we'll have a plate to split with your honey (or to keep to yourself -- please, we're the last people to judge). Chocolate-covered strawberries will be served alongside special cookies from the People's Food Co-op! You already love their sea salt chocolate chip cookies that we sell in the Tap Room -- just wait until you try these goodies! \n\nWe're also bringing in a local acoustic artist to play some tunes on Saturday evening! We'll keep you posted with more information as the weekend draws nearer. \n\nWe hope you'll share the love with us on Valentine's Day weekend! With Revilo on special, delicious chicken, and fabulous chocolate on the menu, how can you not?!", "url": "https://www.facebook.com/events/446121065583340/", "source": "Facebook", "name": "Valentine's Day Weekend at Wolverine State", "date": "2016-02-14T12:00:00-05:00"}, {"description": "What do you love more than wine and chocolate? \nWhen you pair the two together you get a delicious and heart healthy snack.\nBabo has partnered with Mindo and Rave to bring you just that this Valentine's Day.\nJoin us this Sunday at our downtown location for this sweet product demo.", "url": "https://www.facebook.com/events/204042206615832/", "source": "Facebook", "name": "Chocolate & Wine Tasting", "date": "2016-02-14T15:00:00-05:00"}, {"description": "Scott Hanoian, music director and conductor\nArianne Abela, assistant conductor\nScott VanOrnum, organ\nKristin Eder, mezzo-soprano\nStephen Lancaster, bass-baritone\n\nSunday, February 14, 2016, 4 pm\nHill Auditorium \n\nThis Valentine’s Day, we explore the themes of love and loss with works featuring the UMS Choral Union\naccompanied by Hill Auditorium’s Frieze Memorial Organ. The concert, led by new UMS Choral Union music director Scott Hanoian, features a provocative and comforting setting of the Requiem, the longing pleas of a wandering heart by Goethe, and the divinely transcendent poetry of George Herbert, all wedded to the music of Duruflé, Brahms, and Vaughan Williams. This afternoon of choral masterpieces is sure to fill your heart.\n\nhttp://ums.org/performance/ums-choral-union-love-is-strong-as-death/", "url": "https://www.facebook.com/events/940815976009708/", "source": "Facebook", "name": "UMS Choral Union: Love is Strong as Death", "date": "2016-02-14T16:00:00-05:00"}, {"description": "Carson’s American Bistro\nPresents Valentine’s Week\nMonday, Feb. 8 – Sunday, Feb. 14\nFrom 4pm-Close \n \nValentine’s Prix-Fixe Dinner Menu \n$75 for two (tax/gratuity not included)\n \nAppetizer\nSmoked Salmon Pate \nwith crostini\n \nSalad\nCarson’s Caprese Salad\navocado, basil, fresh mozzarella, tomato, layered and drizzled with dark balsamic reduction, extra virgin olive oil and black Hawaiian sea salt\n \nEntrée\nSurf and Turf\ntwo 4oz Canadian lobster tails, 12oz  house Prime rib, wild mushroom bread pudding, grilled asparagus\ntarragon butter and Jameson peppercorn demi-glace\n \nDessert\nRaspberry Crème Brule\ntopped with fresh berries \n\n#ValentinesDay #Special #FineDining", "url": "https://www.facebook.com/events/1705005099757077/", "source": "Facebook", "name": "Valentine's | Weekly Specials", "date": "2016-02-14T16:00:00-05:00"}, {"description": "Spend your Valentine's Day at Sava's with your Sweety!\nOffering specials Thursday, February 11- Sunday, February 14.\nCall (734) 623-2233  to make your reservation or click the link above. \n\nSMALL PLATES\n\nOYSTERS 4 | 10\nchef selection, classic cocktail, mignonette, lemon \n\nLENTIL SALAD\t11\nbraised black lentils, radicchio, baby lettuce, onion, celery, chile-glazed baby carrots, lemon-pomegranate vinaigrette\n\nMAINS\n\nBEEF WELLINGTON\t28\nduxelles, dijon, thyme, prosciutto, lyonnaise, potatoes in duck-fat, sautéed asparagus\n\nCRISPY ORATA\t24\nwith sweet potato and ginger gratin, mango pickle\n\nTORN PASTA\t19\nspicy tomato broth with parmesan rind, white beans, red pepper flake, braised leek\n\nCOCKTAILS\n\nROSES ARE RED, VIOLETS ARE BLUE\t9\nchoice of two James gin or vodka, lychee liquor, crème de violette, egg white, citrus, peychaud’s. garnished with a strawberry rose \n\nBUBBLES & BERRIES\t20\ntwo glasses of cava garnished with luxardo cherries and thyme. served with strawberries and late harvest red zinfandel whipped cream", "url": "https://www.facebook.com/events/1729119570651346/", "source": "Facebook", "name": "Eat Your Heart Out", "date": "2016-02-14T17:00:00-05:00"}, {"description": "Perfectly prepared for two.\n\nAventura will be offering a special 5-course tasting menu with a Cava toast, $50 per person (Tax and Gratuity Included), or wine pairings, $75 per person (Tax and Gratuity Included), February 14, for you and your sweetie. \n\nMake Love Bloom this Valentine's Day! Call 734-369-3153 to make your reservation today.\n\nSEE MENU BELOW\n\nINTERMEZZO\n\n1ST COURSE (choose one)\n\nHOT & COLD OYSTERS\n(H) bechamel (C) mignonette gelee\n\nROASTED EGGPLANT SALAD\nconfit garlic, pickled cauliflower, oregano-lemon vinaigrette, feta cheese\n\nAVOCADO & PICKLED CRAB TOAST\nroasted chilis, cilantro, red radish, coriander gastrique\n\n2ND COURSE (choose one)\n\nCARMELIZED ONION TARTLET\ngolden raisins, pickled mustard seeds, quark cheese, tarragon oil\n\nSAFFRON-SHELLFISH STEW\nhead-on prawn, clams, mussels, green olives, peppadew peppadews, grilled baguette, preserved lemon aioli\n\nLAMB SWEET BREADS\nmediterranean chimichurri, piquillo pepper coulis\n\n3RD COURSE (choose one)\n\nBRAISED PORK CHEEK\nparsnip purée, cast-iron root vegetables, sherry-apple jus\n\nGRILLED SHIITAKE CARBONARA\nhandmade pasta, fresh egg yolk, fine herbs, manchego\n\nPAN-SEARED YELLOW TAIL PERCH\nsalted whitefish & serrano hash, chive crème fraîche, black river osetra caviar\n\nDESSERT (choose one)\n\nRICOTTA CHEESECAKE (Quesada Pasiega)_\nwhipped fresh goat ricotta, honeycomb, sour citrus fruit syrup and shortbread cookies\n\nWARM POTATO NUT CAKE\nclotted cream and toasted chili sugar", "url": "https://www.facebook.com/events/1676316662616175/", "source": "Facebook", "name": "Make Love Bloom", "date": "2016-02-14T17:00:00-05:00"}, {"description": "Join us on this, your (maybe least) favorite holiday of the year!  Not only is Goose Island doing a tap takeover featuring a rare, annual release of Bourbon County Brand Stout, but your favorite Derby Dimes will be there ready to kiss your face, tell your future and (maybe) give you prizes! Grab a beer and come hang with us!\n\nKISSING BOOTH\nFORTUNE TELLING\nRAFFLE FOR STUFFS\n\nGOOSE ISLAND LINE UP:\nGoose IPA\nFour Star Pilsner\nSofie Matilda\nLoita\nBourbon Count Brand Stout\n\n\nTHE PARTY STARTS AT 7PM\nGUESTS 21+ WELCOME", "url": "https://www.facebook.com/events/1149726225046239/", "source": "Facebook", "name": "The Wurst Valendime's Day Party!", "date": "2016-02-14T19:00:00-05:00"}, {"description": "Pointless Brewery & Theater proudly presents “Pointless Video Night!” Enjoy hilarious video shorts at 7pm on the second Sunday of each month, created by some of our very own improvisers and also by professional, amateur and even wannabe film makers in and around the community!! \n\nHere’s how it works: Each month we’ll get a new suggestion from the audience to use as inspiration for the next month’s “Pointless Video Night”. Next, get to work creating your prerecorded masterpiece. Submissions can be no longer than two minutes in length. Send your finished product to pointlessvideoshorts@gmail.com no later than the Saturday before the video night. And finally, come and watch the crowd go wild over your creative and hysterical work of digital media art.\n\nNot into making vids but love watching them? Submit your favorite one from YouTube relative to that month’s “suggestion” and we might play it on that Sunday! That’s right, you can share with the world that video you accidentally stumbled upon late one night while browsing the interwebs that made you cry with laughter (again, assuming it fits the theme of that particular month).\n\nCome and check out our FIRST EVER “Pointless Video Night” on Sunday, February 14th at 7pm. You can see how it works and find out (or even GIVE) the suggestion for the following month. Please note - you are not required to participate in any way. Simply come, enjoy a microbrew, sit back and laugh with some fellow funny people. \n\nLet’s get ROLLIN’!", "url": "https://www.facebook.com/events/1010302699029146/", "source": "Facebook", "name": "Pointless Video Night", "date": "2016-02-14T19:00:00-05:00"}, {"description": "Literati is pleased to welcome Zell Writers’ Program Alum Mo Daviau to read from her debut novel, Every Anxious Wave.\n\nA wild romp of a love story across time, interweaving astrophysics and indie rock.\n\nKarl Bender exclusively uses his Chicago apartment’s wormhole to send people back to rock concerts until his best friend cannot be talked out of trying to save John Lennon. Alas, Karl accidentally leaves off the “1” in “1980,” sending Wayne back to 980, Mannahatta. Though he receives Wayne’s texts extolling the quality of life, and especially the quality of the fish, Karl can’t figure out how to bring him back.\n\nEnter brilliant, prickly, overweight astrophysicist Lena Geduldig. Karl and Lena’s connection is immediate. While they work on getting Wayne back, Karl’s future self emails him from Seattle, imploring him: don’t lose Lena. Karl visits Seattle, now waterlogged, and meets his future stepdaughter. Unable to resist meddling with the past, Karl and Lena bounce around time in Boston, Portland, Chicago, Montana, Seattle, and Mannahatta. When Lena ultimately prevents her own long-ago rape, she alters the course of her life. She no longer knows Karl, who must figure out how to get her back without erasing the stepdaughter to whom he’s grown close.\n\n“Every Anxious Wave gives us the intelligent irreverence of Nick Hornby, the honest romance of Gary Shteyngart, and the swoon-worthy charm of a John Cusack movie, all within a riveting story of lost love, bent time, and rock stars. A delightful, innovative debut.” --Rebecca Dinerstein, author of The Sunlit Night\n\n\"An absolute kick in the pants to read--if you love rock, bodies, and time travel, this is your ride.\" \n--Lidia Yuknavitch, author of The Small Backs of Children\n\nMo Daviau was born in 1976 to a very unusual couple in a widely disliked city in California. A graduate of Smith College and the Helen Zell Writers' Program at the University of Michigan, she now lives in Portland, Oregon, with her stuffed crocodile.", "url": "https://www.facebook.com/events/1047299065322974/", "source": "Facebook", "name": "Mo Daviau", "date": "2016-02-15T19:00:00-05:00"}, {"description": "From Wednesday to Wednesday, alllll of our bulk chocolates are  25% off. Chocolate is the question- who cares what the question is?", "url": "https://www.facebook.com/events/539810849520988/", "source": "Facebook", "name": "25% Off Bulk Chocolates", "date": "2016-02-16T08:15:00-05:00"}, {"description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "url": "https://www.facebook.com/events/1686749728236981/", "source": "Facebook", "name": "Story Time with Ieva", "date": "2016-02-16T10:00:00-05:00"}, {"description": "In 1919, the US government passed the 18th Amendment, clearing the way for 13 years of the folly that was Prohibition. During this time, manufacturing and the sale of alcohol was made illegal, driving alcohol consumption underground. Millions of people in small towns and big cities alike imbibed at secret bars and taverns called speakeasies. Bartenders, working with limited resources to alcohol, began an era that resulted in some of the most creative cocktails the industry has ever seen.\n\nRoadhouse bartender and cocktail historian Alibeth Vandergrift has chosen several of the most popular Prohibition era cocktails to pair with a 1920s style menu created by Chef Alex, featuring some of the times most popular foods. The Roadhouse will turn our dining room into a vintage speakeasy, transporting the guests back to the 1920s.", "url": "https://www.facebook.com/events/1068899403152432/", "source": "Facebook", "name": "Classic Cocktails from the Prohibition Era", "date": "2016-02-16T19:00:00-05:00"}, {"description": "Come in from the cold for hot coffee and hotter poetry! Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Reader\n\nThis month's feature: DENISE MILLER!\n\nDenise Miller is a poet and mixed media artist whose work reflects conscious survival for herself and for individuals living in an “ism” driven culture. Her poetry and art are practices that merge activism, spirituality and craft that draws from and re-shapes cultural currents. Currently, Miller is working on a collection of poems that identify and interrogate the ways that people live out how the body evolves in the absence of peace, how the body navigates when the fiduciary/fixed points are sound and violence, and what people reflect or sound back in its presence. \n\nHer publications include poems in Dunes Review, African American Review and Blackberry: A Magazine . She’s the 2015 Willow Books Emerging Poet, an AROHO Waves Discussion Fellowship awardee, a finalist for the Barbara Deming Money for Women Fund, and a Hedgebrook Fellow. Her newest book, Core, released from Willow Books in November 2015 has been nominated for a 2016 American Book Award and a 2016 Pushcart Prize. Additionally, one of her poems from a collection in progress has also been nominated for the 2016 Pushcart Prize. More of her work can be found at www.makedo.weebly.com   \n\n\nNext month's feature: ALISE ALOUSI!", "url": "https://www.facebook.com/events/181537812210419/", "source": "Facebook", "name": "Skazat! Poetry Series featuring Denise Miller", "date": "2016-02-16T19:00:00-05:00"}, {"description": "February 16, 18\nRackham Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "url": "https://www.facebook.com/events/442008155980033/", "source": "Facebook", "name": "Sir András Schiff, piano", "date": "2016-02-16T19:30:00-05:00"}, {"description": "Spend your Valentine's Day at Sava's with your Sweety!\nOffering specials Thursday, February 11- Sunday, February 14.\nCall (734) 623-2233  to make your reservation or click the link above. \n\nSMALL PLATES\n\nOYSTERS 4 | 10\nchef selection, classic cocktail, mignonette, lemon \n\nLENTIL SALAD\t11\nbraised black lentils, radicchio, baby lettuce, onion, celery, chile-glazed baby carrots, lemon-pomegranate vinaigrette\n\nMAINS\n\nBEEF WELLINGTON\t28\nduxelles, dijon, thyme, prosciutto, lyonnaise, potatoes in duck-fat, sautéed asparagus\n\nCRISPY ORATA\t24\nwith sweet potato and ginger gratin, mango pickle\n\nTORN PASTA\t19\nspicy tomato broth with parmesan rind, white beans, red pepper flake, braised leek\n\nCOCKTAILS\n\nROSES ARE RED, VIOLETS ARE BLUE\t9\nchoice of two James gin or vodka, lychee liquor, crème de violette, egg white, citrus, peychaud’s. garnished with a strawberry rose \n\nBUBBLES & BERRIES\t20\ntwo glasses of cava garnished with luxardo cherries and thyme. served with strawberries and late harvest red zinfandel whipped cream", "url": "https://www.facebook.com/events/1729119570651346/", "source": "Facebook", "name": "Eat Your Heart Out", "date": "2016-02-17T17:00:00-05:00"}, {"description": "Literati is delighted to welcome young-adult author and Ann Arbor native Gavriel Savit in support of Anna and the Swallow Man: a stunning, literary, and wholly original debut novel set in Poland during the Second World War, perfect for readers of The Book Thief.\n\nAbout the book: Kraków, 1939. A million marching soldiers and a thousand barking dogs. This is no place to grow up. Anna Łania is just seven years old when the Germans take her father, a linguistics professor, during their purge of intellectuals in Poland. She’s alone. And then Anna meets the Swallow Man. He is a mystery, strange and tall, a skilled deceiver with more than a little magic up his sleeve. And when the soldiers in the streets look at him, they see what he wants them to see. The Swallow Man is not Anna’s father—she knows that very well—but she also knows that, like her father, he’s in danger of being taken, and like her father, he has a gift for languages: Polish, Russian, German, Yiddish, even Bird. When he summons a bright, beautiful swallow down to his hand to stop her from crying, Anna is entranced. She follows him into the wilderness. Over the course of their travels together, Anna and the Swallow Man will dodge bombs, tame soldiers, and even, despite their better judgment, make a friend. But in a world gone mad, everything can prove dangerous. Even the Swallow Man. Destined to become a classic, Gavriel Savit’s stunning debut reveals life’s hardest lessons while celebrating its miraculous possibilities.\n\nAbout the author: Gavriel Savit holds a BFA in musical theater from the University of Michigan in Ann Arbor, where he grew up. As an actor and singer, Gavriel has performed on three continents, from New York to Brussels to Tokyo. He lives in Brooklyn. This is his first novel.", "url": "https://www.facebook.com/events/1676004656021554/", "source": "Facebook", "name": "Gavriel Savit", "date": "2016-02-17T19:00:00-05:00"}, {"description": "Carson’s American Bistro\nPresents Valentine’s Week\nMonday, Feb. 8 – Sunday, Feb. 14\nFrom 4pm-Close \n \nValentine’s Prix-Fixe Dinner Menu \n$75 for two (tax/gratuity not included)\n \nAppetizer\nSmoked Salmon Pate \nwith crostini\n \nSalad\nCarson’s Caprese Salad\navocado, basil, fresh mozzarella, tomato, layered and drizzled with dark balsamic reduction, extra virgin olive oil and black Hawaiian sea salt\n \nEntrée\nSurf and Turf\ntwo 4oz Canadian lobster tails, 12oz  house Prime rib, wild mushroom bread pudding, grilled asparagus\ntarragon butter and Jameson peppercorn demi-glace\n \nDessert\nRaspberry Crème Brule\ntopped with fresh berries \n\n#ValentinesDay #Special #FineDining", "url": "https://www.facebook.com/events/1705005099757077/", "source": "Facebook", "name": "Valentine's | Weekly Specials", "date": "2016-02-18T16:00:00-05:00"}, {"description": "Join us Thursday evenings, from February 11 through March 3, for the mesmerizing music, humor, and sentiment of the one and only Jacques Brel. Originally performed off-Broadway in 1968, this show has enjoyed continuing success, and was revived Off-Broadway in 2006, to considerable acclaim. We are performing it as a dinner theatre event in partnership with Conor O'Neill's Traditional Irish Pub and Restaurant. Thus, you can purchase dinner-and-a-show tickets for just $20 each (dinner seatings begin at 6pm), or show-only tickets for $10. Curtain at 7:30pm in Conor O'Neill's Celtic Room. Seating is limited, to get your tickets now!", "url": "https://www.facebook.com/events/171925729842741/", "source": "Facebook", "name": "Jacques Brel is Alive and Well and Living in Paris", "date": "2016-02-18T18:00:00-05:00"}, {"description": "Join curators John DeHoog and Ray Wetzel, with some of the artists of Zoku, to learn about their curatorial process and artworks from the exhibition. Free and open to the public.", "url": "https://www.facebook.com/events/553555484819957/", "source": "Facebook", "name": "Artist Talk - MW Furniture ZOKU", "date": "2016-02-18T18:00:00-05:00"}, {"description": "Out for Business at Ross presents: MBgAy. This year's annual charity drag show fundraiser will benefit the Jim Toy Community Center at Necto Nightclub on February 18.\n\nDoors open at 6:30 PM\nShow starts at 8:00 PM", "url": "https://www.facebook.com/events/172194293154008/", "source": "Facebook", "name": "Out For Business at Ross: MBgAy Charity Drag Show", "date": "2016-02-18T18:30:00-05:00"}, {"description": "It’s Media Mania Month at Nerd Nite Ann Arbor! We’re focusing in on the life after “the death of film\" by exploring the process behind and the art created with non-digital photography with historic camera expert Ross Orr. We’ll hear from Martin Thoburn, an interactive filmmaker who finds endless ways to expand his video-based art beyond the screen. Andy Ross might know more about microphones than any person to ever speak into ours - and he’ll be telling the story of the impact of mic amplification on modern music. Join us for a deep dive into audiovisual awareness, plus drinks, laughs, and a spin on a vintage 35MM Carousel projector.\n\nWhen: Thursday, February 18, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER! Courtesy of the Ann Arbor District Library!!\n\nRoss Orr – Are Film Cameras Dead, and Why Not?\n\n“Didn’t Kodak go bankrupt?” After the year 2000, sales of photographic film plunged by at least 95%. Yet there’s still a dedicated fringe who appreciate film’s tangible physicality and distinctive look. In a digital age, why are new converts dusting off decades-old, chunky, glass & metal cameras? For this talk we’ll bust out the 35mm Carousel projector and look at examples of why “slow photography” matters even today.\n\nAbout Ross: Starting with a bakelite Argus at age 8, Ross photographs Ann Arbor (and beyond) using cameras from every era. He bought his first copy of Photoshop in 1995, but celebrates his ongoing love for the photochemical image at silverbased.org and on Flickr. He has contributed numerous articles to MAKE: magazine, including the DIY panoramic pinhole camera chosen for The Best of Make: Vol. 1. He also helps coordinate the web’s largest camera encyclopedia, camera-wiki.org.\n\nMartin Thoburn - Beyond the Video Frame\n\nTake a walk beyond traditional filmmaking and into the world of interactive video art and video mapping.  Our journey will go behind the scenes on how this artist's projects were created from concept to execution. Discover more about the strange world of video beyond the rectangular screen.\n\nAbout Martin: Martin is a local animator and artist working in a variety of different media. He has produced and directed several short films, both animated and live action.  Determined not to be confined to any one medium, Martin continually explores photography, live video mixing, design, collage, animation and motion graphics.  Working with both modern and antique technologies sometimes in tandem, his work explores the uniqueness of the medium, technology, and/or tool. He is involved with YPSI24 and the Ann Arbor Film Festival and you can follow him on Twitter @duiceburger, or visit martin-thoburn.com.\n\nAndy Ross - Music and The Microphone\n\nThe invention of the microphone dramatically changed popular music, and allowed for the development of a more personal, intimate and emotional style of singing. We’ll look at, and listen to, this development.\n\nAbout Andy: Andy is a web and graphic designer, and a widely exhibited artist here in Ann Arbor. He’s also a dedicated amateur musician and singer, and he has taught courses in popular culture and its impact. Find more about him at http://andyrossdesign.com or follow him on Twitter @andyrossdesign.", "url": "https://www.facebook.com/events/967872506583558/", "source": "Facebook", "name": "Film Photography, Interactive Video, and the Magic of Microphones", "date": "2016-02-18T19:00:00-05:00"}, {"description": "Want to learn more about what's going on at Maker Works?\n\nJoin us for our Monthly Member Meeting, led by Maker Works co-founders Tom Root and Dale Grover. In it, they'll cover:\n\nMaker Works Business Scoreboard and Profit & Loss\nMembership Options\nAnnouncements & Upcoming Changes\n\nIf you are or have ever been a member, we would love to see you there! Stop by the shop to stay up to date on Maker Works news.", "url": "https://www.facebook.com/events/1715102698774561/", "source": "Facebook", "name": "February Member Meeting", "date": "2016-02-18T19:00:00-05:00"}, {"description": "Join us for Fix-It Friday, where members of our community bring in their damaged or broken items and fixers examine and try to repair them.\n\nIf you enjoy taking things apart and tinkering, you may enjoy volunteering at Fix-It Friday. And we could really use your help!\n\nStop by the shop between 4pm and 6pm the third Friday of any month, and experience the array of unique items that come through our doors. As a volunteer, you'll get to talk with folks about what they've brought, identify what the issues are, and, if possible, implement creative solutions. \n\nNo sign up needed; just come on in and let a staff member know you're here to help.", "url": "https://www.facebook.com/events/904912706288665/", "source": "Facebook", "name": "February Fix-It Friday", "date": "2016-02-19T16:00:00-05:00"}, {"description": "Don't miss Artini 2016*, which in its 8th edition will once again transform the Downtown Ann Arbor area into a festive competition between the finest bars and restaurants, where the goal is to design the city's most artful martini!\n\nArtini will be on Friday, February 19, from 7:00 to 10:00 pm. Tickets will be for sale on Monday, January 4th for members of the Ann Arbor Art Center and on Wednesday, January 6th for all! As usual tickets will be sold fast, so please make sure you purchase yours as soon as possible.\n\nWHAT IS ARTINI?\n\nArtini is an annual fundraiser hosted by the Ann Arbor Art Center in which local bars and restaurants are invited to compete to create the most artful and innovative martini cocktail. Guests purchase tickets to participate in a fun bar crawl amongst the participating venues and spend the evening walking in Downtown Ann Arbor for the search of the best tasting martini.\n\nPARTICIPATING ARTINI 2016 VENUES INCLUDE:\n\n- Aventura Ann Arbor\n- Babs' Underground Lounge\n- Mélange\n- The Ravens Club\n- Vinology Wine Bar and Restaurant\n- Felix Bistro & Bar\n- Conor O'Neills Ann Arbor\n... and more to come! \n\nThe 2016 winner will be selected by a jury of individuals unaffiliated with our participating venues. These judges include Andy Mohr (Two James, sponsor), Alex Milshteyn (Real Estate Associates, sponsor), Yen Azzaro (of studio Chin-Azzaro), Horace Bomar (long-time Art Center supporter), Jessica Webster (MLive, food critic), and Jorge Avellan (WEMU, reporter).\n\n*Attendees must be 21 or older. Ticket prices are $55.\n\n--------------\n\nArtini 2016 is sponsored by Alex Milshteyn Real Estate Associates\nBeverage sponsor Two James Spirits", "url": "https://www.facebook.com/events/1579264365729837/", "source": "Facebook", "name": "Artini 2016", "date": "2016-02-19T19:00:00-05:00"}, {"description": "Friday, February 19, 2016, 8:00 pm\nMichigan Theater\n\nA decade after it was first brought to the screen, Benoît Charest revives the music of the Oscar-nominated film The Triplets of Belleville with a remarkable cast of musicians in this silent movie-live concert event. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His near-sighted grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas.\n\nBut the true star of the animated film is the hot jazz score written by Canadian composer Benoît Charest. This screening of the beloved French film transports audiences to the exciting streets of 1920s Paris and Le Jazz Hot.\n\nMore info: http://ums.org/performance/the-triplets-of-belleville/", "url": "https://www.facebook.com/events/1620380161539059/", "source": "Facebook", "name": "The Triplets of Belleville", "date": "2016-02-19T20:00:00-05:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Katie & Janelle\" starring Katie McGraw and Janelle Soulliere\n\t\nGroup 2: \"Drop the Fist\" starring Jacob Russell, Jeffrey Smyk, Jaclynn Cherry, Tim Lally, Lorin Kozlowski, Josh Hamilton, and Andi Maziarz\t\n\nGroup 3: \"The League of Pointless Improvisers\" starring Jacob Russell, James Quesada, Jason Valentini, Julia Schroeder, and Matthew Flickinger", "url": "https://www.facebook.com/events/1548729632106704/", "source": "Facebook", "name": "Pointless Improv with Katie & Janelle and Drop the Fist", "date": "2016-02-19T20:00:00-05:00"}, {"description": "On Friday February 19th, join Kevin Michael for the start of Festival Fridays. \n\nHouse | EDM | Trap | Twerk | Electro\nmusic by KEVIN MICHAEL\nopening set by DJ Madisi\n\nKevin Michael, aka Kevin Kerber aka The Dangling Participle has been started from the bottom and now he’s here. From rocking stages to rocking chairs, Kevin Michael has always been a bastion of excellence in music, arts, culture, and oxford commas. His frenetic, open-format style of mixing has been described as, “pop-meets-electro-meets-slow-cooker.” This Ann Arbor based DJ is in it to win it. On his off time, Kevin Michael can be found lifting weights, eating mammies, not reading directions, and sardonically pontificating on miscellaneous etcetera. If you’re looking for the same old DJ, swipe left.", "url": "https://www.facebook.com/events/1679133699011682/", "source": "Facebook", "name": "Festival Friday", "date": "2016-02-19T22:00:00-05:00"}, {"description": "Tell your friends! Tell your family! Tell your dog! (But don't bring your dog!) It's the Second Annual Wolverine State Ski & Snowboard trip! \n\nThe rundown: Meet at the brewery (2019 W. Stadium, Ann Arbor, MI) at 7:30 am on Saturday, February 20th for bagels and to grab the 2016 edition of the Ski & Snowboard Club shirt! Bus departs from the brewery at 8 am and arrives at Alpine Valley around 9 am. You'll receive your lift ticket as you exit the bus, and if you're renting equipment, you'll also receive a rental slip (separate payment for equipment rental is required, but you get a group discount for coming with the brewery!) Meet back at the bus between 5 and 5:30, bus departs after final head count at 5:45 pm. \n\nTrip cost: $65 (includes bagels at the brewery, transportation to and from Alpine Valley, an all-day 9am - 5:30 pm lift ticket, a commemorative t-shirt, and beer on the bus to and from Alpine Valley. There will be room on the bus to store your equipment! \n\nEquipment rental: $21 for skis or snowboard. \n\nPlease use the eventbrite link to register! Remember to select your t-shirt size and indicate whether or not you will require rentals! You will have the option to pay for rentals on the eventbrite page. \n\nSeating is limited to 50 participants, so get on it!", "url": "https://www.facebook.com/events/189689224712860/", "source": "Facebook", "name": "Wolverine State Ski & Snowboard Trip", "date": "2016-02-20T07:30:00-05:00"}, {"description": "From Wednesday to Wednesday, alllll of our bulk chocolates are  25% off. Chocolate is the question- who cares what the question is?", "url": "https://www.facebook.com/events/539810849520988/", "source": "Facebook", "name": "25% Off Bulk Chocolates", "date": "2016-02-20T08:15:00-05:00"}, {"description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "url": "https://www.facebook.com/events/246675595664469/", "source": "Facebook", "name": "Little Peeps PlayGround - \"Seasons\"", "date": "2016-02-20T10:30:00-05:00"}, {"description": "February 20\nHill Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "url": "https://www.facebook.com/events/1611931089050428/", "source": "Facebook", "name": "Sir András Schiff, piano", "date": "2016-02-20T20:00:00-05:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Demon Death Stab\" starring Julia Schroeder, James Quesada, Travis Pelto, Steve Vagts, Andy Reid, Anna Imesch, Aaron Mondry, and Nuverre Naami. With a very serious approach to very ridiculous things, the mission of Demon Death Stab is to say everything with a straight face.\n\nGroup 2: \"Koala Yummies\" starring Jacob Russell and Emily Engelhart\n\nGroup 3: \"The League of Pointless Improvisers\" starring Chris Moody, Erik Heilner, Matt Swartz, Matthew Flickinger, and Moni Jones", "url": "https://www.facebook.com/events/1774907699410690/", "source": "Facebook", "name": "Pointless Improv with Demon Death Stab and Koala Yummies", "date": "2016-02-20T20:00:00-05:00"}, {"description": "Sat. February 20 | 9:30pm | 18+ | $10 Cover\n\nTunde Olaniran with:  Bevlove / Pocket Candies / VNESSWOLFCHILD \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/624", "url": "https://www.facebook.com/events/562101443944037/", "source": "Facebook", "name": "Tunde Olaniran w/ Bevlove,  Pocket Candies & VNESSWOLFCHILD 2/20/16 @ Blind Pig - Ann Arbor", "date": "2016-02-20T21:30:00-05:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Koala Yummies\" starring Jacob Russell and Emily Engelhart\n\nGroup 2: \"Demon Death Stab\" starring Julia Schroeder, James Quesada, Travis Pelto, Steve Vagts, Andy Reid, Anna Imesch, Aaron Mondry, and Nuverre Naami. With a very serious approach to very ridiculous things, the mission of Demon Death Stab is to say everything with a straight face.\n\nGroup 3: \"The League of Pointless Improvisers\" starring Chris Moody, Erik Heilner, Matt Swartz, Matthew Flickinger, and Moni Jones", "url": "https://www.facebook.com/events/1057764714243593/", "source": "Facebook", "name": "Pointless Improv with Koala Yummies and Demon Death Stab", "date": "2016-02-20T22:00:00-05:00"}, {"description": "After Groundhog announces six more weeks of winter, half his animal friends are disappointed, while the other half are excited. Each animal asks Groundhog to make his prediction in their favor the following year. Rather than being truthful about the fact that he just “calls it like he sees it,” he leads them to believe he can control the weather, accepting their gifts of food and favor. On the next Groundhog Day, he finally admits he made promises he couldn’t keep because he was trying to please everyone and makes amends.\n\nKristen Remenar is a children's librarian, writer, teacher, and national speaker on literacy. She is married to author/illustrator Matt Faulkner. This is her first picture book.\n\nA graduate of Rhode Island School of Design, Matt Faulkner has written and illustrated a number of children's books. His work has won wide praise for its humor, exuberance and sensitivity. In addition, he is a contributing illustrator to such national periodicals as The New York Times, The Wall Street Journal and Forbes. Matt is married to author and children's librarian, Kristen Remenar. They live with their 3 kids and 3 cats on the lower right corner of the Michigan mitten. He teaches illustration at the Art Academy University in San Francisco", "url": "https://www.facebook.com/events/1285645741460846/", "source": "Facebook", "name": "Meet Author Kristen Remenar & Illustrator Matt Faulkner for a Discussion & Signing of Their New Picture Book, 'Groundhog's Dilemma'", "date": "2016-02-21T15:00:00-05:00"}, {"description": "Strayaway Child Concert Series presents: Ensoliel-  In Concert! The Ann Arbor born band stops by their hometown for an afternoon of traditional music from Ireland, Scotland, and a few stops in between! \n\nAt The Celtic Room at Conor O'Neill's\nTickets: $15 General, $12 Students, Kids under 10 free\nDoors: 4:30pm\nShow: 5:00\n\nFood and drink available to order during show.\n\nStick around for the regular weekly traditional Irish music session next door in the pub at 7:30 after the show!\n\n\nHailing from the Western Highlands of Connecticut, the east coast of Scotland, the Appalachians and Los Angeles, and meeting in the middle, Ann Arbor-born Ensoleil forms a truly diverse quartet. Combining our traditional and contemporary Irish, Scottish, Québecois, and New England influences with original tunes and songs, Ensoleil brings excitement to dances, festivals, and farmer’s markets abound.\n\nWe are Nadine Dyskant-Miller (flute and feet), Christine Hedden (fiddles), Tanner Porter (cello and voice) and Annika Socolofsky (fiddle, mandolins, and voice). We are all composers, students and graduates of the music composition department at the University of Michigan’s School of Music, Theatre and Dance. As artists working and writing in the new music scene, we share an affinity for exploring sounds beyond traditional music’s normal aesthetic. While firmly grounded in tradition and cultural context, we also believe that traditions evolve and shape themselves to the present. And while our collaboration as Ensoleil is suffused with this creative energy, it is also driven by our love of the sounds and stories of traditional music, and the multiple lenses our diverse roots offer in approaching tradition.\n\nIn Ann Arbor, Ensoleil’s charismatic energy has drawn in a wide range of music goers, ranging from Farmer’s Market spectators and traditional music lovers, to classical musicians and new music fans.", "url": "https://www.facebook.com/events/590199001133654/", "source": "Facebook", "name": "Ensoleil- In Concert", "date": "2016-02-21T17:00:00-05:00"}, {"description": "tl;dr: \nEspresso Royale on State St.\n7pm [sign-ups open at 6:30; list fills up, come early]\nbi-weekly on 1st and 3rd Sundays\n\nJamie Morgan will be the first official Women of the World Poetry Slam representative Ann Arbor has sent since the tournament began in 2008. Join us at this special feature/fundraiser to fund her travels to compete as your Ann Arbor representative this March in Brooklyn, New York! Her voice is necessary; let's make sure she has our support. \n\nJoin us at Espresso Royale at our normal 7pm start time, Sunday February 21st, in our third-to-last points qualifying slam of the season. That's right, Feb 21, March 5, and March 19, are the final points slams of the season. After that, there will be only one way to win a place in the City Finals, to earn a spot on this year's National Poetry Slam team going to Atlanta, Georgia this Summer. \n\nBring friends and join us in one of the most intimate and longest-running poetry slams in the nation. \n\nWe meet every week, but only put on a show 1st and 3rd Sundays in our new home at Espresso Royale on State St, and at our new time of 7pm!\n\nThis is an ancient, yet fresh experience: you, a stage, and everything you need to say for an audience who is ready to hear it. Bring yourself, bring your story, and we'll bring the love.\n\n$5 Suggested Donation\n\nMORE ABOUT THE FEATURE:\n\nJamie Morgan is an award winning youth poetry slam coach, collegiate forensics competitor, and was a member of the 2014 Ann Arbor Poetry Slam Team. Jamie's work has appeared on Button Poetry and at slams across the US. As a romantic, goof-ball, and uncompromising advocate for justice, Jamie's work intertwines experience from teaching, mentoring, coaching, loss, love, and engaging life. She find the laughter in you, show you its teeth and its tail, and hand it back to you smoother and better than you imagined it.    \n\nMORE ABOUT THE EVENT:\n\nSign-up to perform at 6:30; the list fills up, so get there early to guarantee a spot. The Open Mic starts at 7pm, and the Slam starts whenever the open session ends. \n\nA maximum of 10 poets compete each week [spots are guaranteed for the first 8 slammers to arrive], the final two have to work for it. All poets who get into the Slam earn points qualifying toward the City Finals in April, and a chance to be one of four poets to represent Ann Arbor at the National Poetry Slam in August 2016, in Atlanta, Georgia. Poems must be the performer's original work. Come prepared with two poems [one if you're just doing the open mic], and keep it around three minutes or less. No costumes or props are allowed (unless otherwise specifically stated for themed events). See you soon!", "url": "https://www.facebook.com/events/840547559424320/", "source": "Facebook", "name": "A2Poetry Open Mic & Qualifier Slam (12 of 14) featuring WOWPS Rep Jamie Morgan", "date": "2016-02-21T18:30:00-05:00"}, {"description": "Auditons for A2CT's production of Neil Simon's classic romantic comedy, Barefoot in the Park, directed by Wendy Wright, are scheduled for Sunday, February 21 and Monday, February 22 at 7:00 in the A2CT Studio. Callbacks will take place Wednesday, February 24. There are roles for 2-3 women and 3-4 men.  Character descriptions and further audition details are available at: www.a2ct.org/audition", "url": "https://www.facebook.com/events/954841887943781/", "source": "Facebook", "name": "AUDITIONS: Barefoot in the Park", "date": "2016-02-21T19:00:00-05:00"}, {"description": "Join us to play short-form and long-form improv games! All experience levels welcome. Come to watch or to play. It's free!", "url": "https://www.facebook.com/events/1085875258123461/", "source": "Facebook", "name": "The Arcade - A Pointless Improv Jam", "date": "2016-02-21T19:00:00-05:00"}, {"description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "url": "https://www.facebook.com/events/1521814471451960/", "source": "Facebook", "name": "Story Time with Ieva", "date": "2016-02-23T10:00:00-05:00"}, {"description": "Carson’s American Bistro\nPresents Valentine’s Week\nMonday, Feb. 8 – Sunday, Feb. 14\nFrom 4pm-Close \n \nValentine’s Prix-Fixe Dinner Menu \n$75 for two (tax/gratuity not included)\n \nAppetizer\nSmoked Salmon Pate \nwith crostini\n \nSalad\nCarson’s Caprese Salad\navocado, basil, fresh mozzarella, tomato, layered and drizzled with dark balsamic reduction, extra virgin olive oil and black Hawaiian sea salt\n \nEntrée\nSurf and Turf\ntwo 4oz Canadian lobster tails, 12oz  house Prime rib, wild mushroom bread pudding, grilled asparagus\ntarragon butter and Jameson peppercorn demi-glace\n \nDessert\nRaspberry Crème Brule\ntopped with fresh berries \n\n#ValentinesDay #Special #FineDining", "url": "https://www.facebook.com/events/1705005099757077/", "source": "Facebook", "name": "Valentine's | Weekly Specials", "date": "2016-02-23T16:00:00-05:00"}, {"description": "Discussion of this Year's Reads Book - \"The Book of Unknown Americans\"  Cristina Henriquez will be signing at the end of her presentation.  Books will be sold the night of the event by Nicola's Books.\n\nWriter Cristina Henriquez will discuss her work at a special appearance for the Ann Arbor / Ypsilanti Reads 2016. The public program will occur from 7:00 to 9:00 pm. Doors will open at 6 pm to offer the opportunity to connect with community agencies and representatives who will be staffing information tables in the lobby. Copies of \"The Book of Unknown Americans\" will be for sale and the event will include a book signing.\n\nTowsley Auditorium\nMorris Lawrence Building, Washtenaw Community College\n4800 E. Huron River Drive\nAnn Arbor, MI 48105\n\nAuthor: \n\nCristina Henríquez is also the author of the story collection Come Together, Fall Apart, which was a New York Times Editors’ Choice selection, and the novel The World in Half. Her work has appeared in The New Yorker, The Atlantic, The American Scholar, Glimmer Train, Virginia Quarterly Review, Ploughshares, TriQuarterly, AGNI, and Oxford American, as well as in various anthologies.\n\nBook: \n\nThe Book Of Unknown Americans centers on fifteen-year-old Maribel Rivera, who sustains a terrible injury. Her family leaves behind a comfortable life in Mexico and risks everything to come to the United States so that Maribel can have the care she needs. Once they arrive, it’s not long before Maribel attracts the attention of Mayor Toro, the son of one of their new neighbors, who sees a kindred spirit in this beautiful, damaged outsider. Their love story sets in motion events that will have profound repercussions for everyone involved.\n\nHenríquez seamlessly interweaves the story of these star-crossed lovers, and of the Rivera and Toro families, with the testimonials of men and women who have come to the United States from all over Latin America.", "url": "https://www.facebook.com/events/526138584222040/", "source": "Facebook", "name": "Ann Arbor/Ypsilanti Reads - Meet Author Cristina Henriquez for a Discussion & Signing", "date": "2016-02-23T19:00:00-05:00"}, {"description": "Our February Artists' Meet & Greet topic is Tax Tips for Artists. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/1548888185425127/", "source": "Facebook", "name": "Tax Tips for Artists", "date": "2016-02-24T18:00:00-05:00"}, {"description": "Wed. February 24 | 18+ | 9pm | $15 / $65 VIP Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\nWSG: Dan Henig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/567", "url": "https://www.facebook.com/events/1725536331010947/", "source": "Facebook", "name": "Aaron Carter 2/24/16 @ Blind Pig - Ann Arbor", "date": "2016-02-24T21:00:00-05:00"}, {"description": "From Wednesday to Wednesday, alllll of our bulk chocolates are  25% off. Chocolate is the question- who cares what the question is?", "url": "https://www.facebook.com/events/539810849520988/", "source": "Facebook", "name": "25% Off Bulk Chocolates", "date": "2016-02-25T08:15:00-05:00"}, {"description": "The University of Michigan's MiSciWriters, Rackham Graduate School and Literati Bookstore invite you to a unique opportunity to hear a panel of scientists discuss “Contributing to Science through Writing.\" Panelists will include Nick Wigginton, Senior Editor at Science Magazine; Liz Wason, Science Writer for the College of Literature, Science and the Arts at U-Michigan; Theresa Cesena, Manager of Medical Writing at MMS Holdings Inc., and Larissa Sano, Science Writing Specialist at Sweetland Writing Center, U-Michigan.\n\nJoin us as our panelists explore and discuss how they apply their scientific training in a variety of writing professions. With fields ranging from medical writing to translating science to a lay audience in the media, our panelists will discuss the significance of written communication in the scientific community and beyond. They will also share some of the joys and challenges they face staying current and committed to the practice of science in these roles.", "url": "https://www.facebook.com/events/1162953823739366/", "source": "Facebook", "name": "Contributing to Science Through Writing Panel", "date": "2016-02-25T19:00:00-05:00"}, {"description": "Nashville-based, independent artist, Ron Pope, has stood at a crossroads where so many musicians find themselves — at the intersection of record label and independence. In an ever-evolving industry filled with rejection and compromise, he has plotted a new course for his music to reach loyal listeners, taking the industry-road-less-traveled in exchange for the ultimate payback, a league of devoted fans the world over. WSG: Tuett - http://www.truettofficial.com/\n\nVIP tix available here: http://www.etix.com/ticket/p/4574033/ron-pope-vip-meet-greet-ann-arbor-blind-pig-the-blind-pig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/446", "url": "https://www.facebook.com/events/1449897481978519/", "source": "Facebook", "name": "Ron Pope & The Nighthawks w/ Truett 2/25/15 @ Blind Pig - Ann Arbor", "date": "2016-02-25T21:00:00-05:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Safe Word\" starring RJ Cach and Jessica Loria. A monoscene that explores one moment in the relationship of a couple, offering a window into the lives of these characters, as they navigate their relationship and learn truths about themselves and each other.\n\nGroup 2: \"Adultery\" starring Aaron Johnstone, Nuverre Naami, and Tom Novik\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Arthur Brannon, Corene Ford, Matt Swartz, and Mitch Socia", "url": "https://www.facebook.com/events/1728445240723307/", "source": "Facebook", "name": "Pointless Improv with Safe Word and Adultery", "date": "2016-02-26T20:00:00-05:00"}, {"description": "Second Show Added for Friday, February 26th!\n\nDoors 9pm | 18+ | $15 General Admission / $65 Admission + Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\n\n\nWSG: Dan Henig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/573", "url": "https://www.facebook.com/events/1615405452043601/", "source": "Facebook", "name": "Aaron Carter w/ Dan Henig - Night Two 2/26/15 @ Blind Pig - Ann Arbor", "date": "2016-02-26T21:00:00-05:00"}, {"description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "url": "https://www.facebook.com/events/816891221770086/", "source": "Facebook", "name": "Little Peeps PlayGround - \"Fantasy\"", "date": "2016-02-27T10:30:00-05:00"}, {"description": "The A2CT is once again hosting their Annual Chili Cookoff here at Wolverine State! For $20, enjoy 10 chili samples and three samples of Wolverine State brews! Or, if you just want chili, tickets are available for $10. This is the A2CT's biggest fundraiser of the year, so come out and help support this great organization! For tickets, please call 734-971-2228. Tickets will also be available at the door! \n\nSunday, February 28th\n2-5 pm", "url": "https://www.facebook.com/events/1526104744359441/", "source": "Facebook", "name": "Ann Arbor Civic Theatre Annual Chili Cookoff", "date": "2016-02-28T14:00:00-05:00"}, {"description": "Chili, Beer, a 50/50 Raffle and a Silent Auction! \nAnn Arbor Civic Theatre announces its Seventh Annual Chili Cook-Off/Beer Tasting on Sunday, February 28 from 2-5pm at The Wolverine State Brewing Company at 2019 West Stadium Blvd, A2, MI, 48103.  Tickets are $20 and include ten chili tastings and three beer samples. Chili-only tickets are $10, with $5 tickets for children ages 5-10.  Kids under 5 attend free of charge.  Tickets for the event are available in advance at the A2CT office (734) 971-2228, or at the door of the Chili Cook-off.  Additional information is available at www.a2ct.org.\n\nThis year's judges include John Fischer of Gratzi, Mark Grasso of Wolverine State Brewing, and Robbie Schulz of  The Last Word.\n\nContestants Include:\n\nJyoti Athanikar: The Great White Chili\n\nPat and Mike Bohn\n\nJoyce Casale\n\nMary Conley\n\nJacqueline Courteau and Team JT\n\nLynn D'Orio\n\nTJ Johnson: Pedestrian Chili\n\nDave Marton\n\nCindie Niemann\n\nWendy and Steve Raymond\n\nRob Roy: A True Texas Bowl o' Red\n\nWendy and Mike Sielaff: Greg's Best Chili", "url": "https://www.facebook.com/events/1124616054245547/", "source": "Facebook", "name": "A2CT's 7th Annual Chili Cook-Off!", "date": "2016-02-28T14:00:00-05:00"}, {"description": "Vic Amato's sixteen tales in his Incoming: Collected Stories are literary explorations of the corridors of the human psyche, some familiar, some dark, all incorporating empathetic portraits of people, including married couples, young men on the cusp of adulthood, and even a sympathetic examination of the quirky among us.\n\nNearly every piece is set in the modern age; the one exception is \"Everyone Hates Malvolio,\" a sardonic takeoff on Twelfth Night.\n\nVic Amato holds a PhD in political science/public administration from Wayne State University, Detroit. He is a former journalist, mental health services administrator, and college instructor, and he served with the Third Infantry Division. He and his wife, Susan, live in Port Huron, Michigan.", "url": "https://www.facebook.com/events/152137558488266/", "source": "Facebook", "name": "Meet Michigan Author Vic Amato for a Discussion and Signing of His New Collection of Short Stories, 'Incoming: Collected Stories'", "date": "2016-02-28T15:00:00-05:00"}, {"description": "The Cabaret Dinner will feature an amazing array of recent U-M graduates singing selections from Broadway throughout dinner. Leonard Navarro, U-M Musical Theatre class of 2010, will be your host. These incredible performers are not to be missed!\n\nAll proceeds from this dinner support the UMS Education & Community Engagement Program that offers free or low-cost activities for over 20,000 K-12 students, teachers, teens, university students, families, and adults each session.\n\n$150 per person ($80 is tax-deductible)\nOrder tickets online - http://tickets.ums.org/auxiliary/Reserve.aspx?p=2842\n\nSpace is limited – reserve yours soon. Order by Tuesday, February 23rd.\n\nContact Esther Barrett at 734.764.8489 or embarret@umich.edu with questions.", "url": "https://www.facebook.com/events/1510702755897848/", "source": "Facebook", "name": "UMS Cabaret Dinner", "date": "2016-02-28T18:00:00-05:00"}, {"description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/1089084841133148/", "source": "Facebook", "name": "Open Stage", "date": "2016-02-28T19:00:00-05:00"}, {"description": "Carson’s American Bistro\nPresents Valentine’s Week\nMonday, Feb. 8 – Sunday, Feb. 14\nFrom 4pm-Close \n \nValentine’s Prix-Fixe Dinner Menu \n$75 for two (tax/gratuity not included)\n \nAppetizer\nSmoked Salmon Pate \nwith crostini\n \nSalad\nCarson’s Caprese Salad\navocado, basil, fresh mozzarella, tomato, layered and drizzled with dark balsamic reduction, extra virgin olive oil and black Hawaiian sea salt\n \nEntrée\nSurf and Turf\ntwo 4oz Canadian lobster tails, 12oz  house Prime rib, wild mushroom bread pudding, grilled asparagus\ntarragon butter and Jameson peppercorn demi-glace\n \nDessert\nRaspberry Crème Brule\ntopped with fresh berries \n\n#ValentinesDay #Special #FineDining", "url": "https://www.facebook.com/events/1705005099757077/", "source": "Facebook", "name": "Valentine's | Weekly Specials", "date": "2016-02-29T16:00:00-05:00"}, {"description": "From Wednesday to Wednesday, alllll of our bulk chocolates are  25% off. Chocolate is the question- who cares what the question is?", "url": "https://www.facebook.com/events/539810849520988/", "source": "Facebook", "name": "25% Off Bulk Chocolates", "date": "2016-03-02T08:15:00-05:00"}, {"description": "What's better than beer and pizza? How about AWESOME beer and pizza? Join us for a beer dinner at Cantoro Italian Market and Trattoria for five pizzas paired with five Wolverine State brews! Tickets are just $50 for this limited-seating event! Call 734-420-1100 for tickets and information.", "url": "https://www.facebook.com/events/1683111571970300/", "source": "Facebook", "name": "Beer + Pizza Pairing with Cantoro Italian Market", "date": "2016-03-02T19:00:00-05:00"}, {"description": "Yes, THE Michael Johnson, singer of the smash hit singles, \"Bluer Than Blue,\" \"This Night Won't Last Forever,\" \"That's That,\" and other landmark songs. Michael started playing at age 13; studied classical guitar in Barcelona; in 1968 joined the Chad Mitchell Trio with John Denver, touring for a year; and in 1969 toured for a year with the company of \"Jacques Brel Is Alive And Well And Living In Paris.\" In addition to his pop radio hits of the 1970's and '80's, he racked up top singles on the country charts with \"Give Me Wings\" and \"The Moon Is Still Over Her Shoulder.\" Michael's recent recordings feature duet partners Nanci Griffith and Alison Krauss. His music shows a diversity, depth and heart that only come from years of dedication to a labor of love. His amazing guitar work, humor and showmanship will make for a very special evening. Bring a friend! Michael's latest CD is \"Moonlight Deja Vu.\"\nhttp://www.mjblue.com/", "url": "https://www.facebook.com/events/788876821235695/", "source": "Facebook", "name": "Michael Johnson at Green Wood Coffee House", "date": "2016-03-04T20:00:00-05:00"}, {"description": "Saturday, March 5, 2016, 8:00 pm\nHill Auditorium\n\nPaddy Malone and The Chieftains celebrated 50 years of performing in 2012, and their music remains as fresh and relevant as when they first began. Recognized for reinventing traditional Irish music on a contemporary and international scale, their ability to blend tradition with modern music has made them one of the most renowned and revered musical groups to this day. Back for their fifth UMS performance and their first in nearly a decade, “they seem ageless, and so does their Irish music. If common sense tells you they can’t go on forever, you wouldn’t know it from their electrifying performance.” (Boston Globe)\n\nMore info: http://ums.org/performance/the-chieftains/", "url": "https://www.facebook.com/events/1598997080377800/", "source": "Facebook", "name": "The Chieftains", "date": "2016-03-05T20:00:00-05:00"}, {"description": "Sat. March 5 | 9pm | $15 Cover | 18+\n\nElectric Six -  Mortality. It’s the primary reason we don’t live forever. If not for our mortality, the number of years each of us would have to roam this earth would be as infinite as the sands of time running through the earth itself. When extraterrestrials eventually make first contact with us within the next twenty years, the first glaringly obvious thing they will notice…is that we die. They will come to our planet with sinister intentions and they will immediately have the upper hand because we die…and they don’t. It’s a simple as that. And it’s all because of our mortality.\n\nWhile aliens (and the government!!!!!) will always be there to kill us, we have for generations used our cold dead hands to clutch onto whatever silver lining we could sew into the dark cloud of our everlasting mortality. Specifically, we tell ourselves that we can live forever, not in corporeal form, but through our creations of art…and our expressions of love.\n\nThusly, art and love are more important than ever, because they are now the conduits that preserve our life forces. If you don’t create art and you don’t love nobody…well then, you will be forgotten, rather quickly. No one wants to be forgotten rather quickly. No one more so…than Electric Six.\n\nElectric Six understands all this stuff as it prepares to unveil its eleventh studio album Bitch, Don’t Let Me Die!, which will be released on October 6 on Metropolis Records. The album is steeped in themes of mortality, death, discorporation and discoloration…all while it tries to convince you it is actually a work of art, a labour of love.\n\nFrom the pounding, driving opener, “Drone Strikes”, through the 1970s guitar anthem “Two Dollar Two”, Bitch, Don’t Let Me Die! reveals that Electric Six knows that it is going to die, but will not go out quietly. From there, the album moves through the pop goodness of “Kids Are Evil” and “A Variation of Elaine”, the prog-rock showmanship of “Slow Motion Man”, and even a tribute to Elvis Presley in his more rotund years with “Dime Dime Penny Dime”.\n\n“Big Red Arthur” is the anchor track of the album, as it emits a rock-opera bombast that is reminiscent of Radiohead sodomizing David Bowie in the center of his mind. It, like most of the songs on this record, is about death…but it’s kind of funny because it’s only about the death of a fake, out-of-shape drunk Santa Claus who is too fucking stupid to make it down the chimney correctly. In this case, we just end up laughing at death. And that’s uplifting.\n\nTo summarize, mortality is everywhere, and this fall, thanks to their new record Bitch, Don’t Let Me Die!, Electric Six will be everywhere too. Everybody gonna die someday, but with Electric Six’s new album, you no longer have to worry about any of it. Bitch, Don’t Let Me Die is Electric Six’s brand new record for 2015 and it is available on Metropolis Records on Oct. 2. You can come see Electric Six play in your town on the I Wanna Lick The Screen tour, starting in their home state of Michigan on Sept. 25.\n\nWSG: Parlour Tricks", "url": "https://www.facebook.com/events/998925893483957/", "source": "Facebook", "name": "Electric Six w/ Parlour Tricks 3/5/16 @ Blind Pig - Ann Arbor", "date": "2016-03-05T21:00:00-05:00"}, {"description": "One day at a time, discover colorful Motor City moments in history spanning more than three centuries. On November 5, 1851, Voice of the Fugitive published a letter in support of escaped slaves. On July 3, 1904, Monk Parry became the first monkey to drive a car, and on January 16, 1919, the Statler Hotel menu offered whale meat for dinner. The legendary Steve Yzerman was named captain of the Red Wings on October 7, 1986. Local historian Bill Loomis covers the big events and remarkable stories of life and culture from Detroit’s founding to its recent struggles and rebirth.\n\nBill Loomis is the author of Detroit’s Delectable Past (2012), Detroit Food (2014) and numerous articles on culinary and social history. His writing has been published in the Detroit News, Michigan History Magazine, New York Times, Hour Detroit and more. Mr. Loomis was born in Detroit and lived for a number of years in the North Rosedale Park neighborhood in the city. Mr. Loomis now lives in Ann Arbor with his wife and children.", "url": "https://www.facebook.com/events/1520482404946720/", "source": "Facebook", "name": "Meet Ann Arbor Author Bill Loomis for a Discussion & Signing of His New Book, 'On This Day in Detroit History'", "date": "2016-03-06T15:00:00-05:00"}, {"description": "Literati welcomes Clayton Eshleman in support of his latest collection, Clayton Eshleman: Essential Poetry 1960-2015.\n\nClayton Eshleman was born in Indianapolis, Indiana, June 1, 1935. He has a B.A. in Philosophy and an M.A.T. in English Literature from Indiana University. He has lived in Mexico, Japan, Taiwan, Korea, Peru, France, Czechoslovakia, and Hungary. He is presently Professor Emeritus, English Department, Eastern Michigan University. Since 1986 he has lived in Ypsilanti, Michigan with his wife Caryl who over the past forty years has been the primary reader and editor of his poetry and prose. His first collection of poetry, Mexico & North, was published in Kyoto, Japan in 1962.\n\nFrom 1968 to 2004, Black Sparrow Press brought out thirteen collection of his poetry. In 2006, Black Widow Press became his main publisher and with The Price of Experience (2012) has now brought out seven collections of his poetry, prose, and translations, including, in 2008, The Grindstone of Rapport / A Clayton Eshleman Reader. Wesleyan University Press has also published six of his books, including Juniper Fuse: Upper Paleolithic Imagination & the Construction of the Underworld (2003), the first study of Ice Age cave art by a poet. Three book length poems, An Anatomy of the Night, The Jointure, and Nested Dolls were published by BlazeVOX in 2011, 2012 and 2013. Eshleman has published sixteen collections of translations, including Watchfiends & Rack Screams by Antonin Artaud (Exact Change, 1995), The Complete Poetry of César Vallejo with a Foreword by Mario Vargas Llosa (University of California Press, 2007), and Aimé Césaire: The Collected Poetry (co-translated with Annette Smith, University of California Press, 1983). Recently Wesleyan University Press has brought out two more translations of Césaire: Solar Throat Slashed and The Original 1939 Notebook of a Return to the Native Land, both co-translated with A. James Arnold.\n\nEshleman also founded and edited two of the most innovative poetry journals of the later part of the 20th century: Caterpillar (20 issues, 1967-1973) and Sulfur (46 issues, 1981-2000). Doubleday-Anchor published A Caterpillar Anthology in 1971 and Wesleyan will publish a 700 page Sulfur Anthology in January of 2016.\n\nAmong his recognitions and awards are a Guggenheim Fellowship in Poetry, 1978; The National Book Award in Translation, 1979; two grants from the NEA, 1979, 1981; three grants from the NEH, 1980, 1981, 1988; two Landon Translation Prizes from the Academy of American Poets, 1981, 2008; 13 NEA grants for Sulfur magazine, 1983-1996; The Alfonse X. Sabio Award for Excellence in Translation, San Diego State University, 2002; a Rockefeller Study Center residency in Bellagio, Italy, 2004, and a Hemmingway Translation Grant in 2015.\n\nRecent publications include a translation of José Antonio Mazzotti’s Sakra Boccata with a Foreword by Raúl Zurita (Ugly Duckling, 2013). In 2014 Black Widow Press published Clayton Eshleman / The Whole Art, an anthology of essays on Eshleman’s work over the decades, edited by Stuart Kendall. In the fall of 2015, Black Widow brought out Clayton Eshleman / The Essential Poetry 1960-2015 and in 2017 Wesleyan will bring out a 900 page bilingual edition of The Complete Poetry of Aimé Césaire, co-translated with A. James Arnold    \n\nIn her Introduction to Eshleman’s Companion Spider (Wesleyan University Press, 2003), Adrienne Rich wrote: “As a poet and translator, Clayton Eshleman has gone more deeply into his art, its processes and demands, than any modern American poet since Robert Duncan and Muriel Rukeyser… Eshleman has written on the self-making and apprenticeship of the poet, and of the poet as translator, as no one else in North America in the later twentieth century.”  His poetry has been featured in both volumes (1994 and 2013) of the Norton Postmodern American Poetry.\n\nHis website is www.claytoneshleman.com.", "url": "https://www.facebook.com/events/1555169798127346/", "source": "Facebook", "name": "Clayton Eshleman", "date": "2016-03-07T19:00:00-05:00"}, {"description": "In 1944 Italian officer Captain Francesco Verdi is captured by Allied forces in North Africa and shipped to a POW camp in Michigan s Upper Peninsula, where the senior POW, the ruthless Kommandant Vogel, demands that all prisoners adhere to his Nazi dictates. His life threatened, Verdi escapes from the camp and meets up with an American woman, Chiara Frangiapani, who helps him elude capture as they flee to the Lower Peninsula. By 1956 they have become Frank and Claire Green, a young married couple building a new life in postwar Detroit. When INS agent James Giannopoulos tracks them down, Frank learns that Vogel is executing men like Frank for their wartime transgressions. As a series of brutal murders rivets Detroit, Frank is caught between American justice and Nazi vengeance. In \"Wolf s Mouth, \" the recollections of Francesco Verdi/Frank Green give voice to the hopes, fears, and hard choices of a survivor as he strives to escape the ghosts of history.\"\n\nJohn Smolens has published nine works of fiction, including Cold, Quarantine, and The Schoolmaster’s Daughter. He lives in Marquette, Michigan.", "url": "https://www.facebook.com/events/961213527303219/", "source": "Facebook", "name": "Meet Michigan Author John Smolens for a Discussion & Signing of His New Novel, 'Wolf's Mouth'", "date": "2016-03-08T19:00:00-05:00"}, {"description": "Tue. March 8 | 9pm | 18+ | $10 adv./ $12 day of\n\nNorthern California rapper, MC Lars, is set to release his 4th full-length studio album, the Zombie Dinosaur LP, at the end of this coming summer. He has returned home to the Bay Area after living in Los Angeles these past three years, and is self-producing his new album with help from friends in Berkeley and San Francisco. The Zombie Dinosaur LP revisits the satirical, funny, uptempo style of Lars’ 2004 debut album, the Laptop EP. It features guest appearances by Watsky, Kool Keith, and Less than Jake’s Roger Lima. Zombie Dinosaur tackles such topics as postfeminism, in a nod to Game of Thrones (“Dragon Blood”); disappointing reunion bands with very few of their original members (“Sublime with Rome is Not the Same thing as Sublime”); hipster parenting (“Hipster Mom”); and the current state of EDM (“Signing Dubstep”). The project was funded entirely by Lars’s third highly successful Kickstarter campaign, through which he raised over $42k to create and release Zombie Dinosaur under his own label, Horris Records. In the ten years that have followed his debut release, the Laptop EP, Lars has independently produced and released three other solo full-length albums, four EPs, and a number of mixtapes. He has collaborated with KRS-One, mentored and helped develop the career of fellow Stanford alum K.Flay (with whom he collaborated on the 2009 Single and Famous EP), opened for Nas and Snoop Dogg, and played multiple summers on the Vans Warped Tour. He has also headlined club shows across the US and in Canada, Japan, Australia, New Zealand, and Europe. Lars has spoken and presented at two different TEDx conferences, performed at Carnegie Hall with a live string section (at Scholastic’s 2012 Art and Writing Awards – where he debuted the video for his song, “Flow Like Poe,” which is the lead single on his 2012 Edgar Allan Poe EP). Lars has developed and grown Horris Records in this past decade, signing the label’s first artist, Weerd Science (the solo hip-hop project of Cohered & Cambria’s drummer, Josh Eppard). Lars has continued to produce music videos for himself and his friends, including a cameo credit on past musical collaborator “Weird Al” Yankovic’s 2014 “Lame Claim to Fame” (for which Lars was given a special shout out in the liner notes to Al’s Grammy Award winning album, Mandatory Fun). Having been labeled as one of the pioneers of the underground “nerdcore hip-hop” subgenre, Lars has recently expanded from the studio to the classroom. With visiting scholar/teacher residencies at USC, and in the UK, and across the US in Nantucket, Florida, California, Alaska, and Kansas, Lars has found joy in educating young people about “lit-hop,” a subject term he coined to highlight the connections between literature, classical poetry, and the cultural history of rap. Lars has continued to work closely with the American Foundation for Suicide Prevention, teaching workshops on preventing self-harm, and positive ways to use music as creative therapy for depression. He has also worked with the American Heart Association, promoting youth heart health. It’s been quite a decade. WSG: Mega Ran", "url": "https://www.facebook.com/events/1017884834929568/", "source": "Facebook", "name": "MC Lars w/ Mega Ran 3/8/16 @ Blind Pig - Ann Arbor", "date": "2016-03-08T21:00:00-05:00"}, {"description": "From Wednesday to Wednesday, alllll of our bulk chocolates are  25% off. Chocolate is the question- who cares what the question is?", "url": "https://www.facebook.com/events/539810849520988/", "source": "Facebook", "name": "25% Off Bulk Chocolates", "date": "2016-03-09T08:15:00-05:00"}, {"description": "Join us for the Opening Reception & Award announcement of NEVER NOT BROKEN on Friday March 11, 6-9 pm at the 117 Gallery.\n\nAn exhibition curated by Anna van Schaap \n\n[A call for entries is open. Artists are welcome to submit all mediums. Deadline: February 14, 2016. Learn more here: https://goo.gl/3rXum7]\n\nThe circumstances of life are such that at one point or another something will break us.  The loss of a life, a love, a job, a home, will shake our foundation and we will inevitably crumble.  We then consider ourselves defeated; disheartened and utterly broken. But there is power in the acknowledgment of brokenness.\n\nNever Not Broken is taken from the Hindu Goddess Akhilanda or the 'Always Broken Goddess'. \"Akhilanda derives her power from being broke: in flux, pulling herself apart, living in different selves [and states of being] at the same time, from never becoming a whole that has limitations.\" (*1)\n\n\"Fluid connections, the celebration of ambiguity and a sense of ritual in chaos... deeply invested in the notion of complexity, this work will explore the arena of [brokenness] as an entree to rapture.  Artists working in this mode push the deconstruction and dissolution of centre, definitions and boundaries to reach the sublime terror [and beauty] of placelessness [and brokenness]\" *(2)\n\nBrokenness is not indicative of weakness or inability, but rather can be a strong driving force towards creative output as a means of analysis, internalizing, and coping for many artists.  This show seeks work that was created from a state of, and acknowledges our, Never Not Brokenness.\n\n(*1) Excerpt from the online article Why Lying Broken in a Pile on Your Bedroom Floor is a Good Idea by Julie Peters, Elephant Journal\n\n(*2) Excerpt from the Essay Beneath the Remains by Shamin M. Momin, The Gothic: Documents of Contemporary Art\n\n- Never Not Broken March 11 to March 26 at the 117 Gallery - \n-------------------------------------------------------------------------------------\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC", "url": "https://www.facebook.com/events/788568644581287/", "source": "Facebook", "name": "Never Not Broken | Opening Reception", "date": "2016-03-11T18:00:00-05:00"}, {"description": "Sponsored by the University of Michigan Credit Union, Arts & Eats: Dig In with UMS is a $15 ticket package deal that includes a great seat at the performance, exclusive access to a pre-show dinner, and a fun activity to get you thinking about the performance in a whole new way. You can pick up your tickets for the show at the Arts & Eats event.\n\nMore info about Nufonia Must Fall: http://ums.org/multiperformance/nufonia-must-fall/\n\nMore about Dig Ins: http://ums.org/tickets/students/", "url": "https://www.facebook.com/events/447639965441046/", "source": "Facebook", "name": "Dig In: Nufonia Must Fall", "date": "2016-03-11T18:30:00-05:00"}, {"description": "March 11-12\nPower Center\n\n“You can’t help but leave with a fuzzy feeling inside.” (examiner.com) The globetrotting, Montreal-based scratch DJ and music producer Kid Koala presents a magical, multi-disciplinary and theatrical adaptation of his graphic novel and soundtrack, Nufonia Must Fall. This charming story centers around a headphones-sporting robot on the verge of obsolescence who falls in love with a lonely office girl. This live adaptation unfolds via real-time filming of more than a dozen miniature stages and a cast of puppets, while Kid Koala and the Aelos Quartet provide original live scoring on piano, strings, and turntables. The result? You’ll seem to be watching an animated picture, but simultaneously seeing puppets being filmed and projected in real time. Heartfelt, hand-made, and a very cool live experience. \n\nMore info: http://ums.org/performance/nufonia-must-fall/", "url": "https://www.facebook.com/events/488544131294497/", "source": "Facebook", "name": "Nufonia Must Fall", "date": "2016-03-11T20:00:00-05:00"}, {"description": "Two-time Grammy-winner Jim Lauderdale is a \"songwriter's songwriter\" who has written/co-written many modern classics for iconic artists, as well as an intuitive sideman, enhancing the music of a bevy of esteemed musicians. Throughout his three-decade career, Jim Lauderdale has helped pave the way for the current Americana movement, writing songs that cross genres from country, rock, folk, and bluegrass, to R & B and blues. As a solo artist he's created a body of work spanning 28 albums of imaginative roots music.  Along the way he's won awards, garnered critical acclaim, and earned himself an engaged fan base. Jim treats his fans to a new adventure, exploring the redemptive traditional sounds of Memphis and Nashville with his double album, \"Soul Searching: Vol. 1 Memphis/Vol. 2. Nashville.\"  www.jimlauderdale.com", "url": "https://www.facebook.com/events/1729037197315068/", "source": "Facebook", "name": "Jim Lauderdale", "date": "2016-03-11T20:00:00-05:00"}, {"description": "$18 adv./ $20 day of | 18+ | 9pm\n\nSimply put, Tortoise has spent nearly 25 years making music that defies description. While the Chicago-based instrumental quintet has nodded to dub, rock, jazz, electronica and minimalism throughout its revered and influential six-album discography, the resulting sounds have always been distinctly, even stubbornly, their own. \nWSG: Mind Over Mirrors\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/521", "url": "https://www.facebook.com/events/1622992504617740/", "source": "Facebook", "name": "Tortoise w/ Mind Over Mirrors 3/11/16 @ Blind Pig - Ann Arbor", "date": "2016-03-11T21:00:00-05:00"}, {"description": "A marvelous confection of friendship, invention, and adventure.\n\nYou can’t have lollipops for breakfast! But today, Sylvie decides she’s going to break that rule, even if it means she has to make her own amazingly perfect lollipop from scratch.  Come along as she and her trusty pet bird search for missing ingredients, wrestle with giant candy machines, and get lost in a magical pop-up cookbook.\n\nGuest artists The Gottabees bring this marvelous show all the way from Boston to the Pointless stage. \nFor ages 3 & up", "url": "https://www.facebook.com/events/485507254984473/", "source": "Facebook", "name": "Lollipops for Breakfast", "date": "2016-03-12T10:30:00-05:00"}, {"description": "A marvelous confection of friendship, invention, and adventure.\n\nYou can’t have lollipops for breakfast! But today, Sylvie decides she’s going to break that rule, even if it means she has to make her own amazingly perfect lollipop from scratch.  Come along as she and her trusty pet bird search for missing ingredients, wrestle with giant candy machines, and get lost in a magical pop-up cookbook.\n\nGuest artists The Gottabees bring this marvelous show all the way from Boston to the Pointless stage. \nFor ages 3 & up", "url": "https://www.facebook.com/events/1556437754671593/", "source": "Facebook", "name": "Lollipops for Breakfast", "date": "2016-03-12T13:00:00-05:00"}, {"description": "Sat. March 12 |  18+  |  Doors 9:00pm  |  $8 adv./ $10 day of \n\nDesmond Jones  is a five-piece funk/rock/jazz fusion band from Grand Rapids, Michigan. With original music written to compliment the group's sound as a whole, the music is centered around melodic guitar riffs, smooth bass lines, funky drum beats, and some saxophone.\n\nSince 2012 this unique group has played with groups like The Werks, Dopapod, Kung Fu, Jimkata, Tauk, The Verve Pipe, Badfish, Fareed Haque, Old Shoe and many more. The group takes influence from Frank Zappa, The Grateful Dead, Phish, Charles Mingus, The Band, to name a few.\n\nDesmond Jones puts on exciting and high energy shows and is proud to say that each set list and each song is different from show to show. \n\nWSG: Everyday Junior & Dave Menzo", "url": "https://www.facebook.com/events/100357510348543/", "source": "Facebook", "name": "Desmond Jones w/ Everyday Junior & Dave Menzo 3/12/16 @ Blind Pig - Ann Arbor", "date": "2016-03-12T21:00:00-05:00"}, {"description": "Sunday, March 13 | 8pm | 18+ | $16 adv. / $18 day of\n\nmc chris (always spelled in all lower case letters) is rapper from the Libertyville, Illinois, a suburb of Chicago. He was one of the first rappers to focus solely on nerd life, rapping about Star Wars, Harry Potter, ninjas and unrequited love, instead of the usual hip hop fare. He’s just as likely to make an appearance at Comicon as he is at SXSW. mc got his start as an animator on many of the shows you see on Adult Swim. He was writer, actor, songwriter and animator for Sealab 2021, The Brak Show, Space Ghost Coast to Coast and Aqua Teen Hunger Force. He has voiced characters on several Adult Swim pilots such as Welcome to Eltingville, Cheyenne Cinnamon, Your Pretty Face is Going to Hell and Tight Bros. He was also a producer of on air content for over a year before leaving Williams Street to pursue a career in music. mc has since crossed America countless times touring as a headlining act, as well as opening for bands like Pinback and Reggie and the Full Effect. He's collaborated with Talib Kweli, Andrew WK, Cee-Lo and Childish Gambino. His music has been featured in Kevin Smith’s Zak and Miri Make a Porno, Jay and Silent Bob’s Super Groovy Cartoon Movie and he has composed several themes for Smith’s Smodcast podcast network. mc's song \"hoodie ninja\" was featured in both a Honda commercial and America's Funniest Home Videos. Other songs have been featured in Comedy Central’s Broad City and Fox's So You Think You Can Dance? mc most recently started in the pilot Bunny and Frog for Disney and a national commercial for Fiat. mc raises money to fight Cystic Fibrosis. Inspired by his nephew who has CF, mc chris and his fans have raised over $150,000 for the Cystic Fibrosis Foundation through eBay sales and donations collected at live shows. mc kickstarted “the mc chris cartoon” an animated extension of the skit universe featured on his records. Thanks to donations from his fans, he raised $60,000 and produced a six minute pilot presentation with the animation company Titmouse Inc. mc is currently shopping the project.\n\nwith Hot Dad & Nathan Anderson", "url": "https://www.facebook.com/events/995090703894430/", "source": "Facebook", "name": "MC Chris w/ Nathan Anderson & Hot Dad 3/13/16 @ Blind Pig - Ann Arbor", "date": "2016-03-13T20:00:00-04:00"}, {"description": "Tuesday, March 15, 2016, 7:30 pm\nSt. Francis of Assisi\n\nFresh from their 2014 performance of Monteverdi’s Vespers, Apollo’s Fire & Singers returns to St. Francis of Assisi Church with one of their signature pieces, Bach’s St. John Passion. Bursting out of the gate from the agitated opening chorus, this work is considered Bach’s most dramatic and theatrical oratorio. In this acclaimed interpretation, the story’s action is highlighted by a dramatic approach: the roles are performed by true singing actors, staged on a special theatrical platform within the orchestra. The acclaimed Apollo’s Singers evoke the wild mob with fierce intensity. \n\nMore info: http://ums.org/performance/apollos-fire-st-john-passion/", "url": "https://www.facebook.com/events/971816919508035/", "source": "Facebook", "name": "Apollo’s Fire & Apollo’s Singers: Bach’s St. John Passion", "date": "2016-03-15T19:30:00-04:00"}, {"description": "Two young buckaroos wake up, sneak past the sheriff (Mom), and head outside, using Spanish words as they go. \"Andale! Hurry!\" they cry. They enjoy chases, lasso games and lots of dirt--but will the sheriff be able to round them up at the end of the day? Includes a glossary of Spanish words.", "url": "https://www.facebook.com/events/1027466247295861/", "source": "Facebook", "name": "Join Us for the Launch Party for Children's Author Shanda Trent's New Picture Book, 'Giddy-Up Buckaroos'", "date": "2016-03-16T19:00:00-04:00"}, {"description": "Carlene Carter, daughter of country music legends June Carter and Carl Smith, stepdaughter of Johnny Cash, and granddaughter of \"Mother\" Maybelle Carter of the original Carter Family, started her career in the late 1970s when she recorded her acclaimed debut album.  She co-wrote hit songs for Emmylou Harris and The Doobie Brothers, recorded a Top 40 pop duet, then \"came home to country\" in the 1990s with hits like, \"I Fell in Love,\" \"Come On Back,\" and, \"Every Little Thing.\" Carlene's latest release, \"Carter Girl,\" is a tribute to the timeless music of her historic family, that critics hail as \"a triumph,\" \"masterpiece,\" \"an album for the ages,\" and \"really quite perfect.\"  But while she is often referred to as \"country music royalty,\" she simply calls herself a Carter Girl. www.carlenecarter.net", "url": "https://www.facebook.com/events/1948490602041931/", "source": "Facebook", "name": "Carlene Carter at Green Wood Coffee House", "date": "2016-03-18T20:00:00-04:00"}, {"description": "Keep your St. Paddy's celebrations going strong all weekend with the Hair of the Dog Day-After St. Patrick's Day Party! Ghost City Searchlight will be in the house with their foot-stomping Celtic folk rock. More on the band here: http://ghostcitysearchlight.com/", "url": "https://www.facebook.com/events/483904475144432/", "source": "Facebook", "name": "The Hair of the Dog Party: Ghost City Searchlight!", "date": "2016-03-18T20:30:00-04:00"}, {"description": "A heart-pounding new Stevens and Windermere thriller from the award-winning author of \"The Stolen Ones \"and\" The Professionals.\" \n\nKirk Stevens and Carla Windermere of the joint BCA-FBI violent crime task force have handled shocking cases before, but this one is different. Stevens s daughter, Andrea, is distraught over a classmate s suicide, but what the two investigators find is even more disturbing an online suicide club of unhappy teenagers, presided over by an anonymous presence who seems to be spurring them on. Soon, it becomes apparent that the classmate wasn t the first victim and won t be the last, either, unless they can hunt down this psychopath once and for all.\n\nOwen Laukkanen was born in Vancouver. After graduating from university in 2006, he answered an ad on Craigslist for a summer job at the World Series of Poker in Las Vegas as a poker tournament reporter for a poker website. At the end of the summer, they offered him a full-time job. You wouldn t think you could make a living at this, but you would be wrong. For the next three years he traveled around the world, reporting from the most luxurious casinos of Monaco and Macau and Australia to the sketchiest card rooms of California and Atlantic City. In 2009, having seen his fill, Laukkanen quit to concentrate on fiction. He also spends summers as a deckhand on the boats of his father and his uncle, both commercial fishermen. He is at work on more novels. \n\nHis previous Stevens and Windermere novels are \"The Professionals,\" \"Criminal Enterprise,\" \"Kill Fee,\" and \"The Stolen Ones.\" \"The Professionals\" was nominated for the Barry Award and International Thriller Writers Award for best first novel, as well as the \"Spinetingler\" Award for Best Novel: New Voice. \"Criminal Enterprise\" was nominated for the ITW Award for best novel. Both books, as well as \"Kill Fee,\" appeared on several best-of-the-year lists.", "url": "https://www.facebook.com/events/1064114296941949/", "source": "Facebook", "name": "Meet Canadian Thriller Author Owen Laukkanen for a Discussion & Signing of His Latest Stevens & Windermere Novel, 'The Watcher in the Wall'", "date": "2016-03-19T15:00:00-04:00"}, {"description": "Saturday, March 19, 2016, 8:00 pm\nHill Auditorium\n\nThe Montreal Symphony returns to Ann Arbor for the first time since 1989, with American conductor Kent Nagano and pianist Daniil Trifonov both making their UMS debuts. “Hearing Trifonov is like having a deep-tissue massage: you keep wanting to pull away from the sheer intensity of it, and you come out feeling as if your reality had been slightly altered…a knockout.” (Washington Post) \n\nMore info: http://ums.org/performance/montreal-symphony-orchestra/", "url": "https://www.facebook.com/events/1582133688713673/", "source": "Facebook", "name": "Montreal Symphony", "date": "2016-03-19T20:00:00-04:00"}, {"description": "Hosted by the UMS Ambassadors to support the\nUMS Education & Community Engagement Program.\n\nCustom cocktails crafted by Phil Attee\nProduction tour by distiller Ari Sussman\nAppetizers by Grange Kitchen & Bar\n\n$75 per person ($35 is tax-deductible)\nContact Esther Barrett at 734.764.8489, or embarret@umich.edu.\nSpace is limited – reserve yours by March 16.\n\nSponsored by:\nZitatini * Ren and Susan Snyder * Freddi and Dan Kilburn \n      *** Sponsorship opportunities are still available.***", "url": "https://www.facebook.com/events/1702752326667535/", "source": "Facebook", "name": "A2 MIXOLOGY - \"A Still Life\"", "date": "2016-03-21T17:30:00-04:00"}, {"description": "Our March Artists' Meet & Greet topic is \"How to write an artist statement\". Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/968784676489949/", "source": "Facebook", "name": "How to Write an Artist Statement", "date": "2016-03-23T18:00:00-04:00"}, {"description": "Friday, March 25 | 9pm | 18+ | $16 Adv. / $18 Day of\n\nThen Came the Morning, the second album by the Southern-born, Brooklyn-based indie-folk trio the The Lone Bellow, opens with a crest of churchly piano, a patter of drums, and a fanfare of voices harmonizing like a sunrise. It’s a powerful introduction, enormous and overwhelming, as Zach Williams, Brian Elmquist, and Kanene Pipkin testify mightily to life’s great struggles and joys, heralding the morning that dispels the dark night: “Then came the morning! It was bright, like the light that you kept from your smile!” Working with producer Aaron Dessner of the National, the Lone Bellow has created a sound that mixes folk sincerity, gospel fervor, even heavy metal thunder, but the heart of the band is harmony: three voices united in a lone bellow.\n\n\"The feeling I get singing with Zach and Brian is completely natural and wholly electrifying,” says Kanene. “Our voices feel like they were made to sing together.\"\n\nLong before they combined their voices, the three members of the Lone Bellow were singing on their own. Brian had been writing and recording as a solo artist for more than a decade, with three albums under his own name. Kanene and her husband Jason were living in Beijing, China, hosting open mic nights, playing at local clubs and teaching music lessons. Zach began writing songs in the wake of a family tragedy: After his wife was thrown from a horse, he spent days in the hospital at her bedside, bracing for the worst news. The journal he kept during this period would eventually become his first batch of songs as a solo artist. Happily, his wife made a full recovery.\n\nWhen Kanene’s brother asked her and Zach to sing “O Happy Day” together at his wedding, they discovered their voices fit together beautifully, but starting a band together seemed impossible when they lived on opposite sides of the world. Brian soon relocated to New York and Kanene moved there to attend culinary school a couple years later. The three got together in their new hometown to work on a few songs of Zach’s, he’d been chipping away at the scene as a solo artist for awhile by then. After hitting those first harmonies did they decide to abandon all other pursuits. Soon the trio was playing all over the city, although they considered Rockwood Music Hall on the Lower East Side to be their home. They opened for the Civil Wars, Dwight Yokam, Brandi Carlile and the Avett Brothers, and their self-titled debut, produced by Nashville’s Charlie Peacock (the Civil Wars, Holly Williams) and released in January 2013, established them as one of the boldest new acts in the Americana movement.\n\nAfter two hard years of constant touring, the band was exhausted but excited. By 2014, they had written nearly 40 songs on the road and were eager to get them down on tape. After putting together a list of dream producers, they reached out to their first choice, the National guitarist Aaron Dessner, who has helmed albums by the L.A. indie-rock group Local Natives and New York singer-songwriter Sharon Van Etten.\n\n“It occurred to me that it would be fun to get together and make music with them,” says Aaron. “My main interest in producing records is community and friendship more than making money. I already do a lot of traveling and working with the National, so when I have to time to work with other artists, it should be fun and meaningful.”\n\n“Aaron is just so kind,” Zach says. “And he has surrounded himself with all these incredibly talented people, like Jonathan Low, the engineer. His brother Bryce [Dessner, also a guitarist for the National] wrote these amazing brass and string arrangements, and he got some of his friends to play with us.”\n\nDessner and the Lone Bellow spent two weeks recording at Dreamland in upstate New York, a nineteenth-century church that had been converted into a homey studio. The singers found the space to inspire the emotional gravity necessary for the material and the acoustics they were looking for. (For Kanene, Dreamland had one other bonus: “I’m a big Muppets fan, and it looks exactly like the church where Dr. Teeth and the Electric Mayhem lived.”)\n\nAaron set them up in a circle in what had once been the sanctuary, with microphones hanging in the rafters to capture the sound of their voices bleeding together. Most of the vocals were recorded in single takes, a tactic that adds urgency to songs like “Heaven Don’t Call Me Home” and “If You Don’t Love Me.” “There were a couple of times when somebody sang the wrong word or hit a bad note, and we just had to keep going,” says Zach, who says that recording “Marietta” in particular was daunting—especially the moment near the end when he hits an anguished high note, bends it even higher, and holds it for an impossibly long time. It’s a startling display of vocal range, but it’s also almost unbearably raw in its emotional honesty.\n\n“‘Marietta’ is probably the darkest song on the whole record,” Zach explains, “and it’s based on something that happened between my wife and me. The band was getting ready to record that song when all of a sudden my wife showed up with our youngest baby. It was a great surprise, a beautiful moment. So I was able to go out and sing that song, knowing she was there to help me carry the moment.”\n\n“These are true stories,” says Brian. “These aren’t things we made up. We tried to write some songs that had nothing to do with our personal stories, but we just didn’t respond to them. But we’re best buds, so we know each others’ personal stuff and trust each other to figure out what needs to be said and how to say it.” Case in point: Brian wrote “Call to War” about his own struggles during his twenties, but gave the song to Kanene to sing. “The content is painful and brutal,” she says, “but the imagery, the vocals, they build something delicate and ethereal. That kind of contrast illuminates the true beauty and power of a song.”\n\nSays Brian, “We do this one thing together, and we carry each other. Hopefully that makes the listener want to be a part of it. It becomes a communal thing, which means that there’s never a sad song to sing. It’s more a celebration of the light and the dark.”", "url": "https://www.facebook.com/events/1550469435268350/", "source": "Facebook", "name": "The Lone Bellow 3/25/16 at Blind Pig - Ann Arbor", "date": "2016-03-25T21:00:00-04:00"}, {"description": "Saturday, March 26, 2016, 8:00 pm\nHill Auditorium\n\nBach’s complete Sonatas and Partitas have long been a “Mount Everest” of the violin repertoire — music that performers return to throughout their lives. In this special event, Gil Shaham collaborates with video artist David Michalek to open up new avenues for listening to and interpreting Bach’s towering masterpieces.\n\nVideo artist David Michalek, best known for his “Slow Dancing” installation at Lincoln Center, and in the capitals of Europe, says of the Bach Six Solos project: “As a contemporary artist with a particular interest in motion pictures and time, I’ve been compelled to consider how the addition of extreme slow motion might be applied to moving images of the face, the body, obliquely narrative tableaux, and also still life in ways that can both enhance and alter the meanings latent within them. As a visual strategy, extreme slowness creates a continuing sense of a pause in the action — as if the growth and evolution of the slow-moving image is itself a further manifestation of the deep and consuming absorptive state that often arises while observing it.”\n\nMore info: http://ums.org/performance/gil-shaham/", "url": "https://www.facebook.com/events/1663165150570187/", "source": "Facebook", "name": "Bach Six Solos: Gil Shaham, violin", "date": "2016-03-26T20:00:00-04:00"}, {"description": "Sunday, March 27 | 18+  |  Doors 9:00pm  |  $12 adv./ $15 day of \n\nYoung Fathers are DEAD.\n\nOr, rather, DEAD is Young Fathers. Their first full-length album, released in February, 2014, on Anticon and Big Dada has been given the kind of critical appraisal normally held hidden in the filing cabinets of dusty music journos and only brought out, along with the bottle of fine blended whisky for those special occasions, those special rock occasions. You know the kind, when a credible bunch of guitar, bass and drum twenty-somethings from some northern town in the UK or from Indianapolis USA put something together in the studio that reaches out and reminds everyone that modern life isn’t rubbish. Which is a weird reaction for a group who sit in some non-categorisable space between genres ancient and modern, who take hiphop and pop and dip it in a tie-dye mix of Ronnettes and krautrock and ragga and dub and post-punk and afropsych… and make something, something, something.\n\nMany years before dropping DEAD the three individuals who became Young Fathers were apprentice young men. 14 years old, meeting in a sweaty dancing circle in the infamous original Bongo Club in Edinburgh, Scotland, UK. Moving to the in-your-face beats of early noughties hiphop, R&B and Dancehall and then at the end of the night, agreeing to meet at solemn faced would-be producer G’s house, to ‘make records’ on an ancient karaoke machine. The three of them, already looking like their future selves: Alloysious, city street holy man, sad eyes to the stars, past of the Liberian war atrocities buried in childhood scar tissue; Kayus, face exploding from frowns to huge laughter, pure naija boy on the outside but reflective and always feeling far away from his Nigerian home on the inside; and G, quietly watching and waiting for good things to come, practising the serious don’t fuck street face for the neds where he grew up, but nurturing a heart of soul.\n\nFrom the bedroom to the basement. It took them a few years before they found the small underground studio in Leith where they could perfect the uniqueness already nascent in the early days. Here they developed what they call, like the Sicilian mafia, ‘our thing’. Recording processes that involve ritual, musical techniques more usually found in bebop jazz, playing with ways to write lyrics and tunes, scouring the further reaches and always recoiling from cliché. But always, always staying true to the Rules of Pop which demand hooks, energy, sparkle, accessibility, passion and beats that vibrate below the waist. From this point came their first release, what was originally conceived as a mixtape, literally only available on individually recorded cassettes with hand printed sleeves: TAPE ONE was the moment, recorded in a week, ready to release in two.\n\nShortly thereafter, TAPE TWO was recorded and a deal with far-out Los Angeles hiphopping label, Anticon inked. TAPE TWO took the dirty mounds of its predecessor and moulded beautiful sand sculptures, sealed by the sea, with the same processes, the same inspiration, gone deeper, gone darker. A year after its release TAPE TWO wins the Scottish Album Of The Year Award (2014), an indication, perhaps, that people are really starting to get it. YFs are just happy more people are listening, even if that 20 grand prize money does come in handy for debts and mashed up gear. And a final, critical tick from the music business comes at the end of summer when the album is nominated for a Mercury award.\n\nDid I mention the live show? I don’t believe so… on an insane tour of the USA, UK and Europe, heading over to Australia, Japan, Russia and then back to Europe. A huge 27-date UK & European tour preceded standout performances at SXSW, with a 33-date US tour supporting Anticon’s Baths before playing a homecoming show at the Park Stage at Glastonbury. By the end of this year, YFs will have driven around the world one and a half times and flown it several times more. What happens? Each time they appear as a support, the headliner regrets and celebrates, because, if the headliner can’t hope to make the desired impact after the explosion of uber-watt energy that is a Young Fathers show, they can at least reflect and bask in the knowledge that they were partly responsible for something special happening.\n\nWhen they headline, they squeeze hours into 45 minutes and leave the audience exhausted from spectacle and bass, necks aching from craning, ears ringing and a delayed smile forming as they leave after pointless demands for more. (Of course, YFs never give more, because they have given all they have).\n\nSounds like hyperbole? Read the reviews… The Guardian were particularly kind about DEAD, Alexis Petridis wrote: “Young Fathers have quietly constructed a strange and intoxicating musical universe that feels entirely their own” – Guardian 4/5 (Lead Review). I know the group intimately and yet they still shock me on a regular basis. Not with anything as base as the kind of look-at-me desperation of a shocking rocking Rocky Horror spit show, nor with pyro and cannons and strippers or any of the other circus tricks. Just with presence and passion and looking like that beamed in from another world lost aliens with a message of love type of group. With intense engagement… intense… the Johnny Rotten, Ian Curtis, James Brown kind. Taking that brief blast of special that is normally only allowed to boys from terraced houses for a couple of years before imp or exp-losion but YFs just, keep it going, impossibly, like an Ethiopian marathon racer. Which should be an indication, dear star watchers, that something special is happening.\n\nOK, 850 odd words and still so much info to impart. How about… America, it’s like jumping into a deep fat fryer, so many delicious possibilities, like: Jimmy Kimmel, set to take the crown of late night TV chat show hosts, who hosted Young Fathers in June, watched by the entire Anticon roster, performing with blood shot intensity after 24 hours of partying (yes, they party, seriously of course, as you ask) in Los Angeles. More America: the entire staff of KEXP in Seattle, cramming into the control booth and watching in awe during YFs’ radio session there. If you know how many artists go through those doors you’ll know what an accolade that is.\n\nWhat about the BBC? How about all the love from Zane Lowe for the singles, not to mention the weekly shows they made for 1Xtra through October last year (2013) ? Episodes of some outer space Dada drama slotted in amongst all the herbal urban clichés. How about being banned by the beeb? Queen Is Dead, from TAPE TWO, officially banned just in case the Queen of Britain pops her clogs at the moment of spinning.\n\nTime to round it up and leave all the untold good stuff for another time. Now signed with Big Dada, Young Fathers are already recording the next album, printing more of their iconic T-shirts (have you got one yet? You’ll probably have to wait), making more videos, sweating their way through the summer festivals, ignoring stupid borders and other constraints in order to bring it, whatever it is, to you. ENDS", "url": "https://www.facebook.com/events/1551492585165998/", "source": "Facebook", "name": "Young Fathers 3/27/16 @ Blind Pig - Ann Arbor", "date": "2016-03-27T21:00:00-04:00"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-03-31T19:30:00-04:00"}, {"description": "Sponsored by the University of Michigan Credit Union, Arts & Eats: Dig In with UMS is a $15 ticket package deal that includes a great seat at the performance, exclusive access to a pre-show dinner, and a fun activity to get you thinking about the performance in a whole new way. You can pick up your tickets for the show at the Arts & Eats event.\n\nMore info about Mariachi Vargas de Tecalitlán : http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan/\n\nMore about Dig Ins: http://ums.org/tickets/students/", "url": "https://www.facebook.com/events/1667725740151395/", "source": "Facebook", "name": "Dig In: Mariachi Vargas de Tecalitlán", "date": "2016-04-01T18:30:00-04:00"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-04-01T19:30:00-04:00"}, {"description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "url": "https://www.facebook.com/events/453190221522442/", "source": "Facebook", "name": "Mariachi Vargas de Tecalitlán", "date": "2016-04-01T20:00:00-04:00"}, {"description": "In a career that spans 23 albums and includes three Grammy awards, Tom Chapin has covered a lot of creative ground. In addition to his work as a recording artist and concert performer, Chapin has acted on Broadway and worked in films, television and radio. Tom grew up in a family that encouraged artistic pursuits. He began performing professionally as a teenager in the early 1960s, playing in Greenwich Village folk clubs alongside his siblings, Harry and Steve, as one of The Chapin Brothers. In 1971, he began a five-year run as the host of the ABC-TV children's series, \"Make A Wish.\" Chapin and his songs were also featured in the 1970 documentary film, \"Blue Water, White Death,\" for which he spent six months sailing the Indian Ocean searching for great white sharks.\n\nAs a music-maker, Chapin has maintained two parallel careers, as a highly respected contemporary folk artist and as a pioneer in the field of children's music. In the former role, Chapin has established a reputation for insightful, heartfelt songcraft and charismatic live performances. In the latter, he continues to engage the hearts, minds and imaginations of young listeners with witty, life-affirming original songs delivered in a sophisticated array of musical styles. Chapin's infectious songs, sterling musicianship and personal warmth shine, whether he's performing on record or in a concert hall, an outdoor festival, a school, in front of a symphony orchestra, or in an intimate coffeehouse. www.tomchapin.com", "url": "https://www.facebook.com/events/1713063788906616/", "source": "Facebook", "name": "Tom Chapin at  Green Wood Coffee House", "date": "2016-04-01T20:00:00-04:00"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-04-03T19:30:00-04:00"}, {"description": "Monday, April 4 | 9pm | 18+ | $13 adv./ $15 day of\n\nCritically acclaimed pop duo Chairlift has released new music in the form of the infinitely danceable “Ch-Ching.” The R&B laced, vibrating drum infused pop track serves as the first musical offering from their forthcoming album Moth, which will be released in January 2016 via Columbia Records. Although the single is the first work to be released from Chairlift in three years, the duo – comprised of writer/producers and multi-instrumentalists Caroline Polachek and Patrick Wimberly – has hardly been quiet. They collaborated with Beyoncé on her groundbreaking self-titled album via the track “No Angel,” which was written and produced by Caroline and co-produced by Patrick. Caroline released and toured Arcadia, a self-produced solo album under the alias Ramona Lisa and collaborated with SBTRKT, Blood Orange and others, while Patrick produced and collaborated with artists such as Solange Knowles, Wet, Kelela, and Tei Shi.\n\nAn evolution from their last album, 2012’s Something, Moth proves to be an emotionally uninhibited and markedly stronger, more pop inspired body of work. A very New York City inspired album, listeners can expect to be led through an aural mix of big, rich pop inspired hooks, vibrating bass, lively brass and sensuous R&B inspired vocals, all anchored in the duo’s meticulously crafted instrumentation.", "url": "https://www.facebook.com/events/162598590780251/", "source": "Facebook", "name": "Chairlift 4/4/16 at Blind Pig - Ann Arbor", "date": "2016-04-04T21:00:00-04:00"}, {"description": "Sisters Cassie and Sid Sunday have not done a bang-up job of keeping in touch. In their defense, it hasn’t been easy: life veered in sharply different directions for the once-close sisters. Today, beautiful and big-hearted Sid lives an expat’s life of leisure in far-off Singapore, while harried, iPhone-clutching Cassie can’t seem to make it work as a wife and a mom to twin toddlers in Manhattan. \n \nIt doesn’t help that Sid spurns all social media while Cassie is addicted to Facebook. So when Sid issues a challenge to reconnect the old-fashioned way—through real, handwritten letters—Cassie figures, why not? \n \nThe experiment exceeds both of their expectations, and the letters become a kind of mutual confessional that have real and soul-satisfying effects. And they just might have the power to help Cassie save her marriage, and give Sid the strength to get her life back on track.\n \nBut first, one of Cassie’s infamous lapses in judgment comes back to bite her, and all of the letters wind up the one place you’d never, ever want to see them: the Internet…\n\nLisa Beazley has worked in journalism and public relations for more than fifteen years.", "url": "https://www.facebook.com/events/1528777447422865/", "source": "Facebook", "name": "Meet Debut Novelist Lisa Beazley for a Discussion & Signing for 'Keep Me Posted'", "date": "2016-04-05T19:00:00-04:00"}, {"description": "Tuesday, April 5 | 8pm | 18+ | $12 Cover\n\n“During the writing of Drinking From A Salt Pond, the band admits to flaring tempers and tense operations as they worked to redefine their sound, goals, and relationships…”\n\nRun River North will be the first to tell you: it has largely been an uphill climb for the indie rock sextet from Los Angeles, a hero’s journey full of odds-defying opportunities seized amidst rocky naysayers and the snagging brambles of band life. And now, with their second full-length album Drinking From A Salt Pond, Run River North are poised to push forward and create their own wake as a major voice in today’s music landscape.\n\nSince the band’s beginnings just over four years ago, their rise has been steadily spectacular, marked by appearances on national television, sold-out shows at historic venues, tours with rock and roll royalty and heaps of praise from fans and critics alike. As they blossomed, they embraced their initially folk-driven sound, which found its harmonic home alongside rootsy, foot stomping, sing-along-leading peers like Mumford & Sons, The Head and the Heart, and Of Monsters and Men. Powered by the acoustic-guitar-and-vocals songwriting of frontman Alex Hwang, their 2014 self-titled debut record, produced by Phil Ek (Fleet Foxes, Modest Mouse, Band of Horses), was released with their lineup rounded out by the strings duo of Daniel Chae and Jennifer Rim, Joe Chun on bass, Sally Kang on keys, and John Chong on drums.\n\nAs time and tours passed, the six lives spent in close-quarters began to grind the gears a little differently; their whole dynamic began to change. “When we became a band, we mostly played Alex’s songs in band form,” says Chae. “Since then we’ve all put our musical input into it, so the music has changed a lot.”\n\n“We were tired of me on acoustic guitar and everybody singing harmonies,” says Hwang. “We were hitting a ceiling, and it wasn’t fun. We had always agreed this band was six-ways, for better or worse. So at the end of last year, after being in the van constantly, we said, ‘no more touring, let’s write new songs.’”\n\n“We had to grow up pretty fast as a band,” says Chong. “So this past year, there were times when different perspectives and priorities have butted heads.”\n\nDuring the writing of Drinking From A Salt Pond, the band admits to flaring tempers and tense operations as they worked to redefine their sound, goals and relationships. “We’ve had a lot of hating each other, almost kicking people out of the band,” says Hwang. “We’re being honest and that openness is one of the main thrusts for the album. Embracing the bitter with the sweet, not trying to hide the crappy parts…the crappy parts helped make the good.” Being open about its faults, the band recognizes how the turmoil has helped Run River North create something beautiful.\n\n“The record we just made, it’s all the difficult stuff we went through so there’s a darker tone to the music. It works,” says Chae.\n\nOne of the first steps in leaving behind their folk roots was to work with new collaborators. Instead of the reverb-heavy, northwest sound of Ek, they recorded in Los Angeles with Lars Stalfors (Cold War Kids, HEALTH, Deap Vally, Matt and Kim) at the production helm. Stalfors opened their eyes to the upbeat energy and electric tone of indie bands like The Walkmen. Throughout Salt Pond the indie rock influence can be heard, with the band nodding inspiration to everyone from Cage the Elephant and Kings of Leon to The National, Death Cab for Cutie, and Cold War Kids, whose studio in San Pedro, CA the band borrowed to make the album. Also, in a move encouraged by their record label, Nettwerk, Hwang and Chae were sent to Nashville for a week in April 2015 to work on a few new tracks with two different co-writers, Lincoln Parish (formerly of Cage the Elephant) and the Kings of Leon collaborator Nick Brown.\n\n“It was weird but at the same time it was really encouraging,” says Hwang of the co-writing. “It was like bringing our demos to a blind date.”\n\nThe first song from the Nashville sessions was “Run Or Hide,” co-written with Parish, and from first listen it’s clear that Run River North are exploring bombastic new territory. Hwang, Chae, and Parish came up with an organic way of working that was based on jamming and vibing together, and once the song’s melody was nailed down, the rest came easily. It was immediately hard-hitting than any previous song from the band, with a discernible strut serving as a sonic contrast. When the demo was sent home to LA, the rest of the band was shocked.\n\n“Almost everyone else was really scared,” says Hwang, “‘this is not your voice, this is not who we are.’ I was confident it was a really good song and that we were gonna keep it. There’s nothing more aggressive on the record, and that groove on the verses is bigger than the band. The band can’t contain the song.”\n\n“I loved it!” says Chong emphatically. “Alex has a very wide range of emotion when he sings—soft, whispery things; really bombastic; rough—this song showcases all of that. I got really excited. When we recorded it, it really showcases more groove. Joe, our bass player, is solid, and the way the melody is created in the verses really adds to that. There’s a really cool contrast happening, but the choruses hit hard.”\n\nThe other song written in Tennessee was the Nick Brown co-penned “Can’t Come Down,” a track with pop qualities that the band does not shy away from recognizing. For that they leaned on Brown heavily, who served almost as a mentor to Hwang and Chae during the sessions, teaching them about pop hooks, authenticity, and Southern tradition. Deciding to go all in on a pop song, the trio rallied behind Brown’s catchy melodies and licks, and what they ended up with is a happy medium that “still sounds as Run River North as possible,” according to Chong, while simultaneously reaching for the rafters.\n\n“We really gelled with Nick Brown,” says Hwang. “We had the same idea: ‘We have enough songs that exemplify us, so let’s try our hand at writing a pop hook.’ With that mentality we came up with ‘Can’t Come Down.’ Nick wrote the hook, Daniel and Nick wrote the music, and a heavy collaboration on lyrics from everyone. It’s the first song I ever sang the word ‘baby’ in.”\n\nWith those songs firmly planting the band’s flag in new ground, it is Hwang’s “29” that may be the best indicator of the band Run River North are becoming. A piano and drum fueled anthem examining the ups and downs of transition, it finds the singer posing multiple existential questions at once. “Everyone’s always talking about how if you will something, it’s gonna happen. But, sometimes it doesn’t!” says Hwang. “That was a realization I wanted to play with: ‘Your words are cold like the wind…’ It’s kind of like saying, ‘I don’t care what you think,’ but it’s also a reflection about my words. What I do can be just as insignificant as anyone else. So what are you gonna do about it? You’re 29. ‘I know it’s home, I know it hurts/I know I’ll end up at the bottom/What if I leave?’ What if we go on this tour and we don’t end up anywhere? The brutal question is, who cares, and why does it matter? Not answering that in the song really helps. The music is still upbeat, it still has the ‘oh’s’ going on, it’s an anthemic thing. I’m still energetic, I’m not some old dude at 29.”\n\n“29” was written on electric guitar, a tool Hwang has been using more frequently since the end of the debut album’s touring cycle. Originally intended for a more somber feel, at the suggestion of their producer Stalfors, the tempo rose to meet Hwang’s intonations. “It became this song with so much energy,” says Chong, “it’s probably the fastest song we’ve ever done as a band. It’s new territory for us; it’s very fun. It’s a good transition, with lulled verses and really upbeat instrumentals and choruses. This is a good appetizer for our old fans, as this is who we’ve become.”\n\nEmbracing their natural growth and learning to ride the waves of their personal and musical evolutions with open hearts and nimble hands, Run River North have created a sophomore album that will propel them to the forefront of today’s landscape. Although at times the rushing water of their rise will pool into depths tough to swallow, they have learned to lean on each other and to trust themselves along the way in order to make something lasting and truly beautiful.\n\n“From the start, we always said we wanted to play on the biggest stages possible,” says Hwang. “That’s still the same. But it isn’t some self-indulgent dream of becoming rock stars; we still want to support our families with this, we still have the parents that sacrificed for us and we want to honor them. For us as a band, at times it’s felt like we’ve been drinking from a salt pond—and yet, we still created something pretty fresh that we like and are proud of.”\n\nWSG: The Lighthouse and the Whaler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/634", "url": "https://www.facebook.com/events/629378653882823/", "source": "Facebook", "name": "Run River North w/ The Lighthouse & The Whaler 4/5/16 @ Blind Pig - Ann Arbor", "date": "2016-04-05T20:00:00-04:00"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-04-06T19:30:00-04:00"}, {"description": "Wed. April 6 | 9pm | 18+ | $8 adv./ $10 day of\n\nGosh Pith - Gold Chain Tour\nhttp://www.blindpigmusic.com/calendar.html#!/events/653", "url": "https://www.facebook.com/events/166980353679332/", "source": "Facebook", "name": "Gosh Pith | Gold Chain Tour 4/6/16 at Blind Pig - Ann Arbor", "date": "2016-04-06T21:00:00-04:00"}, {"description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "url": "https://www.facebook.com/events/827290400697161/", "source": "Facebook", "name": "Jerusalem Quartet", "date": "2016-04-08T20:00:00-04:00"}, {"description": "Friday, April 8 | 9pm | 18+ | $22 Adv./ $25 Day of\n\nthe Mountain Goats - One thing that happened this past year was at City Winery, in April, where we did a session down in the cellar between soundcheck and the show. We hadn’t really thought a whole lot about the session in advance—on tour, your default response to things is “let’s just show up and play”—and we were kind of under the gun time-wise when we got to the club. So we decided to just do it quick and dirty, old-school style. Like the open mic nights I used to play: unamplified guitar and vocals, friends with their axes playing along, arrangements arrived at on the fly and infinitely flexible. Four songs later we felt really inspired—me and Matt played a song or two without anybody else around because we’d gotten down to the basement before the others, the total song choice was strictly “what do you figure we should play now?”, the mood was relaxed and free…we loved it. Later that night, we decided to strip down the drum kit to essentials and play a choke-the-motor set echoing and elaborating on what we’d done downstairs: a sort of small-ensemble feel, lower in volume but actually higher in intensity. Like what we do in concentrate. It was one of our two favorite performances of the year, the other being the second night at the Fillmore. It felt like acres of new terrain opening up atop an ancient foundation. As soon as it was over, we all wanted to do it again. So in 2016 we’re taking that set on the road. Not that exact set, obviously; the particulars will vary from night to night. But smaller rooms, audible frequencies, up close and personal: this is the general plan. Making eye contact with people in the back row, being able to go off-mic when I want to and still be heard. Total visibility. We couldn’t be more excited about this tour. I love the big album release shows as much as anybody, but that City Winery feel of just playing together with bare essentials in close quarters…there’s nothing like it, and when the whole room locks onto the signal, it’s really special.\nWith: William Tyler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/581", "url": "https://www.facebook.com/events/554988117991170/", "source": "Facebook", "name": "The Mountain Goats w/ William Tyler 4/8/16 @ Blind Pig - Ann Arbor", "date": "2016-04-08T21:00:00-04:00"}, {"description": "Sat. April 9 | 8pm | 18+ | $10 adv./ $12 day of\n\nFlint Eastwood is the evolution of the creative side of Detroit-based multi-talented artist Jax Anderson. Flint Eastwood is what happens when friends and family gather in the forgotten spaces of an embattled city and are left to create with no rules, no boundaries, and nothing holding them back. Jax's endless creativity is a byproduct of growing up in a talented family.\n\nHer father was one of ten kids, each of whom played guitar and sang. Her oldest brother, Sam, played in punk bands, and Jax spent her teenage years learning the value of passion and acceptance at DIY shows. As she got older, her other brother (and Flint Eastwood collaborator and producer) Seth started playing in bands throughout the Detroit garage rock scene. Their dad worked as a curb address painter to pay the bills once the housing crash made his job as a mortgage broker invalid. During this time, Jax and her brothers went door to door, passing out flyers advertising her father's services, through some of the toughest residential neighborhoods in Detroit. These struggles helped form the vision that drives Flint Eastwood: to give everyone listening (whether live or on record) a momentary escape from the problems we all have.\n\nBetween helping around the house, Jax spent her days in her family's Detroit-area home, without cable and internet, teaching herself to play her father's 12-string Taylor guitar that he left for them in the living room. It was also during this time that her mother's love for Motown music began to influence Jax's knack for the theatrics and power of the Detroit sound, as Mom played records from The Temptations, the Jackson Five, and Earth Wind & Fire.\n\nOnce old enough to break out on her own, Jax briefly moved to a small German tourist town in rural Georgia, where the only station in town played solely pop and country. There, she fell in love with the hooks and harmonies that define American pop music. Later, she moved with Seth to Los Angeles, to mainly focus on writing for licensing opportunities and playing small clubs and house parties around town. While in LA, Jax developed a love for film, hopping on tour with bands every chance she could get as a self-taught videographer. Her experiences on the West Coast still influence Jax's push to make her musical endeavors into well-rounded multimedia presentations (mixing music with theatrical lighting, video projection, and costumes).\n\nUpon returning home to Detroit at the very beginning of the much-maligned city's recent resurgence, Jax's explosive and endearing personality on stage became the driving force behind Flint Eastwood. But through it all, it was the songs that were always the focus.\n\nOn their now sold-out debut EP Late Nights In Bolo Ties (2013), Jax and her friends mixed elements of pulsing electronic tracks with blistering bluesy guitar licks, all with a spaghetti-western backdrop, inspired by Sunday night movie sessions with Jax and her father.\n\nOn the forthcoming EP, Small Victories (to be released October 23), Jax has returned to her Detroit roots, mixing a taste of the theatricality of Motown music with her more recently found love for pop music. The result is six songs full of hooks. The type of tracks that you turn up a little too loud, close your eyes, and forget where you are for four minutes. In a live setting, the songs are taken to another level entirely, mixing a CHVRCHES-like depth with a twenty | one | pilots-style flair for the dramatic. This approach has led the band to rapidly gain an ever-growing fanbase. Their last two hometown headline plays have sold out (400+ tickets per show), and the band has toured heavily through the Midwest, mixing festival looks like Electric Forest, MoPop Festival, and Midpoint Music Festival with club appearances alongside acts such as Foxy Shazam, Mayer Hawthorne, Betty Who, X Ambassadors, and Andrew WK.\n\nSmall Victories was crafted and polished in Detroit’s second oldest church, now repurposed as Assemble Sound, a hub of Detroit creativity that fosters artists through collaboration. In this crumbling but inspiring location, the new record was created as a coping mechanism to help Jax deal with the loss of her mother, who was her biggest fan and inspiration. As the listener makes their way through the EP, they experience Jax making her way through her mother's illness and passing, railing against it, dealing with the aftermath associated with such a loss, eventually accepting it, and using it as a driving force to continue to create.\n\nJax broke the EP down in one simple thought:\n\n\"Small Victories comes from the idea that doing anything creative in life takes a lot of persistence, struggle, and hustle. It's easy to expect that the spoils will come easily and be immediately fruitful. But if you focus on the little things, the \"small victories\", you realize that it's those things that are the most rewarding. That's what keeps me going.\"\n\nThe lead single is the EP's first track, \"Find What You're Looking For\", which is Jax's interpretation of her mother's final words to her:\n\n\"Don't let this break you\".", "url": "https://www.facebook.com/events/1217913291571431/", "source": "Facebook", "name": "Flint Eastwood 4/9/16 at Blind Pig - Ann Arbor", "date": "2016-04-09T20:00:00-04:00"}, {"description": "Tuesday, April. 12 | 9pm | 18+ | $13 Adv./ $15 Day of\n\nDenzel Curry 2055 The Ult Experience\nwsg: Allan Kingdom and Sdotbraddy\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/636", "url": "https://www.facebook.com/events/523621744459410/", "source": "Facebook", "name": "Denzel Curry - 2055: The Ult Experience 4/12/16 @ Blind Pig - Ann Arbor", "date": "2016-04-12T21:00:00-04:00"}, {"description": "Wed. April 13 | 9pm | 18+ | $8 adv./ $10 day of\n\nThe Appleseed Collective \nwith: Big Dudee Roo & Rick Chyme\n\nThe Appleseed Collective is a four-piece Americana band that's toured these United States since 2010, serving up songs new and old—barn-burners, old soul jazz, airy mood pieces, bluesy digressions—to crowds hungry for more. Their music is a rich Dixie-Gypsy roots-music mélange with a modern twist, a long-simmering stew of old-time, ragtime, and bluegrass constantly refreshed—like the Melting Pot itself—with immigrant sounds and international spices. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/643", "url": "https://www.facebook.com/events/1698946970352936/", "source": "Facebook", "name": "The Appleseed Collective w/ Big Dudee Roo & Rick Chyme 4/13/16 at Blind Pig - Ann Arbor", "date": "2016-04-13T21:00:00-04:00"}, {"description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "url": "https://www.facebook.com/events/1621365181438631/", "source": "Facebook", "name": "Mnozil Brass", "date": "2016-04-14T19:30:00-04:00"}, {"description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus, where it blended with elements of Spanish music, then was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed Tunisian singer Sonia M’barek, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "url": "https://www.facebook.com/events/419604171550681/", "source": "Facebook", "name": "Zafir: Musical Winds from North Africa to Andalucía", "date": "2016-04-15T20:00:00-04:00"}, {"description": "Scott Ainslie came of age during the Civil Rights era, and cultivated a powerful affinity for cross-cultural exchange. He has studied with elder musicians on both sides of the color line, in the old-time southern Appalachian fiddle and banjo traditions, as well as Black gospel and blues. He plays this music with affection, authority, and power. Armed with a variety of instruments -- vintage guitars, a fretless gourd banjo, a one-string, homemade diddley bow (cigar box guitar) --  and carefully chosen personal anecdotes of his encounters with senior musicians across the South, Ainslie explores the African and European roots of American music and culture, bringing the musical history of America alive.  www.cattailmusic.com", "url": "https://www.facebook.com/events/506775856161991/", "source": "Facebook", "name": "Scott Ainslie at Green Wood Coffee House", "date": "2016-04-15T20:00:00-04:00"}, {"description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "url": "https://www.facebook.com/events/1579924995611394/", "source": "Facebook", "name": "Bavarian Radio Orchestra", "date": "2016-04-16T20:00:00-04:00"}, {"description": "Sat. April 16 | 9pm | 18+ | $15 Cover\n\nMixing a unique future sound with hip-hop and pop elements, Jai Wolf is gaining the attention of fans and influential musicians alike. After Skrillex saw a tweet containing Jai’s bootleg of his hit song, “Ease My Mind,” he immediately signed the remix. Since, Jai Wolf has done official work for Alesso, Dirty South, Melanie Martinez, ODESZA, and more.\n\nIn June 2015, Jai Wolf released his first original single, Indian Summer. Within three weeks, Indian Summer hit #1 on the US Spotify Viral Charts, and has gained global recognition.\n\nJai Wolf has toured nationally including pitstops at Coachella, Bonnaroo, Hard Summer, and will wrap up the year with a headlining tour in Australia this Fall.", "url": "https://www.facebook.com/events/533365020158543/", "source": "Facebook", "name": "Jai Wolf 4/16/16 at Blind Pig - Ann Arbor", "date": "2016-04-16T21:00:00-04:00"}, {"description": "Monday, April 18 | 8pm | 18+ | $15 adv./ $17 day of\n\nPolica with MOTHXR \n\nUnited Crushers (out March 4, 2016) is POLIÇA’s third full-length release and most remarkable album to date. The band, which includes Channy Leaneagh, dual drummers, Drew Christopherson and Ben Ivascu and Chris Beirden on bass with producer Ryan Olson at the helm, collectively wrote the album in Minneapolis in the winter of 2015 during their first true break from two straight years of touring. The new album builds on POLIÇA’s signature synthesizer and percussion-heavy sounds with more complex arrangements and a bigger, crisper hi-fi punch due to the new approach they took to writing and recording: together, all in the same room. There's a tighter groove to these songs and a more vulnerable quality to them, especially in Leaneagh's singing. Her incredible vocal range is consistently on display throughout, beautifully raw and less electronically effected than on previous recordings. United Crushers is the follow up to 2013’s Shulamith which EW called \"propulsive enough for dance floors, and dreamy enough for headphones\" andMOJO said \"proves that intelligent pop music still has the ability to seduce and enthral.\" Their debut, 2012's Give You The Ghost, also garnered international acclaim, with Rolling Stone hailing it as \"the sound of heartbreak and celebration happening simultaneously\" and Q praising it as \"a bewitching, urgent, magical debut.\" The band has conquered massive festivals around the world from Coachella to Glastonbury in addition to performing on Late Night With Jimmy Fallon, Later With Jools Holland and more.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/564", "url": "https://www.facebook.com/events/769930223136488/", "source": "Facebook", "name": "Polica w/ Mothxr 4/18/16 @ Blind Pig - Ann Arbor", "date": "2016-04-18T20:00:00-04:00"}, {"description": "\"Lush, introspective, elegant\"—Boston Globe. Photo by Asia Kepka.", "url": "https://www.facebook.com/events/1088535237838163/", "source": "Facebook", "name": "Anne Heaton", "date": "2016-04-21T20:00:00-04:00"}, {"description": "Thu. April 21 | 9pm | 18+ | $15 Cover\n\nI don’t know how to write a bio for an album. I’ve never written one. I’m a comedian. My job is to talk onstage for long enough that the trapped, drunken audience has to buy more chicken wings from the club. I am not qualified to write about music. And yet here I am, writing a bio for the new The Thermals record, We Disappear. Thank god it’s a great fucking record.\n\nThe first time I heard The Thermals was on broken headphones while riding the A Train to Rockaway, Brooklyn, flying mere feet over a frozen Jamaica Bay on a too-bright January morning. I had just fallen in love with a wonderful, terrible woman who was thousands of miles away. I was very fragile, I had no boundaries, and I was the strongest I’d ever been. And that’s how this album feels. There’s a new vulnerability here, but The Thermals’ sound is as strong as it’s ever been.\n\nThe Thermals are best at making songs you put on mixtapes named ‘Drunken Sing-alongs When You’re Sad.’ They specialize in late-night, secret conversations about feeling simultaneously romantic and resentful over being raised Catholic. They’re the soundtrack to breaking glass, and an ode to the beauty of brokenness.\n\nThey say that the mark of intelligence is the ability to hold two disparate and conflicting truths in the mind at the same time: I am a good person; I am not a good person. We Disappear lives in this delicate, in-between place: at once hard and noisy, while also soft and personal. And seeming contradictions abound on this album. We Disappear is an all-too-real, dark, and intensely personal album – in the past most of singer Hutch Harris’ lyrics have been mostly fictitious tales – about how we try to outrun demise, whether personal or physical. It is an emotional document of how two people can tear each other apart, while simultaneously making you wanna get up and jump around the room.\n\nThe deeply dark, yet oddly catchy “Heart Went Cold” plays on the double metaphor of loss of love/life and features the sad realization “I pushed you away”, but is immediately followed by the super poppy “oh-oh oh”. The classic fucking rock anthem “Hey You” is a paranoid fantasy about running from the Grim Reaper as he calls after you, about “being terrified of death,” says Harris, but “a celebration of that feeling as opposed to feeling sad about it.” A surprisingly uplifting eulogy of the death of a relationship, “Thinking Of You” is explained by Harris as “one of the most straight-forward love songs we’ve ever written, a point-blank post-break up song. It’s a song that says exactly what it means. It and a lot of the record are about regret, i.e. still loving someone after a break-up and hanging on to these feelings.”\n\nWe Disappear is also about separation in terms of technology, how it can isolate us and impact our relationships, and how humans have embraced it to the point where we’ve already assimilated into it. “The Great Dying” and “Into the Code” examine how we’re so afraid we’re going to be forgotten, or overlooked, that we upload everything about our lives onto the Internet.\n\nHarris explains, “Technology, love and death are the three obsessions of the record. Our privacy used to be so important to us and now everything has changed – we freely offer once private information about relationships and reveal everything about our day-to-day lives. We’re trying to preserve our life digitally so when we’re gone people won’t forget us. We’re using technology to become immortal. You can even set up Facebook and Twitter accounts to continue updating after you die! We Disappear is about how humans fight the inevitable.”\n\nI’m sure you want to know that the record will come out March 25th, 2016 on Saddle Creek, that it features the longest running Thermals line-up of Hutch Harris, Kathy Foster, and Westin Glass, and that it was recorded in Portland, OR at Kung Fu Bakery (The Shins, Tegan and Sara) and in Seattle, WA at The Hall of Justice (Nirvana, Mudhoney), and produced by Chris Walla (formerly of Death Cab For Cutie). But what really matters is that this record GETS IT. It walks that fine line between truth and lies, between death and life, between depression and joy – all the while recognizing that one cannot exist without the other. And it brings us with it. That’s the reason to listen to this record: Because it’s a fucking great album, by an amazing band. Long Live The Thermals.", "url": "https://www.facebook.com/events/1683772608545604/", "source": "Facebook", "name": "The Thermals w/ Summer Cannibals 4/21/16 at Blind Pig - Ann Arbor", "date": "2016-04-21T21:00:00-04:00"}, {"description": "\"Nora Jane Struthers has been creating quite a buzz.\"—The Tennessean, Nashville", "url": "https://www.facebook.com/events/937454106322981/", "source": "Facebook", "name": "Nora Jane Struthers", "date": "2016-04-22T20:00:00-04:00"}, {"description": "Warm as summer sunshine, real as the truth, intimate as a long overdue visit between old friends … such is a Jonathan Edwards concert. Four decades into a stellar career of uncompromising musical integrity, the man simply delivers, night after night – songs of passion, songs of insight, songs of humor, all rendered in that pure and powerful tenor which, like fine wine, has only grown sweeter with age.\nThis is one veteran performer who is neither grizzled nor nostalgic.  \nJonathan's  highly respected repertoire  includes such classics as, “Sometimes,” “One Day Closer,” “Don’t Cry Blue,” “Emma,” “Everybody Knows Her,” “Athens County,” and everyone’s favorite ode to putting a good buzz on, “Shanty.” And then, of course, there’s the anthemic “Sunshine (Go Away Today),” that fierce proclamation of protest and independence that resonated with thousands and thousands of frustrated and angry young men and women when it was first released in 1971. Almost 40 years later, at show after show, the song continues to be embraced by faithful followers and new fans alike.\nSince 1971, Jonathan has released 15 albums, including \"Blue Ridge,\" his standard-setting collaboration with bluegrass favorites the Seldom Scene, and \"Little Hands,\" his collection of children’s songs, which was honored with a National Library Association award. His brand new album is, \"Tomorrow's Child.\"\nwww.jonathanedwards.net", "url": "https://www.facebook.com/events/1943009162591226/", "source": "Facebook", "name": "Jonathan Edwards at Green Wood Coffee House", "date": "2016-04-22T20:00:00-04:00"}, {"description": "A blues and boogie summit! Note special start time.", "url": "https://www.facebook.com/events/423521121176906/", "source": "Facebook", "name": "Mr. B's Blues and Boogie Celebration", "date": "2016-04-23T19:30:00-04:00"}, {"description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "url": "https://www.facebook.com/events/1589849627952742/", "source": "Facebook", "name": "The Bad Plus Joshua Redman", "date": "2016-04-23T20:00:00-04:00"}, {"description": "Great Big Sea's lead vocalist returns from Folk Festival's whirlwind performance", "url": "https://www.facebook.com/events/1688475221393083/", "source": "Facebook", "name": "Alan Doyle & The Beautiful Gypsies", "date": "2016-04-24T19:30:00-04:00"}, {"description": "Our April Artists' Meet & Greet topic is How to Photograph Your Artwork. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet events: http://www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/1668025760140932/", "source": "Facebook", "name": "How to Photograph Your Artwork", "date": "2016-04-27T18:00:00-04:00"}, {"description": "New music from an expat Australian trio", "url": "https://www.facebook.com/events/831801416940807/", "source": "Facebook", "name": "The Waifs", "date": "2016-04-27T20:00:00-04:00"}, {"description": "Wed. April 27 | 9pm | 18+ | $28 Cover\n\nReverend Horton Heat with: Unknown Hinson, Nashville Pussy & Lucky Tubb & the Modern Day Troubadours Live in Concert!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/612", "url": "https://www.facebook.com/events/991272244292924/", "source": "Facebook", "name": "Rev. Horton Heat & Company 4/27/16 @ Blind Pig - Ann Arbor", "date": "2016-04-27T21:00:00-04:00"}, {"description": "New music from a New Brunswick songwriter with a rich gospel-soul voice", "url": "https://www.facebook.com/events/979867302105773/", "source": "Facebook", "name": "Matt Andersen & The Bona Fide", "date": "2016-04-28T20:00:00-04:00"}, {"description": "Thursday, April 28 | 9pm | 18+ | $15 Cover\n\nIt’s rare for an artist to bridge the divide between critical acclaim and dedicated fan engagement. Chris Pureka is a Portland-based singer-songwriter whose body of work has resonated deeply with these seemingly disparate milieus. Her bold vulnerability in processing the intimacies of her life in song has long appealed to those listeners who crave authenticity. Now, five years coming, she shares with us another powerful entry in her life’s work, her sixth release, the aptly titled, Backin the Ring. Chris’s elegant emotionality as a vocalist, and her flair and immediacy as a lyricist have garnered her favorable comparisons to Gillian Welch, Ryan Adams, Bruce Springsteen, and Patty Griffin. She’s earned accolades from such distinguished taste-making outlets as The New York Times, Paste, Magnet,Billboard.com, and The AllMusic Guide. She’s shared the stage with such diverse and esteemed artists as Dar Williams, TheLumineers, The Cowboy Junkies, Gregory Alan Isakov, Martin Sexton, and Ani DiFranco. Along the way, Chris has remained fiercely independent, selling nearly 50,000 albums through her own label, Sad Rabbit Records. Chris’s journey in music mirrors her path toward self-discovery. At 16, writing songs became a way of journaling. “I was shy and introverted, and songwriting was a very personal process. I never had any intention of performing,” she shares. Post high school, she went on to complete a biology degree at Wesleyan University, and afterwards, worked in a microbiology research lab at Smith College. Meanwhile, she established a music career parallel to her biology work through touring and issuing a clutch of well-received indie releases.In 2006, when Chris found herself turning down too many opportunities as a musician, she shifted her priorities to become a full-time artist. Her latest album, Backin the Ring, is Chris’s first studio full length since 2010’s critically acclaimedHow I Learned to See in the Dark. “I’m not interested in releasing songs I can’t get behind or records I don’t love,” she says of the five-year span between albums. The title of her latest playfully suggests something of an artistic comeback, but it also references the album’s themes of relationship conflict and making the decision to fight back against dark inner demons. “My music is the outward expression of the work I’m doing internally. What I do comes from my experiences, and I strive to express these experiences authentically. Speaking my truth, and being myself, is the way that I connect with people,” Chris confides. Her rise as an esteemed artist with captivating emotional integrity has been organic and always on her own terms.For someone who never had an intention of being a professional musician, it’s been a life of far-reaching changes and unexpected rewards. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/595", "url": "https://www.facebook.com/events/1318721681600135/", "source": "Facebook", "name": "Chris Pureka 4/28/16 @ Blind Pig - Ann Arbor", "date": "2016-04-28T21:00:00-04:00"}, {"description": "Michigan's cult hero of comedy", "url": "https://www.facebook.com/events/480751802102134/", "source": "Facebook", "name": "Heywood Banks", "date": "2016-04-29T20:00:00-04:00"}, {"description": "Don Campbell is a contemporary/country crossover and folk-rock singer/songwriter whose presentation of music supports the story in the song and welcomes the audience on board for the ride. Often compared to the sounds of Dan Fogelberg, Vince Gill, and Chris Isaak, Don and his ensembles are based out of New England. In 2012, Don released a double CD, \"Kites To Fly: Celebrating the Music of Dan Fogelberg,\" and in 2013 began presenting live performances of this music around his own busy schedule of Don Campbell shows.\nwww.doncampbellmusic.com", "url": "https://www.facebook.com/events/930690620345924/", "source": "Facebook", "name": "A Special Evening Of Dan Fogelberg Music by Don Campbell", "date": "2016-04-29T20:00:00-04:00"}, {"description": "\"A welcome gearshift\"—Real Detroit Weekly", "url": "https://www.facebook.com/events/530159733818023/", "source": "Facebook", "name": "The Ben Daniels Band", "date": "2016-04-30T20:00:00-04:00"}, {"description": "New music from an original and fiercely independent songwriter", "url": "https://www.facebook.com/events/740395076091997/", "source": "Facebook", "name": "Seth Glier", "date": "2016-05-01T20:00:00-04:00"}, {"description": "Genre-crossing jazz virtuosity", "url": "https://www.facebook.com/events/1650789915178155/", "source": "Facebook", "name": "The Julian Lage Trio", "date": "2016-05-02T20:00:00-04:00"}, {"description": "An American master of solo songwriting and blues", "url": "https://www.facebook.com/events/986462064751963/", "source": "Facebook", "name": "Chris Smither", "date": "2016-05-06T20:00:00-04:00"}, {"description": "Vocalist and composer Carla Cooke is the youngest daughter of the legendary Sam Cooke, whose musical life encompassed religion, romance, and history. Carla’s career mirrors that of her father, in that she crafted her sound in the church. Carla sought not to use her father’s name, but to build her own reputation. Now the younger Cooke knows that her roots are firmly entwined in her father's as she connects with them through his music.\n\nCarla Cooke’s style is diverse in gospel, Christian, R&B, soul, and pop styles. With a strong vocal range and warm personality, Carla shows that the apple doesn't fall far from the tree, as she channels the raw talent, emotion, beauty, and charisma of the Cooke family persona. www.carlacooke.com", "url": "https://www.facebook.com/events/919947144747827/", "source": "Facebook", "name": "An Evening of Sam Cooke by Daughter Carla Cooke", "date": "2016-05-06T20:00:00-04:00"}, {"description": "\"Her songs are about living, breathing people.\"—No Depression", "url": "https://www.facebook.com/events/916584281712332/", "source": "Facebook", "name": "Lucy Kaplansky", "date": "2016-05-07T20:00:00-04:00"}, {"description": "\"Her songs are about living, breathing people.\"—No Depression", "url": "https://www.facebook.com/events/483349811834793/", "source": "Facebook", "name": "Lucy Kaplansky", "date": "2016-05-07T20:00:00-04:00"}, {"description": "Sat. May 7 | 9:30pm | 18+ | $10 Cover\n\nSuper Happy Funtime Burlesque is a 16 member band/burlesque show showcasing genre defying music and sexy striptease all in the name of good jokes and bad taste.  Designed to find your line and cross it, SHFB presents its shows as full on musical theater.  Rather than the typical variety show format, SHFB presents a full on original rock opera at its many stops around the nation as it tours year after year in its big red school bus.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/652", "url": "https://www.facebook.com/events/1763664110523989/", "source": "Facebook", "name": "Super Happy Funtime Burlesque 5/7/16 at Blind Pig - Ann Arbor", "date": "2016-05-07T21:30:00-04:00"}, {"description": "Wed. May 11 | 9pm | 18+ | $20 Cover\n\nHailing from Oakland, California, Del the Funky Homosapien and his crew, the Hieroglyphics came out as a markedly non-gangster response to a burgeoning West Coast scene. After being put on at the tender age of 17 by his cousin Ice Cube, Del released two records on Elektra, I Wish My Brother George Was Here (1991) and No Need For Alarm (1993). Despite record sales in the hundreds of thousands, he recorded a third album, Future Development, which was never commercially released. Del parted with Elektra and started work on the Hieroglyphics..family album, 3rd Eye Vision (Hiero Imperium, 1998). Hiero went on the road and toured incessantly in support of the album for much of 1998. Del also spent a good portion of his time drawing, practicing Japanese, and playing mass amounts of video games. Finally ready to unleash a new record on the world, Del comes with BOTH SIDES OF THE BRAIN. Seventeen tracks of pure Del. He says of his work on this album: ..\"I've had complete control\". At times, Del has felt restrained by the formulas in hip hop and the expectations fans place upon emcees who have had hits. I wish that I had the same freedom that someone like Bjork has when she puts out an album..Apart from collaborations with PrincePaul, El-P (Company Flow), and help from a few of his Hiero cohorts (A-plus, Casual, Domino) Del handled the majority of production on this album. By staying true to himself, Del has earned legions of adoring fans. He may have said it best in his classic, Mistadobalina when he declared all in the mind and the heart.", "url": "https://www.facebook.com/events/222011124804458/", "source": "Facebook", "name": "Del The Funky Homosapien wsg DJ Shiftee 5/11/16 at Blind Pig - Ann Arbor", "date": "2016-05-11T21:00:00-04:00"}, {"description": "\"A profound lyricist and respected composer\"—Toronto Star", "url": "https://www.facebook.com/events/1569905103231931/", "source": "Facebook", "name": "Garnet Rogers", "date": "2016-05-13T20:00:00-04:00"}, {"description": "Harmony Bones is a quartet of long-time veterans of the Ann Arbor folk music scene. The band consists of Jeanne Mackey, Tom Voiles, Linda Teaman, and Laz Slomovits. The name Harmony Bones comes from an acupuncture point that harmonizes imbalances and promotes clear thinking, seeing, and hearing.\nJeanne, Tom, Linda and Laz have joined forces to explore a wide range of traditional, contemporary and original folk songs. Rich vocal harmonies and an array of instruments -- guitar, mandolin, flute, pennywhistle, fiddle, banjo, percussion, sitar -- combine to make Harmony Bones.\nSinger/songwriter Jeanne Mackey offers a blend of emotional intensity, wry humor, and global consciousness. In addition to original tunes, her repertoire ranges from Dar Williams to Patsy Cline, from Pete Seeger to Irving Berlin. A seasoned guitarist, she draws on a variety of styles -- folk, classic swing, funky blues, and more -- with the occasional sprinkle of mandolin, accordion, or banjo. Mackey rocked the 1970s East Coast topical music circuit as a young musician advocating feminist values and social justice.  In 2010, Mackey created \"Drop The Knife: A Memoir-in-Song,\" an evening of original songs and stories exploring the meaning of homeland, curses, death, and magic.\nLinda Teaman and Tom Voiles do much of their singing and playing with Nutshell, an Ann Arbor-based Celtic roots band. Nutshell plays for contra-dances and performs at festivals across North America.\nLinda is a singer who brings depth of understanding, warmth and sensitivity to the music. In 2005, her graduation recital for a degree in k-12 choral music had her singing in five languages, encompassing musical forms such as Irish sean nos singing and Italian and German arias by composers Purcell, Mozart and Brahms. She leads the Rudolf Steiner Community Singers, a small choir that sings uncommon Christmas and seasonal songs of celebration.  She hopes you'll forgive her classical background and that she is redeemed by her love of folk music.  In addition to vocals, she adds light percussion to the mix.\nTom consumes a well-rounded musical diet that ranges from Celtic to Indian to rock and roll. He enjoys mixing different styles while maintaining a respect for the traditions from which they spring. Tom has studied North Indian Classical music, Moroccan folk drumming and western classical flute. He has worked with performance artists, dancers, mimes and poets, including Hosain Mosavat, Gerry the Fool, Matthew Smith, ML Liebler and the Magic Poetry Band.\nLaz Slomovits is one of the twin brothers in Ann Arbor’s nationally-known children’s music duo, Gemini. A fine singer and multi-instrumentalist, Laz is starting his 4nd year playing music. His songs are featured in songbooks used by music teachers throughout the country, and Gemini's recordings have won numerous awards. In addition, Laz has had a notable solo career. In his solo work, Laz is best known for his powerful musical settings of the poetry of ancient Sufi mystics Rumi and Hafiz, as well as that of contemporary American poets.", "url": "https://www.facebook.com/events/1637106023218709/", "source": "Facebook", "name": "Harmony Bones at Green Wood Coffee House", "date": "2016-05-13T20:00:00-04:00"}, {"description": "The ears and eyes of America!", "url": "https://www.facebook.com/events/1080836985282330/", "source": "Facebook", "name": "The Corn Potato String Band", "date": "2016-05-15T19:30:00-04:00"}, {"description": "Ty Greenstein (of Girlyman) and Ingrid Elizabeth (of Coyote Grace) in a new roots duo", "url": "https://www.facebook.com/events/164009360644535/", "source": "Facebook", "name": "Mouths of Babes", "date": "2016-05-18T20:00:00-04:00"}, {"description": "Grammy winner Pat Donahue is one of the most popular finger pickers in the world. His musical tastes are eclectic. Though he considers himself foremost a folk guitarist, Pat’s influences are rooted in bluesmen Blind Blake, Robert Johnson, Duke Ellington, Muddy Waters and Miles Davis.\nHaving been a songwriter and guitarist for twenty years for the “Guys All Star Shoe Band” of Minnesota Public Radio’s “A Prairie Home Companion,” Pat got to show off his savvy licks and distinctive original songs to millions of listeners each week. After wrapping up this impressive longterm gig, Pat now turns to full time concert touring, presenting master guitar workshops and attending prestigious music camps. www.patdonahue.com", "url": "https://www.facebook.com/events/148870615480384/", "source": "Facebook", "name": "Pat Donahue at Green Wood Coffee House", "date": "2016-05-20T20:00:00-04:00"}, {"description": "\"The best live performer I've ever seen\"—John Mayer", "url": "https://www.facebook.com/events/200517660293245/", "source": "Facebook", "name": "Martin Sexton", "date": "2016-05-21T20:00:00-04:00"}, {"description": "Our May Artists' Meet & Greet topic is \nHow to Submit Your Artwork to a Show or Gallery. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/1176167649079840/", "source": "Facebook", "name": "How to Submit Your Artwork to a Show or Gallery", "date": "2016-05-25T18:00:00-04:00"}, {"description": "Finding the point where blues and the jam bands meet", "url": "https://www.facebook.com/events/1513930968936295/", "source": "Facebook", "name": "Nick Moss", "date": "2016-05-26T20:00:00-04:00"}, {"description": "New voices from Michigan and Chicago", "url": "https://www.facebook.com/events/483627578508260/", "source": "Facebook", "name": "Chris DuPont & Frances Luke Accord", "date": "2016-06-04T20:00:00-04:00"}, {"description": "Virtuoso bluegrass and roots sounds from Washtenaw County", "url": "https://www.facebook.com/events/987088328046526/", "source": "Facebook", "name": "Thunderwüde", "date": "2016-06-09T20:00:00-04:00"}, {"description": "A direct link to the early days of folk and the blues", "url": "https://www.facebook.com/events/1698056820481625/", "source": "Facebook", "name": "Josh White Jr.", "date": "2016-06-10T20:00:00-04:00"}, {"description": "October Project's lead vocalist returns", "url": "https://www.facebook.com/events/927935930621496/", "source": "Facebook", "name": "Mary Fahl", "date": "2016-06-11T20:00:00-04:00"}, {"description": "Our June Artists' Meet & Greet topic is Legal Issues for Artists. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/527954430710284/", "source": "Facebook", "name": "Legal Issues for Artists", "date": "2016-06-29T18:00:00-04:00"}, {"description": "Newfound Road's amazing lead vocalist steps out with music by Jackson Browne and more. This show has been rescheduled from June 16.", "url": "https://www.facebook.com/events/1124052387614735/", "source": "Facebook", "name": "Tim Shelton", "date": "2016-07-10T19:30:00-04:00"}, {"description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/", "source": "Facebook", "name": "The 2016 Ann Arbor Art Fair", "date": "2016-07-21T10:00:00-04:00"}, {"description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/", "source": "Facebook", "name": "The 2016 Ann Arbor Art Fair", "date": "2016-07-22T10:00:00-04:00"}, {"description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/", "source": "Facebook", "name": "The 2016 Ann Arbor Art Fair", "date": "2016-07-24T10:00:00-04:00"}, {"description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/", "source": "Facebook", "name": "The 2016 Ann Arbor Art Fair", "date": "2016-07-27T10:00:00-04:00"}, {"description": "There are songs that transport you to good times remembered. Songs like, “I’d Really Love To See You Tonight,” “Nights Are Forever Without You,” and, “Love Is The Answer” have that effect on many of us. These songs and numerous others have made John Ford Coley a singing legend.\nJohn is most revered as half of the duo England Dan and John Ford Coley. The classically-trained pianist and talented guitarist continues performing the gold and platinum record hits for audiences around the world. Some of Coley’s other hits are, “Gone Too Far,” “We’ll Never Have To Say Goodbye Again,” and, “Sad To Belong.\"\nJohn’s experiences comprise a broad background. Although he performed throughout high school and college as a classical and rock pianist, he chose to major in English Literature in college, and is an avid student of history. In the mid-1980’s, John began acting in television and in feature films. He recently penned a book, \"Backstage Pass,\" about his years in the music industry.\nwww.johnfordcoley.com", "url": "https://www.facebook.com/events/1675656812706888/", "source": "Facebook", "name": "John Ford Coley at Green Wood Coffee House", "date": "2016-09-09T20:00:00-04:00"}, {"description": "At Woodstock, as a New York kid barely known outside the coffeehouse circuit in Greenwich Village, she sang her song, \"Beautiful People\" and inspired the first panorama of candles and cigarette lighters ever raised at a concert event. That, in turn, moved the young singer to write \"Lay Down (Candles in the Rain\"), which sold more than one million copies in 1970 and prompted Billboard, Cashbox, Melody Maker, Record World, and Bravo to anoint her as female vocalist of the year. Her single, \"Brand New Key,\" topped the charts in 1971.\nWith guitar in hand and a combination of amazing vocal talent, disarming humor, and a vibrant engagement with life, she was booked as the first solo pop/rock artist ever to appear at the Royal Albert Hall, Carnegie Hall, and the Metropolitan Opera House, and later opened the New Metropolitan Opera House in New York, the Sydney Opera House, and in the General Assembly of the United Nations, where she was invited to perform on many occasions as delegates greeted her performances with standing ovations.\nThe top television hosts of all time -- Ed Sullivan, Johnny Carson, and Dick Cavett -- battled to book her.\nUNICEF made her its spokesperson; Jimi Hendrix's father introduced her to the multitude assembled for the twentieth anniversary of Woodstock. Her records continued to sell -- more than eighty million to date. She's had her songs covered by singers as diverse as Cher, Dolly Parton, and Macy Gray. She's raised a family, won an Emmy, opened a restaurant, and written a musical about Wild Bill Hickok and Calamity Jane.\nThis is a rare opportunity to experience Melanie live and in person in an intimate venue. Don't miss it!\nwww.melaniesafka.com", "url": "https://www.facebook.com/events/1653085994944878/", "source": "Facebook", "name": "Melanie at Green Wood Coffee House", "date": "2016-09-16T20:00:00-04:00"}, {"description": "THIS EVENT HAS BEEN POSTPONED TO LATER IN THE POLITICAL SEASON.  PLEASE CHECK OUT THE NEW NOVEMBER 1ST PROGRAM, \"JOKES IN PROCESS\" THAT WE HAVE PUT INTO ITS PLACE.  \n\nThe presidential candidates have been HILARIOUS this year, but now let's see how the professionals do.\nJoin the Emergent Art's Theater and the UnClub as they present \"UnDebateable, the UnPresidential Debates\".\n\nIf you would like to be a part of this historic event, either as a moderator, an interview, and audience reporter, or an actual campaign spokeperson, or if you can do an impression of a candidate, please click the 'Going' button.  If you can't commit, but you are interested in following this event, click 'Maybe' and we will keep you informed.\n\nWe are also looking for folks who can help us stream a webcast of this event.\n\nWant to be a sponsor?  We'll take that too.", "url": "https://www.facebook.com/events/1690454564522707/", "source": "Facebook", "name": "UnDebateable, the UnPresidential Debates - Clown Car to the White House", "date": "2016-09-18T21:00:00-04:00"}, {"description": "\"I think the bottom of the barrel is where the answers are.\"—Fred Eaglesmith", "url": "https://www.facebook.com/events/183894411968312/", "source": "Facebook", "name": "The Fred Eaglesmith Traveling Steam Show", "date": "2016-09-22T20:00:00-04:00"}, {"description": "New music from an OUT magazine OUT100 featured music honoree", "url": "https://www.facebook.com/events/1679614935644801/", "source": "Facebook", "name": "Melissa Ferrick", "date": "2016-10-01T20:00:00-04:00"}, {"description": "Lou and Peter Berryman were both raised in Appleton, WI, and began playing music together in high school during the sixties. During the following nomadic decade, Lou studied classical voice and music theory in college while Peter continued an unfocused fascination with surrealist art, beatnik poetry, and jug band music. Early influences of American and British musical comedy and folk music fed a growing repertoire of original songs. A brief marriage in the early seventies resolved into a lifelong friendship, and by the late seventies and early eighties the two were honing their skills playing regular weekly concerts in Madison, becoming full-time musicians and songwriters in 1979. During those early years they wrote new songs every week, many about the history, cheese, beer and strange politics of their home state. By the mid '80s they were traveling all across the country, still writing and singing, but now with a broader perspective, finding that the quirks of their home state were not so much Midwestern as human. In twenty-five years of performing together, Lou and Peter have released twenty albums and four songbooks worth of hilarious, quirky, yet oddly profound songs, rich with word play and interesting images. Pete Seeger, Tom Paxton and Tom Lehrer count themselves among their fans. Their work has appeared in numerous compilations such as the popular \"Rise Up Singing\" songbook, in periodicals like \"SING OUT! Magazine\", and in many audio compilations. Berryman songs are being sung around the world by a legion of professional musicians including Peter, Paul and Mary, Garrison Keillor and Peggy Seeger. They have appeared numerous times on such national programs as NPR's \"A Prairie Home Companion\" and \"Weekend Edition.\"\nwww.louandpeter.com", "url": "https://www.facebook.com/events/964923176923370/", "source": "Facebook", "name": "Lou and Peter Berryman at Green Wood Coffee House", "date": "2016-10-07T20:00:00-04:00"}, {"description": "lauriemcclain.com", "url": "https://www.facebook.com/events/197527007266742/", "source": "Facebook", "name": "Laurie McLain at Green Wood Coffee House", "date": "2016-10-14T20:00:00-04:00"}, {"description": "There is no better storyteller than Chuck Brodsky.  Ranging from poignant to hilarious, his songs are about the little things in the lives of everyday people.  Chuck's soulful and compassionate voice brings his characters to life, and is the perfect instrument for infusing his lyrics with heartfelt humanity or biting wit. His spoken introductions to his songs can be as spellbinding as his colorful lyrics, which he brings to life with a well-travelled voice and a delivery that's natural and conversational. His groove-oriented strumming and fingerpicking draw on influences from the mountains of western North Carolina where he now lives, and from lots of different good old traditional folk stuff of all kinds. Chuck is widely known for his many wonderful songs about the heroes -- and zeroes -- of baseball. His latest CD is The Baseball Ballads 2.\nwww.chuckbrodsky.com", "url": "https://www.facebook.com/events/147078752335941/", "source": "Facebook", "name": "Chuck Brodsky at Green Wood Coffee House", "date": "2016-10-28T20:00:00-04:00"}, {"description": "http://www.donhenry.com/", "url": "https://www.facebook.com/events/1513216465641630/", "source": "Facebook", "name": "Don Henry at Green Wood Coffee House", "date": "2016-11-18T20:00:00-05:00"}]