[{"url": "https://www.facebook.com/events/768338616627804/", "source": "Facebook", "date": "2015-10-24T09:00:00-04:00", "description": "Make a Difference Day is hailed as “The Nation’s Largest Day of Service.” Come celebrate the 23rd anniversary of this event by volunteering at Dicken Woods Nature Area! Join NAP, the Friends of Dicken Woods, and neighbors to improve trails in this special woodland. We will be working on trail maintenance and removing invasive shrubs. Visit http://dickenwoods.org/ for more information about this nature area. Meet at the end of Dicken Drive, off South Maple Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "name": "Stewardship Workday - Dicken Woods Nature Area"}, {"url": "https://www.facebook.com/events/1077422922270836/", "source": "Facebook", "date": "2015-10-24T10:00:00-04:00", "description": "GameStart School  presents our Fall Festival!!\n\nJoin us for this FREE event on October 24th, 10am to 2pm at Game Start School, located in Plymouth road mall, Ann Arbor.\n\nThe fabulous fun, for kids of all ages, will be brimming with games to play, things to create, tournaments, prizes and badges to be won, and even more! It will also showcase our exciting fall class curriculum and workshops!\n\nCostumes are highly encouraged, so come dressed in awesome Halloween spirit - there will be prizes for the most creative costumes - details to come!\n\nWe will once again be joined by many of our fabulous partners from the Ann Arbor area's Education, Tech, and Gaming communities. These innovative exciting companies and organizations will have awesome activities as you visit their stations!\n\n\nWe can't wait for all the excitement! LET'S MAKE IT HUGE - please invite all your friends and family! \n\nFor more information about GameStart School visit our website www.gamestartschool.org\n\nFor further questions about the Fall Festival, contact us at festival@gamestartschool.org or call 734.926.9213", "name": "GameStart Fall Festival"}, {"url": "https://www.facebook.com/events/484323778419168/", "source": "Facebook", "date": "2015-10-24T13:00:00-04:00", "description": "Make a Difference Day is hailed as “The Nation’s Largest Day of Service.” Come celebrate the 23rd anniversary of this event by volunteering to help remove invasive shrubs. Don’t forget to hike all the way into Molin to view the park’s spectacular bur oak! Please meet at the entrance near the corner of Powell Avenue and Columbia Avenue.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "name": "Stewardship Workday - Molin Nature Area"}, {"url": "https://www.facebook.com/events/1642479922685105/", "source": "Facebook", "date": "2015-10-24T14:00:00-04:00", "description": "Halloween is in the air, so join us as we enGRAVE some ghoulish gourds! Recommended for kids 5 and up (and grownups), though littles are welcome to join their big brothers and sisters. All materials provided. This event is free, but reservations are required; please secure your spot by emailing adriennes@luckysmarket.com", "name": "PUMPKIN CARVING"}, {"url": "https://www.facebook.com/events/1655972631314066/", "source": "Facebook", "date": "2015-10-24T18:00:00-04:00", "description": "The Ann Arbor District Library, the Library of Michigan and the Library of Michigan Foundation  present this special event, featuring 15 authors who were awarded the distinction of having their work selected as a Michigan Notable Book.\n\nThe evening includes a panel discussion by 4 distinguished notable authors, followed by an elegant reception in the Library lobby with music, refreshments, a book signing and the chance to mingle with all 15 authors at this event.\n\nEvery year, the Library of Michigan selects up to twenty of the most notable books, either written by a Michigan resident or about Michigan or the Great Lakes.\n\nThe Night Of Notable Authors features:\n\n6 – 7:30 pm Panel Discussion:\n\nModerated by Anna Clark (\"A Detroit Anthology\" a 2015 Michigan Notable Book). \nPanelists include:\n- Michigan Outdoor Writer and Poet Jerry Dennis (several Michigan Notable Book titles, including \"The Living Great Lakes: Searching For The Heart Of The Inland Seas\"  a 2004 Michigan Notable Book)\n- Mystery Author Loren Estleman (\"Nicotine Kiss: An Amos Walker Novel\" a 2007 Michigan Notable Book)\n- Memoirist and True Crime Author Mardi Jo Link (two Michigan Notable Book titles, including \"Bootstrapper: From Broke To Badass On A Northern Michigan Farm\" a 2014 Michigan Notable Book)\n\n7:30 – 8:30 pm Reception and Booksigning\nEnjoy exquisite music by harpist Deborah Gabrion, elegant refreshments, and the chance to mingle with 15 Michigan Notable Authors:\nSteve Amick\nAnna Clark\nJack Dempsey\nJerry Dennis\nLoren Estleman\nDon Faber\nLarry Glazer\nLolita Hernandez\nMichael Hodges\nSally Howell\nSharon Kegerries\nMardi Jo Link\nDonald Lystra\nAnne-Marie Oomen\nBarbara Rylko-Bauer\n\nBooks will be for sale at the event, courtesy of Literati Bookstore and Aunt Agatha’s Mystery Bookshop.  For more information about this event, visit aadl.org", "name": "Night Of Notable Authors"}, {"url": "https://www.facebook.com/events/843147115782248/", "source": "Facebook", "date": "2015-10-24T21:00:00-04:00", "description": "Sat. October 24 | 18+ | 9pm | $12 adv. $14 Day of \n\nLanghorne Slim\nwith Fort Frances\n\nThere is nothing like the challenges and camaraderie of the road to inspire a songwriter who thrives upon the emotional energy and exhilaration only travel can deliver. Some singers are devoted to the pursuit of perpetual motion, and Langhorne Slim releases his wild soul in ways that come out of the discipline of live performance.\n\nThe 13 songs that compose Langhorne Slim & The Law's new \"The Way We Move\" are road-tested, rollicking and very rock 'n' rolling tunes that the songwriter perfected with his loyal band, and come out of the kind of good times and bad experiences that songwriters of Langhorne's lofty stature can turn into life-affirming rock 'n' roll. You could also call what Langhorne Slim does folk music, but then there's his sly, charming and open-hearted feel for pop music -- those summertime melodies that nudge you into a grin even when the song is about something bad.\n\nFor Langhorne Slim -- Pennsylvania-born self-taught guitarist who moves to Brooklyn at 18, begins feeling out his place in a burgeoning punk-folk scene, wends his way to the West Coast, and finds himself celebrated from Newport to Portland as one of today's most original singers and songwriters -- \"The Way We Move\" represents the sound of a band devoted to living in the moment. Riding the success of his 2009 full-length Be Set Free, Langhorne went through some changes over the last three years -- he lost his beloved grandfather, who is the subject of the new record's moving \"Song for Sid,\" and moved on from a relationship that had lasted five years.\n\nAnd there was the physical moving -- the literal side of the record's title. Pulling up stakes from his home of two years, Portland, Ore., Langhorne also has been touring non-stop with The Law. As he says, \"I'm in a bit of a transitional period -- currently, the road will be home. That's just kind of my spirit, to be slightly restless.\" Perfecting their rangy sound out on the endless grey ribbon, Langhorne and The Law -- bassist Jeff Ratner, drummer Malachi DeLorenzo and banjo player and keyboardist David Moore -- went down to rural Texas in the summer of 2011 to work on new material. With some 30 tunes to consider, the quartet soaked up the Lone Star sunshine and developed arrangements and approaches for Langhorne's latest batch of songs.", "name": "Ann Arbor's 107one Presents: Langhorne Slim & The Law 10/24/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1188606334486694/", "source": "Facebook", "date": "2015-10-24T21:00:00-04:00", "description": "Come out and celebrate the return of Massacre with Wolverine State Brewing Co. and Dirty Deville! Music starts at 9 pm. \n\nBand info: \nhttps://dirtydeville.bandcamp.com/", "name": "Dirty Deville at Wolverine State Brewing Co"}, {"url": "https://www.facebook.com/events/1681564905392090/", "source": "Facebook", "date": "2015-10-25T13:00:00-04:00", "description": "We’re cooking up the creepiest cookies in town! The ghouls from our Bakery Team will show you how to make your own natural freaky frosting using veggies, then we will help you concoct a ghastly cookie creation guarantted to scare! Recommended for kids 4 and up, though littles are welcome to join their big brothers and sisters. This event is free, but reservations are required; please save your spot by emailing adriennes@luckysmarket.com", "name": "LUCKY‘S KIDS CLUB - FREAKY FROSTING!"}, {"url": "https://www.facebook.com/events/1658984461047383/", "source": "Facebook", "date": "2015-10-25T13:00:00-04:00", "description": "Our friends from Paw Paw Brewing Company will be here to share some of their delicious brews. Local brews- they'll cure what ales you!", "name": "Paw Paw Brewery Beer Tasting"}, {"url": "https://www.facebook.com/events/714990331966680/", "source": "Facebook", "date": "2015-10-25T17:00:00-04:00", "description": "Literati is pleased to welcome poets Ken Mikolowski and Michael Lauchlan, in celebration of their recent publications with Wayne State University Press.\n\nKen Mikolowski is the author of four previous books, Thank You Call Again, little mysteries, Big Enigmas, and Remember Me. His poems have been published in Brooklyn Rail, Hanging Loose, Exquisite Corpse, and Abandon Automobile, A Detroit Anthology, and have been recorded by the Frank Carlberg Group. Mikolowski teaches poetry writing at the University of Michigan and, along with his wife Ann, was publisher, editor, and printer of The Alternative Press. He lives in Ann Arbor.\n\nMichael Lauchlan’s poems have appeared in many publications and have been anthologized in Abandon Automobile (Wayne State University Press, 2001) and A Mind Apart. His earlier collections are And the Business Goes to Pieces and Sudden Parade.", "name": "Poetry at Literati: Ken Mikolowski & Michael Lauchlan"}, {"url": "https://www.facebook.com/events/168511443496191/", "source": "Facebook", "date": "2015-10-26T19:00:00-04:00", "description": "Literati is pleased to welcome authors Jeff Parker and Pasha Malla in support of Erratic Fire, Erratic Passion (Featherproof, 2015), with special guest Sean Kilpatrick\n\nErratic Fire, Erratic Passion, a collection of poetry by Jeff Parker and Pasha Malla, is composed of the words of professional athletes, and illustrated by Nathan McKee. The content of post-game interviews and sports chatter is so often meaningless, if not insufferable, and yet there are athletes like Metta World Peace who transcend lame clichés and rote patter, who use language in surprising ways, who can be funny and shocking and insightful and alarmingly sincere — pure poetry. Muhammad Ali offered dazzling displays of lexical wizardry, and Allen Iverson’s infamous “practice” rant shifted the post-game press conference from the banal to the absurd. Featuring an introduction by award-winning sports writer Bethlehem Shoals, Erratic Fire, Erratic Passion is a celebration of these rare and exceptional moments. Various poetic forms and line-breaks highlight — or, in the words of Deion Sanders, “deem to set a candor on” — the sophisticated, sublime, and surprising performances of language made by professional athletes.\n\nJeff Parker's books include Where Bears Roam the Streets: A Russian Journal, the novel Ovenman, and the short story collection The Taste of Penny. He teaches in the MFA program for poets and writers at the University of Massachusetts, Amherst, where he lives.\n\nPasha Malla is the author of four books, which have been listed for or won the Commonwealth Prize, the Dublin-IMPAC Literary Award, the Giller Prize, and the Trillium Book Award. He's the winner of two National Magazine Awards for humor writing and an Arthur Ellis Award for crime fiction. He lives in Toronto.\n\nSean Kilpatrick lives in Detroit and is published or forthcoming in Boston Review, New York Tyrant, BOMB, Columbia Poetry Review, Fence, evergreen review, Sleepingfish, Hobart, and Best American Essays 2014 notably. Anatomy Courses (2012) was co-written with Blake Butler. A novella, Sucker June (Lazy Fascist Press), was published in May 2015.", "name": "Poetry at Literati: Jeff Parker, Pasha Malla, & Sean Kilpatrick"}, {"url": "https://www.facebook.com/events/1655017594775528/", "source": "Facebook", "date": "2015-10-26T21:00:00-04:00", "description": "Monday, October 26 | 9pm | 18+ | $12 adv./ $14 day of\n\nTelekinesis - We've all heard plenty about the astonishing debut and the \"difficult\" sophomore release. But let's pause for a moment to consider the role of album four in rock and roll history. A few key examples: Radiohead – Kid A, R.E.M. – Lifes Rich Pageant, Talking Heads – Remain in Light, Wilco – Yankee Hotel Foxtrot, David Bowie – Hunky Dory ... you see where we're going with this. Album four is an opportunity for artists to reinvent, and frequently revitalize, themselves. The willingness to abandon familiar work habits and signature sounds can be risky, but it's often the difference between a safe, predictable career and a bold transformation that signals the beginning (to quote another pretty amazing fourth LP) of a new age for artist and audience alike. WSG: Say Hi & Girls Who Care\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/482", "name": "Telekinesis w/ Say Hi & Girls Who Care 10/26/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1613304408933212/", "source": "Facebook", "date": "2015-10-27T19:00:00-04:00", "description": "Louise Glück is one of America’s finest contemporary poets. Winner of the Pulitzer Prize, Glück is a former Poet Laureate of the United States and the author of a dozen widely acclaimed books. Stephen Dobyns, writing in the New York Times Book Review, said “no American poet writes better than Louise Glück, perhaps none can lead us so deeply into our own nature.” Pulitzer Prize winner Robert Hass has called her “one of the purest and most accomplished lyric poets now writing.”\n\tEvocative and lyrically graceful, Glück's work is noted for its emotional intensity and technical precision. Glück's considerable accomplishments as a poet are apparent in her latest volume, Poems: 1962-2012. Her new collection of poems, Faithful and Virtuous Night, won the 2014 National Book Award for Poetry.\n\tGlück's recent books are A Village Life (2009), which was shortlisted for the International Griffin Poetry Prize, and Averno (2006), which was nominated for the National Book Award, won the L.L. Winship/PEN New England Award, and was listed by The New York Times Book Review as one of the 100 Notable Books of the Year.\n\tHer earlier work includes The Seven Ages (2001); Vita Nova (1999), winner of The New Yorker Magazine’s Book Award in Poetry; Meadowlands (1996); The Wild Iris (1992), which received the Pulitzer Prize and the Poetry Society of America's William Carlos Williams Award; Ararat (1990), which received the Rebekah Johnson Bobbitt National Prize for Poetry; and The Triumph of Achilles (1985), which received the National Book Critics Circle Award, Boston Globe Literary Press Award, and the Poetry Society of America's Melville Kane Award.The First Four Books of Poems (1999) collects the early work that helped establish Glück as one of America's most original poets. Her book of essays, Proofs and Theories (1994), was awarded the PEN/Martha Albrand Award for Nonfiction.\n\tIn 2003, Glück was named the 12th Poet Laureate Consultant in Poetry by the Library of Congress. That same year, she was named the judge for the Yale Series of Younger Poets, and served in that position through 2010.\n\tIn addition to the Pulitzer Prize and National Book Critics Circle Award, Glück has received many honors. In 2001, she was awarded the Bollingen Prize, given biennially for a poet's lifetime achievement. And in 2008, Glück received the Wallace Stevens Award for “outstanding and proven mastery in the art of poetry.” Her other honors include the Lannan Literary Award for Poetry, Sara Teasdale Memorial Prize, M.I.T. Anniversary Medal, the Pushcart Prize, and a fellowship from the National Endowment for the Arts.\n\tGlück taught at Williams College for 20 years and is currently Rosenkranz writer-in-residence at Yale University. She is a member of the American Academy and Institute of Arts and Letters, and in 1999 was elected a Chancellor of the Academy of American Poets.\n\tThe Zell Visiting Writers Series is presented by the Helen Zell Writers’ Program in partnership with the University of Michigan Museum of Art, with support from the Department of English Language & Literature, the Office of the Vice President for Research, and Janey Lack. For additional information visit lsa.umich.edu/writers.", "name": "Louise Glück Zell Distinguished Poet in Residence Poetry Reading"}, {"url": "https://www.facebook.com/events/1481526608833799/", "source": "Facebook", "date": "2015-10-27T21:00:00-04:00", "description": "Cosmos-wrangling Americana upstart Israel Nash [http://www.israelnash.com/] returns from Texas Hill Country with his Silver Season, a deeply gorgeous and wholly immersive nine-song set that plays less like an album, and more like a cross section of time and space. The man's fourth LP ventures farther down the acid-soaked trail blazed by 2013's Rain Plans, arriving in lush and expansive territory. Here, this Missouri son sounds more assured than ever, supported by his highly capable band and production inspired by psychedelic greats. Israel Nash's Silver Season is best played loudly, and sounds wonderful in headphones. \n\nw/ Caroline Reese - http://www.carolinereesemusic.com\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/477", "name": "Israel Nash 10/27/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/425093224345197/", "source": "Facebook", "date": "2015-10-29T17:30:00-04:00", "description": "Louise Glück is one of America’s finest contemporary poets. Winner of the Pulitzer Prize, Glück is a former Poet Laureate of the United States and the author of a dozen widely acclaimed books. Stephen Dobyns, writing in the New York Times Book Review, said “no American poet writes better than Louise Glück, perhaps none can lead us so deeply into our own nature.” Pulitzer Prize winner Robert Hass has called her “one of the purest and most accomplished lyric poets now writing.”\n\tEvocative and lyrically graceful, Glück's work is noted for its emotional intensity and technical precision. Glück's considerable accomplishments as a poet are apparent in her latest volume, Poems: 1962-2012. Her new collection of poems, Faithful and Virtuous Night, won the 2014 National Book Award for Poetry.\n\tGlück's recent books are A Village Life (2009), which was shortlisted for the International Griffin Poetry Prize, and Averno (2006), which was nominated for the National Book Award, won the L.L. Winship/PEN New England Award, and was listed by The New York Times Book Review as one of the 100 Notable Books of the Year.\n\tHer earlier work includes The Seven Ages (2001); Vita Nova (1999), winner of The New Yorker Magazine’s Book Award in Poetry; Meadowlands (1996); The Wild Iris (1992), which received the Pulitzer Prize and the Poetry Society of America's William Carlos Williams Award; Ararat (1990), which received the Rebekah Johnson Bobbitt National Prize for Poetry; and The Triumph of Achilles (1985), which received the National Book Critics Circle Award, Boston Globe Literary Press Award, and the Poetry Society of America's Melville Kane Award.The First Four Books of Poems (1999) collects the early work that helped establish Glück as one of America's most original poets. Her book of essays, Proofs and Theories (1994), was awarded the PEN/Martha Albrand Award for Nonfiction.\n\tIn 2003, Glück was named the 12th Poet Laureate Consultant in Poetry by the Library of Congress. That same year, she was named the judge for the Yale Series of Younger Poets, and served in that position through 2010.\n\tIn addition to the Pulitzer Prize and National Book Critics Circle Award, Glück has received many honors. In 2001, she was awarded the Bollingen Prize, given biennially for a poet's lifetime achievement. And in 2008, Glück received the Wallace Stevens Award for “outstanding and proven mastery in the art of poetry.” Her other honors include the Lannan Literary Award for Poetry, Sara Teasdale Memorial Prize, M.I.T. Anniversary Medal, the Pushcart Prize, and a fellowship from the National Endowment for the Arts.\n\tGlück taught at Williams College for 20 years and is currently Rosenkranz writer-in-residence at Yale University. She is a member of the American Academy and Institute of Arts and Letters, and in 1999 was elected a Chancellor of the Academy of American Poets.\n\tThe Zell Visiting Writers Series is presented by the Helen Zell Writers’ Program in partnership with the University of Michigan Museum of Art, with support from the Department of English Language & Literature, the Office of the Vice President for Research, and Janey Lack. For additional information visit lsa.umich.edu/writers.", "name": "Louise Glück Zell Distinguished Poet in Residence Poetry Reading"}, {"url": "https://www.facebook.com/events/1490496491271759/", "source": "Facebook", "date": "2015-10-30T19:00:00-04:00", "description": "The annual Devils Night Nite ride is back again for another fun filled adventure!\n\nDue to the difficulty of night riding and the nature of the Local Loop, this will be an advanced level ride.  If you would not be comfortable riding Poto, Highland, or Brighton at Night, this may not be the best choice in rides. It is recommended that you have two working and fully charged front lights, and a rear red light, the ride can last up to 3 hours (based on group preferences).  \n\nWe'll meet at 7pm and wheels turning at 7:30pm.\n\nStay tuned for the meeting location, but near Bluffs/Kuebler-Langford.  Bonfire and/or Bar afterwards.\n\nCostumes Strongly Recommended.  \n\nBonus points for coming to this and the PSSWC the following day, on Halloween!!!", "name": "Ann Arbor Local Loop Devils Night Nite Ride"}, {"url": "https://www.facebook.com/events/603608746443790/", "source": "Facebook", "date": "2015-10-30T19:00:00-04:00", "description": "Come join us at the Ann Arbor Farmers Market on Friday, October 30th for a casual, social ride around town and a playful Halloween/Fall theme to boot. Come as you are, or come in disguise. Your costume, favorite fall get-up, or decorated bike will all be welcome and on show as we roll around town and ding those bells. The route, again, will not exceed 10 miles and will remain within the city limits.\n\nOur mid-ride stop will be extended to allow us a break and a chance to enjoy the aptly themed festivities. Be sure to bring lights for the dark (bonus points for themed lighting)! Check back later for this month's ride route and to stay up on the happenings.\n\n\nWhat's Bike-in?\nSee the community page:\nhttps://www.facebook.com/bikeinannarbor/info?tab=page_info\n\nOR read below\n\nBike-in is: Slow bike rides throughout Ann Arbor for everyone. Post-ride fun with friends, neighbors, and visitors around the community.\n\nEach ride we will begin at the listed location & time, ride casually, then finish the ride by \"biking-in\" to a post-ride time together at a local establishment, green space, or other friendly host setting (i.e. Bike-in :: Movie (outdoor), Creamery (ice cream), Picnic (potluck), Garden (beer garden), etc.).\n\nRides will be open and friendly to all. For gathering information, times, locations, riding routes, weather updates, etc. like/follow the page or visit for updates.\n\nPlease practice safe riding and abide by all legal riding rules at all times, especially while riding with a Bike-in community. Be sure to provide your own helmet, riding lights, and other appropriate accessories.", "name": "Bike-in :: Halloween"}, {"url": "https://www.facebook.com/events/1637196136558152/", "source": "Facebook", "date": "2015-10-30T22:00:00-04:00", "description": "There is a time to be good and a time to be bad...\nBut this time-\nGood time for all to be had!\n\nYour soul is invited to our home to celebrate The Day Of The Dead with a traditional twist of dancing, food, and drinks. \n\nFeaturing DJ Graffiti, burlesque dancers, face painting, VIP lounge, dancing, photo booth, and specialty cocktails.\n\nTickets starting at $20 and can be purchased in advance or at the door.", "name": "Dia De Los Muertos Fiesta"}, {"url": "https://www.facebook.com/events/1505517749773403/", "source": "Facebook", "date": "2015-10-31T07:00:00-04:00", "description": "Add a stop at Lucky's Market to your candy route! We'll have plenty of treats (and maybe a few healthy tricks!) on hand to fill your candy bag. Be sure to stop by every department to snag a treat! Plus- post a picture of yourself to our Facebook page- in costume, please!- and be entered to win a $50 gift card.", "name": "Trick or Treat!"}, {"url": "https://www.facebook.com/events/455328241341532/", "source": "Facebook", "date": "2015-11-01T13:00:00-05:00", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour: Engaging with Art"}, {"url": "https://www.facebook.com/events/109101196116796/", "source": "Facebook", "date": "2015-11-01T15:00:00-05:00", "description": "This program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.What is the self and who gets to define it? This was an important concern of artists in the decade between the fall of the Berlin Wall and 9/11. Join U-M Professor of Theatre and Drama Anita Gonzalez for a theatrical exploration of the artwork in UMMA’s exhibition Come as You Are: Art of the 1990s. Participants will use gesture to investigate and respond to visual images, highlighting personal and political meanings embedded in the work. Gonzalez will lead a discussion linking experiences of the gallery artwork to larger trends of the decade.Anita Gonzalez is Professor of Theatre and Drama at the University of Michigan where she leads the Global Theatre and Ethnic Studies Minor. Her research and publication interests are in the fields of intercultural performance, particularly the way in which performance reveals histories and identities in the Americas and in transnational contexts.Lead support for the exhibition Come as You Are: Art of the 1990s is provided by the University of Michigan Office of the Provost and the University of Michigan Health System. Additional support is provided by Samantha and Ross Partrich, Andrea and Joel Brown, the University of Michigan CEW Frances and Sydney Lewis Visiting Leaders Fund, Department of the History of Art, Residential College, and Department of American Culture.", "name": "In Conversation: Self as Story:  Embodying Art in the Gallery"}, {"url": "https://www.facebook.com/events/1687639351466507/", "source": "Facebook", "date": "2015-11-02T19:00:00-05:00", "description": "As part of our ongoing Fiction at Literati Series, we're pleased to welcome Marlon James, who will read from his latest, A Brief History of Seven Killings. James recently won the 2015 Man Booker Prize.\n\nSeating will be very limited; it's free, and first-come, first-served. \n\n“How to describe Marlon James’s monumental new novel A Brief History of Seven Killings? It’s like a Tarantino remake of The Harder They Come but with a soundtrack by Bob Marley and a script by Oliver Stone and William Faulkner, with maybe a little creative boost from some primo ganja. It’s epic in every sense of that word: sweeping, mythic, over-the-top, colossal and dizzyingly complex. It’s also raw, dense, violent, scalding, darkly comic, exhilarating and exhausting—a testament to Mr. James’s vaulting ambition and prodigious talent.”\n—The New York Times \n\nIn A Brief History of Seven Killings, Marlon James combines brilliant storytelling with his unrivaled skills of characterization and meticulous eye for detail to forge an enthralling novel of dazzling ambition and scope.\n\nOn December 3, 1976, just before the Jamaican general election and two days before Bob Marley was to play the Smile Jamaica Concert to ease political tensions in Kingston, seven gunmen stormed the singer’s house, machine guns blazing. The attack wounded Marley, his wife, and his manager, and injured several others. Little was officially released about the gunmen, but much has been whispered, gossiped and sung about in the streets of West Kingston. Rumors abound regarding the assassins’ fates, and there are suspicions  that the attack was politically motivated.\n\nA Brief History of Seven Killings delves deep into that dangerous and unstable time in Jamaica’s history and beyond. James deftly chronicles the lives of a host of unforgettable characters – gunmen, drug dealers, one-night stands, CIA agents,  even ghosts – over the course of thirty years as they roam the streets of 1970s Kingston, dominate the crack houses of 1980s New York, and ultimately reemerge into the radically altered Jamaica of the 1990s. Along the way, they learn that evil does indeed cast long shadows, that justice and retribution are inextricably linked, and that no one can truly escape his fate.\n\nGripping and inventive, shocking and irresistible, A Brief History of Seven Killings is a mesmerizing modern classic of power, mystery, and insight.", "name": "Marlon James"}, {"url": "https://www.facebook.com/events/926823920720710/", "source": "Facebook", "date": "2015-11-03T14:00:00-05:00", "description": "During the 1920s the Soviet Union emerged on the world stage. The first decade was full of hope for a new social order.  A group of young artists known as Constructivists, spearheaded in part by Vladimir and Georgy Stenberg, championed an art that promoted the egalitarian ideals of the New Order and contributed to the growth of the Soviet Union. They advocated for a utilitarian art that spoke to the masses and their revolutionary aesthetic can still be seen in advertisements and other materials made for the public eye today. Among their most provocative and visionary works were posters advertising Soviet films. UMMA docents will introduce this exhibition that features posters by the Stenbergs and others for some of early cinema’s most inventive films.", "name": "Guided Tour: Soviet Constructivist Posters: Branding the New Order"}, {"url": "https://www.facebook.com/events/1061015660576432/", "source": "Facebook", "date": "2015-11-03T17:30:00-05:00", "description": "In this informal lively conversation offering different perspectives, U-M Institute for Humanities Curator Amanda Krugliak, independent filmmaker Donald Harrison, sound artist and U-M Stamps Professor Stephanie Rowden, U-M History of Art Professor David Doris, and Ann Arbor Film Festival Executive Director Leslie Raymond consider the current UMMA exhibition Jem Cohen: Life Drawing. The group will discuss the work's travelogue-like structure, its unique combinations of images and sound, movement and stillness, which together give a sense of creative journeying.Browse the exhibition from 5:30-6pm. Discussion in the Multipurpose Room begins at 6pm.This program is part of the Institute for Humanities Year of Conversions, a year-long examination of change and transformation and co-presented with UMMA.Lead support for Jem Cohen at UMMA is provided by the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the Susan and Richard Gutow Fund and the Robert and Janet Miller Fund.", "name": "Same World/Different Days... the Intuitions, Chartings and Navigations of Jem Cohen"}, {"url": "https://www.facebook.com/events/1497556230544428/", "source": "Facebook", "date": "2015-11-03T19:00:00-05:00", "description": "Literati welcomes local independent press Short Flight / Long Drive (a division of Hobart: Another Literary Journal and edited by Elizabeth Ellen), presenting a reading from recent SF/LD authors Mira Gonzalez, Tao Lin, and Uzodinma Okehi.\n\nMira Gonzalez [b. 1992] is from Los Angeles, California. She is the author of I Will Never Be Beautiful Enough to Make Us Beautiful Together (Sorry House, 2013), which was nominated for The Believer Poetry Award and The Goodreads Choice Award. Her work has been published widely in print and online.\n\nTao Lin is the author of the novels Taipei (2013), Richard Yates (2010), Eeeee Eee Eeee (2007), the novella Shoplifting from American Apparel (2009), the story-collection Bed (2007), and other books. He edits Muumuu House and lives in New York.\n\nUzodinma Okehi spent 2 years handing out zines on the subway. Wasn’t as fun as he thought. His work has appeared in Pank, Hobart, Bartleby Snopes, also many, many places, no doubt, you’ve never heard of. He has an MFA in writing from New York University. He lives in Brooklyn. His son is 8 yrs old, smiles a lot, (too much?), and will absolutely, cross you over and drain a jumper in your face.", "name": "Mira Gonzalez, Tao Lin, Uzodinma Okehi (Short Flight / Long Drive)"}, {"url": "https://www.facebook.com/events/1631299103808637/", "source": "Facebook", "date": "2015-11-05T17:10:00-05:00", "description": "This event takes place at the Michigan Theater, 603 E Liberty St, Ann Arbor, MI 48104.\n\t\nCelebrated for a visual language that brings together unexpected materials and radically unconventional techniques, artist Julian Schnabel has been a pioneering, and controversial, figure since his first solo exhibition in 1979. As part of a group of 1980s artists known as Neo-Expressionists (a term that he would reject), Schnabel wanted to return to painting pre-abstraction, and forged a practice that encompassed figuration, personal narratives, and references to history and mythology.  His paintings, sculptures, and works on paper have been the subject of numerous exhibitions at museums worldwide, including the current exhibition of his work at the University of Michigan Museum of Art (on view through September 27). Also a renowned filmmaker, in 1996 Schnabel wrote and directed the feature film Basquiat about artist Jean-Michel Basquiat, produced by Peter Brant. Brant Publications, Inc., is a leading art publisher whose titles include Art in America and Interview, among other important art magazines. Mr. Brant is also an entrepreneur, manufacturing executive, philanthropist, sportsman, and art collector who has a personal passion for contemporary art.\n\t\nThe exhibition Julian Schnabel was organized by the Brant Foundation Art Study Center.  Lead support for UMMA’s installation is provided by Joseph and Annette Allen, the University of Michigan Office of the Provost, the University of Michigan Health System, the Richard and Rosann Noel Endowment Fund, and Retirement Income Solutions.", "name": "UMMA & Penny W. Stamps Speaker Series Present: Julian Schnabel in Dialogue with Peter Brant"}, {"url": "https://www.facebook.com/events/874761555971141/", "source": "Facebook", "date": "2015-11-05T17:10:00-05:00", "description": "Michigan Theater 603 E Liberty StAnn Arbor, MI 48104 \n\nSpanish by birth and Italian by choice, architect and designer Patricia Urquiola creates work that is unconventional, emphatic, and experimental, blending humanist sensibilities and technical expertise.  Since opening her own studio in 2001, Urquiola has alternated product design for major international companies with architecture projects for private homes, hotels, and show rooms.  Urquiola's work has earned numerous design awards, including the International Design Yearbook, IMM Cologne, Good Design Awards of the Chicago Athenaeum, and the Red Dot Award.  She has been nominated designer of the year for Elle Decoration International Design Awards, Wallpaper magazine, AD Spain, Maison & Object Paris, A&W Germany, and the Interior Design Hall of Fame, and her products are present in the permanent collection of museums including MoMA NY and Triennale Milano.\tThis event is co-sponsored with the University of Michigan Museum of Art.", "name": "Penny W. Stamps Speaker Series Presents Patricia Urquiola: Thinking Hands"}, {"url": "https://www.facebook.com/events/533195543506273/", "source": "Facebook", "date": "2015-11-06T17:00:00-05:00", "description": "Enjoy live music, engaging activities and special exhibitions at Fridays After 5! With all of UMMA’s galleries remaining open until 8pm, this exciting series provides a festive and interactive atmosphere for all audiences. As always, admission is free. Also, be sure to save the dates for our upcoming Fridays After 5:December 11, 2015; February 12, 2016; April 8, 2016; May 13, 2016; June 10, 2016; July 8, 2016.UMMA Fridays After 5 are generously supported by Comerica Bank and the Community Foundation for Southeast Michigan. The media sponsor for Fridays After 5 is Michigan Radio.", "name": "Fridays After 5"}, {"url": "https://www.facebook.com/events/414478285419162/", "source": "Facebook", "date": "2015-11-07T12:00:00-05:00", "description": "Join The Beer Grotto and Vault of Midnight for a day of drinking, gaming, laughter, and a little education. \n\nTimeline of the day - \n12:00 - Meet at Beer Grotto \n12:30 - Beer Tasting Education Starts / Beer Flights Are Served\n12:45 - 2:00 - Socializing / Drinking / Parlor Games\n2:00 - Buy Growlers and Head to Vault of Midnight Game Room\n2:00 - 6:00 - Play All The Games! \n6:00 - Call A Cab and Let Vault Staff Clean The Shop\n\n\nTickets are $15! Includes a tasting flight at Beer Grotto lead by one of their Well Seasoned Beer Drinkers, access to the legendary Vault of Midnight Game Library. Plus some wonderful company with fellow gaming enthusiasts.\n\nTickets on sale now! Spots are limited so get your ticket today.", "name": "Tactical Drinking"}, {"url": "https://www.facebook.com/events/414478285419162/", "source": "Facebook", "date": "2015-11-07T12:00:00-05:00", "description": "Join The Beer Grotto and Vault of Midnight for a day of drinking, gaming, laughter, and a little education. \n\nTimeline of the day - \n12:00 - Meet at Beer Grotto \n12:30 - Beer Tasting Education Starts / Beer Flights Are Served\n12:45 - 2:00 - Socializing / Drinking / Parlor Games\n2:00 - Buy Growlers and Head to Vault of Midnight Game Room\n2:00 - 6:00 - Play All The Games! \n6:00 - Call A Cab and Let Vault Staff Clean The Shop\n\n\nTickets are $15! Includes a tasting flight at Beer Grotto lead by one of their Well Seasoned Beer Drinkers, access to the legendary Vault of Midnight Game Library. Plus some wonderful company with fellow gaming enthusiasts.\n\nTickets on sale now! Spots are limited so get your ticket today.", "name": "Tactical Drinking"}, {"url": "https://www.facebook.com/events/897981243621860/", "source": "Facebook", "date": "2015-11-08T13:00:00-05:00", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour: Engaging with Art"}, {"url": "https://www.facebook.com/events/1015125868508876/", "source": "Facebook", "date": "2015-11-08T14:00:00-05:00", "description": "“The unifying core of my work stems from encountering the world as it unfolds,” explains Jem Cohen. “It is through close observation, careful listening, and an embrace of chance that I establish the bedrock. . . . Regardless of the tools and the form, the project is . . . life drawing.” Join UMMA docents as they explore Cohen’s dual-gallery presentation including Polaroid images and digital prints of a variety of locations, from New York to Tangier, in the Photography Gallery, and a multi-media component that has been called a cinematic love letter to Nova Scotia's Cape Breton, in the Media Gallery.", "name": "Guided Tour: Jem Cohen: Life Drawing"}, {"url": "https://www.facebook.com/events/1656201404658784/", "source": "Facebook", "date": "2015-11-08T15:00:00-05:00", "description": "Irving Stenn, Jr. Family Gallery\nThis program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.Tyree Guyton’s massive outdoor installation, the Heidelberg Project, has been his artistic focus for most of the last 30 years.  MaryAnn Wilkinson, UMMA’s Adjunct Curator of Modern Art, will explore Guyton’s artistic journey from eager street artist to sophisticated studio artist, in the context of the question he constantly asks himself: What is art today? The multiple, shifting answers to this question are hinted at in the works in the exhibition and will form the basis of discussion.Lead support for this exhibition is provided by the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, the Andy Warhol Foundation for the Visual Arts, and Lisa Applebaum. Additional generous support is provided by the University of Michigan Taubman College of Architecture and Urban Planning and School of Social Work.", "name": "In Conversation: The Art of Tyree Guyton: From the Street to the Studio"}, {"url": "https://www.facebook.com/events/1722746661287743/", "source": "Facebook", "date": "2015-11-11T19:00:00-05:00", "description": "Wed. November 11 | 9pm | 18+ | $12 Adv./ $15 Day of\n\n (((My name is Theo Katzman))) wsg: The Stellars & Anna Ash\n\n(((((I write healing Meta Pop Anthems to soothe your post-Y2K Pop Culture Hangover))))\n\n((((((I think Billy Joel is a punk-rock artist)))))))\n\n((((((((((((((((((((Thank you)))))))))))))))))))))))))\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/556", "name": "Theo Katzman 11/11/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/832974296787302/", "source": "Facebook", "date": "2015-11-11T21:00:00-05:00", "description": "Wed. November 11 | 9pm | 18+ \n\nWith over 1400 legendary late nights, sold-out clubs and triumphant festivals under their belts, The New Deal returns with a passion in 2015. Recently releasedtracks “Mercury Switch” and “Sabotage the System”offera preview of their upcoming fall studio releasewhich bassist Dan Kurtz describes as their “most creative” endeavor to date. “In the last few months we've been pushing ourselves to work with new sounds, new styles, new ways of arranging jams, and the stuff we've come up with has felt great and exciting to us as a result. We're listening back to the board tapes of all the shows and finding the parts, even if they're just a couple of seconds long, that sound the most inspiring and then building studio recordings around them. In some cases we'll glue a bit from one show in one city to another completely unrelated piece from another town, and create something we'd never have come up with in either just a live or just a studio setting.” WSG: Turbo Suit\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/423", "name": "theNEWDEAL w/Turbo Suit @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/752219808216705/", "source": "Facebook", "date": "2015-11-12T19:00:00-05:00", "description": "This is the mack daddy of all of our beer tasting events! We pull together 25 to 30 of the best Belgian and belgian-style ales across the category spectrum. From malty rich trappists to traditional sour lambics and flemish browns to aged and high gravity ales to crazy concoctions made with fruits and spice.  \n\nTickets include beer samples and 24 beers to choose from, an appetizer buffet, a complete event program with tasting notes, and door prizes. \n\nTickets are $30 in advance and $35 if purchased on tasting day. Advance tickets recommended as this tasting often sells out. Call 734-213-1393 to order tickets over the phone.", "name": "A Taste of Belgium"}, {"url": "https://www.facebook.com/events/929976707046058/", "source": "Facebook", "date": "2015-11-12T21:00:00-05:00", "description": "Thursday, November 12 | 9pm | $10 adv./ $12 day of | 18+\nThe Bright Light Social Hour with: SWIMM & Buffalo Coven Party \n\nQuestions bring art to life. Songs can still ponder socio-political issues, the fragility and isolation of the human condition, and what lies ahead for earth. Moreover, music possesses the potential and gravitas to incite change, while reflecting the world’s faults and follies. The Bright Light Social Hour contemplate a “Future South” on their second full-length album, Space Is Still the Place [Frenchkiss Records]. The Austin artists—Curtis Roush [guitar, vocals, synths], Jack O’Brien [bass, vocals, synths], Joseph Mirasole [drums, synths]—offer a different interpretation of the space around them throughout ten thematically connected songs. They tackle a myriad of issues head on during tracks such as “Ghost Dance” and “Ouroboros,” while “Infinite Cities” contemplates loneliness and “Escape Velocity” subtly hints at a orgiastic ending. The album will pose a few questions, but you may leave with an answer or two as well.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/449\n\nSurcharge free tix at The 8 Ball Saloon", "name": "The Bright Light Social Hour with SWIMM 11/12/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/581090628711468/", "source": "Facebook", "date": "2015-11-13T19:00:00-05:00", "description": "Helmut Stern Auditorium\n\nOne MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.", "name": "Mark Webster Reading Series"}, {"url": "https://www.facebook.com/events/1651671698445679/", "source": "Facebook", "date": "2015-11-13T21:00:00-05:00", "description": "Fri. Nov. 13 | 9pm | 18+ | $25 adv./ $30 day of\n\nVanessa Carlton\nwith: Joshua Hyslop\n\nAn unusual light shines through Liberman, Vanessa Carlton’s fifth album. Its ten songs, built on ethereal melodies and lush orchestration, seem to climb out of the shadows, each resonating with a sense of haunting positivity.  The opening track, “Take It Easy,” instantly sets the tone, inviting the listener into a sort of sonic euphoria: each note and lyric thereafter builds on that aesthetic, creating an ongoing narrative that unfurls over its classic side A and side B. \n\n“It’s a calm record,” Carlton says. “I didn’t want any angst in there. I thought, ‘What would I want to hear back? What would make me feel better in my darker times?’ Even a phrase like ‘take it easy,’ which is in a million songs, brings happiness. This album leans toward seeing the good in humans and in the world.”  \n\nCarlton began writing in the summer of 2012, beginning with “Unlock The Lock,” an evocative piano-driven track that set the tone for the songs to come. She’d recently finished touring 2011’s Rabbits On The Run, an album conceived through inspiration from Stephen Hawking’s A Brief History of Time and Richard Adam’s Watership Down. Carlton found herself in the desert and the song emerged, reflecting a newly revealing songwriting sensibility for the artist. “I imagined a group of people listening to it,” she says. “It was the first time I ever wanted to make something like séance music – something that would make a human brain feel at ease, something that would feel right in an everyday ritual. I also realized I wanted the record to be really soothing lyrically and not so much a reveal of me.”\n\nThe musician followed that thread as she continued writing for the next year and a half, this time inspired by books like Joseph Campbell’s The Power of Myth and Aldous Huxley’s The Doors of Perception. Carlton’s primary influence, however, was a colorful oil painting by her grandfather Alan J. Lee, who was originally named Liberman. The painting, created in 1963, hangs in Carlton’s home and showcases three woman captured in swirling pastel colors. She wrote many songs while looking at the image, eventually deciding to call the album after her grandfather. \n\n“The swirly colors of that painting reminded me of the music and the music reminds me of those colors” Carlton notes. “Then I looked up what Liberman means and it’s ‘honorable man’ and ‘my beloved’ – all these things that just felt right to me. It’s a strong family name that, in a weird way, describes the music to me.”\n\nAt the end of 2013, Carlton gathered her songs and decamped to Real World Studio in Box, England to work with producer Steve Osborne, who’d helmed Rabbits On The Run. In the studio, Carlton and Osborne focused on the sound, on creating layers of instrumentation with classic gear that veer away from crisp pop production and reference artists like Air. For Carlton, who began her career with several albums at the mercy of prescribed aesthetics, emphasizing the art of space and sonic beauty felt like the next step. This shift is revealed particularly in the trippy ambience of “House of Seven Swords” and the moody “Ascension,” which builds a soundscape outward from the piano at its center. \n\nCarlton rounded out the album in Nashville, the city she now calls home, with producer Adam Landry who worked on three tracks. Carlton’s husband, Deer Tick front man John McCauley, played on several songs throughout the process, including “Take it Easy,” \"Ascension\" and “Matter of Time.” The latter is stripped of instrumentation and highlights Carlton’s voice as it soars over McCauley’s delicately plucked electric guitar, reminiscent of the old school vocal recordings of Dusty Springfield.  As a whole, Liberman feels like a new chapter in Carlton’s storied career, revealing new facets of her musical skill and instigating fresh inspirations. Stagnancy, she knows, is the antithesis to creativity. \n\n“Martin Scorsese said sometimes your greatest challenge is not your failure but your success,” Carlton says. “In a way I was able to persevere after having a success out of the gate and figure out a path that feels really pure to me. But I had to create this environment where I felt comfortable changing. When I was first doing records I was so young and I wanted to please everyone. But now I sort of feel ancient and I love it and I just want to make art for its own sake. Whether I fall on my face or not at least I know I did it. Everything I’ve done and everything I am is there in the songs.”", "name": "Vanessa Carlton 11/13/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1649453195296218/", "source": "Facebook", "date": "2015-11-14T11:00:00-05:00", "description": "Irving Stenn, Jr. Family Gallery\nMultipurpose Room\nFrom 11-1pm OR 2-4pm\n\nThis program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11am session or the 2pm session and how many adults and children are in your group.Create your own art project inspired by the art works in the exhibition The Art of Tyree Guyton: A Thirty-Year Journey. Designed for families with children ages 6-12 to experience art together, local artist and long-time UMMA docent Susan Clinthorne will lead families on an exploration of the gallery followed by a hands-on workshop.Family Art Studio is generously supported by the University of Michigan Credit Union, UMMA's Lead Sponsor for Student and Family Engagement.Lead support for this exhibition is provided by the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, the Andy Warhol Foundation for the Visual Arts, and Lisa Applebaum. Additional generous support is provided by the University of Michigan Taubman College of Architecture and Urban Planning and School of Social Work.", "name": "Family Art Studio: The Art of Tyree Guyton"}, {"url": "https://www.facebook.com/events/875882805853203/", "source": "Facebook", "date": "2015-11-14T13:00:00-05:00", "description": "Captain Midnight opens his personal toy colelction for you to rip apart, mod, and create anew! Chose parts from boxes of toys to create your own masterpeice. \n\n$10 gets you access to this seasoned and diverse collection of toys & collectables. \n\nGlue and building supplies provided.", "name": "Build A Toy"}, {"url": "https://www.facebook.com/events/875882805853203/", "source": "Facebook", "date": "2015-11-14T13:00:00-05:00", "description": "Captain Midnight opens his personal toy colelction for you to rip apart, mod, and create anew! Chose parts from boxes of toys to create your own masterpeice. \n\n$10 gets you access to this seasoned and diverse collection of toys & collectables. \n\nGlue and building supplies provided.", "name": "Build A Toy"}, {"url": "https://www.facebook.com/events/1610852672500873/", "source": "Facebook", "date": "2015-11-14T19:00:00-05:00", "description": "Turquoise Jeep Records rollin' through November 14th wsg: Lt.baD\nDoors 10pm | 18+ | $15 Cover\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/478", "name": "Turquoise Jeep (Late Show 10pm) 11/14/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/453982398116816/", "source": "Facebook", "date": "2015-11-14T19:00:00-05:00", "description": "Sat. November 14 | 7pm | 18+ | $14 Cover\n\n“It’s all in our minds / Planted over time / Grew into a vine / That became intertwined” – from “All In Our Minds”\n\nThis lyric is the source of the title to Passafire’s fifth studio album, Vines. Though it wasn’t written with this intention, it was in retrospect that the band members – singer/guitarist Ted Bowne, drummer Nick Kubley, bassist/vocalist Will Kubley and keyboardist Mike DeGuzman – realized that it aptly described the current state of the band. Vines is a record that finds its makers at a creative peak, thanks in large part to the comfort of the current line-up, which has been solidified for a few years. They have grown up together, and over the years, as their individual stylistic preferences have changed, they’ve intertwined until the music becomes stronger like vines growing around each other. These four have become a super tight unit, which has led to a comfort level on stage and in the studio that Passafire has never achieved before.  WSG: LIONIZE\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/462", "name": "Passafire w/ Lionize 11/14/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/938841602855732/", "source": "Facebook", "date": "2015-11-15T13:00:00-05:00", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour: Engaging with Art"}, {"url": "https://www.facebook.com/events/1023816757685874/", "source": "Facebook", "date": "2015-11-15T14:00:00-05:00", "description": "The Heidelberg Project is an outdoor art environment in the heart of an urban community on Detroit’s near-east side. The installation was started in 1986 by artist and local resident Tyree Guyton who covered abandoned houses, the street, and the surrounding area with found objects and paintings that express vivid personal, social, and sometimes political themes. The installation not only energized the local community but attracted visitors from around the world and has evolved from the vision of a single artist into a community-based organization run by Guyton and his team. Join UMMA docents as they explore this exhibition that looks at the project’s history and traces its trajectory as an exceptional work among site-specific installations.", "name": "Guided Tour: The Art of Tyree Guyton: A Thirty-Year Journey"}, {"url": "https://www.facebook.com/events/181639825510387/", "source": "Facebook", "date": "2015-11-15T15:00:00-05:00", "description": "The Jan and David Brandon Family Bridge\nThis program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu.During the 1920s, a young Soviet Union experienced steadfast change as it sought to assert itself as a trailblazer on the world stage.  A group of artists known as the Constructivists created art that was utilitarian, spoke to the masses, and embodied the ideals of Communism, including dynamic film posters. Join exhibition curator and 2014-2015 Andrew W. Mellon Curatorial Fellow Lehti Mairike Keelmann for a tour of these provocative posters and see how they branded the New Order as fresh and forward-looking.  Take a closer look at some of the artistic motifs and techniques that were utilized to promote both the films advertised and the Soviet regime.Lead support for the exhibition Soviet Constructivist Posters: Branding the New Order is provided by the University of Michigan Weiser Center for Emerging Democracies and the Center for Russian, East European, and Eurasian Studies.", "name": "In Conversation: Soviet Constructivist Posters: Branding the New Order"}, {"url": "https://www.facebook.com/events/476972239143336/", "source": "Facebook", "date": "2015-11-15T20:00:00-05:00", "description": "$15 Adv./ $18 day of | 18+ | Doors 8pm / Show 9pm\n\nJonathan Richman has been writing music, recording and touring for most of his life, gathering the loyalty of fans and fellow artists with his warmth, humor and insightful lyrics. In the early 1970s he formed the Modern Lovers, a major progenitor of punk music. Tommy Larkins was in the groups Naked Prey, Giant Sand and other popular bands in Tucson, Arizona. Jonathan and Tommy continue to record, write music together and tour across the US. Tommy’s drumming along with Jonathan’s guitar and singing create a live experience that is hard to forget.\n\n“Playing shows and making records keeps getting easier and more fun,” Jonathan states, adding, “…me and Tommy play totally different than we played two years ago. We already play a different style than we played on that live DVD, and the way we played then was totally different from the way we played three years before that. I still feel like we’re just starting out, and I still learn new stuff every night.” -Jonathan\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/503", "name": "Jonathan Richman Featuring Tommy Larkins on the Drums 11/15/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/820090691422005/", "source": "Facebook", "date": "2015-11-18T21:00:00-05:00", "description": "Wed. Nov. 18 | 9pm | 18+ | $10 Cover\n\nAlex Bleeker and the Freaks\nwith Bonny Doon & Elroy Meltzer\n\nUnder the moniker, Alex Bleeker & the Freaks, Jersey­bred songwriter Alex Bleeker has developed a solo career outside of his bass playing duties for Real Estate. Bringing together like­minded players and friends, he and his able­minded Freaks crafted two separate albums of material, a low­key self­titled release in 2009 and a more full­bodied 2013 record entitled How Far Away.\n\nAlex Bleeker and the Freaks’ third album Country Agenda is the culmination of Bleeker’s songwriting, as well as the gelling together of a fully formed band. With the full­time inclusion of guitarist Alex Steinberg, bassist Nick Lenchner, drummer Dylan Shumaker and keyboardist Jacob Wolf, along with occasional guest vocals from Mountain Man singer Molly Sarle, The Freaks’ vibe has coalesced considerably.\n\nNo longer the work of a single director, this version of the band gives the songs more room to breathe, allowing the tunes to move in unexpected directions. A wholly collaborative effort, Country Agenda features multiple songwriters and ensemble playing that stretches out in unhurried passages of glowing musical interplay. The songs wander in slow motion like a coastline drive, drawing on the same wizened energy and brilliant restraint as Crazy Horse, the Dead, Moby Grape and other like­minded cosmic travelers. Easily the most realized and best sounding set of tunes from the project, the strengths of the album are magnified by a cohesive feeling that was absent on previous Freaks records. The sound here is undeniably the birth of a solid band playing together, locked in the groove, and moving down the road in unison.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/502", "name": "Alex Bleeker & The Freaks 11/18/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/904173979677626/", "source": "Facebook", "date": "2015-11-19T17:10:00-05:00", "description": "Michigan Theater\n603 E Liberty St\nAnn Arbor, MI 48104\nPrem Krishnamurthy is a founding principal of the award-winning design studio Project Projects and the director/curator of the critically-acclaimed multidisciplinary exhibition space P!. In addition to working on commissions with Bard College Center for Curatorial Studies, Cooper-Hewitt National Design Museum, Guggenheim Museum, Harvard University, The Jewish Museum, MoMA, RISD Museum, SALT, Whitney Museum of American Art, and the Yale University Art Gallery, he has co-edited books and publications such as MATRIX/Berkeley: A Changing Exhibition of Contemporary Art (Project Projects with Elizabeth Thomas), PRINT magazine’s January 2011 special “Collaboration” issue, and the art journal Paper Monument. He has lectured at institutions ranging from the Walker Art Center, Jan Van Eyck Academie, Academy of Fine Arts Vienna, SALT, Platform Garanti, and Bauhaus University Weimar. Krishnamurthy has received grants from the Graham Foundation and the New York State Council for the Arts for his independent curatorial research.This event is co-sponsored with the University of Michigan Museum of Art.", "name": "Penny W. Stamps Speaker Series Presents: Prem Krishnamurthy: Detours"}, {"url": "https://www.facebook.com/events/553000681529373/", "source": "Facebook", "date": "2015-11-19T19:00:00-05:00", "description": "Museum Apse\nThe artist Nikki S. Lee is best known for her snapshot style photographs in which she appears as a performer in various American subcultures, taking on startlingly different identities. Inspired by her works on view at UMMA, the departments of Vocal Performance and Dance join forces to consider the meaning of taking on a role. Led by professors Caroline Helton and Jessica Fogel, vocal students perform operatic excerpts, inhabiting characters from famous operas.  Interspersed with the vocal performances, dance students and alumni present solos in which they take on unique personae. Lee's work Paris [206] is the featured work of In Focus, UMMA's showcase of recently acquired work. Her work Hispanic Project (25) is included in UMMA's exhibition of Come as You Are: Art of the 1990s.The SMTD@UMMA performance series is made possible in part by the Katherine Tuck Enrichment Fund.Come as You Are: Art of the 1990s is organized by the Montclair Art Museum and curated by Alexandra Schwartz, curator of contemporary art, with Kimberly Siino, curatorial assistant. This exhibition is made possible with generous support from The Andy Warhol Foundation for the Visual Arts.Lead support for the exhibition Come as You Are: Art of the 1990s is provided by the University of Michigan Office of the Provost and the University of Michigan Health System. Additional support is provided by Samantha and Ross Partrich, Andrea and Joel Brown, the University of Michigan CEW Frances and Sydney Lewis Visiting Leaders Fund, Department of the History of Art, Residential College, and Department of American Culture.", "name": "SMTD@UMMA: The Performance Project"}, {"url": "https://www.facebook.com/events/1663435883900279/", "source": "Facebook", "date": "2015-11-21T21:00:00-05:00", "description": "The Rev. Peyton’s Big Damn Band bridges genres and eras with an intensity and effortlessness few contemporary artists possess. And their new album So Deliciouselevates the trio’s work to a new level. Produced by Rev. Peyton, So Delicious offers the band’s most diverse collection of songs buoyed by the Rev.’s supercharged six-string virtuosity — a unique style of fingerpicking inspired by his Delta blues heroes, but taken to new, original heights.\n\nThe fifth full-length original album by the group — which includes Breezy Peyton on washboard and supporting vocals and Ben Bussell on drums and supporting vocals — is their debut on Yazoo Records, a label known for the historic reissues of blues and other old time American music that are the bedrock inspiration for the Rev.’s sound and approach.\n\n“Yazoo was my favorite record label growing up,” he explains. “For fans of old country blues and all manner of early American music, they are the quintessential label. And for me, it’s like being on the same label as Charley Patton and ‘Mississippi’ John Hurt. To think that Yazoo believes we are authentic enough to stand with the other people in their catalog means a lot.”\n\nThe Rev. Peyton’s Big Damn Band has always been strong on authenticity, playing music that blends blues, ragtime, folk, country and other traditional styles with the sleek modern energy of do-it-yourself, homespun, punk fueled rock. And performing tunes plucked from their lives, their community or from the canonical songbook that fed the Rev. Peyton’s formative creative identity. It’s a mix that’s allowed the band to win fans from all corners of the Americana and rock worlds, and bring a new generation to blues and other forms of American roots music.\n\nSo Delicious is a perfect Rev. Peyton’s Big Damn Band album, with songs that speak from the heart and capture the trio — whose sound has been honed over 250 annual tour dates during the last eight years — playing at their peak. The charging, anthemic “Raise a Little Hell,” also the set’s first video, lays out the band’s live modus operandi, thriving on Bussell’s and Breezy’s chugging beat and the Rev.’s resonator guitar riffs and mantra-like singing. The song was inspired by a show at a folk festival, where one of the promoters — struck by the Big Damn Band’s raucous, juke joint power — told the Rev., “Y’all sure raise a lot of hell.”\n\n“I said, ‘Naw we don’t,’ “ the Rev. recalls. “And then I thought, ‘Well, maybe we do raise a little hell.’\n\n\n\n“The sweet, joyful “Pot Roast & Kisses,” which the band has also committed to video, was written for Breezy. The Rev. was developing the finger-busting main riff after enjoying one of her pot roast dinners when the lyrics naturally fell into place. “Some people don’t believe that we really live the way we sing about in our songs,” he explains, “but it’s true. Breezy and me are together and really love each other. We try to keep things simple, like people have in Brown County, Indiana for a long", "name": "Reverend Peyton's Big Damn Band w/ The Erers 11/21/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/733554240084114/", "source": "Facebook", "date": "2015-11-22T13:00:00-05:00", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour: Engaging with Art"}, {"url": "https://www.facebook.com/events/1505481643078096/", "source": "Facebook", "date": "2015-11-22T14:00:00-05:00", "description": "Come as You Are: Art of the 1990s, is the first major museum survey to examine the art of this pivotal decade in its historical context. The exhibition, organized by the Montclair Art Museum, focuses on three principal themes—debates over “identity politics,” the digital revolution, and globalization— and explores a range of geopolitical milestones and social issues through the perspective of artists working at that time. It also illustrates the diverse ways in which the developments of the 1990s redefined contemporary approaches to artistic practice. UMMA docents will explore the themes of this pivotal decade.", "name": "Guided Tour: Come as You Are: Art of the 1990s"}, {"url": "https://www.facebook.com/events/128733187482537/", "source": "Facebook", "date": "2015-11-22T17:30:00-05:00", "description": "Helmut Stern Auditorium\nJustin Torres has published short fiction in The New Yorker, Harper's, Granta, Tin House, The Washington Post, Glimmer Train, Flaunt, and other publications, as well as non-fiction pieces in publications like The Guardian and The Advocate. A graduate of the Iowa Writers’ Workshop, he was a Wallace Stegner Fellow at Stanford University, and most recently a fellow at the Radcliffe Institute for Advanced Study at Harvard. The National Book Foundation named him one of 2012's 5 Under 35. He has been the recipient of a grant from the National Endowment for the Arts, a Rolón Fellowship in Literature from United States Artists, and the VCU Cabell First Novelist Award. He has taught at Columbia University, Lesley University's Low Residency MFA Program, the 92nd Street Y, and currently teaches at The Writers' Foundry MFA Program at St. Joseph's College.Torres is a 2014-2015 Cullman Center Fellow at The New York Public Library.He lives in Brooklyn.UMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please see: http://www.umma.museum/programs-and-tours/events/index.php?d=2015-11-12&m=1", "name": "Justin Torres Fiction Reading"}, {"url": "https://www.facebook.com/events/1636907506583430/", "source": "Facebook", "date": "2015-11-29T13:00:00-05:00", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "name": "Guided Tour: Engaging with Art"}, {"url": "https://www.facebook.com/events/1631391757112051/", "source": "Facebook", "date": "2015-11-29T14:00:00-05:00", "description": "“The unifying core of my work stems from encountering the world as it unfolds,” explains Jem Cohen. “It is through close observation, careful listening, and an embrace of chance that I establish the bedrock. . . . Regardless of the tools and the form, the project is . . . life drawing.” Join UMMA docents as they explore Cohen’s dual-gallery presentation including Polaroid images and digital prints of a variety of locations, from New York to Tangier, in the Photography Gallery, and a multi-media component that has been called a cinematic love letter to Nova Scotia's Cape Breton, in the Media Gallery.", "name": "Guided Tour: Jem Cohen: Life Drawing"}, {"url": "https://www.facebook.com/events/1678322672398279/", "source": "Facebook", "date": "2015-11-29T17:30:00-05:00", "description": "Helmut Stern Auditorium\nJamaal May’s first book of poems, Hum, is a “bittersweet love song” to the ruined streets of his native Detroit. Boston Review writes, “In May’s skilled hands, Keats’s urn becomes a Chinese takeout box and Wordsworth’s abbey spires are belching Zug Island factories.” May’s poetry uses images of technology past and present to render the “hum” that drives human identity and connection. Since Hum’s publication in 2013, May has won the Beatrice Hawley Award, the ALA Notable Book Award, and was a finalist for the NAACP Image Award and Kate Tufts Discovery Award. He has also published two chapbooks, The God Engine and The Whetting of Teeth.May’s poetry has been published in Poetry, The Believer, Ploughshares, New England Review, and The Kenyon Review. His work has been recognized by Cave Canem, Bread Loaf, the Lannan Foundation, and the Indiana Review. He has also been a recipient of the Kenyon Review Fellowship at Kenyon College, Bread Loaf, Callaloo, and the Civitella Ranieri Fellowship.May’s career as an editor and teacher began when he taught poetry in the Detroit public school system. Since then, he has also been on the faculty of the Vermont College of Fine Arts MFA. He has served as an associate editor of West Branch and the series editor, graphic designer and filmmaker for the Organic Weapon Arts Chapbook and Video Series. May is also a member of six national poetry slam teams, including five from Detroit and the NYC-based LouderARTS team. He is a three-time Rustbelt Regional Slam champion and has been a finalist at several national and international poetry slams.UMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please see: http://www.umma.museum/programs-and-tours/events/index.php?com=detail&eID=2657", "name": "Jamaal May Poetry Reading"}, {"url": "https://www.facebook.com/events/429225057271441/", "source": "Facebook", "date": "2015-11-29T18:30:00-05:00", "description": "PLEASE SHARE WITH THE WOMAN-IDENTIFYING SLAMMERS YOU LOVE:\n\nWe will be hosting our first-ever WoWPS qualifier slam on November 29th at 7pm in Espresso Royale (on State St). The winner of the WoWPS qualifier slam will get to represent Ann Arbor at the Women of the World Poetry Slam in Brooklyn, New York, in March 2016. Ann Arbor Poetry Slam will pay for your registration fees and help you with a portion of your travel expenses.\n\nThe slam will be three rounds featuring:\n\n1st Round: 1 minute poem\n2nd Round: 2 minute poem\n3rd Round 3 minute poem\n\nEach round allots a 10-second grace period. The time limits are a max, meaning you do not have to fill up the time. However, there will be time penalties after the ten second grace period. \n\nThere will be cuts after each round, taking 8 poets into the second round, and 4 into the final round. The top-scoring poet, cumulatively, will represent our city in Brooklyn. For more details, visit:\n\nhttp://poetryslaminc.com/tournament/2016-women-world-poetry-slam\n\nELIGIBILITY: in order to be able to compete in the WoWPS qualifier slam, you must be at least 18 years of age, identify as a woman, and have attended *at least* TWO Ann Arbor Poetry & Slam event this calendar year (for the record, there are 2 more events left prior to the qualifier).\n\nWe wish you all the best, and are looking forward to seeing who comes out to represent our city!", "name": "Ann Arbor Women of the World Poetry Slam Qualifier"}, {"url": "https://www.facebook.com/events/887650744615581/", "source": "Facebook", "date": "2015-12-02T21:00:00-05:00", "description": "Wed. December 2 | 9pm | 18+ | $10 Adv./ $12 Day of\n\nBeat Connection\n with Phantoms and Jonah Baseball\n\nBeat Connection is Reed Juenger, Tom Eddy, Jarred Katz and Mark Hunter. Formed in 2010, Beat Connection has undergone numerous changes, finally stabilizing in its current form. The band has already shared the stage with Jungle, Toro y Moi, STRFKR, Washed Out, Holy Ghost! & ODESZA; and has garnered positive looks from Pitchfork, The Fader and The Guardian. With performances scheduled this year at ACL & CHBP, Beat Connection now looks to the future to focus on constantly bringing something new to their audience by bridging the gap between the mundane and the transcendent, the pop and the avant-garde. Expect something new at every turn.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/479", "name": "Beat Connection w/ Phantoms & Jonah Baseball 12/2/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1643528942585214/", "source": "Facebook", "date": "2015-12-03T21:00:00-05:00", "description": "Thursday, December 3 | 9[m | 18+ | $10 adv. / $12 Day of\n\nFlint Eastwood\nwith Valley Hush and Air is the Arche\n\nFlint Eastwood is the evolution of the creative side of Detroit-based multi-talented artist Jax Anderson. Flint Eastwood is what happens when friends and family gather in the forgotten spaces of an embattled city and are left to create with no rules, no boundaries, and nothing holding them back. Jax's endless creativity is a byproduct of growing up in a talented family.\n\nHer father was one of ten kids, each of whom played guitar and sang. Her oldest brother, Sam, played in punk bands, and Jax spent her teenage years learning the value of passion and acceptance at DIY shows. As she got older, her other brother (and Flint Eastwood collaborator and producer) Seth started playing in bands throughout the Detroit garage rock scene. Their dad worked as a curb address painter to pay the bills once the housing crash made his job as a mortgage broker invalid. During this time, Jax and her brothers went door to door, passing out flyers advertising her father's services, through some of the toughest residential neighborhoods in Detroit. These struggles helped form the vision that drives Flint Eastwood: to give everyone listening (whether live or on record) a momentary escape from the problems we all have.\n\nBetween helping around the house, Jax spent her days in her family's Detroit-area home, without cable and internet, teaching herself to play her father's 12-string Taylor guitar that he left for them in the living room. It was also during this time that her mother's love for Motown music began to influence Jax's knack for the theatrics and power of the Detroit sound, as Mom played records from The Temptations, the Jackson Five, and Earth Wind & Fire.\n\nOnce old enough to break out on her own, Jax briefly moved to a small German tourist town in rural Georgia, where the only station in town played solely pop and country. There, she fell in love with the hooks and harmonies that define American pop music. Later, she moved with Seth to Los Angeles, to mainly focus on writing for licensing opportunities and playing small clubs and house parties around town. While in LA, Jax developed a love for film, hopping on tour with bands every chance she could get as a self-taught videographer. Her experiences on the West Coast still influence Jax's push to make her musical endeavors into well-rounded multimedia presentations (mixing music with theatrical lighting, video projection, and costumes).\n\nUpon returning home to Detroit at the very beginning of the much-maligned city's recent resurgence, Jax's explosive and endearing personality on stage became the driving force behind Flint Eastwood. But through it all, it was the songs that were always the focus.\n\nOn their now sold-out debut EP Late Nights In Bolo Ties (2013), Jax and her friends mixed elements of pulsing electronic tracks with blistering bluesy guitar licks, all with a spaghetti-western backdrop, inspired by Sunday night movie sessions with Jax and her father.\n\nOn the forthcoming EP, Small Victories (to be released October 23), Jax has returned to her Detroit roots, mixing a taste of the theatricality of Motown music with her more recently found love for pop music. The result is six songs full of hooks. The type of tracks that you turn up a little too loud, close your eyes, and forget where you are for four minutes. In a live setting, the songs are taken to another level entirely, mixing a CHVRCHES-like depth with a twenty | one | pilots-style flair for the dramatic. This approach has led the band to rapidly gain an ever-growing fanbase. Their last two hometown headline plays have sold out (400+ tickets per show), and the band has toured heavily through the Midwest, mixing festival looks like Electric Forest, MoPop Festival, and Midpoint Music Festival with club appearances alongside acts such as Foxy Shazam, Mayer Hawthorne, Betty Who, X Ambassadors, and Andrew WK.\n\nSmall Victories was crafted and polished in Detroit’s second oldest church, now repurposed as Assemble Sound, a hub of Detroit creativity that fosters artists through collaboration. In this crumbling but inspiring location, the new record was created as a coping mechanism to help Jax deal with the loss of her mother, who was her biggest fan and inspiration. As the listener makes their way through the EP, they experience Jax making her way through her mother's illness and passing, railing against it, dealing with the aftermath associated with such a loss, eventually accepting it, and using it as a driving force to continue to create.\n\nJax broke the EP down in one simple thought:\n\n\"Small Victories comes from the idea that doing anything creative in life takes a lot of persistence, struggle, and hustle. It's easy to expect that the spoils will come easily and be immediately fruitful. But if you focus on the little things, the \"small victories\", you realize that it's those things that are the most rewarding. That's what keeps me going.\"\n\nThe lead single is the EP's first track, \"Find What You're Looking For\", which is Jax's interpretation of her mother's final words to her:\n\n\"Don't let this break you\".", "name": "Flint Eastwood, Valley Hush and Air is the Arche 12/3/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/690897114388628/", "source": "Facebook", "date": "2015-12-10T21:00:00-05:00", "description": "Thu. December 10 | 9pm | 18+ | $20 Cover\n\nThe Sword is a bladed weapon used primarily for cutting or thrusting. WSG: ROYAL THUNDER & Blue Snaggletooth\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/480", "name": "The Sword High Country Tour wsg Royal Thunder & Blue Snaggletooth 12/10/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/463341333828385/", "source": "Facebook", "date": "2015-12-30", "description": "Need a fantastic gift for your fave teacher? Grab a bag of Sweetwaters' new blend, Scholar Joe, in stock right now! For every bag you buy, Lucky's Market will make a donation to the Ann Arbor Public Schools Educational Foundation!", "name": "Scholar Joe- Supporting the AAPSEF"}, {"url": "https://www.facebook.com/events/780337908747994/", "source": "Facebook", "date": "2016-01-11T19:30:00-05:00", "description": "Monday, January 11, 2016, 7:30 pm\nHill Auditorium\n\nFounded by Sir Thomas Beecham in 1946, the Royal Philharmonic Orchestra made its UMS debut in 1950 and last performed in Hill Auditorium in 1992. This concert features Pinchas Zukerman both at the helm and as the featured soloist. \n\nMore info: http://ums.org/performance/royal-philharmonic-orchestra/", "name": "Royal Philharmonic Orchestra"}, {"url": "https://www.facebook.com/events/478188069030288/", "source": "Facebook", "date": "2016-01-14T20:00:00-05:00", "description": "A catchy multicultural potluck", "name": "October Babies"}, {"url": "https://www.facebook.com/events/1496989627284184/", "source": "Facebook", "date": "2016-01-15T20:00:00-05:00", "description": "Fine Mitten spirits!", "name": "Dragon Wagon"}, {"url": "https://www.facebook.com/events/1506035683053327/", "source": "Facebook", "date": "2016-01-16T20:00:00-05:00", "description": "Positive storytelling and song from a Detroit icon", "name": "Rev. Robert B. Jones Sr."}, {"url": "https://www.facebook.com/events/1604747733142781/", "source": "Facebook", "date": "2016-01-20T19:30:00-05:00", "description": "Wednesday, January 20, 2016, 7:30 pm\nHill Auditorium\n\n“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas) Since 1988, Wynton Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, sophisticated to spirited, it’s all sheer jazz perfection — no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/1516-jazz-at-lincoln-center-orchestra/", "name": "Jazz at Lincoln Center Orchestra with Wynton Marsalis"}, {"url": "https://www.facebook.com/events/1620983154780471/", "source": "Facebook", "date": "2016-01-21T19:30:00-05:00", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show"}, {"url": "https://www.facebook.com/events/1621661494783572/", "source": "Facebook", "date": "2016-01-21T20:00:00-05:00", "description": "\"A skilled purveyor of lovely gloom\"—NPR", "name": "Chris Bathgate w/Bear Medicine"}, {"url": "https://www.facebook.com/events/1453480484950039/", "source": "Facebook", "date": "2016-01-22T20:00:00-05:00", "description": "Friday, January 22, 2016, 8:00 pm\nRackham Auditorium\n\nThe Chamber Music Society of Lincoln Center presents chamber music of every instrumentation, style, and historical period. The six musicians performing in this concert include violinist Benjamin Beilman, an Ann Arbor native whose career has been burnished by a series of major awards recognizing his extraordinary musical talent. \n\nMore info: http://ums.org/performance/chamber-music-society-of-lincoln-center", "name": "Chamber Music Society of Lincoln Center"}, {"url": "https://www.facebook.com/events/1452156068412417/", "source": "Facebook", "date": "2016-01-22T20:00:00-05:00", "description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "name": "Young Jean Lee Theater Company: Straight White Men"}, {"url": "https://www.facebook.com/events/1711386249095948/", "source": "Facebook", "date": "2016-01-23T20:00:00-05:00", "description": "Now featuring Molly Cherryholmes on fiddle!", "name": "Mountain Heart"}, {"url": "https://www.facebook.com/events/1008141132558808/", "source": "Facebook", "date": "2016-01-24T19:30:00-05:00", "description": "\"Sophisticated intelligence and provocative originality\"—Boston Globe", "name": "John Gorka"}, {"url": "https://www.facebook.com/events/1020565857968750/", "source": "Facebook", "date": "2016-01-27T19:30:00-05:00", "description": "Wednesday, January 27, 2016, 7:30 pm\nMichigan Theater\n\nBy any measure of talent and accomplishment, Lisa Fischer is a superstar. Yet, if you do not know her name, it’s likely because she has spent the past 20 years as a backup singer for the Rolling Stones, Sting, Chris Botti, and countless others. Her name may not be on the marquee, but she doesn’t care. Her astonishing range, spot-on intonation, mastery of the stage, and infectious sweet smile make her the go-to singer for the likes of Tina Turner, Chaka Khan, Beyoncé, Bobby McFerrin, Lou Reed, Dionne Warwick, Aretha Franklin, and a host of others. As one of the top session and backup singers, she’s featured in the Oscar-winning documentary 20 Feet from Stardom and celebrated for her live concert duets with Mick Jagger during “Gimme Shelter” that have also received millions of hits on YouTube. After winning Grammy Awards for “Best Female R&B Performance” (1992) and “Best Music Film” (2015), she has decided to move forward from being a backup singer, putting together her own band and claiming her well-deserved place center stage. \n\nMore info: http://ums.org/performance/ms-lisa-fischer-and-grand-baton", "name": "Ms. Lisa Fischer and Grand Baton"}, {"url": "https://www.facebook.com/events/1155115267866605/", "source": "Facebook", "date": "2016-02-02T19:30:00-05:00", "description": "Tuesday, February 2, 2016, 7:30 pm\nLydia Mendelssohn Theatre\n\nWith Tanya Tagaq, ancient meets modern in provocative, powerful ways. This spellbinding performance features the Inuit throat singer accompanying a screening of Nanook of the North (1922) with a live score. Tagaq’s mixed-media performance reclaims the controversial classic — considered the first feature-length documentary — capturing the sense of the sound of the Arctic spaces shown in the film and adding tremendous feeling and depth to what is a complex mix of beautiful representations and racially charged clichés.\n\nTanya Tagaq’s music is unnerving and exquisite, rooted in Inuit throat singing, but also influenced by electronica, industrial, and metal influences. It is a style that she has perfected with collaborators such as Björk and that reminds some of Meredith Monk’s vocal innovations. Winner of the 2014 Polaris Prize for “Album of the Year” (she beat out Drake and Arcade Fire), Tanya Tagaq makes her UMS debut in this one-night only event. “Nobody, anywhere, sounds like she does.” (Globe and Mail)\n\nMore info: http://ums.org/performance/tanya-tagaq/", "name": "Tanya Tagaq in concert with Nanook of the North"}, {"url": "https://www.facebook.com/events/1650197571924093/", "source": "Facebook", "date": "2016-02-03T20:00:00-05:00", "description": "South Africa's masters of a cappella harmony", "name": "Ladysmith Black Mambazo—Night 1"}, {"url": "https://www.facebook.com/events/415608208638260/", "source": "Facebook", "date": "2016-02-04T20:00:00-05:00", "description": "South Africa's masters of a cappella harmony", "name": "Ladysmith Black Mambazo—Night 2"}, {"url": "https://www.facebook.com/events/1594841967471096/", "source": "Facebook", "date": "2016-02-05T20:00:00-05:00", "description": "Friday, February 5, 2016, 8:00 pm\nLydia Mendelssohn Theatre\n\nTaylor Mac is equal parts bedazzled shaman, searing social critic, radical angel, and Elizabethan fool. A critical darling of the New York downtown cabaret scene, he is beloved for his iconic beauty, disarming vulnerability, and soaring spirit. His 24-Decade History of Popular Music will eventually become an epic show performed over 24 continuous hours; in Ann Arbor, Taylor will focus on the 1960s, 70s, and 80s, connecting the decades to the vibrant music scene in Detroit. “Fabulousness can come in many forms, and Taylor Mac seems intent on assuming every one of them.” (New York Times) A UMS co-commission. \n\nMore info: http://ums.org/performance/taylor-mac-a-24-decade-history-of-american-popular-music-1960s-1980s/", "name": "Taylor Mac: A 24-Decade History of American Popular Music: 1960s–1980s"}, {"url": "https://www.facebook.com/events/1435582513413462/", "source": "Facebook", "date": "2016-02-06T20:00:00-05:00", "description": "Saturday, February 6, 2016, 8:00 pm\nHill Auditorium \n\n“His superb live performance confirmed the impression of his recording: A major new pianist has arrived.” (New York Times) Born in 1987, the Russian-German pianist Igor Levit received effusive praise for his two-disc debut album of Beethoven’s late piano sonatas. A relative newcomer to the United States, he makes his UMS debut with this recital appearance. \n\nMore info: http://ums.org/performance/igor-levit/", "name": "Igor Levit, piano"}, {"url": "https://www.facebook.com/events/434979390034017/", "source": "Facebook", "date": "2016-02-10T20:00:00-05:00", "description": "New music from pioneers of alternative country", "name": "Freakwater"}, {"url": "https://www.facebook.com/events/1751894891699345/", "source": "Facebook", "date": "2016-02-11T20:00:00-05:00", "description": "Love and marriage ... and songwriting!", "name": "My Folky Valentine"}, {"url": "https://www.facebook.com/events/998900176828714/", "source": "Facebook", "date": "2016-02-12T20:00:00-05:00", "description": "Two Ark favorites in a richly comic duo show", "name": "Christine Lavin & Don White"}, {"url": "https://www.facebook.com/events/1730970073793618/", "source": "Facebook", "date": "2016-02-13T19:30:00-05:00", "description": "Featuring:\nNathan Bell with Rachel Brown & The Beatnik Playboys\nDakota Dave Hull\nRollie Tussing & The Midwest Territory Band\n\nand introducing Samantha Dunlap\n\nNote special start time!", "name": "The Ark and Acoustic Routes Present BREAKFEST 2016"}, {"url": "https://www.facebook.com/events/368546533344933/", "source": "Facebook", "date": "2016-02-13T20:00:00-05:00", "description": "Saturday, February 13, 2016, 8:00 pm\nPower Center\n\n“Every aspect of the dance-making here is thoroughly accomplished.” (New York Times) A prolific choreographer who danced with Ronald K. Brown’s Evidence, Rennie Harris’s Puremovement, and the Alvin Ailey American Dance Theater, Camille A. Brown brings her newest work to Ann Arbor for her UMS debut. Black Girl — Linguistic Play speaks to the complexities of carving out a positive identity as a Black female in urban American culture.\n\nIn a world where Black women are often portrayed only in terms of their strength, resiliency, or trauma, this work interrogates these narratives by presenting a fuller spectrum of the black female and the complexities of negotiating in this racially and politically charged world. The work uses elements of African-American social dancing, rhythmic play, and musical compositions to better illustrate who “Black Girl” knows herself to be. Brown’s choreography is “fun, inventive, and watchable.” (Times Square Chronicles) \n\nMore info: http://ums.org/performance/camille-a-brown-dancers/", "name": "Camille A. Brown & Dancers: Black Girl — A Linguistic Play"}, {"url": "https://www.facebook.com/events/621637631307319/", "source": "Facebook", "date": "2016-02-14T20:00:00-05:00", "description": "\"Gypsy-Swinging Serenading Firebreathing Circus Freaks.\" The perfect Valentine's, for some folks!", "name": "Caravan of Thieves"}, {"url": "https://www.facebook.com/events/442008155980033/", "source": "Facebook", "date": "2016-02-16T19:30:00-05:00", "description": "February 16, 18\nRackham Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "name": "Sir András Schiff, piano"}, {"url": "https://www.facebook.com/events/1480713228923537/", "source": "Facebook", "date": "2016-02-16T20:00:00-05:00", "description": "New music from Shawn! Dinner-show tickets available with dinner at Café Felix.", "name": "Shawn Colvin"}, {"url": "https://www.facebook.com/events/1670755793140201/", "source": "Facebook", "date": "2016-02-18T20:00:00-05:00", "description": "Zydeco accordion from Louisiana for a winter's night", "name": "Buckwheat Zydeco"}, {"url": "https://www.facebook.com/events/1620380161539059/", "source": "Facebook", "date": "2016-02-19T20:00:00-05:00", "description": "Friday, February 19, 2016, 8:00 pm\nMichigan Theater\n\nA decade after it was first brought to the screen, Benoît Charest revives the music of the Oscar-nominated film The Triplets of Belleville with a remarkable cast of musicians in this silent movie-live concert event. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His near-sighted grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas.\n\nBut the true star of the animated film is the hot jazz score written by Canadian composer Benoît Charest. This screening of the beloved French film transports audiences to the exciting streets of 1920s Paris and Le Jazz Hot.\n\nMore info: http://ums.org/performance/the-triplets-of-belleville/", "name": "The Triplets of Belleville"}, {"url": "https://www.facebook.com/events/1611931089050428/", "source": "Facebook", "date": "2016-02-20T20:00:00-05:00", "description": "February 20\nHill Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "name": "Sir András Schiff, piano"}, {"url": "https://www.facebook.com/events/711839748946653/", "source": "Facebook", "date": "2016-02-24T20:00:00-05:00", "description": "\"The world's greatest flatpicker\"—Oklahoma Gazette", "name": "Tommy Emmanuel"}, {"url": "https://www.facebook.com/events/1449897481978519/", "source": "Facebook", "date": "2016-02-25T21:00:00-05:00", "description": "Nashville-based, independent artist, Ron Pope, has stood at a crossroads where so many musicians find themselves — at the intersection of record label and independence. In an ever-evolving industry filled with rejection and compromise, he has plotted a new course for his music to reach loyal listeners, taking the industry-road-less-traveled in exchange for the ultimate payback, a league of devoted fans the world over. WSG: Tuett - http://www.truettofficial.com/\n\nVIP tix available here: http://www.etix.com/ticket/p/4574033/ron-pope-vip-meet-greet-ann-arbor-blind-pig-the-blind-pig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/446", "name": "Ron Pope & The Nighthawks w/ Truett 2/25/15 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1538895803015696/", "source": "Facebook", "date": "2016-02-26T20:00:00-05:00", "description": "\"Music to cure what ails you\"—Michigan Times", "name": "Mustard's Retreat"}, {"url": "https://www.facebook.com/events/1112577285437513/", "source": "Facebook", "date": "2016-02-27T19:30:00-05:00", "description": "A journey to the land of the mind's eye. Note special start time!", "name": "The Ark's 29th Annual Storytelling Festival feat. Kevin Kling"}, {"url": "https://www.facebook.com/events/1067500173261475/", "source": "Facebook", "date": "2016-02-28T13:00:00-05:00", "description": "Storytelling for the family", "name": "Storytelling for Kids"}, {"url": "https://www.facebook.com/events/1598997080377800/", "source": "Facebook", "date": "2016-03-05T20:00:00-05:00", "description": "Saturday, March 5, 2016, 8:00 pm\nHill Auditorium\n\nPaddy Malone and The Chieftains celebrated 50 years of performing in 2012, and their music remains as fresh and relevant as when they first began. Recognized for reinventing traditional Irish music on a contemporary and international scale, their ability to blend tradition with modern music has made them one of the most renowned and revered musical groups to this day. Back for their fifth UMS performance and their first in nearly a decade, “they seem ageless, and so does their Irish music. If common sense tells you they can’t go on forever, you wouldn’t know it from their electrifying performance.” (Boston Globe)\n\nMore info: http://ums.org/performance/the-chieftains/", "name": "The Chieftains"}, {"url": "https://www.facebook.com/events/488544131294497/", "source": "Facebook", "date": "2016-03-11T20:00:00-05:00", "description": "March 11-12\nPower Center\n\n“You can’t help but leave with a fuzzy feeling inside.” (examiner.com) The globetrotting, Montreal-based scratch DJ and music producer Kid Koala presents a magical, multi-disciplinary and theatrical adaptation of his graphic novel and soundtrack, Nufonia Must Fall. This charming story centers around a headphones-sporting robot on the verge of obsolescence who falls in love with a lonely office girl. This live adaptation unfolds via real-time filming of more than a dozen miniature stages and a cast of puppets, while Kid Koala and the Aelos Quartet provide original live scoring on piano, strings, and turntables. The result? You’ll seem to be watching an animated picture, but simultaneously seeing puppets being filmed and projected in real time. Heartfelt, hand-made, and a very cool live experience. \n\nMore info: http://ums.org/performance/nufonia-must-fall/", "name": "Nufonia Must Fall"}, {"url": "https://www.facebook.com/events/1622992504617740/", "source": "Facebook", "date": "2016-03-11T21:00:00-05:00", "description": "$18 adv./ $20 day of | 18+ | 9pm\n\nSimply put, Tortoise has spent nearly 25 years making music that defies description. While the Chicago-based instrumental quintet has nodded to dub, rock, jazz, electronica and minimalism throughout its revered and influential six-album discography, the resulting sounds have always been distinctly, even stubbornly, their own.\n\nFull Bio - http://www.blindpigmusic.com/calendar.html#!/events/521", "name": "Tortoise 3/11/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/971816919508035/", "source": "Facebook", "date": "2016-03-15T19:30:00-04:00", "description": "Tuesday, March 15, 2016, 7:30 pm\nSt. Francis of Assisi\n\nFresh from their 2014 performance of Monteverdi’s Vespers, Apollo’s Fire & Singers returns to St. Francis of Assisi Church with one of their signature pieces, Bach’s St. John Passion. Bursting out of the gate from the agitated opening chorus, this work is considered Bach’s most dramatic and theatrical oratorio. In this acclaimed interpretation, the story’s action is highlighted by a dramatic approach: the roles are performed by true singing actors, staged on a special theatrical platform within the orchestra. The acclaimed Apollo’s Singers evoke the wild mob with fierce intensity. \n\nMore info: http://ums.org/performance/apollos-fire-st-john-passion/", "name": "Apollo’s Fire & Apollo’s Singers: Bach’s St. John Passion"}, {"url": "https://www.facebook.com/events/1582133688713673/", "source": "Facebook", "date": "2016-03-19T20:00:00-04:00", "description": "Saturday, March 19, 2016, 8:00 pm\nHill Auditorium\n\nThe Montreal Symphony returns to Ann Arbor for the first time since 1989, with American conductor Kent Nagano and pianist Daniil Trifonov both making their UMS debuts. “Hearing Trifonov is like having a deep-tissue massage: you keep wanting to pull away from the sheer intensity of it, and you come out feeling as if your reality had been slightly altered…a knockout.” (Washington Post) \n\nMore info: http://ums.org/performance/montreal-symphony-orchestra/", "name": "Montreal Symphony"}, {"url": "https://www.facebook.com/events/1488521474793961/", "source": "Facebook", "date": "2016-03-20T19:30:00-04:00", "description": "Appalachia gone Brazilian! Photo by Vincent Soyez. This show is FREE to Ark members at the door.", "name": "Matuto"}, {"url": "https://www.facebook.com/events/962546740435420/", "source": "Facebook", "date": "2016-03-23T20:00:00-04:00", "description": "Indian classical music and multicultural fusion", "name": "Maestro Khan"}, {"url": "https://www.facebook.com/events/119883711695876/", "source": "Facebook", "date": "2016-03-24T20:00:00-04:00", "description": "New music from Patty!", "name": "Patty Larkin"}, {"url": "https://www.facebook.com/events/1663165150570187/", "source": "Facebook", "date": "2016-03-26T20:00:00-04:00", "description": "Saturday, March 26, 2016, 8:00 pm\nHill Auditorium\n\nBach’s complete Sonatas and Partitas have long been a “Mount Everest” of the violin repertoire — music that performers return to throughout their lives. In this special event, Gil Shaham collaborates with video artist David Michalek to open up new avenues for listening to and interpreting Bach’s towering masterpieces.\n\nVideo artist David Michalek, best known for his “Slow Dancing” installation at Lincoln Center, and in the capitals of Europe, says of the Bach Six Solos project: “As a contemporary artist with a particular interest in motion pictures and time, I’ve been compelled to consider how the addition of extreme slow motion might be applied to moving images of the face, the body, obliquely narrative tableaux, and also still life in ways that can both enhance and alter the meanings latent within them. As a visual strategy, extreme slowness creates a continuing sense of a pause in the action — as if the growth and evolution of the slow-moving image is itself a further manifestation of the deep and consuming absorptive state that often arises while observing it.”\n\nMore info: http://ums.org/performance/gil-shaham/", "name": "Bach Six Solos: Gil Shaham, violin"}, {"url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook", "date": "2016-03-31T19:30:00-04:00", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"url": "https://www.facebook.com/events/453190221522442/", "source": "Facebook", "date": "2016-04-01T20:00:00-04:00", "description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "name": "Mariachi Vargas de Tecalitlán"}, {"url": "https://www.facebook.com/events/445903825593347/", "source": "Facebook", "date": "2016-04-02T20:00:00-04:00", "description": "Punk-funk-folk's pathbreaking entrepreneur. At the Michigan Theater, 603 E. Liberty, Ann Arbor.", "name": "Ani DiFranco at The Michigan Theater"}, {"url": "https://www.facebook.com/events/1617523538522455/", "source": "Facebook", "date": "2016-04-06T19:30:00-04:00", "description": "Note special start time!", "name": "Micah Smiles Benefit Concert for C.S. Mott Children's Hospital"}, {"url": "https://www.facebook.com/events/827290400697161/", "source": "Facebook", "date": "2016-04-08T20:00:00-04:00", "description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "name": "Jerusalem Quartet"}, {"url": "https://www.facebook.com/events/1602568673339827/", "source": "Facebook", "date": "2016-04-13T20:00:00-04:00", "description": "South Africa's legendary breaker of walls", "name": "The Johnny Clegg Band"}, {"url": "https://www.facebook.com/events/1621365181438631/", "source": "Facebook", "date": "2016-04-14T19:30:00-04:00", "description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "name": "Mnozil Brass"}, {"url": "https://www.facebook.com/events/419604171550681/", "source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus, where it blended with elements of Spanish music, then was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed Tunisian singer Sonia M’barek, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "name": "Zafir: Musical Winds from North Africa to Andalucía"}, {"url": "https://www.facebook.com/events/1579924995611394/", "source": "Facebook", "date": "2016-04-16T20:00:00-04:00", "description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "name": "Bavarian Radio Orchestra"}, {"url": "https://www.facebook.com/events/1589849627952742/", "source": "Facebook", "date": "2016-04-23T20:00:00-04:00", "description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "name": "The Bad Plus Joshua Redman"}]