[{"source": "Facebook", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-          March 15 – Sam Van Wagoner\nhttp://www.samvanwagonermusic.com/\nMICHIGAN ACOUSTIC BREWERY TOUR! Sam Van Wagoner is a singer­songwriter from Detroit, MI. His sound traverses a wide spectrum of American roots music, from acoustic folk to horn­fueled R&B. Beginning his career in LA, he has traveled across the country performing. His 2015 EP On Tap features some of Detroit’s finest musicians. \n\n-          March 22 – Kevin Devine\nKevin Devine is an Ann Arbor-based singer, songwriter and entertainer whose fans range in age from kindergartners to 106- year-olds. Kevin has performed thousands of shows from Berlin, Massachusetts to Wetumpka, Alabama to Sunville, Michigan and everywhere in between, including children's and family concerts, senior citizen sing-alongs and \"big kid\" shows in pubs and clubs with various bands, like his current Ann Arbor band, Kevin & the Glen Levens, a roots/Celtic/Americana band. His shows feature a fast-paced ramble through a dozen genres with an emphasis on novelty songs, audience participation and improvisation bordering on chaos.  And accordions.\n\n-      March 29 - Dave Menzo\nhttp://www.davemenzo.com/\nDave Menzo is a solo artist who has the pleasure of playing with a few bands and many talented musicians.\n\nAPRIL\n\n-          April 5 - Bob Skon \nhttp://bobskon.com/\n\"Bob is a musician best described in the singer / songwriter style, blended with a healthy dose of folk-rock, and a touch of jazz.... He has a wonderful ability to use intelligent wordplay for capturing those moments in life we can all identify with. In this Bob could be a peer of the legendary Ray Davies.\" - The Bodhisattva Beat\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1570530316598853/", "name": "Acoustic Tuesdays: Sam Van Wagoner", "date": "2016-03-15T19:00:00-04:00"}, {"source": "Facebook", "description": "Can you feel it? Spring? It's there hiding behind the snow -- come celebrate it with us! Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Reader\n\nThis month's feature: ALISE ALOUSI!\n\nAlise Alousi’s writing has appeared in: Graffiti Rag, The Alternative Press, The Malpais Review and in several anthologies including, We are Iraqis: Aesthetics and Politics in a Time of War, Inclined to Speak: An Anthology of Contemporary Arab American Poetry, and To Light a Fire: 20 Years with the InsideOut Literary Arts Project.  She has received fellowships to Soul Mountain and the Fine Arts Work Center and was among the first Knight Arts Challenge Detroit recipients for From Detroit to Baghdad: Al-Mutanabbi Street Starts Here, an exhibit and performance series commemorating the bombing of Baghdad's centuries old street of booksellers. Alousi is the Interim Executive Director of the InsideOut Literary Arts Project.\n\n\nNext month's feature: SUSAN HUTTON!", "url": "https://www.facebook.com/events/1573310022990502/", "name": "Skazat! Poetry Series featuring Alise Alousi", "date": "2016-03-15T19:00:00-04:00"}, {"source": "Facebook", "description": "Join U-M History faculty as they discuss their recent publications, which will be available for purchase and signing. Featuring: Paulina Alberto, Stephen Berrey, Howard Brick, Deirdre de Cruz, Gregory Dowd, Hussein Fancy, Nancy Rose Hunt, Martha S. Jones, Tiya Miles, Derek Peterson, Sherie Randolph, Ronald G. Suny, Thomas Trautmann, and Jeffrey Veidlinger. Light hors d'oeuvres and non-alcoholic beverages provided. Presented by the Eisenberg Institute for Historical Studies, the University of Michigan Department of History, and Literati Bookstore.", "url": "https://www.facebook.com/events/189069494794416/", "name": "The Past is Present: New Writings from U-M Historians", "date": "2016-03-15T19:00:00-04:00"}, {"source": "Facebook", "description": "Tuesday, March 15, 2016, 7:30 pm\nSt. Francis of Assisi\n\nFresh from their 2014 performance of Monteverdi’s Vespers, Apollo’s Fire & Singers returns to St. Francis of Assisi Church with one of their signature pieces, Bach’s St. John Passion. Bursting out of the gate from the agitated opening chorus, this work is considered Bach’s most dramatic and theatrical oratorio. In this acclaimed interpretation, the story’s action is highlighted by a dramatic approach: the roles are performed by true singing actors, staged on a special theatrical platform within the orchestra. The acclaimed Apollo’s Singers evoke the wild mob with fierce intensity. \n\nMore info: http://ums.org/performance/apollos-fire-st-john-passion/", "url": "https://www.facebook.com/events/971816919508035/", "name": "Apollo’s Fire & Apollo’s Singers: Bach’s St. John Passion", "date": "2016-03-15T19:30:00-04:00"}, {"source": "Facebook", "description": "Come celebrate Irish week here at babo!\n\nWe will be offering 10% off all green juices, Irish lattes, and beer on draft. \n\nAnd don't forget about our delicious Irish food specials!\n\nSee our menu below!\n\nHowever, you will be celebrating we have options for you!\n\nBABO IRISH WEEK\nMonday, March. 14th –Sunday, Mar. 20th\n\nFOOD SPECIALS\n\nSANDWICH OF THE WEEK\n\nCORNED BEEF SANDWICH\ncrust bakery rye, housemade corned beef, braised cabbage slaw, whole grain mustard, swiss cheese\n\nENTREE OF THE WEEK\n\nRYE-CRUSTED CORNED BEEF\nbraised corned beef with toasted caraway, crust bakeries rye bread crumbs, topped with rich caraway gravy\n\nVEGETARIAN ENTREE OF THE WEEK\n\nBRAISED CABBAGE\nslow braised cabbage, onion, and tomatoes seasoned with garlic, onion, thyme, and fennel seed\n\nFEATURED SIDES\n\nROSTI POTATOES\nshredded potato pancake filled with roasted shallots, thyme, and cheddar cheese\n\nROASTED ROOT VEGETABLE MEDLEY\ncarrots, parsnips, turnips, fennel, garlic, thyme, and Guinness stout glaze", "url": "https://www.facebook.com/events/1581383522183183/", "name": "Babo Irish Week", "date": "2016-03-15T20:00:00-04:00"}, {"source": "Facebook", "description": "We've got a special WEDNESDAY edition of NNA2 headed your way this March! Monica Dus will reveal the secret of why that sugar-free cookie just ain't the same as the real thing. Lindsay Blackwell will explain the difference between harmless and super-scary trolls on the interwebs. And Brian Worthman will take us on a journey by describing how smarty-pants scientists figured out the makeup of the Earth's crust. Three of the greatest nerds that A2 has to offer, awesome friends, and booze to boot? Get down to LIVE to geek out with us!\n \nWhen: WEDNESDAY, March 16, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER! bc Ann Arbor District Library RULEZ the SCHOOLZ!!\n\nMonica Dus: \"50 Shades of Sweet: How Sugar Dominates the Brain\"\nWe like to think we can resist life’s temptations, but ever tried saying no to a cookie? It whispers to you, it calls to you. Sugar is a powerful force: it hijacks your brain and wins nearly all the time ... I'll talk about how this happens and also how, even if your mouth is fooled by fake sugar, your brain is not.\n\nAbout Monica:\n\n I got my first microscope at age 7 and had an idyllic childhood in Italy pulling hair off Barbies and legs off bugs and looking at them under the microscope. What really drew me to science, however, was the pervasive beauty of the natural world. I still remember my first encounters with molecular biology: I was awed by its beauty and complexity. Nearly twenty years later, I still haven’t found something that is man-made and more beautiful than the natural world, not even a Dolce&Gabbana dress. I am currently a professor at University of Michigan where I head a research lab and teach genetics and neuroscience. My favorite things in life are dogs, desserts, philosophy and post-modern literature, pastel colors,  unicorns, and of course, teaching.\nFind her on Twitter as @Hardkandy000\n\nLindsay Blackwell: \"Trolls, Trouble, and Telling the Difference\"\n\nFor as long as we've had the Internet, we've had online trolls. But what is a troll, really—and how do we tell the difference between trolling and more serious forms of abuse? To build a better and more empathetic web, researchers, designers, and users must work in tandem. In this talk, PhD student Lindsay Blackwell explores the ins and outs of misbehavior online, including efforts to regulate and prevent online harassment.\n\nAbout Lindsay:\nLindsay Blackwell is a PhD student at the University of Michigan School of Information's Social Media Research Lab. Her research explores misbehavior in online communities, including trolling and online harassment. Prior to graduate school, Lindsay enjoyed a career in social media marketing, where she won several awards for her work with clients like I Love New York. You can follow Lindsay on Twitter (@linguangst) or by visiting www.lindsayblackwell.net. \n\nFind her on Twitter as @linguangst\n\nBrian Worthmann: \"Journey to the Center of the Earth\"\nFrom the guy who brought you acoustic waves in the air and ocean a few Nerd Nites ago comes another talk about the inner layers of the Earth. Many of us learned in high school (or earlier!) that the Earth is composed of a crust, mantle, outer core and inner core. But how do we know that? The easy answer is \"well, smart scientists said so\". But assuming you consider that an unsatisfactory explanation, Brian will talk about some feats of science and engineering used in the last hundred years or so to explore what lies beneath our feet.\n\nAbout Brian:\nA graduate student at the University of Michigan in the Applied Physics Department, Brian spends his not-free time researching acoustics and talking about science with whoever wants to listen. And he spends his free time nerding out pretty hard about physics, math and engineering, and binge-watching House of Cards Season 4. Brian is a 2015 RELATE alum, and also one of the newest members of the RELATE coordinator team.", "url": "https://www.facebook.com/events/546123325546142/", "name": "Sugar & the Brain, Internet Trolls, & Discovering the Earth's Core", "date": "2016-03-16T19:00:00-04:00"}, {"source": "Facebook", "description": "Literati is delighted to welcome MacArthur Fellow and Harvard sociologist Matthew Desmond in support of Evicted: Poverty and Profit in the American City.\n\nIn this brilliant, heartbreaking book, Matthew Desmond takes us into the poorest neighborhoods of Milwaukee to tell the story of eight families on the edge. Arleen is a single mother trying to raise her two sons on the $20 a month she has left after paying for their rundown apartment. Scott is a gentle nurse consumed by a heroin addiction. Lamar, a man with no legs and a neighborhood full of boys to look after, tries to work his way out of debt. Vanetta participates in a botched stickup after her hours are cut. All are spending almost everything they have on rent, and all have fallen behind. The fates of these families are in the hands of two landlords: Sherrena Tarver, a former schoolteacher turned inner-city entrepreneur, and Tobin Charney, who runs one of the worst trailer parks in Milwaukee. They loathe some of their tenants and are fond of others, but as Sherrena puts it, “Love don’t pay the bills.” She moves to evict Arleen and her boys a few days before Christmas. Even in the most desolate areas of American cities, evictions used to be rare. But today, most poor renting families are spending more than half of their income on housing, and eviction has become ordinary, especially for single mothers. In vivid, intimate prose, Desmond provides a ground-level view of one of the most urgent issues facing America today. As we see families forced  into shelters, squalid apartments, or more dangerous neighborhoods, we bear witness to the human cost of America’s vast inequality—and to people’s determination and intelligence in the face of hardship. Based on years of embedded fieldwork and painstakingly gathered data, this masterful book transforms our understanding of extreme poverty and economic exploitation while providing fresh ideas for solving a devastating, uniquely American problem. Its unforgettable scenes of hope and loss remind us of the centrality of home, without which nothing else is possible.\n\n\"This is an extraordinary and crucial piece of work. Read it. Please, read it.”\n—Adrian Nicole LeBlanc, author of Random Family\n\n“Evicted is a striking account of a severe and rapidly developing form of economic hardship in the U.S. Matthew Desmond’s riveting narrative of the experiences of families in Milwaukee embroiled in the process of eviction will not only shock general readers, but it will broaden the perspective of experts on urban poverty as well. This powerful, well-written book also includes revealing portraits of profit-seeking landlords, as well as important findings from comprehensive surveys to back up the ethnographic research. Evicted is that rare book that both enlightens and serves as an urgent call for action.”\n—William Julius Wilson, Lewis P. and Linda L. Geyser University Professor, Harvard University, and author of When Work Disappears\n\n\"This sensitive, achingly beautiful ethnography should refocus our understanding of poverty in America on the simple challenge of keeping a roof over your head.\"\n—Robert D. Putnam, Professor of Public Policy, Harvard, and author of Bowling Alone and Our Kids\nMatthew Desmond is the John L. Loeb Associate Professor of the Social Sciences at Harvard University and codirector of the Justice and Poverty Project. A former member of the Harvard Society of Fellows, he is the author of the award-winning book On the Fireline, coauthor of two books on race, and editor of a collection of studies on severe deprivation in America. His work has been supported by the Ford, Russell Sage, and National Science Foundations, and his writing has appeared in the New York Times and Chicago Tribune. In 2015, Desmond was awarded a MacArthur “Genius” grant.\n\nPhoto Credit: John D. & Catherine T. MacArthur Foundation", "url": "https://www.facebook.com/events/580540912113420/", "name": "Matthew Desmond: Evicted", "date": "2016-03-16T19:00:00-04:00"}, {"source": "Facebook", "description": "Two young buckaroos wake up, sneak past the sheriff (Mom), and head outside, using Spanish words as they go. \"Andale! Hurry!\" they cry. They enjoy chases, lasso games and lots of dirt--but will the sheriff be able to round them up at the end of the day? Includes a glossary of Spanish words.", "url": "https://www.facebook.com/events/1027466247295861/", "name": "Join Us for the Launch Party for Children's Author Shanda Trent's New Picture Book, 'Giddy-Up Buckaroos'", "date": "2016-03-16T19:00:00-04:00"}, {"source": "Facebook", "description": "Join us at ABC for a wee bit of fun on St. Patrick’s Day!\nTop of the morning at 8am for breakfast & happy hour\nMichael Faricy Stout and Espresso Love Breakfast Stout on tap\nTraditional Irish specials & no cover all day long\n\nFREE ST PATRICK'S DAY T'S TO THE FIRST 50 CUSTOMERS!", "url": "https://www.facebook.com/events/541503302694996/", "name": "St. Patrick's Day at ABC Brewpub", "date": "2016-03-17T08:00:00-04:00"}, {"source": "Facebook", "description": "FEELING LUCKY?\nWe are looking to share our take on \"The luck of the Irish\" with you! We're even making a weekend out of it and offering these delicious options from March 17- March 20. \n\nOffering hearty meals with potatoes, corned beef, and cabbage. Paired with a dry stout or craft cocktail with Jameson Irish Whiskey.\n\nMake your reservation with link listed above. \n\n– ST. PATTY'S DAY FOOD SPECIALS – \n\nBEER & CHEDDAR DIP\naged cheddar, irish red ale, zingerman's pretzels\n\nCORNED BEEF\nbraised corned beef, roasted root vegetables, braised cabbage, housemade mustard\n\nCORNED BEEF SANDWICH\nsauerkraut, gruyère, housemade aioli, irish soda bread\n\nVEGETARIAN SHEPHERD'S PIE\ncheesy mashed potatoes, vegetable pot roast\n\n– ST. PATTY'S DAY COCKTAILS –\n\nBREAKFAST WITH PATTY\njameson caskmates, cold press\n\nDUBLINER\njameson black barrel, vermouth, angostura\n\nHOT PADDY \npaddy, cardamom honey, lemon, ginger tea\n\n– BEERS –\n\nWOLVERINE | THE VOLITIONIST\nDry Stout Lager­­ \n\nWOLVERINE | SNAKES ON A SHAMROCK \nIrish Red Lager­ \n\nGUINNESS\nIrish Dry Stout", "url": "https://www.facebook.com/events/1765846730302973/", "name": "Sava's St. Patty's Day", "date": "2016-03-17T13:00:00-04:00"}, {"source": "Facebook", "description": "Want to learn more about what's going on at Maker Works?\n\nJoin us for our Monthly Member Meeting, led by Maker Works co-founders Tom Root and Dale Grover. In it, they'll cover:\n\n- Maker Works Business Scoreboard and Profit & Loss\n- Membership Options\n- Announcements & Upcoming Changes\n\nIf you are or have ever been a member, we would love to see you there! Stop by the shop to stay up to date on Maker Works news.", "url": "https://www.facebook.com/events/529888503858209/", "name": "March Member Meeting", "date": "2016-03-17T20:00:00-04:00"}, {"source": "Facebook", "description": "Come celebrate Irish week here at babo!\n\nWe will be offering 10% off all green juices, Irish lattes, and beer on draft. \n\nAnd don't forget about our delicious Irish food specials!\n\nSee our menu below!\n\nHowever, you will be celebrating we have options for you!\n\nBABO IRISH WEEK\nMonday, March. 14th –Sunday, Mar. 20th\n\nFOOD SPECIALS\n\nSANDWICH OF THE WEEK\n\nCORNED BEEF SANDWICH\ncrust bakery rye, housemade corned beef, braised cabbage slaw, whole grain mustard, swiss cheese\n\nENTREE OF THE WEEK\n\nRYE-CRUSTED CORNED BEEF\nbraised corned beef with toasted caraway, crust bakeries rye bread crumbs, topped with rich caraway gravy\n\nVEGETARIAN ENTREE OF THE WEEK\n\nBRAISED CABBAGE\nslow braised cabbage, onion, and tomatoes seasoned with garlic, onion, thyme, and fennel seed\n\nFEATURED SIDES\n\nROSTI POTATOES\nshredded potato pancake filled with roasted shallots, thyme, and cheddar cheese\n\nROASTED ROOT VEGETABLE MEDLEY\ncarrots, parsnips, turnips, fennel, garlic, thyme, and Guinness stout glaze", "url": "https://www.facebook.com/events/1581383522183183/", "name": "Babo Irish Week", "date": "2016-03-17T20:00:00-04:00"}, {"source": "Facebook", "description": "FEELING LUCKY?\nWe are looking to share our take on \"The luck of the Irish\" with you! We're even making a weekend out of it and offering these delicious options from March 17- March 20. \n\nOffering hearty meals with potatoes, corned beef, and cabbage. Paired with a dry stout or craft cocktail with Jameson Irish Whiskey.\n\nMake your reservation with link listed above. \n\n– ST. PATTY'S DAY FOOD SPECIALS – \n\nBEER & CHEDDAR DIP\naged cheddar, irish red ale, zingerman's pretzels\n\nCORNED BEEF\nbraised corned beef, roasted root vegetables, braised cabbage, housemade mustard\n\nCORNED BEEF SANDWICH\nsauerkraut, gruyère, housemade aioli, irish soda bread\n\nVEGETARIAN SHEPHERD'S PIE\ncheesy mashed potatoes, vegetable pot roast\n\n– ST. PATTY'S DAY COCKTAILS –\n\nBREAKFAST WITH PATTY\njameson caskmates, cold press\n\nDUBLINER\njameson black barrel, vermouth, angostura\n\nHOT PADDY \npaddy, cardamom honey, lemon, ginger tea\n\n– BEERS –\n\nWOLVERINE | THE VOLITIONIST\nDry Stout Lager­­ \n\nWOLVERINE | SNAKES ON A SHAMROCK \nIrish Red Lager­ \n\nGUINNESS\nIrish Dry Stout", "url": "https://www.facebook.com/events/1765846730302973/", "name": "Sava's St. Patty's Day", "date": "2016-03-18T13:00:00-04:00"}, {"source": "Facebook", "description": "This is a free event.\n\nAs part of a community partnership with the 54TH Ann Arbor Film Festival we will be hosting this special presentation on Friday, March 18 at 3:00 PM.  \n\nA very special presentation of Light Music (1975/1977) an expanded cinema work for two 16mm projectors and sound system by British artist and filmmaker Lis Rhodes (b.1942).\nIn this groundbreaking work, Rhodes plays with our preconception of film by presenting the soundtrack as a series of horizontal and vertical lines that were drawn with pen and ink on the optical edge of the filmstrip. These are projected onto two opposite facing screens in a hazy room. As the films roll, they appear as an ‘optical soundtrack’. What the viewer hears, on the other hand, is the audible equivalent of the alternating images on the screens. The space between the two screens turns the beams into airy sculptural forms consisting of light, shadow and smoke, which encourages the viewer to move around the room. This in turns destroys conventional film watching codes and turns the film into a collective practice where the audience is expected to intervene into the work and thus, become the performer. This work was the artist’s reaction to what she perceives as a lack of interest and appreciation of European women composers. Thus in Light Music, Lis Rhodes interweaves cinematic practices with a range of topics from gender politics to phenomenological experience. --Deren Erelçin\n\nThe Ann Arbor Film Festival is the longest-running independent and experimental film festival in North America. The 54th AAFF takes place March 15 - 20, 2016 and presents over 200 films, videos and performances from more than 20 countries with dozens of U.S., N. American and world premieres. For more info: aafilmfest.org", "url": "https://www.facebook.com/events/1058789827495894/", "name": "Light Music: Lis Rhodes Special Presentation at the Ann Arbor Art Center", "date": "2016-03-18T15:00:00-04:00"}, {"source": "Facebook", "description": "Literati is pleased to welcome Craig Dionne, presenting from his title Posthuman Lear: Reading Shakespeare in the Anthropocene.\n\nApproaching King Lear from an eco-materialist perspective, Posthuman Lear examines how the shift in Shakespeare’s tragedy from court to stormy heath activates a different sense of language as tool-being — from that of participating in the flourish of aristocratic prodigality and circumstance, to that of survival and pondering one’s interdependence with a denuded world. Dionne frames the thematic arc of Shakespeare’s tragedy about the fall of a king as a tableaux of our post-sustainable condition. For Dionne, Lear’s progress on the heath works as a parable of flat ontology.\n\nAt the center of Dionne’s analysis of rhetoric and prodigality in the tragedy is the argument that adages and proverbs, working as embodied forms of speech, offer insight into a nonhuman, fragmentary mode of consciousness. The Renaissance fascination with memory and proverbs provides an opportunity to reflect on the human as an instance of such enmeshed being where the habit of articulating memorized patterns of speech works on a somatic level. Dionne theorizes how mnemonic memory functions as a potentially empowering mode of consciousness inherited by our evolutionary history as a species, revealing how our minds work as imprinted machines to recall past prohibitions and useful affective scripts to aid in our interaction with the environment. The proverb is that linguistic inscription that defines the equivalent of human-animal imprinting, where the past is etched upon collective memory within ‘adagential” being that lives on through the generations as autonomic cues for survival.\n\nDionne’s reimagining of this tragedy is important in the way it places Shakespeare’s central existential questions — the meaning of familial love, commitments to friends, our place in a secular world — in a new relation to the main question of surviving within fixed environmental limits. Along the way, Dionne reflects on the larger theoretical implications of recycling the old historicism of early modern culture to speak to an eco-materialism, and why the modernist textual aesthetics of the self-distancing text seems inadequate when considering the uncertainty and trauma that underscores life in a post-sustainable culture. Dionne’s final appeal is to “repurpose” our fatalism in the face of ecological disaster.\n\nCraig Dionne is Professor of Literary and Cultural Theory at Eastern Michigan University, where he teaches Shakespeare and Early Modern English Literature. He specializes in Shakespeare and popular culture, early modern literacies and cultural studies. He has co-edited Disciplining English: Alternative Critical Perspectives (with David Shumway, SUNY Press, 2002), Rogues and Early Modern English Culture (with Steve Mentz, University of Michigan Press, 2005), Native Shakespeares: Indigenous Appropriations on a Global Stage (with Parmita Kapadia, Ashgate, 2008), and Bollywood Shakespeares (with Parmita Kapadia, Palgrave, 2014).  He was senior editor of JNT: Journal of Narrative Theory for ten years, and he also co-edited the inaugural issue of postmedieval: a journal of medieval cultural studies (with Eileen Joy, Palgrave, 2010).", "url": "https://www.facebook.com/events/470897309779133/", "name": "Craig Dionne", "date": "2016-03-18T19:00:00-04:00"}, {"source": "Facebook", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Thursday Interns\" starring Doug Kolbicz and Janelle Soulliere\n\nGroup 2: \"Buddy Cop\" starring Jacob Russell and Chris Petersen\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Corene Ford, Doug Kolbicz, Erik Heilner, Jacob Russell, and Julia Schroeder", "url": "https://www.facebook.com/events/948653355172234/", "name": "Pointless Improv with Thursday Interns and Buddy Cop", "date": "2016-03-18T20:00:00-04:00"}, {"source": "Facebook", "description": "Keep your St. Paddy's celebrations going strong all weekend with the Hair of the Dog Day-After St. Patrick's Day Party! Ghost City Searchlight will be in the house with their foot-stomping Celtic folk rock. As is tradition, Snakes on a Shamrock Irish Red Lager and the Voltionist Dry Stout Lager 15-oz pours are only $2 all day and  night! Menu specials to be announced. \n\nMore on the band here: http://ghostcitysearchlight.com/", "url": "https://www.facebook.com/events/483904475144432/", "name": "The Hair of the Dog Party: Ghost City Searchlight!", "date": "2016-03-18T20:30:00-04:00"}, {"source": "Facebook", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring: Aaron Johnstone, Corene Ford, Doug Kolbicz, Erik Heilner, Jacob Russell, and Julia Schroeder", "url": "https://www.facebook.com/events/838836839561896/", "name": "A Pointless Display of Improvised Feats", "date": "2016-03-18T22:00:00-04:00"}, {"source": "Facebook", "description": "Kick off the 2016 racing seasson with the Waterloo Grit and Gravel road race! Three different distances, all with Wolverine State beer at the finish line, free for all 21+ participants. Visit epicraces.com for more information and to sign up. See you at the finish line!", "url": "https://www.facebook.com/events/756066817828222/", "name": "Waterloo Grit and Gravel", "date": "2016-03-19T10:00:00-04:00"}, {"source": "Facebook", "description": "Do you like photography and spending time outdoors? Photo monitoring may be the perfect volunteer opportunity for you! We need volunteers to take beautiful photos at specific locations each season to record the progress of our restoration work. You must have your own digital camera. Come join us at this informational meeting for more details about this volunteer opportunity! Please register by March 16. For more information or to register call NAP 734.794.6627, or send us an email at NAP@a2gov.org.", "url": "https://www.facebook.com/events/493180147540094/", "name": "Photo Monitoring Kickoff & Training", "date": "2016-03-19T10:00:00-04:00"}, {"source": "Facebook", "description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "url": "https://www.facebook.com/events/461342057391118/", "name": "Little Peeps PlayGround - \"Mysteries\"", "date": "2016-03-19T10:30:00-04:00"}, {"source": "Facebook", "description": "This training is for volunteers interested in leading and/or co-leading NAP stewardship workdays. We will focus on procedures, ecological considerations, and tips and tricks to lead a successful event. Participants must be 18 years old or older, and must have a strong commitment to preserving the environment while fostering community and engaging the public. An interest and background in ecology (and plant ID) is strongly desired, but not required. Participants should be dressed for classroom and time outside. Please register by March 16. For more information or to register call NAP 734.794.6627, or send us an email at NAP@a2gov.org", "url": "https://www.facebook.com/events/956729351080887/", "name": "Workday Leader Training", "date": "2016-03-19T12:00:00-04:00"}, {"source": "Facebook", "description": "A heart-pounding new Stevens and Windermere thriller from the award-winning author of \"The Stolen Ones \"and\" The Professionals.\" \n\nKirk Stevens and Carla Windermere of the joint BCA-FBI violent crime task force have handled shocking cases before, but this one is different. Stevens s daughter, Andrea, is distraught over a classmate s suicide, but what the two investigators find is even more disturbing an online suicide club of unhappy teenagers, presided over by an anonymous presence who seems to be spurring them on. Soon, it becomes apparent that the classmate wasn t the first victim and won t be the last, either, unless they can hunt down this psychopath once and for all.\n\nOwen Laukkanen was born in Vancouver. After graduating from university in 2006, he answered an ad on Craigslist for a summer job at the World Series of Poker in Las Vegas as a poker tournament reporter for a poker website. At the end of the summer, they offered him a full-time job. You wouldn t think you could make a living at this, but you would be wrong. For the next three years he traveled around the world, reporting from the most luxurious casinos of Monaco and Macau and Australia to the sketchiest card rooms of California and Atlantic City. In 2009, having seen his fill, Laukkanen quit to concentrate on fiction. He also spends summers as a deckhand on the boats of his father and his uncle, both commercial fishermen. He is at work on more novels. \n\nHis previous Stevens and Windermere novels are \"The Professionals,\" \"Criminal Enterprise,\" \"Kill Fee,\" and \"The Stolen Ones.\" \"The Professionals\" was nominated for the Barry Award and International Thriller Writers Award for best first novel, as well as the \"Spinetingler\" Award for Best Novel: New Voice. \"Criminal Enterprise\" was nominated for the ITW Award for best novel. Both books, as well as \"Kill Fee,\" appeared on several best-of-the-year lists.", "url": "https://www.facebook.com/events/1064114296941949/", "name": "Meet Canadian Thriller Author Owen Laukkanen for a Discussion & Signing of His Latest Stevens & Windermere Novel, 'The Watcher in the Wall'", "date": "2016-03-19T15:00:00-04:00"}, {"source": "Facebook", "description": "\"Laughing at Cancer\" is Pointless Brewery & Theatre's fundraising event to raise money for cancer research. Tori Tomalia, co-founder of Pointless, received the devastating diagnosis of stage IV lung cancer in May of 2013. After months of chemotherapy, a genetic test revealed the mutation that is driving her cancer (called ROS1) and she is now able to manage her cancer with cutting-edge targeted pills that work directly on this mutation.\n\nMarch 19th will be Tori's 40th birthday, and what better way to celebrate than to raise funds to support more innovative treatments like this.\n\nThere will be an \"all-ages\" show at 7 pm, and an adults-only show at 9 pm. Both shows will feature Tori telling stories about her experiences that might make you laugh and might make you cry, and the League of Pointless Improvisers who might make you laugh until you cry. Either way, there is certain to be laughing, possibly crying. There will also be a special beer brewed just for the occasion, and a silent auction.\n\nThe money raised will go toward a special ROS1 fund at the Bonnie J. Addario Lung Cancer Foundation. These funds are earmarked for a new study focused on ROS1 driven cancers. This is an exciting, innovative, and patient-driven endeavor, and one that will directly help Tori and people like her.", "url": "https://www.facebook.com/events/1568069486841967/", "name": "Laughing at Cancer - shows at 7 pm & 9 pm", "date": "2016-03-19T19:00:00-04:00"}, {"source": "Facebook", "description": "Saturday, March 19, 2016, 8:00 pm\nHill Auditorium\n\nThe Montreal Symphony returns to Ann Arbor for the first time since 1989, with American conductor Kent Nagano and pianist Daniil Trifonov both making their UMS debuts. “Hearing Trifonov is like having a deep-tissue massage: you keep wanting to pull away from the sheer intensity of it, and you come out feeling as if your reality had been slightly altered…a knockout.” (Washington Post) \n\nMore info: http://ums.org/performance/montreal-symphony-orchestra/", "url": "https://www.facebook.com/events/1582133688713673/", "name": "Montreal Symphony", "date": "2016-03-19T20:00:00-04:00"}, {"source": "Facebook", "description": "FEELING LUCKY?\nWe are looking to share our take on \"The luck of the Irish\" with you! We're even making a weekend out of it and offering these delicious options from March 17- March 20. \n\nOffering hearty meals with potatoes, corned beef, and cabbage. Paired with a dry stout or craft cocktail with Jameson Irish Whiskey.\n\nMake your reservation with link listed above. \n\n– ST. PATTY'S DAY FOOD SPECIALS – \n\nBEER & CHEDDAR DIP\naged cheddar, irish red ale, zingerman's pretzels\n\nCORNED BEEF\nbraised corned beef, roasted root vegetables, braised cabbage, housemade mustard\n\nCORNED BEEF SANDWICH\nsauerkraut, gruyère, housemade aioli, irish soda bread\n\nVEGETARIAN SHEPHERD'S PIE\ncheesy mashed potatoes, vegetable pot roast\n\n– ST. PATTY'S DAY COCKTAILS –\n\nBREAKFAST WITH PATTY\njameson caskmates, cold press\n\nDUBLINER\njameson black barrel, vermouth, angostura\n\nHOT PADDY \npaddy, cardamom honey, lemon, ginger tea\n\n– BEERS –\n\nWOLVERINE | THE VOLITIONIST\nDry Stout Lager­­ \n\nWOLVERINE | SNAKES ON A SHAMROCK \nIrish Red Lager­ \n\nGUINNESS\nIrish Dry Stout", "url": "https://www.facebook.com/events/1765846730302973/", "name": "Sava's St. Patty's Day", "date": "2016-03-20T13:00:00-04:00"}, {"source": "Facebook", "description": "tl;dr: \nAnn Arbor Poetry Slam\nEspresso Royale on State St.\n7pm [sign-ups open at 6:30; list fills up, come early]\nbi-weekly on 1st and 3rd Sundays\n\nJoin us at Espresso Royale at our normal 7pm start time, Sunday March 20th in our LAST points qualifying slam of the season. After this, there will be a one-off Last Chance Slam to win a place in the City Finals in order to earn a spot on this year's National Poetry Slam team going to Atlanta, Georgia in August. \n\nBring friends and join us in one of the most intimate and longest-running poetry slams in the nation. We meet every week, but only put on a show 1st and 3rd Sundays in our new home at Espresso Royale on State St, and at our new time of 7pm!\n\nThis is an ancient, yet fresh experience: you, a stage, and everything you need to say for an audience who is ready to hear it. Bring yourself, bring your story, and we'll bring the love.\n\n$5 Suggested Donation\nDonate with a credit/debit card or PayPal here: https://www.gofundme.com/2nnusymc\n\nMORE ABOUT THE EVENT:\n\nSign-up to perform at 6:30; the list fills up, so get there early to guarantee a spot. The Open Mic starts at 7pm, and the Slam starts whenever the open session ends. \n\nA maximum of 10 poets compete each week [spots are guaranteed for the first 8 slammers to arrive], the final two have to work for it. All poets who get into the Slam earn points qualifying toward the City Finals in April, and a chance to be one of four poets to represent Ann Arbor at the National Poetry Slam in August 2016, in Atlanta, Georgia. Poems must be the performer's original work. Come prepared with two poems [one if you're just doing the open mic], and keep it around three minutes or less. No costumes or props are allowed (unless otherwise specifically stated for themed events). See you soon!", "url": "https://www.facebook.com/events/757036801063937/", "name": "Last Qualifier Slam of the Season & Open Mic", "date": "2016-03-20T18:30:00-04:00"}, {"source": "Facebook", "description": "Join us to play short-form and long-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/1532709557022732/", "name": "The Arcade - A Pointless Improv Jam", "date": "2016-03-20T19:00:00-04:00"}, {"source": "Facebook", "description": "Come celebrate Irish week here at babo!\n\nWe will be offering 10% off all green juices, Irish lattes, and beer on draft. \n\nAnd don't forget about our delicious Irish food specials!\n\nSee our menu below!\n\nHowever, you will be celebrating we have options for you!\n\nBABO IRISH WEEK\nMonday, March. 14th –Sunday, Mar. 20th\n\nFOOD SPECIALS\n\nSANDWICH OF THE WEEK\n\nCORNED BEEF SANDWICH\ncrust bakery rye, housemade corned beef, braised cabbage slaw, whole grain mustard, swiss cheese\n\nENTREE OF THE WEEK\n\nRYE-CRUSTED CORNED BEEF\nbraised corned beef with toasted caraway, crust bakeries rye bread crumbs, topped with rich caraway gravy\n\nVEGETARIAN ENTREE OF THE WEEK\n\nBRAISED CABBAGE\nslow braised cabbage, onion, and tomatoes seasoned with garlic, onion, thyme, and fennel seed\n\nFEATURED SIDES\n\nROSTI POTATOES\nshredded potato pancake filled with roasted shallots, thyme, and cheddar cheese\n\nROASTED ROOT VEGETABLE MEDLEY\ncarrots, parsnips, turnips, fennel, garlic, thyme, and Guinness stout glaze", "url": "https://www.facebook.com/events/1581383522183183/", "name": "Babo Irish Week", "date": "2016-03-20T20:00:00-04:00"}, {"source": "Facebook", "description": "The UnClub has been permanently moved to 9:30pm Sunday evenings at the Yellow Barn. \n\nCOMICS and PERFORMERS: Please click \"See More\" below for spot request instructions for 3/20/16.\n\nAfter March 20 and 27, these are the Sundays on which we will have shows the rest of the year ( Stage Time at 8pm and UNclub at 9:30pm).\n\nApril 10 and 24\nMay 1 and 22\nJune 5 and 26\nJuly 10 and 24\nAug 14 and 21\nSept 4 and 11\nOct 9 and 30\nNov 13 and 27\nDec 11 and 18\n\nWatch old comics develop new bits and new comics just develop at the UNclub (TM) at the Yellow Barn Theater in Ann Arbor.\n\nA $5 suggested donation at the door to cover theater overhead.\n\nComics and performers, please follow these procedures for stage time:\n\n- Click \"Going\" on this Facebook Event. Even if you are thinking about it, you can click \"Interested\" so you can get updates on this page. Do this by 5:00pm, the day of the show. This does not guarantee you a spot, but not doing it puts you at the bottom of the list.\n\n- THERE ARE NO GUARANTEED SPOTS FOR THIS SHOW, but there is a pecking order.  It is as follows:\n\n1. Current and past members of Chili Challis's Comedy Dojo or any of his workshops.\n2. Invited guests\n3. Acts who have indicted they will attend (Clicking on this Facebook event counts as an RSVP)\n\nAll other spots are given at the show-runner's discretion.\n\n- After 5:00pm Sunday, \"show ups\" can \"go up\" only if spots are available.\n- The line-up will be created after the 8:00 Stage Time show presented by the Emergent Arts Theater at The Yellow Barn.\n- Those arriving after the line-up is finalized will be given spots as time permits.\n- Length of stage time will depend largely on the turn out, performer's experience, and the show-runner's discretion.\n- As always, if you show up and do not get a spot, you will be put at the top of the list for the next show.\n\n--- Want to increase your odds of getting a spot? Here's some DO's and DON'T's\nDO . . . . Share this event page with your fans on your fan page, your facebook page, your website, or your tweets, or any other social media.\nDO . . . . Volunteer for less time. If you are willing to do 3 rather than 5, or 4 rather than 7, then you are more likely to get a spot.\nDO . . . . Come to the paid shows.\nDO . . . . Stay for \"meet and greet\" after shows.\nDO . . . . Answer poll questions whenever they appear on the event page.\nDO . . . . Bring people. This is not, I repeat NOT, a \"bringer.\" But if somebody has come to see you, it will be very hard to deny you a spot. In the past, we've had shows where we've added a minute of time for every person the comic brought as a non-performing audience member. Bring three people and a five minute spot becomes an eight minute spot.\n\nContact Mark at: www.facebook.com/marksweetman", "url": "https://www.facebook.com/events/1017878511621337/", "name": "The UNclub at The Yellow Barn (3/20/16)", "date": "2016-03-20T21:30:00-04:00"}, {"source": "Facebook", "description": "Hosted by the UMS Ambassadors to support the\nUMS Education & Community Engagement Program.\n\nCustom cocktails crafted by Phil Attee\nProduction tour by distiller Ari Sussman\nAppetizers by Grange Kitchen & Bar\n\n$75 per person ($35 is tax-deductible)\nContact Esther Barrett at 734.764.8489, or embarret@umich.edu.\nSpace is limited – reserve yours by March 16.\n\nSponsored by:\nZitatini * Ren and Susan Snyder * Freddi and Dan Kilburn \n      *** Sponsorship opportunities are still available.***", "url": "https://www.facebook.com/events/1702752326667535/", "name": "A2 MIXOLOGY - \"A Still Life\"", "date": "2016-03-21T17:30:00-04:00"}, {"source": "Facebook", "description": "Free and open to the public. Seating is first come, first serve.\n\nIn his video work Metamorphosis Chat, on view at UMMA through March 27, Turkish artist Ferhat Özgür offers a warm and intensely personal experience of what has become a complex moral debate within Turkish culture: wearing the headscarf. Two women, clearly dear friends, decide to swap clothing—one woman is wearing a headscarf and no other adornment, the other more modern attire—and experience what it's like to literally and figuratively walk in each other's shoes. Their expressions of friendship, compassion, and respect for one another, are symbolic of the potential for human kinship and understanding. Join U-M Institute for the Humanities Curator Amanda Krugliak, and Professors Gottfried Hagen (Turkish and Near Eastern Studies), Christiane Gruber (History of Art), and Heidi Kumao and David Chung (School of Art and Design), for an informal and dynamic discussion that will consider Özgür’s piece from cultural as well as artistic points of view.\n \n5:30 pm Metamorphosis Chat (9:25 min), Media Gallery\n6-7 pm Discussion, Multipurpose Room\n\n\nThis program is presented in partnership with the U-M Institute for the Humanities and co-sponsored by the Islamic Studies Program and the Weiser Center for Emerging Democracies.\n\nLead support for Ferhat Özgür: Metamorphosis Chat is provided by SAHA – Supporting Contemporary Art from Turkey, the University of Michigan Institute for the Humanities, and the Herbert W. and Susan L. Johe Endowment. Additional support is provided by the University of Michigan Islamic Studies Program, the Institute for Research on Women and Gender, the Weiser Center for Emerging Democracies, the Center for Middle Eastern and North African Studies, and Women’s Studies.", "url": "https://www.facebook.com/events/752170941481803/", "name": "Metamorphosis Chat: Of Turkish Living Rooms and Transformation", "date": "2016-03-22T17:30:00-04:00"}, {"source": "Facebook", "description": "Featuring Pio Tosini Prosciutto di Parma \n\nThis sweet ham, cured in the town of Langhirano, Italy, bears the honorable mark of the Consorzio del Prosciutto di Parma signifying its exceptional quality and rigorous curing processes. The family-owned and operated Pio Tosini company has become one of the most credible and sought-after producers of Prosciutto di Parma and has been in operation for over 80 years. There are only four ingredients that go into this ham and they are Italian pigs, salt, air and time. At Pio Tosini, a curing time of over 500 days (more than 100 days longer than typical prosciutto production) allows for slow and even salt penetration, assuring the sweetness of the hams. Each ham is trimmed, deboned by hand and personally selected.\n\nThe roots of the Pio Tosini company run deep and date back to the beginning of the last century (1905) in the heart of northern Italy, where Ferrante Tosini (Pio Tosini’s father) started his business slaughtering pigs and curing his own cuts of pork meat in the back room of the family’s grocery store. After World War I he was assisted by his young son Pio and together they gradually improved the business, experimenting with new processing techniques and curing methods. Today Pio Tosini is still a family company, with Ferrante’s great-grandson and Pio’s grandson Giovanni Bianchi carrying out the traditions of the 111 year old company.\n\nChef Alex and Giovanni have collaborated on a menu that highlights the complex flavors of the ham throughout the meal, each course celebrating the sweetness of the hams. Giovanni will be at the Roadhouse to share his family’s story and lead us through a tasting of these delicious hams.\n\n$80 a person (price includes dinner, tax and gratuity - beverages additional)\n\nAmuse Bouche\nBurrata with Prosciutto and Hazelnut Romesco\n\nAppetizer Course\nTorta Fritta with Prosciutto and Fig Preserves\n\nSoup Course\nFennel Soup with Pecorino and Crispy Prosciutto\n\nEntree Course\nJohn Dory with Potatoes de Parma and Roasted Pepper Coulis\n\nDessert Course\nSweet Ricotta Balls with Maraschino Soaked Orange", "url": "https://www.facebook.com/events/217835468568017/", "name": "A Parma Farmhouse Dinner", "date": "2016-03-22T19:00:00-04:00"}, {"source": "Facebook", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-          March 22 – Kevin Devine\nKevin Devine is an Ann Arbor-based singer, songwriter and entertainer whose fans range in age from kindergartners to 106- year-olds. Kevin has performed thousands of shows from Berlin, Massachusetts to Wetumpka, Alabama to Sunville, Michigan and everywhere in between, including children's and family concerts, senior citizen sing-alongs and \"big kid\" shows in pubs and clubs with various bands, like his current Ann Arbor band, Kevin & the Glen Levens, a roots/Celtic/Americana band. His shows feature a fast-paced ramble through a dozen genres with an emphasis on novelty songs, audience participation and improvisation bordering on chaos.  And accordions.\n\n-      March 29 - Dave Menzo\nhttp://www.davemenzo.com/\nDave Menzo is a solo artist who has the pleasure of playing with a few bands and many talented musicians.\n\nAPRIL\n\n-          April 5 - Bob Skon \nhttp://bobskon.com/\n\"Bob is a musician best described in the singer / songwriter style, blended with a healthy dose of folk-rock, and a touch of jazz.... He has a wonderful ability to use intelligent wordplay for capturing those moments in life we can all identify with. In this Bob could be a peer of the legendary Ray Davies.\" - The Bodhisattva Beat\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/822282524550244/", "name": "Acoustic Tuesdays: Kevin Devine", "date": "2016-03-22T19:00:00-04:00"}, {"source": "Facebook", "description": "It's that time of the year! This is the annual LGBTQ+ dance party you do not want to miss. Theme: SUPERQUEEROES! Dress to the nine or come casual.\n\nLocation: EMU Student Center Ballroom\nContact: Chase Anderson\nPhone: 734.487.4149\nEmail: lgbtrc@emich.edu\nCost: Free\nOpen to the public\nLBC Approved: No", "url": "https://www.facebook.com/events/154938721559419/", "name": "EMU Pride Prom 2016", "date": "2016-03-22T20:00:00-04:00"}, {"source": "Facebook", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "url": "https://www.facebook.com/events/1716312661946739/", "name": "TheRide’s ServiceFest", "date": "2016-03-23T10:00:00-04:00"}, {"source": "Facebook", "description": "Our March Artists' Meet & Greet topic is \"How to write an artist statement\". Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/968784676489949/", "name": "How to Write an Artist Statement", "date": "2016-03-23T18:00:00-04:00"}, {"source": "Facebook", "description": "What is it?\nWe are working with the community to help\ncreate a light rail transit system that will\nconnect downtown to world-class medical\ncenters. Central Campus to North Campus.\nPlymouth Road to Main Street shops. All with\ngreater capacity. Greater comfort. More\nsustainably powered. Faster, more reliable\nservice. And setting Ann Arbor up for the next\ncentury.\n\nThese Open House Events will include\nproject staff and representatives from\nthe collaborating organizations to answer\nquestions and record comments.\nWe’ll provide an overview of the project to\ndate and the draft recommendations of\nthe consultant and Project Management\nCommittee.\n\nAreas of discussion:\n• Type of transit technology\n• Configuration of the route\n• Station locations\n• Cost estimate\n• Future expansion possibilities\n\nThis is the fourth in a series of public input\nopportunities. Previous meetings were held in\nDecember 2012, June 2013, and November,\n2013.\n\nFor more information about the project, please\ncontact us at info@aaconnector.com", "url": "https://www.facebook.com/events/1053725137981528/", "name": "Connector Open House", "date": "2016-03-24T11:00:00-04:00"}, {"source": "Facebook", "description": "What is it?\nWe are working with the community to help\ncreate a light rail transit system that will\nconnect downtown to world-class medical\ncenters. Central Campus to North Campus.\nPlymouth Road to Main Street shops. All with\ngreater capacity. Greater comfort. More\nsustainably powered. Faster, more reliable\nservice. And setting Ann Arbor up for the next\ncentury.\n\nThese Open House Events will include\nproject staff and representatives from\nthe collaborating organizations to answer\nquestions and record comments.\nWe’ll provide an overview of the project to\ndate and the draft recommendations of\nthe consultant and Project Management\nCommittee.\n\nAreas of discussion:\n• Type of transit technology\n• Configuration of the route\n• Station locations\n• Cost estimate\n• Future expansion possibilities\n\nThis is the fourth in a series of public input\nopportunities. Previous meetings were held in\nDecember 2012, June 2013, and November,\n2013.\n\nFor more information about the project, please\ncontact us at info@aaconnector.com", "url": "https://www.facebook.com/events/1650481561881321/", "name": "Connector Open House", "date": "2016-03-24T18:00:00-04:00"}, {"source": "Facebook", "description": "Literati is thrilled to welcome Tom Bissell, reading from his latest, Apostle: Travels Among the Tombs of the Twelve.\n\nIn this profound and moving journey into the heart of Christianity, the widely acclaimed author of\"The Disaster Artist\"explores the mysterious and often paradoxical lives and legacies of the Twelve Apostles a book both for those of the Christian faith and those who want to understand it from the outside in.\n\nPeter, Matthew, Thomas, John: Who were these men? What was their relationship to Jesus? Tom Bissell gives us rich and deeply informed answers to these ancient and surprisingly elusive questions. He examines not just who these men were (and weren't), but how their identities have taken shape over the course of two millennia. He makes clear that, ultimately, their story is the story of Christianity and its growth from an obscure Jewish sect to the global faith we know today. Bissell has visited holy sites from Rome and Jerusalem to Turkey, India, and Kyrgyzstan, and he vividly captures the rich diversity of Christianity's global reach. Written with warmth, humor, and rare acumen, Apostle is a brilliant synthesis of travel writing, biblical history, and a deep lifelong relationship with Christianity. The result is an unusual, erudite, at times hilarious book a religious, intellectual, and personal adventure.\n\nTom Bissell was born in Escanaba, Michigan, in 1974. He has lived in New York City, Uzbekistan, Vietnam, Italy, Las Vegas, Estonia, Portland, and currently lives in Los Angeles. In 2006 he was awarded the Rome Prize, and in 2010 he received a Guggenheim Fellowship. He has also done scriptwriting for several popular video-game franchises, including Gears of War, Battlefield, and Uncharted.", "url": "https://www.facebook.com/events/1734419736791919/", "name": "Tom Bissell", "date": "2016-03-24T19:00:00-04:00"}, {"source": "Facebook", "description": "Come celebrate Irish week here at babo!\n\nWe will be offering 10% off all green juices, Irish lattes, and beer on draft. \n\nAnd don't forget about our delicious Irish food specials!\n\nSee our menu below!\n\nHowever, you will be celebrating we have options for you!\n\nBABO IRISH WEEK\nMonday, March. 14th –Sunday, Mar. 20th\n\nFOOD SPECIALS\n\nSANDWICH OF THE WEEK\n\nCORNED BEEF SANDWICH\ncrust bakery rye, housemade corned beef, braised cabbage slaw, whole grain mustard, swiss cheese\n\nENTREE OF THE WEEK\n\nRYE-CRUSTED CORNED BEEF\nbraised corned beef with toasted caraway, crust bakeries rye bread crumbs, topped with rich caraway gravy\n\nVEGETARIAN ENTREE OF THE WEEK\n\nBRAISED CABBAGE\nslow braised cabbage, onion, and tomatoes seasoned with garlic, onion, thyme, and fennel seed\n\nFEATURED SIDES\n\nROSTI POTATOES\nshredded potato pancake filled with roasted shallots, thyme, and cheddar cheese\n\nROASTED ROOT VEGETABLE MEDLEY\ncarrots, parsnips, turnips, fennel, garlic, thyme, and Guinness stout glaze", "url": "https://www.facebook.com/events/1581383522183183/", "name": "Babo Irish Week", "date": "2016-03-24T20:00:00-04:00"}, {"source": "Facebook", "description": "All About Eve (Katie Geddes and Deb Wood) and Michael Krieger present the story of Good Friday, told through the music of Indigo Girls, Natalie Merchant, and Andrew Lloyd Webber, along with scripture and prayer.\n \n                               30 minute service\n                    repeats at 7:30pm and 8:30pm\n            Enter at any time; stay as long as you like\n              (worship service; no admission charge)", "url": "https://www.facebook.com/events/1577492092573060/", "name": "Good Friday Evening Vigil featuring All About Eve and Michael Krieger", "date": "2016-03-25T19:00:00-04:00"}, {"source": "Facebook", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"The Real Thing\" starring Nathan Corliss and Mat De Lisle\n\nGroup 2: \"Doom and Doomer\" starring Jeremy Conn and Jenny Bloomer\n\nGroup 3: \"The League of Pointless Improvisers\" starring Andy Reid, Jason Valentini, Matt Swartz, Matthew Flickinger, Mitch Socia, and Moni Jones", "url": "https://www.facebook.com/events/487821191409092/", "name": "Pointless Improv with The Real Thing and Doom and Doomer", "date": "2016-03-25T20:00:00-04:00"}, {"source": "Facebook", "description": "Friday, March 25 | 9pm | 18+ | $16 Adv. / $18 Day of\n\nThe Lone Bellow with David Ramirez\n\nThen Came the Morning, the second album by the Southern-born, Brooklyn-based indie-folk trio the The Lone Bellow, opens with a crest of churchly piano, a patter of drums, and a fanfare of voices harmonizing like a sunrise. It’s a powerful introduction, enormous and overwhelming, as Zach Williams, Brian Elmquist, and Kanene Pipkin testify mightily to life’s great struggles and joys, heralding the morning that dispels the dark night: “Then came the morning! It was bright, like the light that you kept from your smile!” Working with producer Aaron Dessner of the National, the Lone Bellow has created a sound that mixes folk sincerity, gospel fervor, even heavy metal thunder, but the heart of the band is harmony: three voices united in a lone bellow.\n\n\"The feeling I get singing with Zach and Brian is completely natural and wholly electrifying,” says Kanene. “Our voices feel like they were made to sing together.\"\n\nLong before they combined their voices, the three members of the Lone Bellow were singing on their own. Brian had been writing and recording as a solo artist for more than a decade, with three albums under his own name. Kanene and her husband Jason were living in Beijing, China, hosting open mic nights, playing at local clubs and teaching music lessons. Zach began writing songs in the wake of a family tragedy: After his wife was thrown from a horse, he spent days in the hospital at her bedside, bracing for the worst news. The journal he kept during this period would eventually become his first batch of songs as a solo artist. Happily, his wife made a full recovery.\n\nWhen Kanene’s brother asked her and Zach to sing “O Happy Day” together at his wedding, they discovered their voices fit together beautifully, but starting a band together seemed impossible when they lived on opposite sides of the world. Brian soon relocated to New York and Kanene moved there to attend culinary school a couple years later. The three got together in their new hometown to work on a few songs of Zach’s, he’d been chipping away at the scene as a solo artist for awhile by then. After hitting those first harmonies did they decide to abandon all other pursuits. Soon the trio was playing all over the city, although they considered Rockwood Music Hall on the Lower East Side to be their home. They opened for the Civil Wars, Dwight Yokam, Brandi Carlile and the Avett Brothers, and their self-titled debut, produced by Nashville’s Charlie Peacock (the Civil Wars, Holly Williams) and released in January 2013, established them as one of the boldest new acts in the Americana movement.\n\nAfter two hard years of constant touring, the band was exhausted but excited. By 2014, they had written nearly 40 songs on the road and were eager to get them down on tape. After putting together a list of dream producers, they reached out to their first choice, the National guitarist Aaron Dessner, who has helmed albums by the L.A. indie-rock group Local Natives and New York singer-songwriter Sharon Van Etten.\n\n“It occurred to me that it would be fun to get together and make music with them,” says Aaron. “My main interest in producing records is community and friendship more than making money. I already do a lot of traveling and working with the National, so when I have to time to work with other artists, it should be fun and meaningful.”\n\n“Aaron is just so kind,” Zach says. “And he has surrounded himself with all these incredibly talented people, like Jonathan Low, the engineer. His brother Bryce [Dessner, also a guitarist for the National] wrote these amazing brass and string arrangements, and he got some of his friends to play with us.”\n\nDessner and the Lone Bellow spent two weeks recording at Dreamland in upstate New York, a nineteenth-century church that had been converted into a homey studio. The singers found the space to inspire the emotional gravity necessary for the material and the acoustics they were looking for. (For Kanene, Dreamland had one other bonus: “I’m a big Muppets fan, and it looks exactly like the church where Dr. Teeth and the Electric Mayhem lived.”)\n\nAaron set them up in a circle in what had once been the sanctuary, with microphones hanging in the rafters to capture the sound of their voices bleeding together. Most of the vocals were recorded in single takes, a tactic that adds urgency to songs like “Heaven Don’t Call Me Home” and “If You Don’t Love Me.” “There were a couple of times when somebody sang the wrong word or hit a bad note, and we just had to keep going,” says Zach, who says that recording “Marietta” in particular was daunting—especially the moment near the end when he hits an anguished high note, bends it even higher, and holds it for an impossibly long time. It’s a startling display of vocal range, but it’s also almost unbearably raw in its emotional honesty.\n\n“‘Marietta’ is probably the darkest song on the whole record,” Zach explains, “and it’s based on something that happened between my wife and me. The band was getting ready to record that song when all of a sudden my wife showed up with our youngest baby. It was a great surprise, a beautiful moment. So I was able to go out and sing that song, knowing she was there to help me carry the moment.”\n\n“These are true stories,” says Brian. “These aren’t things we made up. We tried to write some songs that had nothing to do with our personal stories, but we just didn’t respond to them. But we’re best buds, so we know each others’ personal stuff and trust each other to figure out what needs to be said and how to say it.” Case in point: Brian wrote “Call to War” about his own struggles during his twenties, but gave the song to Kanene to sing. “The content is painful and brutal,” she says, “but the imagery, the vocals, they build something delicate and ethereal. That kind of contrast illuminates the true beauty and power of a song.”\n\nSays Brian, “We do this one thing together, and we carry each other. Hopefully that makes the listener want to be a part of it. It becomes a communal thing, which means that there’s never a sad song to sing. It’s more a celebration of the light and the dark.”", "url": "https://www.facebook.com/events/1550469435268350/", "name": "The Lone Bellow w/ David Ramirez 3/25/16 at Blind Pig - Ann Arbor", "date": "2016-03-25T21:00:00-04:00"}, {"source": "Facebook", "description": "On Friday March 25th, join Kevin Michael for the second installment of Festival Fridays.\n\nFirst 100 guests will receive a FREE can of Red Bull Yellow \n\nHouse | EDM | Trap | Twerk | Electro\nmusic by KEVIN MICHAEL\n\nVisit the Red Bull photo booth that night and create your own GIF! \n\nKevin Michael, aka Kevin Kerber aka The Dangling Participle has been started from the bottom and now he’s here. From rocking stages to rocking chairs, Kevin Michael has always been a bastion of excellence in music, arts, culture, and oxford commas. His frenetic, open-format style of mixing has been described as, “pop-meets-electro-meets-slow-cooker.” This Ann Arbor based DJ is in it to win it. On his off time, Kevin Michael can be found lifting weights, eating mammies, not reading directions, and sardonically pontificating on miscellaneous etcetera. If you’re looking for the same old DJ, swipe left.", "url": "https://www.facebook.com/events/193431837697114/", "name": "Festival Friday", "date": "2016-03-25T22:00:00-04:00"}, {"source": "Facebook", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring: Andy Reid, Jason Valentini, Matt Swartz, Matthew Flickinger, Mitch Socia, and Moni Jones", "url": "https://www.facebook.com/events/184767285232450/", "name": "A Pointless Display of Improvised Feats", "date": "2016-03-25T22:00:00-04:00"}, {"source": "Facebook", "description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "url": "https://www.facebook.com/events/189662964737024/", "name": "Little Peeps PlayGround - \"Animals\"", "date": "2016-03-26T10:30:00-04:00"}, {"source": "Facebook", "description": "Saturday, March 26, 2016, 8:00 pm\nHill Auditorium\n\nBach’s complete Sonatas and Partitas have long been a “Mount Everest” of the violin repertoire — music that performers return to throughout their lives. In this special event, Gil Shaham collaborates with video artist David Michalek to open up new avenues for listening to and interpreting Bach’s towering masterpieces.\n\nVideo artist David Michalek, best known for his “Slow Dancing” installation at Lincoln Center, and in the capitals of Europe, says of the Bach Six Solos project: “As a contemporary artist with a particular interest in motion pictures and time, I’ve been compelled to consider how the addition of extreme slow motion might be applied to moving images of the face, the body, obliquely narrative tableaux, and also still life in ways that can both enhance and alter the meanings latent within them. As a visual strategy, extreme slowness creates a continuing sense of a pause in the action — as if the growth and evolution of the slow-moving image is itself a further manifestation of the deep and consuming absorptive state that often arises while observing it.”\n\nMore info: http://ums.org/performance/gil-shaham/", "url": "https://www.facebook.com/events/1663165150570187/", "name": "Bach Six Solos: Gil Shaham, violin", "date": "2016-03-26T20:00:00-04:00"}, {"source": "Facebook", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Get in the Barrel\" starring Lisa Seymour, Tia Peruzzi, Brody Webster, and Sheevani Desai Ignasinski\n\nGroup 2: \"Human Amusements\" starring PJ Jacokes, Jen Hansen, Chris Petersen, Joe Hingelberg, Matt Naas, Travis Pelto, and Amber Hunt\t\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, James Quesada, Corene Ford, Erik Heilner, and Julia Schroeder", "url": "https://www.facebook.com/events/155237174863547/", "name": "Pointless Improv with Get in the Barrel and Human Amusements", "date": "2016-03-26T20:00:00-04:00"}, {"source": "Facebook", "description": "Sat. March 26 | 9pm | 18+ | $10 Cover\n\nThe Crane Wives with Loose Teeth and Owl Game\n\nThe Crane Wives are a home grown indie-folk outfit from Grand Rapids, Michigan. They utilize three-part vocal harmonies, eclectic instrumentation, and a passion for song-craft to create organic music that is both accessible and innovative. Each live show features contagious energy as well as original music that ranges from whisper quiet ballads to danceable grooves. \n\nThe band formed in late August of 2010 and has released three full-length albums, \"Safe Ship, Harbored\" (2011), \"The Fool In HerWedding Gown\" (2012), and \"Coyote Stories\" (2015) with a fourth album \"Foxlore\" Due out April 2nd, 2016.", "url": "https://www.facebook.com/events/1059630090724670/", "name": "The Crane Wives w/ Loose Teeth & Owl Game 3/26/16 at Blind Pig - Ann Arbor", "date": "2016-03-26T21:00:00-04:00"}, {"source": "Facebook", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Human Amusements\" starring PJ Jacokes, Jen Hansen, Chris Petersen, Joe Hingelberg, Matt Naas, Travis Pelto, and Amber Hunt\t\n\nGroup 2: \"Get in the Barrel\" starring Lisa Seymour, Tia Peruzzi, Brody Webster, and Sheevani Desai Ignasinski\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, James Quesada, Corene Ford, Erik Heilner, and Julia Schroeder", "url": "https://www.facebook.com/events/102257710169081/", "name": "Pointless Improv with Human Amusements and Get in the Barrel", "date": "2016-03-26T22:00:00-04:00"}, {"source": "Facebook", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/218509918499828/", "name": "Open Stage", "date": "2016-03-27T19:00:00-04:00"}, {"source": "Facebook", "description": "Sunday, March 27 | 18+  |  Doors 9:00pm  |  $12 adv./ $15 day of \n\nYoung Fathers are DEAD.\nwsg: HXLT\n\nOr, rather, DEAD is Young Fathers. Their first full-length album, released in February, 2014, on Anticon and Big Dada has been given the kind of critical appraisal normally held hidden in the filing cabinets of dusty music journos and only brought out, along with the bottle of fine blended whisky for those special occasions, those special rock occasions. You know the kind, when a credible bunch of guitar, bass and drum twenty-somethings from some northern town in the UK or from Indianapolis USA put something together in the studio that reaches out and reminds everyone that modern life isn’t rubbish. Which is a weird reaction for a group who sit in some non-categorisable space between genres ancient and modern, who take hiphop and pop and dip it in a tie-dye mix of Ronnettes and krautrock and ragga and dub and post-punk and afropsych… and make something, something, something.\n\nMany years before dropping DEAD the three individuals who became Young Fathers were apprentice young men. 14 years old, meeting in a sweaty dancing circle in the infamous original Bongo Club in Edinburgh, Scotland, UK. Moving to the in-your-face beats of early noughties hiphop, R&B and Dancehall and then at the end of the night, agreeing to meet at solemn faced would-be producer G’s house, to ‘make records’ on an ancient karaoke machine. The three of them, already looking like their future selves: Alloysious, city street holy man, sad eyes to the stars, past of the Liberian war atrocities buried in childhood scar tissue; Kayus, face exploding from frowns to huge laughter, pure naija boy on the outside but reflective and always feeling far away from his Nigerian home on the inside; and G, quietly watching and waiting for good things to come, practising the serious don’t fuck street face for the neds where he grew up, but nurturing a heart of soul.\n\nFrom the bedroom to the basement. It took them a few years before they found the small underground studio in Leith where they could perfect the uniqueness already nascent in the early days. Here they developed what they call, like the Sicilian mafia, ‘our thing’. Recording processes that involve ritual, musical techniques more usually found in bebop jazz, playing with ways to write lyrics and tunes, scouring the further reaches and always recoiling from cliché. But always, always staying true to the Rules of Pop which demand hooks, energy, sparkle, accessibility, passion and beats that vibrate below the waist. From this point came their first release, what was originally conceived as a mixtape, literally only available on individually recorded cassettes with hand printed sleeves: TAPE ONE was the moment, recorded in a week, ready to release in two.\n\nShortly thereafter, TAPE TWO was recorded and a deal with far-out Los Angeles hiphopping label, Anticon inked. TAPE TWO took the dirty mounds of its predecessor and moulded beautiful sand sculptures, sealed by the sea, with the same processes, the same inspiration, gone deeper, gone darker. A year after its release TAPE TWO wins the Scottish Album Of The Year Award (2014), an indication, perhaps, that people are really starting to get it. YFs are just happy more people are listening, even if that 20 grand prize money does come in handy for debts and mashed up gear. And a final, critical tick from the music business comes at the end of summer when the album is nominated for a Mercury award.\n\nDid I mention the live show? I don’t believe so… on an insane tour of the USA, UK and Europe, heading over to Australia, Japan, Russia and then back to Europe. A huge 27-date UK & European tour preceded standout performances at SXSW, with a 33-date US tour supporting Anticon’s Baths before playing a homecoming show at the Park Stage at Glastonbury. By the end of this year, YFs will have driven around the world one and a half times and flown it several times more. What happens? Each time they appear as a support, the headliner regrets and celebrates, because, if the headliner can’t hope to make the desired impact after the explosion of uber-watt energy that is a Young Fathers show, they can at least reflect and bask in the knowledge that they were partly responsible for something special happening.\n\nWhen they headline, they squeeze hours into 45 minutes and leave the audience exhausted from spectacle and bass, necks aching from craning, ears ringing and a delayed smile forming as they leave after pointless demands for more. (Of course, YFs never give more, because they have given all they have).\n\nSounds like hyperbole? Read the reviews… The Guardian were particularly kind about DEAD, Alexis Petridis wrote: “Young Fathers have quietly constructed a strange and intoxicating musical universe that feels entirely their own” – Guardian 4/5 (Lead Review). I know the group intimately and yet they still shock me on a regular basis. Not with anything as base as the kind of look-at-me desperation of a shocking rocking Rocky Horror spit show, nor with pyro and cannons and strippers or any of the other circus tricks. Just with presence and passion and looking like that beamed in from another world lost aliens with a message of love type of group. With intense engagement… intense… the Johnny Rotten, Ian Curtis, James Brown kind. Taking that brief blast of special that is normally only allowed to boys from terraced houses for a couple of years before imp or exp-losion but YFs just, keep it going, impossibly, like an Ethiopian marathon racer. Which should be an indication, dear star watchers, that something special is happening.\n\nOK, 850 odd words and still so much info to impart. How about… America, it’s like jumping into a deep fat fryer, so many delicious possibilities, like: Jimmy Kimmel, set to take the crown of late night TV chat show hosts, who hosted Young Fathers in June, watched by the entire Anticon roster, performing with blood shot intensity after 24 hours of partying (yes, they party, seriously of course, as you ask) in Los Angeles. More America: the entire staff of KEXP in Seattle, cramming into the control booth and watching in awe during YFs’ radio session there. If you know how many artists go through those doors you’ll know what an accolade that is.\n\nWhat about the BBC? How about all the love from Zane Lowe for the singles, not to mention the weekly shows they made for 1Xtra through October last year (2013) ? Episodes of some outer space Dada drama slotted in amongst all the herbal urban clichés. How about being banned by the beeb? Queen Is Dead, from TAPE TWO, officially banned just in case the Queen of Britain pops her clogs at the moment of spinning.\n\nTime to round it up and leave all the untold good stuff for another time. Now signed with Big Dada, Young Fathers are already recording the next album, printing more of their iconic T-shirts (have you got one yet? You’ll probably have to wait), making more videos, sweating their way through the summer festivals, ignoring stupid borders and other constraints in order to bring it, whatever it is, to you. ENDS", "url": "https://www.facebook.com/events/1551492585165998/", "name": "Young Fathers w/ HXLT 3/27/16 @ Blind Pig - Ann Arbor", "date": "2016-03-27T21:00:00-04:00"}, {"source": "Facebook", "description": "Literati is pleased to welcome Scott Ellsworth in support of The Secret Game: A Wartime Story of Courage, Change, and Basketball's Lost Triumph.\n\nThe Secret Game is the true story of the game that never should have happened--and of a nation on the brink of monumental change. In the fall of 1943, at the little-known North Carolina College for Negroes, Coach John McLendon was on the verge of changing basketball forever. A protégé of James Naismith, the game's inventor, McLendon taught his team to play the full-court press and run a fast break that no one could catch. His Eagles would become the highest-scoring college team in America--a basketball juggernaut that shattered its opponents by as many as sixty points per game. Yet his players faced danger whenever they traveled backcountry roads.\n\nAcross town, at Duke University, the best basketball squad on campus wasn't the Blue Devils, but an all-white military team from the Duke medical school. Composed of former college stars from across the country, the team dismantled everyone they faced, including the Duke varsity. They were prepared to take on anyone--until an audacious invitation arrived, one that was years ahead of anything the South had ever seen before. What happened next wasn't on anyone's schedule. \n\nBased on years of research, The Secret Game is a story of courage and determination, and of an incredible, long-buried moment in the nation's sporting past. The riveting, true account of a remarkable season, it is the story of how a group of forgotten college basketball players, aided by a pair of refugees from Nazi Germany and a group of daring student activists, not only blazed a trail for a new kind of America, but helped create one of the most meaningful moments in basketball history.\n\nScott Ellsworth has written about American history for the New York Times, the Washington Post, and the Los Angeles Times. Formerly a historian at the Smithsonian Institution, he is the author of Death in a Promised Land, a groundbreaking account of the 1921 Tulsa race riot. He lives with his wife and twin sons in Ann Arbor, where he teaches at the University of Michigan.", "url": "https://www.facebook.com/events/1575967599393425/", "name": "Scott Ellsworth", "date": "2016-03-28T19:00:00-04:00"}, {"source": "Facebook", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "url": "https://www.facebook.com/events/181952312183242/", "name": "TheRide’s ServiceFest", "date": "2016-03-29T10:00:00-04:00"}, {"source": "Facebook", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-      March 29 - Dave Menzo\nhttp://www.davemenzo.com/\nDave Menzo is a solo artist who has the pleasure of playing with a few bands and many talented musicians.\n\nAPRIL\n\n-          April 5 - Bob Skon \nhttp://bobskon.com/\n\"Bob is a musician best described in the singer / songwriter style, blended with a healthy dose of folk-rock, and a touch of jazz.... He has a wonderful ability to use intelligent wordplay for capturing those moments in life we can all identify with. In this Bob could be a peer of the legendary Ray Davies.\" - The Bodhisattva Beat\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/907377109378989/", "name": "Acoustic Tuesdays: Dave Menzo", "date": "2016-03-29T19:00:00-04:00"}, {"source": "Facebook", "description": "Come celebrate Irish week here at babo!\n\nWe will be offering 10% off all green juices, Irish lattes, and beer on draft. \n\nAnd don't forget about our delicious Irish food specials!\n\nSee our menu below!\n\nHowever, you will be celebrating we have options for you!\n\nBABO IRISH WEEK\nMonday, March. 14th –Sunday, Mar. 20th\n\nFOOD SPECIALS\n\nSANDWICH OF THE WEEK\n\nCORNED BEEF SANDWICH\ncrust bakery rye, housemade corned beef, braised cabbage slaw, whole grain mustard, swiss cheese\n\nENTREE OF THE WEEK\n\nRYE-CRUSTED CORNED BEEF\nbraised corned beef with toasted caraway, crust bakeries rye bread crumbs, topped with rich caraway gravy\n\nVEGETARIAN ENTREE OF THE WEEK\n\nBRAISED CABBAGE\nslow braised cabbage, onion, and tomatoes seasoned with garlic, onion, thyme, and fennel seed\n\nFEATURED SIDES\n\nROSTI POTATOES\nshredded potato pancake filled with roasted shallots, thyme, and cheddar cheese\n\nROASTED ROOT VEGETABLE MEDLEY\ncarrots, parsnips, turnips, fennel, garlic, thyme, and Guinness stout glaze", "url": "https://www.facebook.com/events/1581383522183183/", "name": "Babo Irish Week", "date": "2016-03-29T20:00:00-04:00"}, {"source": "Facebook", "description": "When you shop on this day, we'll give 10% of our sales to Ann Arbor YMCA to help them create their next Learning Garden. Start making your list and stock up to support wellness and sustanability in our community!", "url": "https://www.facebook.com/events/1738849703012983/", "name": "Impact Day benefiting Ann Arbor YMCA", "date": "2016-03-30T07:00:00-04:00"}, {"source": "Facebook", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "url": "https://www.facebook.com/events/1562324927414210/", "name": "TheRide’s ServiceFest", "date": "2016-03-30T18:00:00-04:00"}, {"source": "Facebook", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-03-31T19:30:00-04:00"}, {"source": "Facebook", "description": "Sponsored by the University of Michigan Credit Union, Arts & Eats: Dig In with UMS is a $15 ticket package deal that includes a great seat at the performance, exclusive access to a pre-show dinner, and a fun activity to get you thinking about the performance in a whole new way. You can pick up your tickets for the show at the Arts & Eats event.\n\nMore info about Mariachi Vargas de Tecalitlán : http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan/\n\nMore about Dig Ins: http://ums.org/tickets/students/", "url": "https://www.facebook.com/events/1667725740151395/", "name": "Dig In: Mariachi Vargas de Tecalitlán", "date": "2016-04-01T18:30:00-04:00"}, {"source": "Facebook", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-04-01T19:30:00-04:00"}, {"source": "Facebook", "description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "url": "https://www.facebook.com/events/453190221522442/", "name": "Mariachi Vargas de Tecalitlán", "date": "2016-04-01T20:00:00-04:00"}, {"source": "Facebook", "description": "In a career that spans 23 albums and includes three Grammy awards, Tom Chapin has covered a lot of creative ground. In addition to his work as a recording artist and concert performer, Chapin has acted on Broadway and worked in films, television and radio. Tom grew up in a family that encouraged artistic pursuits. He began performing professionally as a teenager in the early 1960s, playing in Greenwich Village folk clubs alongside his siblings, Harry and Steve, as one of The Chapin Brothers. In 1971, he began a five-year run as the host of the ABC-TV children's series, \"Make A Wish.\" Chapin and his songs were also featured in the 1970 documentary film, \"Blue Water, White Death,\" for which he spent six months sailing the Indian Ocean searching for great white sharks.\n\nAs a music-maker, Chapin has maintained two parallel careers, as a highly respected contemporary folk artist and as a pioneer in the field of children's music. In the former role, Chapin has established a reputation for insightful, heartfelt songcraft and charismatic live performances. In the latter, he continues to engage the hearts, minds and imaginations of young listeners with witty, life-affirming original songs delivered in a sophisticated array of musical styles. Chapin's infectious songs, sterling musicianship and personal warmth shine, whether he's performing on record or in a concert hall, an outdoor festival, a school, in front of a symphony orchestra, or in an intimate coffeehouse. www.tomchapin.com", "url": "https://www.facebook.com/events/1713063788906616/", "name": "Tom Chapin at  Green Wood Coffee House", "date": "2016-04-01T20:00:00-04:00"}, {"source": "Facebook", "description": "Strayaway Child Concert Series is proud to present: Lindsay Straw & Caroline O'Shea in concert!\n\nSunday, April 3, 2016\nConor O'Neill's Celtic Room\nDoors 5pm \nShow 5:30pm\nGeneral Admission: $15\nStudents: $12\nKids under 10- Free\n\nLindsay Straw is a singer, guitarist, and Irish bouzouki player who performs traditional songs and tunes from the British Isles. Originally from Montana, she began to explore Boston’s Irish and folk music scenes while studying film scoring at Berklee College of Music. Her debut solo album My Mind From Love Being Free was released on May 1, 2015. She is a 2015 recipient of Club Passim's Iguana Fund Grant, which will enable her to make her second album in 2016.\n\nLindsay has impressed with her tender singing voice and an extensive repertoire that is rooted in the Scottish and Northern Irish traditions, but which also delves into contemporary songwriters like Richard Thompson and Bob Dylan. She has also drawn praise for her sensitive, agile accompaniment on bouzouki and guitar at many a local session and in concert as a member of the Irish quartet The Ivy Leaf, with piper Joey Abarta, and with fellow guitar & bouzouki player Owen Marshall.\nhttp://www.lindsaystraw.com/\n\nCaroline O’Shea is from Milton, MA, and has played the Irish flute and tin whistle since she was a child. As a teenager, she competed in the All-Ireland championships for four years in a row in Letterkenny, Co. Donegal and in Tullamore, Co. Offaly. She received her TTCT Diploma—a week-long certification course in Dublin for teaching traditional Irish music—in 2016, and has taught for Boston’s branch of Comhaltas Ceoltoiri Eireann (Irish music school); at the Killarney School of Music in Killarney, Co. Kerry; at the Milton Art Center; and at the Irish Cultural Centre of New England, in addition to private lessons. Caroline currently plays in a duo with singer Lindsay Straw, and plays flute, whistles, and sings with traditional Irish group The Ivy Leaf. In addition to playing flute and whistle, Caroline was recently awarded a grant from the MA Cultural Council to study the uilleann pipes with master piper Joey Abarta.\n\nSince 2010, Caroline has played flute, whistles, and sung with traditional Irish group The Ivy Leaf. Their debut CD of tunes and songs The Ivy Leaf: Traditional Irish Music was released in 2012. She plays at festivals and events with Boston-based band Devri as well, and played low and high whistles on the band’s debut CD Broad Street in 2012.\nhttps://cosheamusic.wordpress.com/", "url": "https://www.facebook.com/events/1685542291727910/", "name": "Lindsay Straw & Caroline O'Shea- In Concert", "date": "2016-04-03T17:30:00-04:00"}, {"source": "Facebook", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-04-03T19:30:00-04:00"}, {"source": "Facebook", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "url": "https://www.facebook.com/events/1032406803469486/", "name": "TheRide’s ServiceFest", "date": "2016-04-04T17:30:00-04:00"}, {"source": "Facebook", "description": "Come celebrate Irish week here at babo!\n\nWe will be offering 10% off all green juices, Irish lattes, and beer on draft. \n\nAnd don't forget about our delicious Irish food specials!\n\nSee our menu below!\n\nHowever, you will be celebrating we have options for you!\n\nBABO IRISH WEEK\nMonday, March. 14th –Sunday, Mar. 20th\n\nFOOD SPECIALS\n\nSANDWICH OF THE WEEK\n\nCORNED BEEF SANDWICH\ncrust bakery rye, housemade corned beef, braised cabbage slaw, whole grain mustard, swiss cheese\n\nENTREE OF THE WEEK\n\nRYE-CRUSTED CORNED BEEF\nbraised corned beef with toasted caraway, crust bakeries rye bread crumbs, topped with rich caraway gravy\n\nVEGETARIAN ENTREE OF THE WEEK\n\nBRAISED CABBAGE\nslow braised cabbage, onion, and tomatoes seasoned with garlic, onion, thyme, and fennel seed\n\nFEATURED SIDES\n\nROSTI POTATOES\nshredded potato pancake filled with roasted shallots, thyme, and cheddar cheese\n\nROASTED ROOT VEGETABLE MEDLEY\ncarrots, parsnips, turnips, fennel, garlic, thyme, and Guinness stout glaze", "url": "https://www.facebook.com/events/1581383522183183/", "name": "Babo Irish Week", "date": "2016-04-04T20:00:00-04:00"}, {"source": "Facebook", "description": "Monday, April 4 | 9pm | 18+ | $13 adv./ $15 day of\n\nCritically acclaimed pop duo Chairlift has released new music in the form of the infinitely danceable “Ch-Ching.” The R&B laced, vibrating drum infused pop track serves as the first musical offering from their forthcoming album Moth, which will be released in January 2016 via Columbia Records. Although the single is the first work to be released from Chairlift in three years, the duo – comprised of writer/producers and multi-instrumentalists Caroline Polachek and Patrick Wimberly – has hardly been quiet. They collaborated with Beyoncé on her groundbreaking self-titled album via the track “No Angel,” which was written and produced by Caroline and co-produced by Patrick. Caroline released and toured Arcadia, a self-produced solo album under the alias Ramona Lisa and collaborated with SBTRKT, Blood Orange and others, while Patrick produced and collaborated with artists such as Solange Knowles, Wet, Kelela, and Tei Shi.\n\nAn evolution from their last album, 2012’s Something, Moth proves to be an emotionally uninhibited and markedly stronger, more pop inspired body of work. A very New York City inspired album, listeners can expect to be led through an aural mix of big, rich pop inspired hooks, vibrating bass, lively brass and sensuous R&B inspired vocals, all anchored in the duo’s meticulously crafted instrumentation.", "url": "https://www.facebook.com/events/162598590780251/", "name": "Chairlift 4/4/16 at Blind Pig - Ann Arbor", "date": "2016-04-04T21:00:00-04:00"}, {"source": "Facebook", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nAPRIL\n\n-          April 5 - Bob Skon \nhttp://bobskon.com/\n\"Bob is a musician best described in the singer / songwriter style, blended with a healthy dose of folk-rock, and a touch of jazz.... He has a wonderful ability to use intelligent wordplay for capturing those moments in life we can all identify with. In this Bob could be a peer of the legendary Ray Davies.\" - The Bodhisattva Beat\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1658487314415325/", "name": "Acoustic Tuesdays: Bob Skon", "date": "2016-04-05T19:00:00-04:00"}, {"source": "Facebook", "description": "Sisters Cassie and Sid Sunday have not done a bang-up job of keeping in touch. In their defense, it hasn’t been easy: life veered in sharply different directions for the once-close sisters. Today, beautiful and big-hearted Sid lives an expat’s life of leisure in far-off Singapore, while harried, iPhone-clutching Cassie can’t seem to make it work as a wife and a mom to twin toddlers in Manhattan. \n \nIt doesn’t help that Sid spurns all social media while Cassie is addicted to Facebook. So when Sid issues a challenge to reconnect the old-fashioned way—through real, handwritten letters—Cassie figures, why not? \n \nThe experiment exceeds both of their expectations, and the letters become a kind of mutual confessional that have real and soul-satisfying effects. And they just might have the power to help Cassie save her marriage, and give Sid the strength to get her life back on track.\n \nBut first, one of Cassie’s infamous lapses in judgment comes back to bite her, and all of the letters wind up the one place you’d never, ever want to see them: the Internet…\n\nLisa Beazley has worked in journalism and public relations for more than fifteen years.", "url": "https://www.facebook.com/events/1528777447422865/", "name": "Meet Debut Novelist Lisa Beazley for a Discussion & Signing for 'Keep Me Posted'", "date": "2016-04-05T19:00:00-04:00"}, {"source": "Facebook", "description": "Tuesday, April 5 | 8pm | 18+ | $12 Cover\n\n“During the writing of Drinking From A Salt Pond, the band admits to flaring tempers and tense operations as they worked to redefine their sound, goals, and relationships…”\n\nRun River North will be the first to tell you: it has largely been an uphill climb for the indie rock sextet from Los Angeles, a hero’s journey full of odds-defying opportunities seized amidst rocky naysayers and the snagging brambles of band life. And now, with their second full-length album Drinking From A Salt Pond, Run River North are poised to push forward and create their own wake as a major voice in today’s music landscape.\n\nSince the band’s beginnings just over four years ago, their rise has been steadily spectacular, marked by appearances on national television, sold-out shows at historic venues, tours with rock and roll royalty and heaps of praise from fans and critics alike. As they blossomed, they embraced their initially folk-driven sound, which found its harmonic home alongside rootsy, foot stomping, sing-along-leading peers like Mumford & Sons, The Head and the Heart, and Of Monsters and Men. Powered by the acoustic-guitar-and-vocals songwriting of frontman Alex Hwang, their 2014 self-titled debut record, produced by Phil Ek (Fleet Foxes, Modest Mouse, Band of Horses), was released with their lineup rounded out by the strings duo of Daniel Chae and Jennifer Rim, Joe Chun on bass, Sally Kang on keys, and John Chong on drums.\n\nAs time and tours passed, the six lives spent in close-quarters began to grind the gears a little differently; their whole dynamic began to change. “When we became a band, we mostly played Alex’s songs in band form,” says Chae. “Since then we’ve all put our musical input into it, so the music has changed a lot.”\n\n“We were tired of me on acoustic guitar and everybody singing harmonies,” says Hwang. “We were hitting a ceiling, and it wasn’t fun. We had always agreed this band was six-ways, for better or worse. So at the end of last year, after being in the van constantly, we said, ‘no more touring, let’s write new songs.’”\n\n“We had to grow up pretty fast as a band,” says Chong. “So this past year, there were times when different perspectives and priorities have butted heads.”\n\nDuring the writing of Drinking From A Salt Pond, the band admits to flaring tempers and tense operations as they worked to redefine their sound, goals and relationships. “We’ve had a lot of hating each other, almost kicking people out of the band,” says Hwang. “We’re being honest and that openness is one of the main thrusts for the album. Embracing the bitter with the sweet, not trying to hide the crappy parts…the crappy parts helped make the good.” Being open about its faults, the band recognizes how the turmoil has helped Run River North create something beautiful.\n\n“The record we just made, it’s all the difficult stuff we went through so there’s a darker tone to the music. It works,” says Chae.\n\nOne of the first steps in leaving behind their folk roots was to work with new collaborators. Instead of the reverb-heavy, northwest sound of Ek, they recorded in Los Angeles with Lars Stalfors (Cold War Kids, HEALTH, Deap Vally, Matt and Kim) at the production helm. Stalfors opened their eyes to the upbeat energy and electric tone of indie bands like The Walkmen. Throughout Salt Pond the indie rock influence can be heard, with the band nodding inspiration to everyone from Cage the Elephant and Kings of Leon to The National, Death Cab for Cutie, and Cold War Kids, whose studio in San Pedro, CA the band borrowed to make the album. Also, in a move encouraged by their record label, Nettwerk, Hwang and Chae were sent to Nashville for a week in April 2015 to work on a few new tracks with two different co-writers, Lincoln Parish (formerly of Cage the Elephant) and the Kings of Leon collaborator Nick Brown.\n\n“It was weird but at the same time it was really encouraging,” says Hwang of the co-writing. “It was like bringing our demos to a blind date.”\n\nThe first song from the Nashville sessions was “Run Or Hide,” co-written with Parish, and from first listen it’s clear that Run River North are exploring bombastic new territory. Hwang, Chae, and Parish came up with an organic way of working that was based on jamming and vibing together, and once the song’s melody was nailed down, the rest came easily. It was immediately hard-hitting than any previous song from the band, with a discernible strut serving as a sonic contrast. When the demo was sent home to LA, the rest of the band was shocked.\n\n“Almost everyone else was really scared,” says Hwang, “‘this is not your voice, this is not who we are.’ I was confident it was a really good song and that we were gonna keep it. There’s nothing more aggressive on the record, and that groove on the verses is bigger than the band. The band can’t contain the song.”\n\n“I loved it!” says Chong emphatically. “Alex has a very wide range of emotion when he sings—soft, whispery things; really bombastic; rough—this song showcases all of that. I got really excited. When we recorded it, it really showcases more groove. Joe, our bass player, is solid, and the way the melody is created in the verses really adds to that. There’s a really cool contrast happening, but the choruses hit hard.”\n\nThe other song written in Tennessee was the Nick Brown co-penned “Can’t Come Down,” a track with pop qualities that the band does not shy away from recognizing. For that they leaned on Brown heavily, who served almost as a mentor to Hwang and Chae during the sessions, teaching them about pop hooks, authenticity, and Southern tradition. Deciding to go all in on a pop song, the trio rallied behind Brown’s catchy melodies and licks, and what they ended up with is a happy medium that “still sounds as Run River North as possible,” according to Chong, while simultaneously reaching for the rafters.\n\n“We really gelled with Nick Brown,” says Hwang. “We had the same idea: ‘We have enough songs that exemplify us, so let’s try our hand at writing a pop hook.’ With that mentality we came up with ‘Can’t Come Down.’ Nick wrote the hook, Daniel and Nick wrote the music, and a heavy collaboration on lyrics from everyone. It’s the first song I ever sang the word ‘baby’ in.”\n\nWith those songs firmly planting the band’s flag in new ground, it is Hwang’s “29” that may be the best indicator of the band Run River North are becoming. A piano and drum fueled anthem examining the ups and downs of transition, it finds the singer posing multiple existential questions at once. “Everyone’s always talking about how if you will something, it’s gonna happen. But, sometimes it doesn’t!” says Hwang. “That was a realization I wanted to play with: ‘Your words are cold like the wind…’ It’s kind of like saying, ‘I don’t care what you think,’ but it’s also a reflection about my words. What I do can be just as insignificant as anyone else. So what are you gonna do about it? You’re 29. ‘I know it’s home, I know it hurts/I know I’ll end up at the bottom/What if I leave?’ What if we go on this tour and we don’t end up anywhere? The brutal question is, who cares, and why does it matter? Not answering that in the song really helps. The music is still upbeat, it still has the ‘oh’s’ going on, it’s an anthemic thing. I’m still energetic, I’m not some old dude at 29.”\n\n“29” was written on electric guitar, a tool Hwang has been using more frequently since the end of the debut album’s touring cycle. Originally intended for a more somber feel, at the suggestion of their producer Stalfors, the tempo rose to meet Hwang’s intonations. “It became this song with so much energy,” says Chong, “it’s probably the fastest song we’ve ever done as a band. It’s new territory for us; it’s very fun. It’s a good transition, with lulled verses and really upbeat instrumentals and choruses. This is a good appetizer for our old fans, as this is who we’ve become.”\n\nEmbracing their natural growth and learning to ride the waves of their personal and musical evolutions with open hearts and nimble hands, Run River North have created a sophomore album that will propel them to the forefront of today’s landscape. Although at times the rushing water of their rise will pool into depths tough to swallow, they have learned to lean on each other and to trust themselves along the way in order to make something lasting and truly beautiful.\n\n“From the start, we always said we wanted to play on the biggest stages possible,” says Hwang. “That’s still the same. But it isn’t some self-indulgent dream of becoming rock stars; we still want to support our families with this, we still have the parents that sacrificed for us and we want to honor them. For us as a band, at times it’s felt like we’ve been drinking from a salt pond—and yet, we still created something pretty fresh that we like and are proud of.”\n\nWSG: The Lighthouse and the Whaler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/634", "url": "https://www.facebook.com/events/629378653882823/", "name": "Run River North w/ The Lighthouse & The Whaler 4/5/16 @ Blind Pig - Ann Arbor", "date": "2016-04-05T20:00:00-04:00"}, {"source": "Facebook", "description": "Saadia Faruqi is a Pakistani American writer of fiction and nonfiction. She writes for a number of publications including Huffington Post and The Islamic Monthly about the global contemporary Muslim experience and about interfaith dialogue. She has trained law enforcement on cultural sensitivity issues and offers community college classes on a variety of topics related to Islam and Muslims. She is editor-in-chief of Blue Minaret, a magazine for Muslim art, poetry and prose. Her short stories have been published in several American literary journals and magazines such as Catch & Release,  On the Rusk, In Flight and The Great American Literary Magazine. “Brick Walls: Tales of Hope & Courage from Pakistan” is her debut fiction book. She is currently working on a novel based in Pakistan and the U.S. as well as a children’s book series.\n\n“Faruqi’s evocative collection is like a breath of fresh air as it breaks through all the clutter of violence, terrorism and fear, and offers much hope and faith in humanity despite the odds.” Kitaab book review.\n\n“Faruqi’s stories beautifully capture the similarities (of the human condition); her ambitious, flawed, raw characters are easy to relate to for any reader, regardless of ethnicity.” Brown Girl Magazine book review.\n\n“If you want to learn about the real Pakistan behind the headlines, this is a good place to start.” Bookmuse book review.", "url": "https://www.facebook.com/events/1677432605865426/", "name": "Meet Author Saadia Faruqi for a Discussion & Signing of 'Brick Walls: Tales of Hope & Courage From Pakistan'", "date": "2016-04-06T19:00:00-04:00"}, {"source": "Facebook", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/", "name": "American Ballet Theatre: The Sleeping Beauty", "date": "2016-04-06T19:30:00-04:00"}, {"source": "Facebook", "description": "Wed. April 6 | 9pm | 18+ | $8 adv./ $10 day of\n\nGosh Pith - Gold Chain Tour\nWSG: Passalacqua, Obese Ghost Children & The Landmarks\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/653", "url": "https://www.facebook.com/events/166980353679332/", "name": "Gosh Pith | Gold Chain Tour 4/6/16 at Blind Pig - Ann Arbor", "date": "2016-04-06T21:00:00-04:00"}, {"source": "Facebook", "description": "Bryan Burrough is a special correspondent at Vanity Fair magazine and the author of six books, including the No. 1 New York Times Best-Seller Barbarians at the Gate and his latest, Days of Rage. He is also a three-time winner of the prestigious Gerald Loeb Award for Excellence in Financial Journalism.\nBorn in 1961, Bryan was raised in Temple, Texas, and graduated from the University of Missouri School of Journalism in 1983. From 1983 to 1992 he was a reporter for The Wall Street Journal, where he reported from Dallas, Houston, Pittsburgh and, during the late 1980s, covered the busy mergers and acquisitions beat in New York. He has written for Vanity Fair since 1992.\nIn 1990 Bryan and John Helyar co-authored Barbarians, the story of the fight for control of RJR Nabisco. The book, which spent 39 weeks on the New York Times bestseller list, has been hailed as one of the most influential business narratives of all time. Bryan joined Vanity Fair in 1992, where he has reported from locales as diverse as Hollywood, Nepal, Moscow, Tokyo and Jerusalem.\n\nFrom the bestselling author of Public Enemies and The Big Rich, an explosive account of the decade-long battle between the FBI and the homegrown revolutionary terrorists of the 1970s\nThe Weathermen. The Symbionese Liberation Army. The FALN. The Black Liberation Army. The names seem quaint now, when not forgotten altogether. But there was a stretch of time in America, roughly between 1968 and 1975, when there was on average more than one significant terrorist act in this country every week, and the FBI combated these groups and others as nodes in a single revolutionary underground, dedicated to the violent overthrow of the American government.\n\nBenefiting from the extraordinary number of people from the underground and the FBI who speak about their experiences for the first time, Days of Rage is filled with important revelations and fresh details about the major revolutionaries and their connections and about the FBI and its desperate efforts to make the bombings stop. The result is mesmerizing and completely new—a book that takes us into the hearts and minds of homegrown terrorists and federal agents alike and weaves their stories into a spellbinding secret history of the 1970s.", "url": "https://www.facebook.com/events/970118143072822/", "name": "Meet Author & Journalist Bryan Burrough for a Discussion of 'Days of Rage'", "date": "2016-04-07T19:00:00-04:00"}, {"source": "Facebook", "description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "url": "https://www.facebook.com/events/827290400697161/", "name": "Jerusalem Quartet", "date": "2016-04-08T20:00:00-04:00"}, {"source": "Facebook", "description": "Friday, April 8 | 9pm | 18+ | $22 Adv./ $25 Day of\n\nthe Mountain Goats - One thing that happened this past year was at City Winery, in April, where we did a session down in the cellar between soundcheck and the show. We hadn’t really thought a whole lot about the session in advance—on tour, your default response to things is “let’s just show up and play”—and we were kind of under the gun time-wise when we got to the club. So we decided to just do it quick and dirty, old-school style. Like the open mic nights I used to play: unamplified guitar and vocals, friends with their axes playing along, arrangements arrived at on the fly and infinitely flexible. Four songs later we felt really inspired—me and Matt played a song or two without anybody else around because we’d gotten down to the basement before the others, the total song choice was strictly “what do you figure we should play now?”, the mood was relaxed and free…we loved it. Later that night, we decided to strip down the drum kit to essentials and play a choke-the-motor set echoing and elaborating on what we’d done downstairs: a sort of small-ensemble feel, lower in volume but actually higher in intensity. Like what we do in concentrate. It was one of our two favorite performances of the year, the other being the second night at the Fillmore. It felt like acres of new terrain opening up atop an ancient foundation. As soon as it was over, we all wanted to do it again. So in 2016 we’re taking that set on the road. Not that exact set, obviously; the particulars will vary from night to night. But smaller rooms, audible frequencies, up close and personal: this is the general plan. Making eye contact with people in the back row, being able to go off-mic when I want to and still be heard. Total visibility. We couldn’t be more excited about this tour. I love the big album release shows as much as anybody, but that City Winery feel of just playing together with bare essentials in close quarters…there’s nothing like it, and when the whole room locks onto the signal, it’s really special.\nWith: William Tyler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/581", "url": "https://www.facebook.com/events/554988117991170/", "name": "The Mountain Goats w/ William Tyler 4/8/16 @ Blind Pig - Ann Arbor", "date": "2016-04-08T21:00:00-04:00"}, {"source": "Facebook", "description": "Melissa Grunow is the author of Realizing River City: A Memoir (Tumbleweed Books, 2016). Her writing has appeared in Creative Nonfiction, River Teeth, New Plains Review, Blue Lyra Review, Temenos, and Yemassee, among many others. She is also a live storyteller who competes in Detroit's The Moth StorySLAM.  \n\nAn award-winning writer, Melissa was a semi-finalist for the 2015 DISQUIET International Literary Lisbon Writing Program, a Pushcart Prize nominee for her essay \"Home,\" a two-time recipient of the Detroit Working Writers creative nonfiction prize, and is featured in Poets & Writers  Directory of Writers. \n\nShe is a volunteer reader for Creative Nonfiction magazine, screening general submissions for publication and and editor for Grey Wolfe Publishing. She is a member of Detroit Working Writers, Michigan Writers, and the Association of Writers and Writing Programs (AWP).  \n\nMelissa holds a Bachelor of Science in English-creative writing and journalism from Central Michigan University, a Master of Arts in English from New Mexico State University, and a Master of Fine Arts in Creative Writing with distinction from National University.\n\nAt times, life can feel like a challenging feat of survival. Whether it’s living through abusive relationships or figuring out the complexities of what it means to be a woman searching for love, Realizing River City is a memoir that proves how despite the troubles we may face, there is hope in the way we continually risk ourselves in search for the life we want to live. In her poetic exploration of past relationships, Melissa Grunow’s honest words do not falter in the face of so much loss. Taking the rage we all feel about grief and pain, and funneling it into truth, beauty, and ultimately redemption on each page, Realizing River City is about discovering how the most important relationship is the one we have with ourselves.", "url": "https://www.facebook.com/events/1721699551382115/", "name": "Meet Local Author Melissa Grunow for a Discussion & Signing of Her Memoir 'Realizing River City'", "date": "2016-04-09T15:00:00-04:00"}, {"source": "Facebook", "description": "Sat. April 9 | 8pm | 18+ | $10 adv./ $12 day of\n\nFlint Eastwood with: Marcus Alan Ward, Jacob Sigman & The Timbre of Cedar\n\nFlint Eastwood is the evolution of the creative side of Detroit-based multi-talented artist Jax Anderson. Flint Eastwood is what happens when friends and family gather in the forgotten spaces of an embattled city and are left to create with no rules, no boundaries, and nothing holding them back. Jax's endless creativity is a byproduct of growing up in a talented family.\n\nHer father was one of ten kids, each of whom played guitar and sang. Her oldest brother, Sam, played in punk bands, and Jax spent her teenage years learning the value of passion and acceptance at DIY shows. As she got older, her other brother (and Flint Eastwood collaborator and producer) Seth started playing in bands throughout the Detroit garage rock scene. Their dad worked as a curb address painter to pay the bills once the housing crash made his job as a mortgage broker invalid. During this time, Jax and her brothers went door to door, passing out flyers advertising her father's services, through some of the toughest residential neighborhoods in Detroit. These struggles helped form the vision that drives Flint Eastwood: to give everyone listening (whether live or on record) a momentary escape from the problems we all have.\n\nBetween helping around the house, Jax spent her days in her family's Detroit-area home, without cable and internet, teaching herself to play her father's 12-string Taylor guitar that he left for them in the living room. It was also during this time that her mother's love for Motown music began to influence Jax's knack for the theatrics and power of the Detroit sound, as Mom played records from The Temptations, the Jackson Five, and Earth Wind & Fire.\n\nOnce old enough to break out on her own, Jax briefly moved to a small German tourist town in rural Georgia, where the only station in town played solely pop and country. There, she fell in love with the hooks and harmonies that define American pop music. Later, she moved with Seth to Los Angeles, to mainly focus on writing for licensing opportunities and playing small clubs and house parties around town. While in LA, Jax developed a love for film, hopping on tour with bands every chance she could get as a self-taught videographer. Her experiences on the West Coast still influence Jax's push to make her musical endeavors into well-rounded multimedia presentations (mixing music with theatrical lighting, video projection, and costumes).\n\nUpon returning home to Detroit at the very beginning of the much-maligned city's recent resurgence, Jax's explosive and endearing personality on stage became the driving force behind Flint Eastwood. But through it all, it was the songs that were always the focus.\n\nOn their now sold-out debut EP Late Nights In Bolo Ties (2013), Jax and her friends mixed elements of pulsing electronic tracks with blistering bluesy guitar licks, all with a spaghetti-western backdrop, inspired by Sunday night movie sessions with Jax and her father.\n\nOn the forthcoming EP, Small Victories (to be released October 23), Jax has returned to her Detroit roots, mixing a taste of the theatricality of Motown music with her more recently found love for pop music. The result is six songs full of hooks. The type of tracks that you turn up a little too loud, close your eyes, and forget where you are for four minutes. In a live setting, the songs are taken to another level entirely, mixing a CHVRCHES-like depth with a twenty | one | pilots-style flair for the dramatic. This approach has led the band to rapidly gain an ever-growing fanbase. Their last two hometown headline plays have sold out (400+ tickets per show), and the band has toured heavily through the Midwest, mixing festival looks like Electric Forest, MoPop Festival, and Midpoint Music Festival with club appearances alongside acts such as Foxy Shazam, Mayer Hawthorne, Betty Who, X Ambassadors, and Andrew WK.\n\nSmall Victories was crafted and polished in Detroit’s second oldest church, now repurposed as Assemble Sound, a hub of Detroit creativity that fosters artists through collaboration. In this crumbling but inspiring location, the new record was created as a coping mechanism to help Jax deal with the loss of her mother, who was her biggest fan and inspiration. As the listener makes their way through the EP, they experience Jax making her way through her mother's illness and passing, railing against it, dealing with the aftermath associated with such a loss, eventually accepting it, and using it as a driving force to continue to create.\n\nJax broke the EP down in one simple thought:\n\n\"Small Victories comes from the idea that doing anything creative in life takes a lot of persistence, struggle, and hustle. It's easy to expect that the spoils will come easily and be immediately fruitful. But if you focus on the little things, the \"small victories\", you realize that it's those things that are the most rewarding. That's what keeps me going.\"\n\nThe lead single is the EP's first track, \"Find What You're Looking For\", which is Jax's interpretation of her mother's final words to her:\n\n\"Don't let this break you\".", "url": "https://www.facebook.com/events/1217913291571431/", "name": "Flint Eastwood w/ Marcus Alan Ward, Jacob Sigman & The Timbre of Cedar 4/9/16 at Blind Pig - Ann Arbor", "date": "2016-04-09T20:00:00-04:00"}, {"source": "Facebook", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "url": "https://www.facebook.com/events/194586454240654/", "name": "TheRide’s ServiceFest", "date": "2016-04-11T18:30:00-04:00"}, {"source": "Facebook", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1686417714974855/", "name": "Acoustic Tuesdays: Nick Zomparelli", "date": "2016-04-12T19:00:00-04:00"}, {"source": "Facebook", "description": "Tuesday, April. 12 | 9pm | 18+ | $13 Adv./ $15 Day of\n\nDenzel Curry 2055 The Ult Experience\nwsg: Allan Kingdom,  Sdotbraddy, and Detroit Che\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/636", "url": "https://www.facebook.com/events/523621744459410/", "name": "Denzel Curry - 2055: The Ult Experience 4/12/16 @ Blind Pig - Ann Arbor", "date": "2016-04-12T21:00:00-04:00"}, {"source": "Facebook", "description": "Wed. April 13 | 9pm | 18+ | $8 adv./ $10 day of\n\nThe Appleseed Collective \nwith: Big Dudee Roo & Rick Chyme\n\nThe Appleseed Collective is a four-piece Americana band that's toured these United States since 2010, serving up songs new and old—barn-burners, old soul jazz, airy mood pieces, bluesy digressions—to crowds hungry for more. Their music is a rich Dixie-Gypsy roots-music mélange with a modern twist, a long-simmering stew of old-time, ragtime, and bluegrass constantly refreshed—like the Melting Pot itself—with immigrant sounds and international spices. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/643", "url": "https://www.facebook.com/events/1698946970352936/", "name": "The Appleseed Collective w/ Big Dudee Roo & Rick Chyme 4/13/16 at Blind Pig - Ann Arbor", "date": "2016-04-13T21:00:00-04:00"}, {"source": "Facebook", "description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "url": "https://www.facebook.com/events/1621365181438631/", "name": "Mnozil Brass", "date": "2016-04-14T19:30:00-04:00"}, {"source": "Facebook", "description": "the event: our monthly beer tasting series explore the expansive world of beer through the lens of different themes. we'll gather a couple dozen brews worth sampling to bring you a novel and varied experience for your palates. We’ll pair the beer samples with an appetizer buffet, provide a program with tasting notes, and top off the night with a door prize drawing.\n\nthe style: For April's tasting, we're getting weird. Think Hefeweizen's made with curry, porters made with pig heads, historical ales made with heather.  Whatever outlandish beers that we can get out hands on, we guarantee they will be unorthodox and out of the ordinary.\n\nthe details: Arbor Brewing Company's monthly tastings run from 7-9 PM on the 2nd Thursday of each month. Ticket holders will enter through the Arbor Brewing Company Tap Room entrance. \n\nthe contest: Guests who come attired in a creative costume will get a second raffle ticket for the door prize drawing. Get wacky, get weird, get funky and double your chances!\n\nthe tickets: Tickets are available at the pub or by phone at 734-213-1393. $25 in advance, $30 day of. \nTickets are also available on Eventbrite: https://www.eventbrite.com/e/beer-tasting-april-foolishness-tickets-22819923004", "url": "https://www.facebook.com/events/1767827183440408/", "name": "Beer Tasting: April Foolishness", "date": "2016-04-15T19:00:00-04:00"}, {"source": "Facebook", "description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus. There it blended with elements of Spanish music and was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed singer Nidal Ibourk, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "url": "https://www.facebook.com/events/419604171550681/", "name": "Zafir: Musical Winds from North Africa to Andalucía", "date": "2016-04-15T20:00:00-04:00"}, {"source": "Facebook", "description": "Scott Ainslie came of age during the Civil Rights era, and cultivated a powerful affinity for cross-cultural exchange. He has studied with elder musicians on both sides of the color line, in the old-time southern Appalachian fiddle and banjo traditions, as well as Black gospel and blues. He plays this music with affection, authority, and power. Armed with a variety of instruments -- vintage guitars, a fretless gourd banjo, a one-string, homemade diddley bow (cigar box guitar) --  and carefully chosen personal anecdotes of his encounters with senior musicians across the South, Ainslie explores the African and European roots of American music and culture, bringing the musical history of America alive.  www.cattailmusic.com", "url": "https://www.facebook.com/events/506775856161991/", "name": "Scott Ainslie at Green Wood Coffee House", "date": "2016-04-15T20:00:00-04:00"}, {"source": "Facebook", "description": "frontier ruckus live at the Blind Pig on Friday, April 15th!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/663", "url": "https://www.facebook.com/events/149342562122588/", "name": "Frontier Ruckus 4/15/16 at Blind Pig - Ann Arbor", "date": "2016-04-15T21:00:00-04:00"}, {"source": "Facebook", "description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "url": "https://www.facebook.com/events/1579924995611394/", "name": "Bavarian Radio Orchestra", "date": "2016-04-16T20:00:00-04:00"}, {"source": "Facebook", "description": "Sat. April 16 | 9pm | 18+ | $15 Cover\n\nMixing a unique future sound with hip-hop and pop elements, Jai Wolf is gaining the attention of fans and influential musicians alike. After Skrillex saw a tweet containing Jai’s bootleg of his hit song, “Ease My Mind,” he immediately signed the remix. Since, Jai Wolf has done official work for Alesso, Dirty South, Melanie Martinez, ODESZA, and more.\n\nIn June 2015, Jai Wolf released his first original single, Indian Summer. Within three weeks, Indian Summer hit #1 on the US Spotify Viral Charts, and has gained global recognition.\n\nJai Wolf has toured nationally including pitstops at Coachella, Bonnaroo, Hard Summer, and will wrap up the year with a headlining tour in Australia this Fall.", "url": "https://www.facebook.com/events/533365020158543/", "name": "Jai Wolf 4/16/16 at Blind Pig - Ann Arbor", "date": "2016-04-16T21:00:00-04:00"}, {"source": "Facebook", "description": "$14 adv./ $16 day of | 18+\n\nFuturistic & Devvon Terrell\nwith Munch & Mocha\n\nGrowing up around music from his Father & two older brothers, it was inevitable that Futuristic would be a natural. He wrote his first raps at the age of six and hasn't looked back since. Born in Illinois but moved to Arizona in high school, Futuristic's flow seems to be just as hot as his surroundings. His album \"The Rise\" released on May 12th 2015 debuted at #2 on itunes and #9 on Hip-Hop Billboard charts. He has been touring virtually non-stop over the last 2 years headlining his own tours and supporting bigger acts such as Somo & Machine Gun Kelly. His fast witty lyrics mixed with substance and relatable subject matter has gained him a die hard fan base called WTFGang which stands for \"We're The Future\". As an independent artist Futuristic takes pride in his creativity and versatility using his words to inspire his fans and let them know that anything is truly possible but also gives them music to BANG with the top down in the summer. Moving forward he expects to be exactly what he named his lead single from his album.... \"The Greatest\". Futuristic recently was featured on A Great Big World single \"Hold Each Other\" which has led him to National television performances on The Tonight Show Starring Jimmy Fallon, VH1 Streamy Awards, Performing for the Vice President Joe Biden & CEO of Apple Time Cook, for the HRC National Dinner in Washington D.C.\n\nGood music arguably comes from a place that is insightful, meaningful and modern.This is where the living weirdo known as Devvon Terrell lives and sleeps. Hailing from Brooklyn, New York the singer has his own urban style and sound that is a testament to his generation.\n\nDevvon Terrell took the internet by storm, showcasing his talent on various remixes and cover videos on youtube that have gained him as much as 200,000 views on a single video.\n\n \n\nDevvon Terrell wears a variety of hats to translate his music to his audience. From shooting and editing videos to engineering, mixing and mastering all of his music. This jack of all trades mentality has earned him placements with And One Live, C2C Dj Khaled's Halftime Report, a number one Mixtape on Datpiff.com and countless other mediums. Devvon Terrell recently released his first album titled \"Weird Sexy Cool\" and earned a the spot of top 16 albums on the itunes RNB charts. With all his endeavors on the rise Devvon Terrell will surely make the transformation from local talent, to mainstream superstar.", "url": "https://www.facebook.com/events/1042945595776720/", "name": "Futuristic and Devvon Terrel 4/17/16 at Blind Pig - Ann Arbor", "date": "2016-04-17T21:00:00-04:00"}, {"source": "Facebook", "description": "Monday, April 18 | 8pm | 18+ | $15 adv./ $17 day of\n\nPolica with MOTHXR \n\nUnited Crushers (out March 4, 2016) is POLIÇA’s third full-length release and most remarkable album to date. The band, which includes Channy Leaneagh, dual drummers, Drew Christopherson and Ben Ivascu and Chris Beirden on bass with producer Ryan Olson at the helm, collectively wrote the album in Minneapolis in the winter of 2015 during their first true break from two straight years of touring. The new album builds on POLIÇA’s signature synthesizer and percussion-heavy sounds with more complex arrangements and a bigger, crisper hi-fi punch due to the new approach they took to writing and recording: together, all in the same room. There's a tighter groove to these songs and a more vulnerable quality to them, especially in Leaneagh's singing. Her incredible vocal range is consistently on display throughout, beautifully raw and less electronically effected than on previous recordings. United Crushers is the follow up to 2013’s Shulamith which EW called \"propulsive enough for dance floors, and dreamy enough for headphones\" andMOJO said \"proves that intelligent pop music still has the ability to seduce and enthral.\" Their debut, 2012's Give You The Ghost, also garnered international acclaim, with Rolling Stone hailing it as \"the sound of heartbreak and celebration happening simultaneously\" and Q praising it as \"a bewitching, urgent, magical debut.\" The band has conquered massive festivals around the world from Coachella to Glastonbury in addition to performing on Late Night With Jimmy Fallon, Later With Jools Holland and more.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/564", "url": "https://www.facebook.com/events/769930223136488/", "name": "Polica w/ Mothxr 4/18/16 @ Blind Pig - Ann Arbor", "date": "2016-04-18T20:00:00-04:00"}, {"source": "Facebook", "description": "Thu. April 21 | 9pm | 18+ | $15 Cover\n\nI don’t know how to write a bio for an album. I’ve never written one. I’m a comedian. My job is to talk onstage for long enough that the trapped, drunken audience has to buy more chicken wings from the club. I am not qualified to write about music. And yet here I am, writing a bio for the new The Thermals record, We Disappear. Thank god it’s a great fucking record.\n\nThe first time I heard The Thermals was on broken headphones while riding the A Train to Rockaway, Brooklyn, flying mere feet over a frozen Jamaica Bay on a too-bright January morning. I had just fallen in love with a wonderful, terrible woman who was thousands of miles away. I was very fragile, I had no boundaries, and I was the strongest I’d ever been. And that’s how this album feels. There’s a new vulnerability here, but The Thermals’ sound is as strong as it’s ever been.\n\nThe Thermals are best at making songs you put on mixtapes named ‘Drunken Sing-alongs When You’re Sad.’ They specialize in late-night, secret conversations about feeling simultaneously romantic and resentful over being raised Catholic. They’re the soundtrack to breaking glass, and an ode to the beauty of brokenness.\n\nThey say that the mark of intelligence is the ability to hold two disparate and conflicting truths in the mind at the same time: I am a good person; I am not a good person. We Disappear lives in this delicate, in-between place: at once hard and noisy, while also soft and personal. And seeming contradictions abound on this album. We Disappear is an all-too-real, dark, and intensely personal album – in the past most of singer Hutch Harris’ lyrics have been mostly fictitious tales – about how we try to outrun demise, whether personal or physical. It is an emotional document of how two people can tear each other apart, while simultaneously making you wanna get up and jump around the room.\n\nThe deeply dark, yet oddly catchy “Heart Went Cold” plays on the double metaphor of loss of love/life and features the sad realization “I pushed you away”, but is immediately followed by the super poppy “oh-oh oh”. The classic fucking rock anthem “Hey You” is a paranoid fantasy about running from the Grim Reaper as he calls after you, about “being terrified of death,” says Harris, but “a celebration of that feeling as opposed to feeling sad about it.” A surprisingly uplifting eulogy of the death of a relationship, “Thinking Of You” is explained by Harris as “one of the most straight-forward love songs we’ve ever written, a point-blank post-break up song. It’s a song that says exactly what it means. It and a lot of the record are about regret, i.e. still loving someone after a break-up and hanging on to these feelings.”\n\nWe Disappear is also about separation in terms of technology, how it can isolate us and impact our relationships, and how humans have embraced it to the point where we’ve already assimilated into it. “The Great Dying” and “Into the Code” examine how we’re so afraid we’re going to be forgotten, or overlooked, that we upload everything about our lives onto the Internet.\n\nHarris explains, “Technology, love and death are the three obsessions of the record. Our privacy used to be so important to us and now everything has changed – we freely offer once private information about relationships and reveal everything about our day-to-day lives. We’re trying to preserve our life digitally so when we’re gone people won’t forget us. We’re using technology to become immortal. You can even set up Facebook and Twitter accounts to continue updating after you die! We Disappear is about how humans fight the inevitable.”\n\nI’m sure you want to know that the record will come out March 25th, 2016 on Saddle Creek, that it features the longest running Thermals line-up of Hutch Harris, Kathy Foster, and Westin Glass, and that it was recorded in Portland, OR at Kung Fu Bakery (The Shins, Tegan and Sara) and in Seattle, WA at The Hall of Justice (Nirvana, Mudhoney), and produced by Chris Walla (formerly of Death Cab For Cutie). But what really matters is that this record GETS IT. It walks that fine line between truth and lies, between death and life, between depression and joy – all the while recognizing that one cannot exist without the other. And it brings us with it. That’s the reason to listen to this record: Because it’s a fucking great album, by an amazing band. Long Live The Thermals.", "url": "https://www.facebook.com/events/1683772608545604/", "name": "The Thermals w/ Summer Cannibals 4/21/16 at Blind Pig - Ann Arbor", "date": "2016-04-21T21:00:00-04:00"}, {"source": "Facebook", "description": "Warm as summer sunshine, real as the truth, intimate as a long overdue visit between old friends … such is a Jonathan Edwards concert. Four decades into a stellar career of uncompromising musical integrity, the man simply delivers, night after night – songs of passion, songs of insight, songs of humor, all rendered in that pure and powerful tenor which, like fine wine, has only grown sweeter with age.\nThis is one veteran performer who is neither grizzled nor nostalgic.  \nJonathan's  highly respected repertoire  includes such classics as, “Sometimes,” “One Day Closer,” “Don’t Cry Blue,” “Emma,” “Everybody Knows Her,” “Athens County,” and everyone’s favorite ode to putting a good buzz on, “Shanty.” And then, of course, there’s the anthemic “Sunshine (Go Away Today),” that fierce proclamation of protest and independence that resonated with thousands and thousands of frustrated and angry young men and women when it was first released in 1971. Almost 40 years later, at show after show, the song continues to be embraced by faithful followers and new fans alike.\nSince 1971, Jonathan has released 15 albums, including \"Blue Ridge,\" his standard-setting collaboration with bluegrass favorites the Seldom Scene, and \"Little Hands,\" his collection of children’s songs, which was honored with a National Library Association award. His brand new album is, \"Tomorrow's Child.\"\nwww.jonathanedwards.net", "url": "https://www.facebook.com/events/1943009162591226/", "name": "Jonathan Edwards at Green Wood Coffee House", "date": "2016-04-22T20:00:00-04:00"}, {"source": "Facebook", "description": "Big Wild\nw/ guests TBA!\n\nFri. April 22 | 9pm | All Ages | $10 adv./ $12 day of\n\nStemming from a relentless desire to create something new, Big Wild’s sound taps into the natural curiosity we all share by exploring beyond conventional boundaries in music. This spark was ignited when he first began creating music under the heavy influence of modern hip hop producers. Since then, he has increasingly drawn inspiration from the limitless potential of electronic music, while at the same time building a style unique to him.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/637\n\nConnect with Big Wild:\nhttp://bigwildmusic.com\nhttp://soundcloud.com/bigwildmusic \nhttp://twitter.com/bigwildmusic\nhttp://instagram.com/bigwildmusic", "url": "https://www.facebook.com/events/935490533173037/", "name": "Big Wild :: 4/22 at Blind Pig - Ann Arbor", "date": "2016-04-22T21:00:00-04:00"}, {"source": "Facebook", "description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "url": "https://www.facebook.com/events/1589849627952742/", "name": "The Bad Plus Joshua Redman", "date": "2016-04-23T20:00:00-04:00"}, {"source": "Facebook", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1535746816722754/", "name": "Acoustic Tuesdays: Heather Schwartz", "date": "2016-04-26T19:00:00-04:00"}, {"source": "Facebook", "description": "Our April Artists' Meet & Greet topic is How to Photograph Your Artwork. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet events: http://www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/1668025760140932/", "name": "How to Photograph Your Artwork", "date": "2016-04-27T18:00:00-04:00"}, {"source": "Facebook", "description": "Wed. April 27 | 9pm | 18+ | $28 Cover\n\nReverend Horton Heat with: Unknown Hinson, Nashville Pussy & Lucky Tubb & the Modern Day Troubadours Live in Concert!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/612", "url": "https://www.facebook.com/events/991272244292924/", "name": "Rev. Horton Heat & Company 4/27/16 @ Blind Pig - Ann Arbor", "date": "2016-04-27T21:00:00-04:00"}, {"source": "Facebook", "description": "Diana Wege is an artist. She has painted in all fifty states and in 2000 she published Land America Leaves Wild, a book of her paintings of 23 of those states. This is her first children’s book.  Diane also grew up in Grand Rapids and Ann Arbor and is a graduate of Greenhills School.\n\nHarbour Island, only three miles long and half a mile wide, is one of the oldest settlements in the Bahamas and is best known for its broad pink-sand beaches and for bonefishing, a compelling catch-and-release enterprise that pits a determined angler against an inedible, surprisingly powerful, and elusive quarry.\n\nYoung and fearless Flossie lives on Harbour Island and has a persistent dream is to go fishing with the legendary guide Bonefish Joe, a beloved island institution who picks up his wealthy clients at the dock and returns with them hours later, fishless but satisfied. One Sunday, after church, Flossie’s wish is surprisingly granted and she discovers the allure, the challenge, and the delights of hooking (and releasing) one of angling’s greatest prizes.\n\nDiana Wege’s illustrations of the island, its inhabitants, its customs, and its architecture,bring this story alive, perfectly catching the characters, culture and charm of Harbour Island.", "url": "https://www.facebook.com/events/1079340418752835/", "name": "Meet Illustrator/Artist Diane Wege for a discussion & Signing of 'A Day with Bonefish Joe' her First Children's Picture Book", "date": "2016-04-28T19:00:00-04:00"}, {"source": "Facebook", "description": "Thursday, April 28 | 9pm | 18+ | $15 Cover\n\nIt’s rare for an artist to bridge the divide between critical acclaim and dedicated fan engagement. Chris Pureka is a Portland-based singer-songwriter whose body of work has resonated deeply with these seemingly disparate milieus. Her bold vulnerability in processing the intimacies of her life in song has long appealed to those listeners who crave authenticity. Now, five years coming, she shares with us another powerful entry in her life’s work, her sixth release, the aptly titled, Backin the Ring. Chris’s elegant emotionality as a vocalist, and her flair and immediacy as a lyricist have garnered her favorable comparisons to Gillian Welch, Ryan Adams, Bruce Springsteen, and Patty Griffin. She’s earned accolades from such distinguished taste-making outlets as The New York Times, Paste, Magnet,Billboard.com, and The AllMusic Guide. She’s shared the stage with such diverse and esteemed artists as Dar Williams, TheLumineers, The Cowboy Junkies, Gregory Alan Isakov, Martin Sexton, and Ani DiFranco. Along the way, Chris has remained fiercely independent, selling nearly 50,000 albums through her own label, Sad Rabbit Records. Chris’s journey in music mirrors her path toward self-discovery. At 16, writing songs became a way of journaling. “I was shy and introverted, and songwriting was a very personal process. I never had any intention of performing,” she shares. Post high school, she went on to complete a biology degree at Wesleyan University, and afterwards, worked in a microbiology research lab at Smith College. Meanwhile, she established a music career parallel to her biology work through touring and issuing a clutch of well-received indie releases.In 2006, when Chris found herself turning down too many opportunities as a musician, she shifted her priorities to become a full-time artist. Her latest album, Backin the Ring, is Chris’s first studio full length since 2010’s critically acclaimedHow I Learned to See in the Dark. “I’m not interested in releasing songs I can’t get behind or records I don’t love,” she says of the five-year span between albums. The title of her latest playfully suggests something of an artistic comeback, but it also references the album’s themes of relationship conflict and making the decision to fight back against dark inner demons. “My music is the outward expression of the work I’m doing internally. What I do comes from my experiences, and I strive to express these experiences authentically. Speaking my truth, and being myself, is the way that I connect with people,” Chris confides. Her rise as an esteemed artist with captivating emotional integrity has been organic and always on her own terms.For someone who never had an intention of being a professional musician, it’s been a life of far-reaching changes and unexpected rewards. \n\nWSG: Anna Vogelzang\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/595", "url": "https://www.facebook.com/events/1318721681600135/", "name": "Chris Pureka w/ Anna Vogelzang 4/28/16 @ Blind Pig - Ann Arbor", "date": "2016-04-28T21:00:00-04:00"}, {"source": "Facebook", "description": "Don Campbell is a contemporary/country crossover and folk-rock singer/songwriter whose presentation of music supports the story in the song and welcomes the audience on board for the ride. Often compared to the sounds of Dan Fogelberg, Vince Gill, and Chris Isaak, Don and his ensembles are based out of New England. In 2012, Don released a double CD, \"Kites To Fly: Celebrating the Music of Dan Fogelberg,\" and in 2013 began presenting live performances of this music around his own busy schedule of Don Campbell shows.\nwww.doncampbellmusic.com", "url": "https://www.facebook.com/events/930690620345924/", "name": "A Special Evening Of Dan Fogelberg Music by Don Campbell", "date": "2016-04-29T20:00:00-04:00"}, {"source": "Facebook", "description": "Nicola's Books is THRILLED to be hosting a store event for NYT bestselling children's author Andy Griffiths. \n\nAndy Griffiths is one of Australia’s most popular children’s authors. Andy is best known for The Treehouse series, the JUST! books and The Day My Bum Went Psycho. Over the last 20 years Andy’s books have been New York Times bestsellers, adapted for the stage and television and won more than 50 Australian children’s choice awards. Andy, a passionate advocate for literacy, is an ambassador for The Indigenous Literacy Foundation and The Pyjama Foundation.\n\nAndy and Terry live in a 52-Story treehouse. (It used to be a 39-story treehouse, but they keep expanding.) It has a chainsaw-juggling level, a make-your-own-pizza parlor, a rocket-powered carrot-launcher, a life-size snakes and ladders game, a remembering booth, a Ninja Snail Training Academy and a high-tech detective agency, with all the latest high-tech detective technology, including the Disguise-o-Matic 5000!\nSomething that is sure to come in handy as they try to solve the mystery of: What happened to Mr. Big Nose? After all, it's hard to turn in your next book when your publisher has vanished!\nJoin \"New York Times-\"bestselling author Andy Griffiths and illustrator Terry Denton on another wild storytelling adventure in a series \"Publishers Weekly\" described as \"Anarchic absurdity at its best.\" Welcome to \"The 52-Story Treehouse...\"What are you waiting for? Come on up!", "url": "https://www.facebook.com/events/1697126153910182/", "name": "Meet NYT Bestselling Children's Author Andy Griffiths for a Discussion & Signing of His New Book, 'The 52- Story Treehouse'", "date": "2016-04-30T11:00:00-04:00"}, {"source": "Facebook", "description": "International Tabletop Day is back and this year Vault of Midnight is going to make it better than ever. Founded in 2013 by Geek & Sundry, International Tabletop Day is a worldwide celebration of board-gaming awesomeness. Join your local community of board gamers and play the latest heavy hitters or revisit a classic.\n\nInternational Tabletop Day is a free, family friendly event for both tabletop enthusiasts and curious noobs alike. Join Vault of Midnight's staff and a small army of gaming experts at The Beer Grotto - we'll teach you all the rules and make recommendations on some new games that you might want to add to your game collection.\n\nExcelsior!", "url": "https://www.facebook.com/events/1711823135728044/", "name": "International Tabletop Day 2016", "date": "2016-04-30T12:00:00-04:00"}, {"source": "Facebook", "description": "Vocalist and composer Carla Cooke is the youngest daughter of the legendary Sam Cooke, whose musical life encompassed religion, romance, and history. Carla’s career mirrors that of her father, in that she crafted her sound in the church. Carla sought not to use her father’s name, but to build her own reputation. Now the younger Cooke knows that her roots are firmly entwined in her father's as she connects with them through his music.\n\nCarla Cooke’s style is diverse in gospel, Christian, R&B, soul, and pop styles. With a strong vocal range and warm personality, Carla shows that the apple doesn't fall far from the tree, as she channels the raw talent, emotion, beauty, and charisma of the Cooke family persona. www.carlacooke.com", "url": "https://www.facebook.com/events/919947144747827/", "name": "An Evening of Sam Cooke by Daughter Carla Cooke", "date": "2016-05-06T20:00:00-04:00"}, {"source": "Facebook", "description": "Get an up-close look at what makes the water flow to your faucet.\n\nSaturday, May 7th\n11am to 3pm\n\n919 Sunset Rd\nAnn Arbor, MI 48103\n(734) 794– 6426\n\nFreebies, tours, family friendly activities and light refreshments.", "url": "https://www.facebook.com/events/1513835392257274/", "name": "Water Treatment Plant Open House", "date": "2016-05-07T11:00:00-04:00"}, {"source": "Facebook", "description": "Sat. May 7 | 9:30pm | 18+ | $10 Cover\n\nSuper Happy Funtime Burlesque is a 16 member band/burlesque show showcasing genre defying music and sexy striptease all in the name of good jokes and bad taste.  Designed to find your line and cross it, SHFB presents its shows as full on musical theater.  Rather than the typical variety show format, SHFB presents a full on original rock opera at its many stops around the nation as it tours year after year in its big red school bus.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/652", "url": "https://www.facebook.com/events/1763664110523989/", "name": "Super Happy Funtime Burlesque 5/7/16 at Blind Pig - Ann Arbor", "date": "2016-05-07T21:30:00-04:00"}, {"source": "Facebook", "description": "Wed. May 11 | 9pm | 18+ | $20 Cover\n\nHailing from Oakland, California, Del the Funky Homosapien and his crew, the Hieroglyphics came out as a markedly non-gangster response to a burgeoning West Coast scene. After being put on at the tender age of 17 by his cousin Ice Cube, Del released two records on Elektra, I Wish My Brother George Was Here (1991) and No Need For Alarm (1993). Despite record sales in the hundreds of thousands, he recorded a third album, Future Development, which was never commercially released. Del parted with Elektra and started work on the Hieroglyphics..family album, 3rd Eye Vision (Hiero Imperium, 1998). Hiero went on the road and toured incessantly in support of the album for much of 1998. Del also spent a good portion of his time drawing, practicing Japanese, and playing mass amounts of video games. Finally ready to unleash a new record on the world, Del comes with BOTH SIDES OF THE BRAIN. Seventeen tracks of pure Del. He says of his work on this album: ..\"I've had complete control\". At times, Del has felt restrained by the formulas in hip hop and the expectations fans place upon emcees who have had hits. I wish that I had the same freedom that someone like Bjork has when she puts out an album..Apart from collaborations with PrincePaul, El-P (Company Flow), and help from a few of his Hiero cohorts (A-plus, Casual, Domino) Del handled the majority of production on this album. By staying true to himself, Del has earned legions of adoring fans. He may have said it best in his classic, Mistadobalina when he declared all in the mind and the heart. WSG: Sean Anonymous", "url": "https://www.facebook.com/events/222011124804458/", "name": "Del The Funky Homosapien wsg DJ Shiftee & Sean Anonymous 5/11/16 at Blind Pig - Ann Arbor", "date": "2016-05-11T21:00:00-04:00"}, {"source": "Facebook", "description": "Harmony Bones is a quartet of long-time veterans of the Ann Arbor folk music scene. The band consists of Jeanne Mackey, Tom Voiles, Linda Teaman, and Laz Slomovits. The name Harmony Bones comes from an acupuncture point that harmonizes imbalances and promotes clear thinking, seeing, and hearing.\nJeanne, Tom, Linda and Laz have joined forces to explore a wide range of traditional, contemporary and original folk songs. Rich vocal harmonies and an array of instruments -- guitar, mandolin, flute, pennywhistle, fiddle, banjo, percussion, sitar -- combine to make Harmony Bones.\nSinger/songwriter Jeanne Mackey offers a blend of emotional intensity, wry humor, and global consciousness. In addition to original tunes, her repertoire ranges from Dar Williams to Patsy Cline, from Pete Seeger to Irving Berlin. A seasoned guitarist, she draws on a variety of styles -- folk, classic swing, funky blues, and more -- with the occasional sprinkle of mandolin, accordion, or banjo. Mackey rocked the 1970s East Coast topical music circuit as a young musician advocating feminist values and social justice.  In 2010, Mackey created \"Drop The Knife: A Memoir-in-Song,\" an evening of original songs and stories exploring the meaning of homeland, curses, death, and magic.\nLinda Teaman and Tom Voiles do much of their singing and playing with Nutshell, an Ann Arbor-based Celtic roots band. Nutshell plays for contra-dances and performs at festivals across North America.\nLinda is a singer who brings depth of understanding, warmth and sensitivity to the music. In 2005, her graduation recital for a degree in k-12 choral music had her singing in five languages, encompassing musical forms such as Irish sean nos singing and Italian and German arias by composers Purcell, Mozart and Brahms. She leads the Rudolf Steiner Community Singers, a small choir that sings uncommon Christmas and seasonal songs of celebration.  She hopes you'll forgive her classical background and that she is redeemed by her love of folk music.  In addition to vocals, she adds light percussion to the mix.\nTom consumes a well-rounded musical diet that ranges from Celtic to Indian to rock and roll. He enjoys mixing different styles while maintaining a respect for the traditions from which they spring. Tom has studied North Indian Classical music, Moroccan folk drumming and western classical flute. He has worked with performance artists, dancers, mimes and poets, including Hosain Mosavat, Gerry the Fool, Matthew Smith, ML Liebler and the Magic Poetry Band.\nLaz Slomovits is one of the twin brothers in Ann Arbor’s nationally-known children’s music duo, Gemini. A fine singer and multi-instrumentalist, Laz is starting his 4nd year playing music. His songs are featured in songbooks used by music teachers throughout the country, and Gemini's recordings have won numerous awards. In addition, Laz has had a notable solo career. In his solo work, Laz is best known for his powerful musical settings of the poetry of ancient Sufi mystics Rumi and Hafiz, as well as that of contemporary American poets.", "url": "https://www.facebook.com/events/1637106023218709/", "name": "Harmony Bones at Green Wood Coffee House", "date": "2016-05-13T20:00:00-04:00"}, {"source": "Facebook", "description": "Grammy winner Pat Donahue is one of the most popular finger pickers in the world. His musical tastes are eclectic. Though he considers himself foremost a folk guitarist, Pat’s influences are rooted in bluesmen Blind Blake, Robert Johnson, Duke Ellington, Muddy Waters and Miles Davis.\nHaving been a songwriter and guitarist for twenty years for the “Guys All Star Shoe Band” of Minnesota Public Radio’s “A Prairie Home Companion,” Pat got to show off his savvy licks and distinctive original songs to millions of listeners each week. After wrapping up this impressive longterm gig, Pat now turns to full time concert touring, presenting master guitar workshops and attending prestigious music camps. www.patdonahue.com", "url": "https://www.facebook.com/events/148870615480384/", "name": "Pat Donohue at Green Wood Coffee House", "date": "2016-05-20T20:00:00-04:00"}, {"source": "Facebook", "description": "Our May Artists' Meet & Greet topic is \nHow to Submit Your Artwork to a Show or Gallery. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/1176167649079840/", "name": "How to Submit Your Artwork to a Show or Gallery", "date": "2016-05-25T18:00:00-04:00"}, {"source": "Facebook", "description": "New music! At the Royal Oak Music Theatre, 318 W. Fourth St., Royal Oak, MI. Co-presented by AEG Live and The Ark.", "url": "https://www.facebook.com/events/830428020395505/", "name": "Josh Ritter & The Royal City Band", "date": "2016-05-25T20:00:00-04:00"}, {"source": "Facebook", "description": "Finding the point where blues and the jam bands meet", "url": "https://www.facebook.com/events/1513930968936295/", "name": "Nick Moss", "date": "2016-05-26T20:00:00-04:00"}, {"source": "Facebook", "description": "New voices from Michigan and Chicago", "url": "https://www.facebook.com/events/483627578508260/", "name": "Chris DuPont & Frances Luke Accord", "date": "2016-06-04T20:00:00-04:00"}, {"source": "Facebook", "description": "Leftover Salmon\nThe Ark - Ann Arbor\nAnn Arbor, MI\n\nTickets on sale Saturday, March 12th at 10am ET.\nTicket Link: http://bit.ly/1P22W4W", "url": "https://www.facebook.com/events/1673862936197989/", "name": "Leftover Salmon at The Ark | Ann Arbor, MI", "date": "2016-06-05T20:00:00-04:00"}, {"source": "Facebook", "description": "New music from a killer Colorado sister quartet", "url": "https://www.facebook.com/events/124603611266932/", "name": "SHEL", "date": "2016-06-08T20:00:00-04:00"}, {"source": "Facebook", "description": "Virtuoso bluegrass and roots sounds from Washtenaw County", "url": "https://www.facebook.com/events/987088328046526/", "name": "Thunderwüde", "date": "2016-06-09T20:00:00-04:00"}, {"source": "Facebook", "description": "A direct link to the early days of folk and the blues", "url": "https://www.facebook.com/events/1698056820481625/", "name": "Josh White Jr.", "date": "2016-06-10T20:00:00-04:00"}, {"source": "Facebook", "description": "October Project's lead vocalist returns", "url": "https://www.facebook.com/events/927935930621496/", "name": "Mary Fahl", "date": "2016-06-11T20:00:00-04:00"}, {"source": "Facebook", "description": "New music from Hayes! Emily Gimble is the granddaughter of legendary Texas fiddler Johnny Gimble.", "url": "https://www.facebook.com/events/1200205393330710/", "name": "Hayes Carll w/Emily Gimble", "date": "2016-06-18T20:00:00-04:00"}, {"source": "Facebook", "description": "Monday, June 20 | 9pm | 18+ | $15 adv./ $20 day of\n\nCritically acclaimed singer-songwriter James McCartney has remained fiercely dedicated to his musical vision of melding smart hooks and feral alt-rock with the grandeur and spiritually centeredness of psychedelic music. Now, he issues the sharpest entry of his vision, the majestic The Blackberry Train engineered by Steve Albini (Nirvana, The Pixies and PJ Harvey).\n\n“It’s all been an evolution,” James says. “This set of songs definitely has a harder edge, but it’s a continuation of the last album. The main thing for me is to not conform or compromise.”\n\nJames’ panoramic artistry is inspired by such diverse musicians as Kurt Cobain, The Smiths, Radiohead, PJ Harvey, The Cure, The Beatles, Neil Young, Jimi Hendrix, and Hank Williams. His fingerprint aesthetic has earned him plaudits from Rolling Stone, The Boston Globe, The New York Times, and The Daily News. He’s earned a strong following the old fashioned way, through tirelessly touring the US, Europe and the UK, and playing bigger and bigger shows with each go around.\n\nThe Blackberry Train is an epiphanic co-mingling of aesthetics. James sought out the distinct audio stylings of Steve Albini to conjure a grungier sensibility. He welcomed the engineer’s gifts for capturing music with a raw clarity, and Steve Albini’s reputation for not impinging on an artist’s vision. The results make for an eclectic album with fastidiously crafted songs documented in the studio with glorious purity.\n\n“I like the music to have elements of the avant garde, psychedelic, and be just a little against the grain,” James reveals. “But in the end, it’s about having as much emotion as possible for me, musically and lyrically. It’s all about the music being cathartic, heartfelt and true.”\n\nThe Blackberry Train manages to be both diverse and cohesive. The album opens invigoratingly with the jangling rocker, “Too Hard” and closes with the stately and aptly named folk song “Peace and Stillness.” Between these bookends, highlights include the rough-edged and urgently melodic “Unicorn,” the anthemic “Peyote Coyote,” and the soulful ballad “Prayer.” One very personal song is the winsome and reflective “Waterfall” which was inspired by memories of his mother.\n\nThis summer and fall James will embark on extensive tour dates in the U.S. Thinking ahead, James says: “I just want to keep on going, keep working, and improving as a songwriter. I’d love to feel that I realized my full potential both as a person, and as a songwriter. That feels like a great, fulfilling goal to shoot for. Making a lot of music, and striving for more depth artistically–those are my goals.”", "url": "https://www.facebook.com/events/573249992825775/", "name": "James McCartney 6/20/16 at Blind Pig - Ann Arbor", "date": "2016-06-20T21:00:00-04:00"}, {"source": "Facebook", "description": "A walking encyclopedia of American blues and roots music", "url": "https://www.facebook.com/events/1725030044449861/", "name": "The Steve Nardella Blues Band", "date": "2016-06-23T20:00:00-04:00"}, {"source": "Facebook", "description": "A walking encyclopedia of American blues and roots music", "url": "https://www.facebook.com/events/1238691669478608/", "name": "The Steve Nardella Blues Band", "date": "2016-06-23T20:00:00-04:00"}, {"source": "Facebook", "description": "International new folk sensations from Australia", "url": "https://www.facebook.com/events/662938483846794/", "name": "Boy & Bear", "date": "2016-06-28T20:00:00-04:00"}, {"source": "Facebook", "description": "Our June Artists' Meet & Greet topic is Legal Issues for Artists. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/527954430710284/", "name": "Legal Issues for Artists", "date": "2016-06-29T18:00:00-04:00"}, {"source": "Facebook", "description": "\"A young Paul Simon wrapped in a Tom Waits heart\"—Zvents", "url": "https://www.facebook.com/events/836609109798914/", "name": "Matt the Electrician", "date": "2016-07-06T20:00:00-04:00"}, {"source": "Facebook", "description": "Newfound Road's amazing lead vocalist steps out with music by Jackson Browne and more. This show has been rescheduled from June 16.", "url": "https://www.facebook.com/events/1124052387614735/", "name": "Tim Shelton", "date": "2016-07-10T19:30:00-04:00"}, {"source": "Facebook", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/", "name": "The 2016 Ann Arbor Art Fair", "date": "2016-07-21T10:00:00-04:00"}, {"source": "Facebook", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/", "name": "The 2016 Ann Arbor Art Fair", "date": "2016-07-22T10:00:00-04:00"}, {"source": "Facebook", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/", "name": "The 2016 Ann Arbor Art Fair", "date": "2016-07-24T10:00:00-04:00"}, {"source": "Facebook", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/", "name": "The 2016 Ann Arbor Art Fair", "date": "2016-07-27T10:00:00-04:00"}, {"source": "Facebook", "description": "A retro-tinged jazz sound with contemporary honesty", "url": "https://www.facebook.com/events/1570961503220935/", "name": "Leftover Cuties", "date": "2016-07-27T20:00:00-04:00"}, {"source": "Facebook", "description": "The Old Tin Can tour!", "url": "https://www.facebook.com/events/1262918310390270/", "name": "Scythian", "date": "2016-07-28T20:00:00-04:00"}, {"source": "Facebook", "description": "Nashville rock 'n' roll with Motor City soul", "url": "https://www.facebook.com/events/1680680362219416/", "name": "Captain Ivory", "date": "2016-08-12T20:00:00-04:00"}, {"source": "Facebook", "description": "\"Scotland's greatest living songwriter\"—Celtic World", "url": "https://www.facebook.com/events/1120634974616420/", "name": "Dougie MacLean", "date": "2016-08-19T20:00:00-04:00"}, {"source": "Facebook", "description": "Southeast Michigan's beloved songstress", "url": "https://www.facebook.com/events/241378229531717/", "name": "Katie Geddes", "date": "2016-08-24T20:00:00-04:00"}, {"source": "Facebook", "description": "\"Finds light in telling stories through music\"—Albuquerque Journal", "url": "https://www.facebook.com/events/1721730291447543/", "name": "Ellis Paul", "date": "2016-08-26T20:00:00-04:00"}, {"source": "Facebook", "description": "Ireland's legends push musical boundaries", "url": "https://www.facebook.com/events/905763186211716/", "name": "Altan", "date": "2016-09-15T20:00:00-04:00"}, {"source": "Facebook", "description": "At Woodstock, as a New York kid barely known outside the coffeehouse circuit in Greenwich Village, she sang her song, \"Beautiful People\" and inspired the first panorama of candles and cigarette lighters ever raised at a concert event. That, in turn, moved the young singer to write \"Lay Down (Candles in the Rain\"), which sold more than one million copies in 1970 and prompted Billboard, Cashbox, Melody Maker, Record World, and Bravo to anoint her as female vocalist of the year. Her single, \"Brand New Key,\" topped the charts in 1971.\nWith guitar in hand and a combination of amazing vocal talent, disarming humor, and a vibrant engagement with life, she was booked as the first solo pop/rock artist ever to appear at the Royal Albert Hall, Carnegie Hall, and the Metropolitan Opera House, and later opened the New Metropolitan Opera House in New York, the Sydney Opera House, and in the General Assembly of the United Nations, where she was invited to perform on many occasions as delegates greeted her performances with standing ovations.\nThe top television hosts of all time -- Ed Sullivan, Johnny Carson, and Dick Cavett -- battled to book her.\nUNICEF made her its spokesperson; Jimi Hendrix's father introduced her to the multitude assembled for the twentieth anniversary of Woodstock. Her records continued to sell -- more than eighty million to date. She's had her songs covered by singers as diverse as Cher, Dolly Parton, and Macy Gray. She's raised a family, won an Emmy, opened a restaurant, and written a musical about Wild Bill Hickok and Calamity Jane.\nThis is a rare opportunity to experience Melanie live and in person in an intimate venue. Don't miss it!\nwww.melaniesafka.com", "url": "https://www.facebook.com/events/1653085994944878/", "name": "Melanie at Green Wood Coffee House", "date": "2016-09-16T20:00:00-04:00"}, {"source": "Facebook", "description": "THIS EVENT HAS BEEN POSTPONED TO LATER IN THE POLITICAL SEASON.  PLEASE CHECK OUT THE NEW NOVEMBER 1ST PROGRAM, \"JOKES IN PROCESS\" THAT WE HAVE PUT INTO ITS PLACE.  \n\nThe presidential candidates have been HILARIOUS this year, but now let's see how the professionals do.\nJoin the Emergent Art's Theater and the UnClub as they present \"UnDebateable, the UnPresidential Debates\".\n\nIf you would like to be a part of this historic event, either as a moderator, an interview, and audience reporter, or an actual campaign spokeperson, or if you can do an impression of a candidate, please click the 'Going' button.  If you can't commit, but you are interested in following this event, click 'Maybe' and we will keep you informed.\n\nWe are also looking for folks who can help us stream a webcast of this event.\n\nWant to be a sponsor?  We'll take that too.", "url": "https://www.facebook.com/events/1690454564522707/", "name": "UnDebateable, the UnPresidential Debates - Clown Car to the White House", "date": "2016-09-18T21:00:00-04:00"}, {"source": "Facebook", "description": "\"I think the bottom of the barrel is where the answers are.\"—Fred Eaglesmith", "url": "https://www.facebook.com/events/183894411968312/", "name": "The Fred Eaglesmith Traveling Steam Show", "date": "2016-09-22T20:00:00-04:00"}, {"source": "Facebook", "description": "New music from an OUT magazine OUT100 featured music honoree", "url": "https://www.facebook.com/events/1679614935644801/", "name": "Melissa Ferrick", "date": "2016-10-01T20:00:00-04:00"}, {"source": "Facebook", "description": "Lou and Peter Berryman were both raised in Appleton, WI, and began playing music together in high school during the sixties. During the following nomadic decade, Lou studied classical voice and music theory in college while Peter continued an unfocused fascination with surrealist art, beatnik poetry, and jug band music. Early influences of American and British musical comedy and folk music fed a growing repertoire of original songs. A brief marriage in the early seventies resolved into a lifelong friendship, and by the late seventies and early eighties the two were honing their skills playing regular weekly concerts in Madison, becoming full-time musicians and songwriters in 1979. During those early years they wrote new songs every week, many about the history, cheese, beer and strange politics of their home state. By the mid '80s they were traveling all across the country, still writing and singing, but now with a broader perspective, finding that the quirks of their home state were not so much Midwestern as human. In twenty-five years of performing together, Lou and Peter have released twenty albums and four songbooks worth of hilarious, quirky, yet oddly profound songs, rich with word play and interesting images. Pete Seeger, Tom Paxton and Tom Lehrer count themselves among their fans. Their work has appeared in numerous compilations such as the popular \"Rise Up Singing\" songbook, in periodicals like \"SING OUT! Magazine\", and in many audio compilations. Berryman songs are being sung around the world by a legion of professional musicians including Peter, Paul and Mary, Garrison Keillor and Peggy Seeger. They have appeared numerous times on such national programs as NPR's \"A Prairie Home Companion\" and \"Weekend Edition.\"\nwww.louandpeter.com", "url": "https://www.facebook.com/events/964923176923370/", "name": "Lou and Peter Berryman at Green Wood Coffee House", "date": "2016-10-07T20:00:00-04:00"}, {"source": "Facebook", "description": "Two nights with Steppin' in It's fast-rising lead vocalist", "url": "https://www.facebook.com/events/1668844700041158/", "name": "Joshua Davis—Night 1", "date": "2016-10-21T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/215744518775574/", "name": "Joshua Davis—Night 2", "date": "2016-10-22T20:00:00-04:00"}]