[{"description": "A scholar from the prestigious University of Michigan Music School and multi-instrumentalist, Theo played drums, guitar, and the majority of the bass on his debut album Romance Without Finance.  During his college experience, Theo was a member of My Dear Disco and still stays very involved in the Ann Arbor music community. In Theo’s brief career since becoming a solo artist he has achieved unprecedented success having performed at the heralded Ann Arbor Folk Festival, selling out venues everywhere in America and opening for Darren Criss for his Listen Up Tour. Theo is also very involved in many other music production projects including Vulfpeck, Jason French and Michelle Chamuel.   \nhttp://theokatzman.com/\nw/ Joey Dosik \nJoey Dosik one of the great jazz-soul artists to attend University of Michigan Music School. Joey is a multi-instrumentalist currently producing music in Los Angeles.   \nhttp://joeydosik.com\n\nhttp://www.twitter.com/soniclunch \nhttp://www.facebook.com/soniclunch\nhttp://www.instagram.com/soniclunch \nhttp://www.soniclunch.com/ \nhttp://www.bankofannarbor.com/", "date": "2015-08-20T11:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1450233278610689/", "name": "Theo Katzman w/ Joey Dosik 8/20 Bank of Ann Arbor's Sonic Lunch (FREE)"}, {"description": "Join us at the Ann Arbor Farmer's Market on Thursday, August 20th from 5-9 pm! Live local acts and musical artists straight from Nashville will provide musical entertainment. BBQ, beer, and a good time is waiting! We're bringing West Side Wheat, Gulo Gulo, and Czech Pils. Cups will be $5 apiece! Come on down and enjoy an Ann Arbor classic. See you there!", "date": "2015-08-20T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/422480304610372/", "name": "NashBash"}, {"description": "The Battle for Iron and The Psychedelic Brain\n\nWhat’s all the “Fe”ss about? We’re not the only organizsms that need Iron, which can mean we have some competition in getting the nutrients we need. Ada Hagan breaks down the ins and outs of Iron and bacteria. Even the most well-nourished body and brain can still learn a LOT about consciousness and psychoactive substances. Research on psychedelics is only just now recovering fromits implosion in the 70s, following the heydey of LSD research in the 60s. What does our current understanding of the brain tell us about the psychadelic experience? Dr. George A. Mashour walks us through a little research history and leads us through his present exploration of ketamine.\n\nMark your calendar, grab a friend, and say hey to a fellow nerd! We'll see you at LIVE with a frosty beverage in hand for August's edition of Nerd Nite!\n\nWhen: August 20: 6:30 doors, 7pm nerd stuff\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER because Ann Arbor District Library!\n\n-----\n\nThe Battle for Iron: What's all the \"Fe\"ss about?\nAda Hagan\nIron is an important nutrient that we all make sure to get enough of in our diets. Did you know bacteria need it too though? Come learn about the battle invading bacteria wage against your body over iron atoms. Those bacteria have some pretty cool tricks up their sleeves, but so do we! That is, if we learn enough about it…\n\nThe Psychedelic Brain\nDr. George A. Mashour\nPsychoactive substances have been known since antiquity and modern psychedelic subculture underwent an explosion in the 1960s followed by an implosion in the 1970s. More recently, the neuroscience of psychedelic drugs has emerged from the shadows of a dark past. What are the neural correlates of the psychedelic experience? What does this phenomenology and neurobiology tell us about the functioning of the brain? I will discuss these questions as well as my own research on ketamine.", "date": "2015-08-20T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1487801211517647/", "name": "Fe and LSD"}, {"description": "We're excited to welcome our friends at Harlequin Creature for a \"typewriter-themed story-time\" to celebrate Issue 6! Harlequin Creature will have a reading by one of their authors & illustrators, and there will also be stories of fantastical creatures, and of course, they'll have some typewriters for you to try your hand it.", "date": "2015-08-22T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1617483835198576/", "name": "Typewriter storytime w/ Harlequin Creature"}, {"description": "We're thrilled to host Ida Pearle for a story time! She'll read from her wonderful book, The Moon is Going to Addy's House.\n\nAfter a play date in the city, Addy heads home to the country with her family. And through the long drive, the moon seems to be following them closely—Addy’s faithful guardian and friend.\n\nThe comforting sense that the moon is your own personal companion is universal to childhood, and Ida Pearle has depicted it beautifully through her lyrical text and soft, sleepy cut-paper collage illustrations. This is a book that children will ask to hear every night at bedtime.\n\nIda Pearle is a musician and artist. She has played and recorded with several Michigan bands such as Flashpapr, His Name is Alive, and Saturday Looks Good to Me. She received a fine arts degree from The Cooper Union. She lives with her husband and daughter in Brooklyn, New York. Learn more at IdaPearle.com", "date": "2015-08-23T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/539630056185135/", "name": "Story time w/ Ida Pearle"}, {"description": "The Heidelberg Project, celebrating its 30th anniversary in 2016, is one of the largest, best-known, and longest-running site-specific art installations in the country. Occupying more than two blocks along Heidelberg Street on Detroit’s East Side it has been the life’s work of artist Tyree Guyton who grew up on Heidelberg Street. Encouraged by his housepainter grandfather to become an artist, and with the help of neighborhood children, the project has transformed its neighborhood. Join UMMA docents as they explore this installation, including the two new works created specifically for this exhibition.", "date": "2015-08-23T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1632111203732078/", "name": "Guided Tour: The Art of Tyree Guyton: A Thirty-Year Journey"}, {"description": "Shop with us this Wednesday, when you'll get 30% off all Lucky's Market brand products in our Grocery department. Beans, salsa, olive oil, and more! Even better: when you purchase our private label products, a portion of the sales will be reinvested in the communities we serve. \n\nPlease note, this applies to products from our Grocery department only.", "date": "2015-08-26T07:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/429207190599102/", "name": "ONE DAY SALE-30% Off Private Label Grocery"}, {"description": "Literati is pleased to welcome Kelly Fordon, who will read from her latest story collection, Garden for the Blind.\n\n\"Garden for the Blind is one of the most intricately and beautifully constructed works of fiction I've read.\" -Laura Kasischke\n\nIn Garden for the Blind, trouble lurks just outside the door for Kelly Fordon’s diverse yet interdependent characters. As a young girl growing up in an affluent suburb bordering Detroit, Alice Townley witnesses a tragic accident at her parents’ lavish party. In the years that follow, Alice is left mostly in the care of the household staff, free to forge friendships with other pampered and damaged teens. When she and her friend Mike decide to pin a crime on another student at their exclusive high school, the consequences will reverberate for years to come.\n\nSet between 1974 and 2012, Fordon’s intricately woven stories follow Alice and Mike through high school, college, and into middle age, but also skillfully incorporate stories of their friends, family, acquaintances, and even strangers who are touched by the same themes of privilege, folly, neglect, and resilience. A WWII veteran sleepwalks out of his home at night, led by vivid flashbacks. A Buddhist monk is assaulted by a robber while seated in meditation. A teenaged girl is shot walking home from the corner store with a friend. A lifelong teacher of blind children is targeted by vandals at the school she founded.\n\nGarden for the Blind visits suburban and working-class homes, hidden sanctuaries and dangerous neighborhoods, illustrating the connections between settings and relationships (whether close or distant) and the strange motivations that keep us moving forward. All readers of fiction will enjoy the nimble unfolding of Fordon’s narrative in this collection.\n\nPrior to writing fiction and poetry, Kelly Fordon worked at the NPR member station in Detroit and for National Geographic magazine. Her fiction, poetry, and book reviews have appeared in The Boston Review, The Florida Review, Flashquake, The Kenyon Review, and various other journals. She is the author of two poetry chapbooks, On the Street Where We Live, which won the 2011 Standing Rock Chapbook Contest, and Tell Me When It Starts to Hurt, which was published by Kattywompus Press in 2013. She received her MFA in fiction writing from Queens University of Charlotte and works for InsideOut Literary Arts in Detroit as a writer-in-residence.", "date": "2015-08-26T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/886797341385975/", "name": "Kelly Fordon"}, {"description": "Join us for our next Community Impact Day! We're supporting Ypsilanti Meals on Wheels AND Ann Arbor Meals on Wheels, who will each receive 5% of our daily sales. Stock up in support of their awesome programs to help combat food insecurity faced by seniors and homebound individuals. Like and share- spread the word!", "date": "2015-08-27T07:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/889353694468444/", "name": "10% Day"}, {"description": "Bank of Ann Arbor's 2015 Sonic Lunch Lineup!! \n6/04 Martha Reeves \n6/11 Joshua Davis \n6/18 Jessica Hernandez & The Deltas\n6/25 Michelle Chamuel w/ Absofacto*\n7/09 Joe Hertler & The Rainbow Seekers\n7/23 Laith Al-Saadi\n7/30 Bennett\n8/06 Luke Winslow-King\n8/13 BØRNS w/ Chris Bathgate*\n8/20 Theo Katzman w/ Joey Dosik*\n8/27 Vulfpeck \n* Shows with openers start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 4 to August 27, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Sonic Lunch concerts are free and suitable for all ages. Come join the crowds for an energizing mid-day break or just relax and enjoy the music. \n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor with support from Ann Arbor’s 107One FM and Perich Advertising & Design\n\nJune 4th - Martha Reeves \nJoin us on June 4th as we kick off the Sonic Lunch series with Motown legend, Rock N’ Roll Hall of Fame member and undisputed diva, Martha Reeves! Martha Reeves and the Vandellas recorded throughout the 60’s for Motown’s Gordy label, charting 24 R&B hits including, “Nowhere to Run”, “Jimmy Mack”, “Heat Wave”, and their signature “Dancing in The Street”. \n\nJune 11th - Joshua Davis\nJoshua’s amazing talent led him on a journey that has landed him as a finalist on the most recent series of NBC’s The Voice. Michigan’s Joshua Davis was raised in the folk tradition: the music, the social movements, the land. He writes songs that blend the roots of American music with gritty rock n' roll and vintage soul. For over 15 years, Joshua has made a living sharing his songs, stories and knowledge across the US and Canada.  Joshua has an extensive performing background, having appeared at festivals, concert halls, coffeehouses and dives as both a solo act and a member of a group. In addition to his solo act, Joshua has also been the front man for roots ensemble Steppin' In It, been a member of the classic swing band Shout Sister Shout, been in the songwriter showcase band The Starlight Six and much more.\nhttp://www.joshuadavismusic.com \n\nJune 18th - Jessica Hernandez\nJessica Hernandez & The Deltas have had an incredible year including a performance on The Late Show with David Letterman and festival appearances at major shows including Bonnaroo, Austin City Limits and Lollapalooza.   \nJessica Hernandez & The Deltas are a wide-ranging, high-energy rock n’ roll band from Detroit. Their mercurial, often gritty sound reflects all of the Motor City's musical traditions, as well as some outside its geographical and multicultural boundaries. In their thoroughly modern, driving sound are traces of Motown, tough vintage R&B, Latin grooves, raucous surf, neo-psych, roots rock, cinema jazz, and retro '60s girl group pop. \nhttp://www.jessicahernandezandthedeltas.com \n\n\n6/25 - Michelle Chamuel w/s/g Absofacto\nMichelle Chamuel \nFrom the moment Michelle made her television debut on season 4 of NBC’s The Voice, the bespectacled Massachusetts native and University of Michigan Alumni singer charmed audiences and pop stars alike with her soulful covers. While some may have leapt at the chance to be on The Voice, Chamuel was initially wary of the realities (no pun intended) of submitting to a reality television show – though she soon found herself happily on team Usher and taking home 2nd place. \n“I went to the show looking for a teacher and it turned out Usher was looking for a student”, says 28-year-old Chamuel. “I was craving the challenges and rewards of being part of a top musical community, and I found that on The Voice.”\nBy the time she took The Voice stage in 2013, Chamuel had spent the better part of a decade fronting the seven-piece Michigan rock band, Ella Riot (formerly My Dear Disco). In the band, Chamuel learned the artistry of performing by touring around the country 200 days a year, releasing several albums, and learning to drive a tour bus that ran on waste vegetable oil. Eventually the fuel ran out; Ella Riot parted ways in 2012 and Chamuel returned to Massachusetts in search of home and solitude.  \nConsidering all the emotion contained within it, “Face the Fire” came together at a breakneck pace. For three weeks, Chamuel and her collaborators, Tyler Duncan and Theo Katzman – college pals and My Dear Disco band members – holed up in Chamuel’s home, building the album from musical nuggets each had brought to the sessions. The trio takes influence from several genres across the history of music – spanning from 80’s pop (“Rock It”) and melodic house (“Weight of the World”) to VHS-infused reggae (“Money”).  The title track on the album is no exception – showcasing the convergence of Chamuel’s vision and her collaborators ingenuity.  “Face the Fire” serves as a sort of pulsing mission statement, a vamping call to action that Chamuel relates to her own experience in harnessing musical passion. This track, which like the rest of the album, was recorded and produced in Chamuel and Duncan’s home studios, features a tapestry of interlocking percussion, surf-punk bass tones, and a rousing call and answer between Chamuel and her choir.  \n“The imagery I get when singing the song is that I’m in front of a big, camp-like fire. There are people all around, and I’m not sure if they’re ghosts or strangers, but they chime in while I sing. It’s almost a trance-like state – being pulled towards this fire. Everyone is being pulled towards it.”\nhttp://www.michellechamuel.com \n\nAbsofacto\nAbsofacto is the solo moniker of Jonathan Visger, who is also the lead vocalist and songwriter for Hollow & Akimbo and Mason Proper, in addition to being the former bass player of Dale Earnhardt Jr. Jr.   \nAbsofacto’s latest single “Dissolve” was #1 on Hype Machine’s non-remix charts immediately upon release. “Dissolve” can be described as a well-executed burst of eclectic stylistic flair, enjoyably difficult to classify in its welcome mixture of nostalgic pop, electronica and hints of R&B. The impressive stylistic balance is reminiscent of artists like Gorillaz and Beck at their best and most stylistically intuitive — lofty comparisons but well-deserved comparisons in this case. \nhttp://www.absofacto.com \n\nJuly 9th - Joe Hertler & The Rainbow Seekers\nJoe Hertler & The Rainbow Seekers will make a sprightly young groove doctor out of anyone. With spectacular energy pulsating from every member of the band, it’s no wonder why they are headlining festivals as one of Michigan’s top rising stars.  Lead singer and Amish excommunicate Joe Hertler splashes through lyrical puddles of golden rain, leaving his audience wearing flowery headdresses and bubbling smiles. A ride on the Rainbow will take you across the mountains of Motown, through the fjords of folk, over the archipelagos of Americana, and—at last—into a funky firth, where only the fiercest of friendships can be found.   Their new album, Terra Incognita, goes beyond their comfort limits into new styles, new instruments and new vocals. Everything works out in favor of Joe Hertler & The Rainbow Seekers. It might be early to say, but Terra Incognita could be just what they need to push them over the threshold. Fans that love Joe Hertler & The Rainbow Seekers for their folk melodies will not be disappointed. Though they’ve gone in new directions, the new album still features songs similar to those on On Being. With slow, precise fingerpicking, Joe gently sings poetry similar to their old stuff in “Betelgeuse” and “Red Wings.”\nhttp://www.joehertler.com \n\n\nJuly 23rd - Laith Al-Saadi \nLaith Al-Saadi was crowned “King of the Blues” by Guitar Center making him one of the top 4 Blues guitarists in the Country.  Laith has been a staple to the Michigan music scene for most of his adult life.  He has shared the stage with greats like Buddy Guy, BB King, Taj Mahal, Kenny Wayne Shepard, Luther Allison, Son Seals and Johnny Winter. Laith is one of the best and most polished guitar-driven acts you are likely to find on earth.  \nIn 2013, Al-Saadi teamed up with producer Jeffrey Weber and an all-star cast of L.A. session legends to make his third release REAL. The album was recorded live to 2-track with no edits, overdubs, auto tune or compression at the world famous Ocean Way Recording Studios in Hollywood. The album features a dream-band of musicians such as Jim Keltner (Drums), Leland Sklar (Bass), Larry Goldings (Hammond B-3), Jimmy Vivino (Rhythm Guitar/ Backing Vox), Tom Scott (Sax), Lee Thornburg (Trumpet), Brandon Fields (Bari Sax), Nick Lane (Trombone / Horn Arranger) and more... \nThe soulful new album is reminiscent of the great musical traditions of New Orleans and Chicago with a splash of Blues, Country, Gospel and Roots Rock, and is arguably Al-Saadi's best work to date.\nhttp://www.laithmusic.com \n\nJuly 30th - Bennett \nBennett is a 3-piece folk-rock group from Grand Rapids, Michigan. Described as “powerfully original” and “hauntingly beautiful”, their music is as unique as it is authentic and matured well beyond its age, garnering praise from both local and national media outlets. Boasting first place in regional competitions, climbing local music charts and playing alongside acts such as The Avett Brothers, OAR, Easton Corbin and Bela Fleck, these boys have quickly established themselves as a force to be reckoned with on the American music scene. Their lush, string driven sound, seemingly effortless harmonies, and willingness to evolve their style set them apart as somewhere between up-and-coming and (somehow) already there. \nhttp://www.bennettband.com \n\n\nAugust 6th - Luke Winslow-King \nCadillac, Michigan native Luke Winslow-King made New Orleans his home about a dozen years ago, and the Crescent City has definitely left its mark on King’s music. The singer, songwriter and guitarist specializes in the classic sounds of early folk, blues, rock n’ roll and ragtime, played with soulful New Orleans flair.\nA seriously gifted musician with a degree in Jazz guitar from Michigan’s prestigious Interlochen Arts Academy, King paid his dues by busking on the streets of New Orleans during his early days in Louisiana.  Since then he’s shared stages with Jack White, Taj Mahal, Nickel Creek’s Chris Thile and the Rebirth Brass Band.  Deftly mixing original material with songs from a bygone era, Luke Winslow-King brings his dynamic five-piece band to Liberty Plaza once again.\n\n\nAugust 13th - BØRNS w/s/g Chris Bathgate \nThe nom de plume of singer/songwriter, multi-instrumentalist, and Michigan native Garrett Borns, Børns, crafts big-hearted, alternately dreamy and danceable, falsetto-driven electro-pop confections that have been dusted with glam rock and folk. Raised in the great lake coastal town of Grand Haven, Michigan, Børns studied music at the Interlochen Center for the Arts and Grand Rapids Community College, while becoming a fixture in the local music scene. After a brief stint in New York City, Børns decided to relocate to Los Angeles, where he set up shop in a self-described \"treetop sanctuary\" just outside of the city, and began honing what would eventually become his debut EP, the Interscope-issued Candy. His new single “Electric Love” is on the Billboard Heatseekers chart and in rotation on every rock station in America.  https://www.facebook.com/bornsmusic \nw/ Chris Bathgate,\nBathgate’s signature country-tinged gothic folk has been perfectly honed in his latest critically acclaimed album Salt Year.  \nhttp://chrisbathgate.org \n\nAugust 20th - Theo Katzman w/ Joey Dosik \nA scholar from the prestigious University of Michigan Music School and multi-instrumentalist, Theo played drums, guitar, and the majority of the bass on his debut album Romance Without Finance.  During his college experience, Theo was a member of My Dear Disco and still stays very involved in the Ann Arbor music community. In Theo’s brief career since becoming a solo artist he has achieved unprecedented success having performed at the heralded Ann Arbor Folk Festival, selling out venues everywhere in America and opening for Darren Criss for his Listen Up Tour. Theo is also very involved in many other music production projects including Vulfpeck, Jason French and Michelle Chamuel.   \nhttp://theokatzman.com/\nw/ Joey Dosik \nJoey Dosik one of the great jazz-soul artists to attend University of Michigan Music School. Joey is a multi-instrumentalist currently producing music in Los Angeles.   \nhttp://joeydosik.com\n\n8/27 Vulfpeck\nVulfpeck is an out-of-the-box, unorthodox, funk band that has reached the point of mastery. The band originally formed at the University of Michigan before residing in Los Angeles. Vulfpeck is essentially a rhythm section; the group has backed numerous singers and soundtrack work. Though other musicians occasionally contribute, the core members are Jack Stratton, Theo Katzman, Woody Goss, and Joe Dart.  Every player is a multi-instrumentalist with the exception of Dart, who sticks to bass for every song.  Vulfpeck recently made headlines in March 2014 after they released their debut album Sleepify exclusively on Spotify; an album containing 10 songs of silence, each around 30 seconds in length. Vulfpeck’s concept for the album was simple – they asked fans to listen to the album on repeat while they slept, in order to generate enough money in royalties for the band to play an admission-free tour.  \nhttp://www.vulfpeck.com", "date": "2015-08-27T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1741513069408670/", "name": "2015 Bank of Ann Arbor's Sonic Lunch Concert Lineup!!!"}, {"description": "Vulfpeck is an out-of-the-box, unorthodox, funk band that has reached the point of mastery. The band originally formed at the University of Michigan before residing in Los Angeles. Vulfpeck is essentially a rhythm section; the group has backed numerous singers and soundtrack work. Though other musicians occasionally contribute, the core members are Jack Stratton, Theo Katzman, Woody Goss, and Joe Dart.  Every player is a multi-instrumentalist with the exception of Dart, who sticks to bass for every song.  Vulfpeck recently made headlines in March 2014 after they released their debut album Sleepify exclusively on Spotify; an album containing 10 songs of silence, each around 30 seconds in length. Vulfpeck’s concept for the album was simple – they asked fans to listen to the album on repeat while they slept, in order to generate enough money in royalties for the band to play an admission-free tour.  \nhttp://www.vulfpeck.com \n\nhttp://www.twitter.com/soniclunch \nhttp://www.facebook.com/soniclunch\nhttp://www.instagram.com/soniclunch \nhttp://www.soniclunch.com/ \nhttp://www.bankofannarbor.com/", "date": "2015-08-27T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/868808823192186/", "name": "VULFPECK 8/27 Bank of Ann Arbor's Sonic Lunch (FREE)"}, {"description": "We're celebrating all things grilling! Join us on our patio as we serve up some of the best tastes of the season- hot dogs, veggies, sides, music and more, with all proceeds beneﬁting one of our favorite local arts organizations. Wild Swan Theater is dedicated to producing professional theater of the highest artistic quality for families and to making that theater accessible to everyone including low income, minority, and disabled children through low ticket prices and innovative outreach programs. Celebrate the amazing work they're doing in our community by stuﬃng yourself silly!For more information about their org, please visit their website http://www.wild-swantheater.org/", "date": "2015-08-29T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/412476485614552/", "name": "GRILLING FOR A CAUSE: Wild Swan Theater"}, {"description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "date": "2015-08-30T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1585477635047598/", "name": "Guided Tour: Engaging with Art"}, {"description": "Come get your howl on with the release one of our most anticipated seasonal brews.\n\nJoin ABC owners and brewers as we sample this monster brew, snack on light appetizers, and learn a little about the history and recipe that makes this unique brew so deliciously interesting.\n\nAs always the release party will feature light snacks along with samples of the featured beer during the event and discounts on beer to take home.   Mug clubbers get in free.  Must be 21 with valid ID.", "date": "2015-09-01T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1478561089105767/", "name": "Release Party: Violin Monster"}, {"description": "Literati is thrilled to help launch John U. Bacon's latest book, Endzone, with a reading by the author, Q&A, and signing at Rackham Auditorium. The event is free and open to the public.\n\n***\n\nPre-order the book from us and, if you let us know in the 'comment' field, we can bring it to Rackham and have it ready for you on 9/1 for pick-up! \n\nhttp://www.literatibookstore.com/book/9781250078971 \n\n***\n\nEndzone tells the story of how college football's most successful, richest and respected program almost lost all three in less than a decade - and entirely of its own doing. It is a story of hubris, greed, and betrayal - a tale more suited to Wall Street than the world's top public university. \nAuthor John U. Bacon takes you inside the offices, the board rooms and the locker rooms of the University of Michigan to see what happened, and why - with countless eye-opening, head-shaking scenes of conflict and conquest. \n\nBut Endzone is also an inspiring story of redemption and revival. When those who loved Michigan football the most recognized it was being attacked from within, they rallied to reclaim the values that made it great for over a century -- values that went deeper than dollars. The list of heroes includes players, students, lettermen, fans and faculty - and the leaders who had the courage to listen to them.\n\nTheir unprecedented uprising produced a new athletic director, and a new coach - the hottest in the land - who vindicated the fans' faith when he turned down more money and fame to return to the place he loved most: Michigan. \n\nIf you love a good story, you'll want to dive into Endzone: The Rise, Fall and Return of Michigan Football.\n\nJohn U. Bacon has written for Time, The New York Times, and ESPN Magazine, among other publications, earning national honors. He is the author of five books on sports and business, including Bo’s Lasting Lessons (with Bo Schembechler), a New York Times and Wall Street Journal business bestseller. Bacon teaches at Northwestern University and the University of Michigan and is a popular public speaker.", "date": "2015-09-01T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1687744584778136/", "name": "John U. Bacon 'Endzone' Launch"}, {"description": "We’re heating up fall ﬂavors! Grab a taste of the West as we kick Hatch Chile season into gear. We’ll be roasting these special peppers on our patio all weekend, oﬀering tastes, recipes, and culinary tricks.", "date": "2015-09-04T07:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1495556167404573/", "name": "GREEN CHILE FEST"}, {"description": "Everybody’s working for the weekend!!! \nEach Friday we will release a cask conditioned pin - a super limited 4.5 gallon cask – at the bar to kick off whatever you have in store for the weekend. Whether you're going off the deep end, want a new romance or simply need a second chance, these beers are sure to satisfy.  Typically they will be one-off of a standard brew but accentuated with new and interesting ingredients. It's special, it's unique, it's only on the back of our bar. \n\nThis week’s featured brew is a pin of Euchre Pils, dry-hopped in the cask with whole cone Czech Saaz. \nTapped@4,", "date": "2015-09-04T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1634095426838237/", "name": "Quitting Time Cask"}, {"description": "UMMA and Arts at Michigan celebrate Welcome Week by introducing new University of Michigan students to the wide array of possibilities for arts participation on campus. This evening event will feature live music and performances, WCBN DJs, dance, poetry, film, games, prizes, and a variety of art-making activities.\n\t\nArtscapade! is generously supported by the University of Michigan Credit Union, UMMA's Lead Sponsor for Student and Family Engagement, and co-sponsored by Arts at Michigan.", "date": "2015-09-04T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1438952493101505/", "name": "Artscapade!"}, {"description": "“The unifying core of my work stems from encountering the world as it unfolds,” explains Jem Cohen. “It is through close observation, careful listening, and an embrace of chance that I establish the bedrock. . . . Regardless of the tools and the form, the project is . . . life drawing.” Join UMMA docents as they explore Cohen’s dual-gallery presentation including Polaroid and digital images of a variety of locations, from New York to Tangier, in the Photography Gallery, and a multi-media component that has been called a cinematic love letter to Nova Scotia's Cape Breton, in the Media Gallery. \n\t\nLead support for Jem Cohen at UMMA is provided by the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the Susan and Richard Gutow Fund and the Robert and Janet Miller Fund.", "date": "2015-09-06T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/976031092418434/", "name": "Guided Tour: Jem Cohen Life Drawing"}, {"description": "tl;dr: \nnew place: Espresso Royale on State St.\nnew time: 7pm [sign-ups open at 6:30]\nnew model: bi-weekly on 1st and 3rd Sundays\n\n\nBring your friends and join us for our first show of the new slam season! This weekend, come out to one of the most intimate and longest-running poetry slam scenes in the nation. \n\nWe meet up every week, but only put on a show on 1st and 3rd Sundays. This will be our first event in our new home at Espresso Royale on State St, and at our new time of 7pm!\n\nThis is an ancient, yet fresh and timeless experience: you, a stage, and everything you need to say for an audience who is ready to hear it. Bring yourself, bring your story, and we'll bring the love.\n\nFREE [$5 Suggested Donation]\n\nMORE ABOUT THE FEATURE:\n\nWilliam H. Evans is a writer and instructor from Columbus, Ohio. A staple of the Columbus and national poetry scenes, Evans is a growing legend in the community. His work appears or is forthcoming in The Legendary, Union Station Magazine, joint and others. \n\nHis second poetry manuscript, lowercase boy, was published on Penmanship Books in the Fall 2014. He is also founder of the popular site Black Nerd Problems.\n\nMORE ABOUT THE EVENT:\n\nOpen Mic starts at 7pm, and the Slam starts whenever the open session ends. Sign-up for both opens at 6:30, so get there early to guarantee a spot. \n\nA maximum of 10 poets compete each week [spots are guaranteed for the first 8 slammers to arrive]. All poets who get into the Slam earn points qualifying toward the City Finals in April, and a chance to be one of four poets to represent Ann Arbor at the National Poetry Slam this August in California. Poems must be the performer's original work. Come prepared with two poems [one if you're just doing the open mic], and keep it around three minutes or less. No costumes or props are allowed.", "date": "2015-09-06T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1634542646821206/", "name": "Ann Arbor Poetry Slam Season Opener featuring William H. Evans"}, {"description": "O'zapft is! Oktoberfest 2015 releases on Wednesday, September 9. We sold more Oktoberfest last year on release day than any other beer on any one day EVER, so get here early, hang out for Trivia, and enjoy some traditional German food specials! It's the unofficial start of fall around here - celebrate the changing seasons with Wolverine State Oktoberfest! \n\nProst!", "date": "2015-09-09T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1645238869096751/", "name": "Oktoberfest 2015 Release"}, {"description": "This month come and join our celebration of Michigan’s awesome beer scene. Classics, seasonals & innovative brews from breweries across the great mitten state!\nWe will feature two dozen or so of the best examples available in the state, and a few from our own collection of amazing brews.  \n\nTickets include beer samples, an appetizer buffet, a complete event program with tasting notes, and entry in our door prize drawing.  All tastings run from 7 - 9 pm.\nTickets are $25 in advance and $30 if purchased on tasting day. Advance tickets recommended as this tasting often sells out. Call 734-213-1393 to order tickets over the phone.", "date": "2015-09-10T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/524680824362325/", "name": "Beer Tasting: Michigan Made"}, {"description": "Literati is pleased to welcome poets Linda Gregerson and David Baker, alongside scholar Steven Mullaney, in celebration of their recent titles. \n\nDavid Baker is author or editor of fourteen books of poetry and criticism. He holds the Thomas B. Fordham Chair at Denison University, teaches regularly in the Warren Wilson College MFA program, and is the poetry editor of the Kenyon Review.\n\nLinda Gregerson is the author of Waterborne, The Woman Who Died in Her Sleep, and Fire in the Conservatory. She teaches Renaissance literature and creative writing at the University of Michigan. Her poems have appeared in The Best American Poetry as well as in the Atlantic, Poetry, Ploughshares, the Yale Review, TriQuarterly, and other publications. Among her many awards and honors are a Guggenheim Fellowship, an American Academy of Arts and Letters Award in Literature, four Pushcart Prizes, and a Kingsley Tufts Award.\n\nSteven Mullaney is professor of English at the University of Michigan. He is the author of The Place of the Stage: License, Play, and Power in Renaissance England.", "date": "2015-09-10T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1606167982999530/", "name": "Linda Gregerson, David Baker, & Steven Mullaney"}, {"description": "**Due to an increase in demand for this event, we've moved it to the Performance Network Theater, which is just one block north of our bookstore along 4th Ave (120 E. Huron). The event is still free and general admission. Doors open at 11:30!**\n\nLiterati is thrilled to welcome Christopher Moore to Ann Arbor to read from his latest, Secondhand Souls. This event is free and open to the public. Doors will open at 11:30am. We expect a large crowd!\n\n\"Disturbingly hilarious. And vice versa.\" --Jenny Lawson, #1 New York Times bestselling author of Let's Pretend This Didn't Happen.\n\nIn San Francisco, the souls of the dead are mysteriously disappearing and you know that can't be good in New York Times bestselling author Christopher Moore's delightfully funny sequel to A Dirty Job.\n\nSomething really strange is happening in the City by the Bay. People are dying, but their souls are not being collected. Someone or something is stealing them and no one knows where they are going, or why, but it has something to do with that big orange bridge. Death Merchant Charlie Asher is just as flummoxed as everyone else. He's trapped in the body of a fourteen-inch-tall meat puppet waiting for his Buddhist nun girlfriend, Audrey, to find him a suitable new body to play host.\n\nTo get to the bottom of this abomination, a motley crew of heroes will band together: the seven-foot-tall death merchant Minty Fresh; retired policeman turned bookseller Alphonse Rivera; the Emperor of San Francisco and his dogs, Bummer and Lazarus; and Lily, the former Goth girl. Now if only they can get little Sophie to stop babbling about the coming battle for the very soul of humankind.\n\nChristopher Moore is the author of thirteen previous novels, including Lamb, The Stupidest Angel, Fool, Sacre Bleu, and A Dirty Job. He lives in San Francisco, California.\n\nThe event is free and open to the public, however seating will be limited. General admission will begin at 11:30am. A book signing will follow the reading.", "date": "2015-09-11T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1484059641905480/", "name": "Christopher Moore"}, {"description": "Another fall season will arrives not only with crisp air and beautiful weather, but also ABC's much anticipated festival - Oktoberfest: celebration of beers, brats and Leiderhosen!\n\nWe're once again closing off the street and putting up the beer tents for our annual street party. Join us at the corner of Main and Washington to enjoy a delightful autumn evening under the stars with beer, brats, music, and dancing.\n(Parking available at the 4th and Washington parking structure) \n\n* 5-12 Friday and Saturday\n* Live music provided by the Immigrant Sons. \n* No cover. \n* Must be 21 with valid ID. Children welcome with parents. \n* Food, beer, mulled wine and soft drinks available for purchase\n* Call Beth at 734-213-1393 for more information. \n\nLeiderhosen optional (but pants required).", "date": "2015-09-11T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1484187111898809/", "name": "Oktoberfest"}, {"description": "Literati is pleased to welcome Jerry Dennis and Glenn Wolff, founders of Michigan independent publisher Big Maple Press. They will be on hand to read and present from their collaborative work.\n\nIn autumn 2014 author Jerry Dennis and artist Glenn Wolff teamed with creative director Gail Dennis to form Big Maple Press, a small press dedicated to publishing special editions of the works of Dennis and Wolff and making them available only at independent bookstores and on the Big Maple Press website.\n\nJerry and Glenn have won numerous awards and have received acclaim from readers and reviewers around the world for their many books published by major publishers, as well as for their essays and illustrations in such publications as The New York Times, The Village Voice, Smithsonian, Audubon, Wildlife Conservation, Sports Afield, and Orion. \n\nJERRY DENNIS has earned international acclaim for his many works of nonfiction, fiction, and poetry. His books, including The Bird in the Waterfall, The Windward Shore, and The Living Great Lakes, have won many awards, are frequently taught in colleges and high schools, and have been translated into six languages. His shorter works have appeared in The New York Times, Smithsonian, Audubon, Orion, Michigan Quarterly Review, and many other publications. Visit him at www.jerrydennis.net\n\nGLENN WOLFF has illustrated more than 30 books, hundreds of articles and essays in such publications as The New York Times, The Wall Street Journal, The Village Voice, Audubon, and Wildlife Conservation Magazine, and his mixed-media fine art has been shown throughout the U.S. and Canada and is included in many private and public collections. More on his work can be found at www.glennwolff.com", "date": "2015-09-11T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/810808392351544/", "name": "Jerry Dennis & Glenn Wolff"}, {"description": "Wolverine State is grilling out this football season! Come hang out on the patio -- (Har)burgers, brats, and all the fixins will be available (along with beer specials!) on the following dates: \n\nSeptember 12 vs Oregon*\nOctober 10 vs Northwestern (Homecoming)\nOctober 17 vs Michigan State\nNovember 28 vs Ohio State\n\nNoon games: Swing by after the game to soak in some college football and grab a couple of burgers! \n\nCome grill out, hang out, and celebrate some Michigan football!", "date": "2015-09-12T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/441760629344609/", "name": "Grill Out with WSBC this Football Season!"}, {"description": "The HomeGrown Festival is a grassroots community event showcasing the best of our region's locally grown food, drink, music, and fun!\n\nFind more info here: homegrownfestival.org", "date": "2015-09-12T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/786549754798355/", "name": "HomeGrown Festival 2015"}, {"description": "Literati welcomes poet Rob Halpern as part of our ongoing Poetry at Literati series. Rob's latest collection, Common Place, was released this year from Ugly Duckling Presse. \n\nCommon Place continues Halpern’s sustained inquiry into the relations of body and voice to relentless militarization and economic depredation. Written in enjambed verses and impacted prose, Halpern’s language is at once raw and sculpted, passionate and analytic.\n\n\"Halpern’s inquiry is thrilling in its depth and unsettling in its resultant darkness\". — Michael Andor Brodeur, The Boston Globe\n\nRob Halpern lives between San Francisco and Ypsilanti, Michigan, where he teaches at Eastern Michigan University and Huron Valley Women’s Correctional Facility. Common Place is his most recent volume of poetry (Ugly Duckling 2015). Other titles include Music for Porn, Rumored Place, and Disaster Suites, which was recently translated into Dutch as part of the Contemporary Poetry in Translation series published by the Netherlands’ literary arts foundation, Perdu. Together with Taylor Brady, he also co-authored Snow Sensitive Skin. Placeholder, a book-length selection of his poetry and prose drawn from across all of these books, was just published in the UK (Enitharmon 2015). Among other projects, Halpern is currently translating Georges Perec’s early essays on aesthetics and politics, while co-editing a volume of essays on New Narrative, together with Robin Tremblay-McGaw. His critical essays appear in Mediations, Journal of Narrative Theory, Modernist Cultures, Review of Contemporary Fiction, The Claudius App, and Chicago Review.", "date": "2015-09-12T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/483690148469283/", "name": "Poetry at Literati: Rob Halpern"}, {"description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "date": "2015-09-13T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1618223435122188/", "name": "Guided Tour: Engaging with Art"}, {"description": "Known for an iconoclastic pictorial language of eccentric materials and radically unconventional techniques, New York painter and filmmaker Julian Schnabel (born 1951) has been a pioneering, and controversial figure in the art world. Featuring works from the mid-1970s to the present, including pieces from Schnabel’s most well-known series, the Plate Paintings and Wax Paintings, this exhibition explores the artist’s use of found materials, his experimentation with chance operations, and his idiosyncratic and inventive mark-making. Enjoy Schnabel’s unorthodox art with an UMMA docent tour. \n\t\nThis exhibition was organized by the Brant Foundation Art Study Center. Lead support for UMMA’s installation is provided by Joseph and Annette Allen, the University of Michigan Office of the Provost, the University of Michigan Health System, the Richard and Rosann Noel Endowment Fund, and Retirement Income Solutions.", "date": "2015-09-13T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/463082293861896/", "name": "Guided Tour: Julian Schnabel"}, {"description": "Skazat! is back for the season! Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Reader\n\nThis month's feature: JENNIFER SPERRY STEINORTH!\n\n\nJennifer Sperry Steinorth poems appear or are forthcoming in Colorado Review, jubilat, Michigan Quarterly Review, the Collagist, Four Way Review, Pleiades, A River And Sound Review, Wake: Great Lakes Thought and Culture, and elsewhere. Her first poetry collection, Forking The Swift, was published through Michigan Cooperative Press in 2010.  Formally diverse, her poetry is informed by a career in home construction and design, many years spent as a classical dancer and the domestic concerns of motherhood and homemaking. Eleanor Wilner writes, \"the poems are finely calibrated for tone which manages to be, at times or all at once: rueful, alert, ironic, contradictory, self-deprecatory, devastating and/or playful...\" having, \"what Italo Calvino calls one of the essentials of the literary art, \"lightness,\" by which he refers not to the frivolous but rather to the ability to treat weighty subjects with a mastery of style that lightens them--a liveliness of the imagination and intelligence that lightens, without denial, what would otherwise be unbearable:  the \"weight, the heaviness, the inertia, the opacity of the world.\"\" Steinorth has an MFA from Warren Wilson, a builder’s license in the state of Michigan and works at Interlochen Center for the Arts. \n\n\n\nNext month: TARFIA FAIZULLAH!", "date": "2015-09-15T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/752407211554167/", "name": "Skazat Poetry Series featuring Jennifer Sperry Steinorth"}, {"description": "Literati is pleased to welcome Matt Bell back to Literati in support of his latest novel, Scrapper.\n\n“A fearless and harrowing meditation on the ruination and transformation of cities and of people; but amid loss and destruction, Bell finds a strain of piercing hope. This is an extraordinary book.” —Emily St. John Mandel, New York Times bestselling author of Station Eleven\n\nDetroit has descended into ruin. Kelly scavenges for scrap metal from the hundred thousand abandoned buildings in a part of the city known as “the zone,” an increasingly wild landscape where one day he finds something far more valuable than the copper he’s come to steal: a kidnapped boy, crying out for rescue. Briefly celebrated as a hero, Kelly secretly avenges the boy’s unsolved kidnapping, a task that will take him deeper into the zone and into a confrontation with his own past and long-buried traumas.\n\nThe second novel from the acclaimed author of In the House upon the Dirt between the Lake and the Woods, Scrapper is a devastating re-imagining of one of America’s greatest cities, its beautiful architecture, its lost houses, shuttered factories, boxing gyms, and storefront churches. With precise, powerful prose, it asks: What do we owe for our crimes, even those we’ve committed to protect the people we love?\n\nMatt Bell’s first story collection, How They Were Found, was published in 2010 by Keyhole Press, and was reviewed in The Believer, American Book Review, and Bookslut, among many other venues. In 2012, Cataclysm Baby, a novella, was published by Mud Luscious Press, with blurbs by Karen Russell, Lucy Corin, Lance Olsen, and Chris Bachelder. Bell’s fiction has been anthologized in Best American Mystery Stories 2010, Best American Fantasy 2, and 30 Under 30: An Anthology of Innovative Fiction by Younger Writers, and shortlisted in Best American Short Stories 2010 and the Pushcart Prize anthology. He serves as Senior Editor at Dzanc Books and teaches writing at the University of Michigan in Ann Arbor.", "date": "2015-09-16T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/433780773497108/", "name": "Matt Bell"}, {"description": "Epic Rap Battles of History are bringing their high energy blend of music and comedy to the live stage for their first full blown tour of the USA. The show features the most popular rap battles performed live with a DJ and full band, improvised comedy, interactive songs and audience volunteers brought on stage to be part of the show.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/411", "date": "2015-09-16T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/817073941733940/", "name": "Epic Rap Battles of History 9/16/15 @ Blind Pig - Ann Arbor"}, {"description": "This event takes place at the Michigan Theater, 603 E Liberty St, Ann Arbor, MI 48104.\n\t\nCelebrated for a visual language that brings together unexpected materials and radically unconventional techniques, artist Julian Schnabel has been a pioneering, and controversial, figure since his first solo exhibition in 1979. As part of a group of 1980s artists known as Neo-Expressionists (a term that he would reject), Schnabel wanted to return to painting pre-abstraction, and forged a practice that encompassed figuration, personal narratives, and references to history and mythology.  His paintings, sculptures, and works on paper have been the subject of numerous exhibitions at museums worldwide, including the current exhibition of his work at the University of Michigan Museum of Art (on view through September 27). Also a renowned filmmaker, in 1996 Schnabel wrote and directed the feature film Basquiat about artist Jean-Michel Basquiat, produced by Peter Brant. Brant Publications, Inc., is a leading art publisher whose titles include Art in America and Interview, among other important art magazines. Mr. Brant is also an entrepreneur, manufacturing executive, philanthropist, sportsman, and art collector who has a personal passion for contemporary art.\n\t\nThe exhibition Julian Schnabel was organized by the Brant Foundation Art Study Center.  Lead support for UMMA’s installation is provided by Joseph and Annette Allen, the University of Michigan Office of the Provost, the University of Michigan Health System, the Richard and Rosann Noel Endowment Fund, and Retirement Income Solutions.", "date": "2015-09-17T17:10:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1631299103808637/", "name": "UMMA & Penny W. Stamps Speaker Series Present: Julian Schnabel in Dialogue with Peter Brant"}, {"description": "Drop in during this free community event to browse the galleries and enjoy new special exhibitions including The Art of Tyree Guyton: A Thirty-Year Journey featuring the work of the renowned artist best known for the Heidelberg Project, an outdoor art environment on Detroit’s near-east side; a multi-format photography and video installation by filmmaker Jem Cohen; rarely displayed World War I posters supporting the war effort and Americanism; and the radically unconventional work of the pioneering and controversial contemporary painter Julian Schnabel. Enjoy live jazz music by the Michael Malis Trio. Exuberant, buoyant, and soulful, the evening will feature original compositions rooted in the jazz pianist-composer tradition and drawing inspiration from the musical legacy of Detroit. Curators’ conversations and light refreshments round out the event. \n\t\nUMMA After Hours is generously sponsored by Fidelity Investments.", "date": "2015-09-18T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/968559879877652/", "name": "UMMA After Hours"}, {"description": "Literati is pleased to welcome Patrick Wensink, as part of our Fiction at Literati series, in support of his latest novel, Fake Fruit Factory (September 2015, Curbside Splendor). Reading with Patrick will be friend of the store Aaron Burch, the editor of Hobart: Another Literary Journal and author of the story collection Backswing (Queen's Ferry Press, 2014)\n\nFake Fruit Factory is a stick-slapping, gut-punching comedic novel about the eccentric small town of Dyson, Ohio. When NASA determines an errant satellite will crash there, the town's young mayor uses the ensuing media circus to attract tourism and save his bankrupt rust belt community.\n\nUnless, of course, the satellite completely wipes it from the map.\n\nIn Fake Fruit Factory, Wensink’s motley cast of characters are the heart of “America’s Boringest City.” Bo Rutili is Dyson’s twenty-six-year-old mayor, who relieves stress with copious doses of hand sanitizer. Donna “Urinating Bear” Queen uses her recent lottery spoils to convince the town she’s the only one who can save it. And Old Man Packwicz, Dyson’s aging ex-mayor, might finally save the town via a filet-mignon wielding, toilet paper-clad mummy.\n\nFake Fruit Factory hilariously captures the peculiarities of small town life through the story of a wacky community finding its place in contemporary America.\n\nPatrick Wensink is the author of three works of fiction, including the bestselling Broken Piano for President, and a forthcoming essay collection. He frequently contributes to publications like New York Times, Oxford American, Salon, and Huffington Post. He once sold his own line of BBQ Sauce, was married in a doughnut shop, and got punched in the mouth so hard he lost a tooth. (Not all at the same time.) He lives in Louisville, KY with his wife and son.", "date": "2015-09-18T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/664241450379121/", "name": "Patrick Wensink, w/ Aaron Burch"}, {"description": "We're thrilled to host Deb Pilutti for a story time! She'll read from her wonderful book, Bear and Squirrel Are Friends... Yes, Really!\n\nYes, bears sometimes eat squirrels. But can they still be friends? Find out in this clever picture book that’s perfect for preschoolers.\nThe other bears said, “Squirrel would make a good midnight snack!”\nBear said, “Squirrel’s my friend. I would never eat a friend.”\nBut what happens if Bear gets really, really hungry? Squirrel has just the solution! This story about the power and bond of friendship will warm the hearts—and tickle the funny bones—of everyone who reads it.\n\nDeb Pilutti is the author and illustrator of several books for children and has worked as a design partner at Oliebollen.com, where she designs toys and products for kids. Her design and illustration work has earned her many awards and has been published in several magazines including Step Inside Design, HOW Magazine’s Best Digital Designs issue, and Print magazine. She enjoys spending time in the woods near her home in Michigan. Visit her at DebPilutti.com.", "date": "2015-09-19T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/886799788040791/", "name": "Deb Pilutti story time"}, {"description": "Sat. September 19 | 9pm | 18+ | $20 Cover\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/421\n\nThe members of MUTEMATH had reached their breaking point. Collectively gathered on the front porch of their New Orleans home-studio where they were struggling to record the follow up to their 2006 critically-acclaimed Teleprompt/ Warner Bros. debut, the quartet screamed at each other with the full weight of the accumulated frustrations that had escalated from weeks of fighting. To heighten the tension, a lawn mower droning in the background drowned out their voices, inciting them to yell even louder in misguided efforts to be heard.  Finally, drummer Darren King voiced what everyone was thinking, but feared saying out loud: either call it quits or swallow their individual pride and try to write the best songs they ever had. No one said a word at that point, recalls vocalist/frontman Paul Meany. And without comment, apology or agreeing, I just remember all of us walking right back inside, going straight to our instruments, and just starting to play music. That was the day King, Meany, guitarist Greg Hill, and bassist Roy Mitchell-Cárdenas began to write what would become Armistice.  But before that day would arrive, the band had written close to 16 songs in the midst of their 3 years on the road and had full intention of arriving in New Orleans to record and sculpt these ideas into the 10 or so songs they would need for their sophomore release. But after weeks of recording and working in every separate corner of an old uptown voodoo Victorian, the internal conflicts over what parts made up the best ideas began building to a full on creative stalemate.  Growing exhausted with their crumbling democracy, the band started looking for an outside producer to evaluate the situation. One by one, they were flown in every other day for a week until they met Dennis Herring (Modest Mouse, Elvis Costello, The Hives).\n“What caught our attention about Dennis was that he had the most simple, yet slightly offensive suggestion for us,” says Meany about their first visit. Upon hearing what had been recorded so far Herring said, “Why don’t you just try writing some new songs?\nI’m surprised no one had really entertained that option up until then, Meany comments, perhaps because it seemed like too daunting of a task considering how invested we’d become in the existing ideas. But Herring continued to push his point, You obviously aren’t happy with what you have, and honestly, I don’t think it’s great either. Stop spinning your wheels; shelve these songs; and start spending your time writing together. Don’t worry about recording your record right now. Just write it.”\nTaking a few days to think about it after Herring left, the band attempted a discussion on what to do next, but still could not come to any unanimous agreements until that noteworthy day on the front porch where all the conflict would come to a head.\nAll of the constant fighting had left us unable to resolve anything, remembers Mitchell-Cárdenas. But something special happened when we just decided to shut our mouths, pick up our instruments, and disregard anything we had written prior. Something began to align in the creative universe. Songs were forming on their own at a fast pace, almost as if their true sound was being discovered for the first time. It was in this moment that their first single Spotlight fell out of the sky.\nOnce the band had grasped the benefit of their new mindset, they didn’t waste any more time. All previous 16 ideas were completely scrapped and the band began to work together in the same room everyday just starting with a tempo and key to play in. It turned into a marathon style writing session yielding a new song about every other day. The band eventually signed on Herring as their official producer and after 3 months in New Orleans shaping up almost 20 brand new songs, they headed to Oxford, MS and worked more closely with Herring to put the final details in place.  Fueled by the band’s chaos and confusion, MUTEMATH has created a work of tremendous beauty and meaning on Armistice via such tracks as the hypnotic, musically inventive Clipping, the propulsive, high dynamic charge of The Nerve, the quirky tribute to Murphy’s Law Backfire, and the nine-minute, soaring, closing opus Burden.  Instead of brushing aside the questions and anxiety that propelled the project’s birth, the quartet embraces them, with each song questioning where to go from here.\nSince MUTEMATH released its first EP in late 2004 and hit the road in 2005, their inherent nature has challenged limitations and expanded parameters. By the time of the 2006 self-titled debut, their blending of adverse genres into its own innovative sonically adventurous creation earned them a reputation as one of modern music’s most daring young groups. By 2007, they would find themselves Grammy nominated and declared by Alternative Press as the #1 band you need to see live before you die. But in the process of pushing boundaries even further for themselves, they almost pushed themselves out of existence. It was a risk we had to take, says King looking back on what they set out to accomplish for Armistice. This record was by far the most painful music-making experience I’ve ever had, but also the one I’m most proud of.\nIt’s evident that this record is not a high-minded story with a beautiful resolve, but rather the experience of knowing when to stop fighting for the sake of progress. Without a doubt, ideals get mamed and dismembered in the scuffle, but Armistice emerges as a transcendent anesthetic to keep us singing and dancing through it all.", "date": "2015-09-19T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/441077436062198/", "name": "Mutemath 9/19/15 @ Blind Pig - Ann Arbor"}, {"description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "date": "2015-09-20T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1674301546116200/", "name": "Guided Tour: Engaging with Art"}, {"description": "During World War I, the American Government used a powerful poster campaign to rally citizens to the cause. Propaganda, commodity, and art came together in WWI posters. The focus of this exhibition of rarely displayed WWI posters from UMMA’s collection is coal miners. These works explore the larger themes of supporting the war effort and Americanism. UMMA docents will guide visitors through this exhibition that marks the centennial of the Great War (1914-1919). This exhibition includes some of the lesser-known works by America’s most famous poster artists.\n\t\nLead support for Mine More Coal: War Effort and Americanism in World War I Posters is provided by the Herbert W. and Susan L. Johe Endowment.", "date": "2015-09-20T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/986096314745597/", "name": "Guided Tour: Mine More Coal: War Effort and Americanism in World War I Posters"}, {"description": "This program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.\n\t\nMuch of the power and impact of Julian Schnabel’s work is located in what we experience in its physical materiality. His use of found materials, chance operations, and inventive mark making are immediately available to us and offer entry points to the cultural signifiers that are layered within them. Join Jim Cogswell, Arthur F. Thurnau Professor and Professor of Art, Penny W. Stamps School of Art and Design, for an exploration of what we learn from our experience of these works in their material presence, and the evidence of process and intention buried within them.  How far can we trust our perceptions? What, if anything, might go missing from relying on what we see and long to touch?\n\t\nThe exhibition Julian Schnabel was organized by the Brant Foundation Art Study Center.  Lead support for UMMA’s installation is provided by Joseph and Annette Allen, the University of Michigan Office of the Provost, the University of Michigan Health System, the Richard and Rosann Noel Endowment Fund, and Retirement Income Solutions.", "date": "2015-09-20T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/905925456120853/", "name": "In Conversation: Julian Schnabel: Insistent Materiality"}, {"description": "This program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.\n\t\nMuch of the power and impact of Julian Schnabel’s work is located in what we experience in its physical materiality. His use of found materials, chance operations, and inventive mark making are immediately available to us and offer entry points to the cultural signifiers that are layered within them. Join Jim Cogswell, Arthur F. Thurnau Professor and Professor of Art, Penny W. Stamps School of Art and Design, for an exploration of what we learn from our experience of these works in their material presence, and the evidence of process and intention buried within them.  How far can we trust our perceptions? What, if anything, might go missing from relying on what we see and long to touch?\n\t\nThe exhibition Julian Schnabel was organized by the Brant Foundation Art Study Center.  Lead support for UMMA’s installation is provided by Joseph and Annette Allen, the University of Michigan Office of the Provost, the University of Michigan Health System, the Richard and Rosann Noel Endowment Fund, and Retirement Income Solutions.", "date": "2015-09-20T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/943788932309006/", "name": "In Conversation: Julian Schnabel: Insistent Materiality"}, {"description": "$13 Adv./ $15 day of | 8pm | 18+\n\nIn March of this year, Cannibal Ox released its highly-anticipated sophomore album, Blade of the Ronin, to worldwide critical acclaim. The album, which served as the follow-up to the group’s 2001 seminal debut The Cold Vein, earned praise from European media outlets including The Guardian, Echos, DJ Mag, Wire Magazine, Uncut, and Q Magazine among others.  On the return of Cannibal Ox, DJ Mag exclaimed, “No one else sounded anything like [Cannibal Ox].  No one else sounds anything like them now either.  Superb, and a cold fuzzy to all psychonauts who remember.  They’re Back.”\n\nSurcharge free tickets at the 8 Ball Saloon\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/427", "date": "2015-09-23T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1452891638349255/", "name": "Cannibal Ox with special guest: Liam 9/23/15 @ Blind Pig - Ann Arbor"}, {"description": "The Heidelberg Project is an outdoor art environment in the heart of an urban community on Detroit’s near-east side. The installation was started in 1986 by artist and local resident Tyree Guyton who covered abandoned houses, the street, and the surrounding area with found objects and paintings that express vivid personal, social, and sometimes political themes. The street was gradually transformed into a lively, visually arresting, and often controversial work of art that not only energized the local community but attracted visitors from around the world. Over the last three decades, the project has morphed from the work of a single artist into a broad-based collaboration between Guyton, Executive Director Jenenne Whitfield, and their team of volunteers.\n\t\nOn the occasion of the 30-year anniversary of the Heidelberg Project, Tyree Guyton and Jenenne Whitfield look back over their dramatic journey as they contemplate new possibilities for the future. Exhibition curator MaryAnn Wilkinson will offer remarks about the exhibition at UMMA and Mr. Guyton’s work within the context of the global art community.", "date": "2015-09-25T17:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1447838492191448/", "name": "UMMA Dialogue: A Thirty-Year Journey with Tyree Guyton and Jenenne Whitfield"}, {"description": "Join us at the Hands On Museum for a night of boozy exploration! Make an alcohol-ink tile, enjoy three different selections of Wolverine State lagers, and learn about the brewing process! Dave and Marty, pilot brewers at Wolverine State, along with the People's Food Co-op's Bridget O'Brien, will be on hand to present the science behind fermentation and brewing. Sliders will be available from Knight's, and additional refreshments will be provided by the People's Food Co-op. \n\nTickets are $25 for members, $30 for non-members. Register and purchase your tickets on Eventbrite! http://www.eventbrite.com/e/a-pint-at-the-museum-tickets-17835548606?aff=es2", "date": "2015-09-25T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1633622073571300/", "name": "A Pint at the Museum"}, {"description": "Literati is pleased to welcome friend of the store Robert James Russell to launch his western novel, Mesilla. Reading with Robert will be Chicago-based author Ben Tanzer.\n\n1863, New Mexico Territory. Shot full of holes and on the run from the relentless pursuit of his one-time friend now intent on retribution, Confederate deserter Everett Root finds himself navigating the brutal desert headed to the town of Mesilla.\n\n“In a mounting gush of sumptuous prose, Robert James Russell’s Mesilla scrubs bare the elements of the classic Western—the wounded, questing hero, the damsel in distress, the phantasmal villain in hot pursuit—and reinvents them as existential meditation.”—Matthew Gavin Frank\n\n“A shotgun marriage between classic and revisionist Western, Mesilla sings a hard-bitten practicality and brutal authenticity.” —Emily Schultz, author of The Blondes\n\nA born and bred Michigander, Robert James Russell is the co-founding editor of the literary journal Midwestern Gothic, which aims to catalog the very best fiction of the Midwestern United States (an area he believes is ripe with its own mythologies and tall tales, yet often overlooked), as well as the micro-press MG Press. In 2013 he launched the online literary journal CHEAP POP, which publishes micro-fiction, 500 words or less.\n\nFascinated by regionalist literature and the intersection of place and relationships, his work has appeared in numerous publications, both print and online. His first novel, Sea of Trees, was published by Winter Goose Publishing in 2012. His first collection of stories, Don’t Ask Me to Spell It Out, was released in April 2015 by WhiskeyPaper Press.  His Western novel, Mesilla, will be released in September 2015 by Dock Street Press. He’s been nominated three times for the Pushcart Prize, and was awarded an artist residency with the University Musical Society for the 2014-2015 performance season.\n\nBen Tanzer is the author of the books My Father’s House, You Can Make Him Like You, So Different Now, Orphans and Lost in Space, among others. Ben can be found online at This Blog Will Change Your Life, the center of his growing lifestyle empire. He lives in Chicago with his wife and two sons.", "date": "2015-09-25T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1063994200280399/", "name": "Robert James Russell, ft. Ben Tanzer"}, {"description": "During the 1920s the Soviet Union emerged on the world stage. The first decade was full of hope for a new social order that would reject the values and traditions of Tsarist rule. Centered in Moscow, a group of young artists, spearheaded in part by Vladimir (1899-1982) and Georgy Stenberg (1900-1933), championed an art that promoted the egalitarian ideals of the New Order and contributed to the growth of the Soviet Union. Known as the Constructivists, they advocated for utilitarian art that was easily accessible and spoke to the masses. Among their most provocative and visionary works were posters advertising Soviet films.\n\t\nUMMA’s exhibition, Soviet Constructivist Posters: Branding the New Order features a selection of posters by the Stenbergs and other Constructivists for some of early cinema’s most inventive films including, Sergei Eisenstein’sOctober and Dziga Vertov’s Man with a Movie Camera.\n\t\nUsing dynamic compositions, bold colors, and emblematic images, these posters announced that the Soviet Union was a progressive nation that could propel society into a utopian future. Their revolutionary aesthetic became associated with the workers’ movement and helped to shape how it was understood both at home and abroad. Though Constructivism went out of favor in the 1930s with the rise of Joseph Stalin (1878–1953), Constructivist designs continued to have an influence abroad. Today, their legacy can be seen in advertisements and other promotional materials made for the public eye.\n\t\nLead support for this exhibition is provided by the University of Michigan Weiser Center for Emerging Democracies and the Center for Russian, East European, and Eurasian Studies.", "date": "2015-09-26T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/504714833012958/", "name": "Soviet Constructivist Posters: Branding the New Order"}, {"description": "Children ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. The story on September 26 will introduce children to UMMA’s exhibition The Art of Tyree Guyton: A Thirty-Year Journey. Meet in front of the UMMA Store.\n\t\nStorytime at the Museum is generously supported by the University of Michigan Credit Union, UMMA's Lead Sponsor for Student and Family Engagement. \n\t\nLead support for The Art of Tyree Guyton: A Thirty-Year Journey is provided by the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, the Andy Warhol Foundation for the Visual Arts, Lisa Applebaum, and the University of Michigan Taubman College of Architecture and Urban Planning and School of Social Work.", "date": "2015-09-26T23:15:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1603511863232037/", "name": "Storytime at the Museum"}, {"description": "It's Easy Being Green is a day-long learning, local buying, and eating celebration of living a life that’s better for the planet and not so hard on the wallet. From supporting efforts to reduce your carbon footprint to learning homesteading skills for living a more hands-on, DIY life, It's Easy Being Green has you covered!", "date": "2015-09-27T12:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/677018942398030/", "name": "It's Easy Being Green: A Sustainable Living Expo"}, {"description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "date": "2015-09-27T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/823986854374892/", "name": "Guided Tour: Engaging with Art"}, {"description": "Known for an iconoclastic pictorial language of eccentric materials and radically unconventional techniques, New York painter and filmmaker Julian Schnabel (born 1951) has been a pioneering, and controversial figure in the art world. Featuring works from the mid-1970s to the present, including pieces from Schnabel’s most well-known series, the Plate Paintings and Wax Paintings, this exhibition explores the artist’s use of found materials, his experimentation with chance operations, and his idiosyncratic and inventive mark-making. Enjoy Schnabel’s unorthodox art with an UMMA docent tour. \n\t\nThis exhibition was organized by the Brant Foundation Art Study Center. Lead support for UMMA’s installation is provided by Joseph and Annette Allen, the University of Michigan Office of the Provost, the University of Michigan Health System, the Richard and Rosann Noel Endowment Fund, and Retirement Income Solutions.", "date": "2015-09-27T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1623348677919834/", "name": "Gallery Tour: Julian Schnabel"}, {"description": "Need a fantastic end-of-year gift for your fave teacher? Grab a bag of Sweetwaters' new blend, Scholar Joe, in stock right now! For every bag you buy, Lucky's Market will make a donation to the Ann Arbor Public Schools Educational Foundation!", "date": "2015-09-30", "source": "Facebook", "url": "https://www.facebook.com/events/463341333828385/", "name": "Scholar Joe- Supporting the AAPSEF"}, {"description": "Literati is thrilled to welcome Claire Vaye Watkins in support of her first novel, Gold Fame Citrus.\n\n“An extraordinary novel: relentlessly brilliant, utterly fearless, and often savagely funny. Watkins explores the maze of human thirst in all its forms. Here’s a love story that tracks the mutating hopes of two lost souls, in prose that is fever-bright and ferociously assured, against the backdrop of the Great American Desert. More confirmation that Watkins is one of the brightest stars in our firmament.”\n–Karen Russell\n\nIn 2012, Claire Vaye Watkins’s story collection, Battleborn, swept nearly every award for short fiction. Now this young writer, widely heralded as a once-in-a-generation talent, returns with a first novel that harnesses the sweeping vision and deep heart that made her debut so arresting to a love story set in a devastatingly imagined near future:\n\nUnrelenting drought has transfigured Southern California into a surreal, phantasmagoric landscape. With the Central Valley barren, underground aquifer drained, and Sierra snowpack entirely depleted, most “Mojavs,” prevented by both armed vigilantes and an indifferent bureaucracy from freely crossing borders to lusher regions, have allowed themselves to be evacuated to internment camps. In Los Angeles’ Laurel Canyon, two young Mojavs—Luz, once a poster child for the Bureau of Conservation and its enemies, and Ray, a veteran of the “forever war” turned surfer—squat in a starlet’s abandoned mansion. Holdouts, they subsist on rationed cola and whatever they can loot, scavenge, and improvise.\n\nThe couple’s fragile love somehow blooms in this arid place, and for the moment, it seems enough. But when they cross paths with a mysterious child, the thirst for a better future begins. They head east, a route strewn with danger: sinkholes and patrolling authorities, bandits and the brutal, omnipresent sun. Ghosting after them are rumors of a visionary dowser—a diviner for water—and his followers, who whispers say have formed a colony at the edge of a mysterious sea of dunes.\n\nImmensely moving, profoundly disquieting, and mind-blowingly original, Watkins’s novel explores the myths we believe about others and tell about ourselves, the double-edged power of our most cherished relationships, and the shape of hope in a precarious future that may be our own.\n\nClaire Vaye Watkins is the author of Battleborn, winner of the Story Prize, the Rosenthal Family Foundation Award from the American Academy of Arts and Letters, and a Silver Pen Award from the Nevada Writers Hall of Fame. Battleborn was named a Best Book of 2012 by the San Francisco Chronicle, Boston Globe, Time Out New York, and Flavorwire, and a Best Short Story Collection by NPR.org.  An assistant professor at Bucknell University, Claire is also the co-director, with Derek Palacio, of the Mojave School, a free creative writing workshop for teenagers in rural Nevada.", "date": "2015-09-30T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/910676398998635/", "name": "Claire Vaye Watkins"}, {"description": "Wed. September 30 | 9pm | 18+ | $14 Adv./ $16 day of\nSurcharge free tickets available at The 8 Ball Saloon\n\nEl Ten Eleven gained notoriety through film & TV, featuring their music in various commercials from the likes of Lexus, to the MTV awards - Licensing partnerships with Gary Hustwit’s award-winning design documentary trilogy, Helvetica, Objectified and Urbanized - Toured with artists such as Bonobo, with touring support coming from Baths, Peter Hook & The Light, Globes, and Races. They have performed at festivals such as Fun Fun Fun Fest, North Coast Music Festival and more. \"tightly wound tunes with plenty of punch.” - SPIN \"The impression they’re capable of leaving on listeners is akin to that of watching two guys stuff themselves into a tiny box, and then forcibly push the walls outward until it’s a large box” - Consequence of Sound\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/416 WSG: Sego", "date": "2015-09-30T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1674940409392866/", "name": "El Ten Eleven w/ Sego 9/30/15 @ Blind Pig - Ann Arbor"}, {"description": "In celebration of WEMU’s 50th anniversary, the Ann Arbor Summer Festival and WEMU co-present NPR’s Wait Wait…Don’t Tell Me!\n\nBe a part of the live audience recorded for broadcast on the following Saturday, in the iconic Hill Auditorium.\n\nNow in its 17th season, Wait Wait… Don’t Tell Me! is National Public Radio’s Peabody Award-winning quiz show. Host Peter Sagal leads a rotating panel of comedians, humorists and journalists, listener contestants and celebrity guests through a comic review of the week’s news. Contestants vie for the most coveted prize in all of public radio: a custom-recorded greeting by scorekeeper emeritus Carl Kasell for their voicemail.", "date": "2015-10-01T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/819142474860659/", "name": "NPR Presents: Wait Wait … Don’t Tell Me!"}, {"description": "The music of The Growlers is unmistakable.\n\nSure, you can hone in on some influences baked into the work of this California-bred band. Heck, even they’d cop to a few, like Ricky Nelson and The Clash. But once those same RIYL tags have been filtered through the minds and hands and voices of this five-piece, there’s simply nothing else like it.\n\nThe Growlers took the phrase “Beach Goth” as an apt descriptor of their music. Sunburned and salty, that term perfectly describes their distinctive melding of reverb heavy surf guitar and Bakersfield-style honky tonk with ‘80s post-punk.\n\nThis is especially true of Chinese Fountain, The Growlers’ fifth full-length set to be released on September 23rd via Everloving Records. The 11 songs found on it are some of the strongest that they’ve committed to tape yet; a byproduct not only of eight years in the trenches together, but finely honing their gypsy folk dirges and psychedelic sea shanties to fans at close to 150 shows each year. The connection between vocalist Brooks Nielsen and guitarist Matt Taylor (the principal songwriters of the group) has only grown deeper.\n\n“The band played better than they’ve ever played,” says Nielsen. “We’ve got the process down now. There’s less screwing around to get the songs laid out and we weren’t waiting around for take after take. We knew it and we played without much time to spare.”\nThat confidence bleeds through every track on Chinese Fountain, with the band assured enough to layer in shades of many new influences: the loping ska beat of “Dull Boy” and “Going Gets Tuff,” the playful disco beat behind the title track, or the Teardrop Explodes-like agitation of “Good Advice.”\n\nNot that the band left themselves much room to second-guess anything. The five spent about three weeks writing the tracks, and about half that time in the studio recording them. That may sound rushed, but it’s not as if you can hear any strain on the finished product; Chinese Fountain is as rock solid and watertight as anything in their still-growing discography.\n\nThere’s evolution to be heard in Chinese Fountain as well, courtesy of some of Nielsen’s most pointed and poignant lyrics to date. He takes our obsession with the online world to task on the funky title track. When he drops the bomb that obliterates that most famous of Beatles’ claims with \"The internet is bigger than Jesus or John Lennon” he re-contextualizes Marshall McLuhan's \"the medium is the message\" in the same breath. He urges positivity no matter the obstacles (“Going Gets Tuff”). Too, he reveals a tattered heart to the world on tracks like “Rare Hearts” and “Love Test.”\n\n“This is my chance to let it all out,” Nielsen says of these songs. “I kind of bottle things up and don’t really get emotional. But I think if I don’t open up, I’d be a really stale person.”\n\nWSG: The Babe Rainbow\n\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/392", "date": "2015-10-01T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1639454666285655/", "name": "The Growlers 10/1/15 @ Blind Pig - Ann Arbor"}, {"description": "Sat. October 3 | 9pm | 18+ | $14 Cover\n\nRub-ble-buck-et [ru-bul-buck-it] Noun 1. A vessel in which workers collect waste materials on a construction site; We need a rubblebucket for all this rubble. 2. A wild art-pop band from Brooklyn, NY; I’m jonesing for the new Rubblebucket album ‘Survival Sounds’. 3. The condition of having hard nipples, or riding a mean yes wave; He has great Rubblebucket. Verb 4. The act of uncrossing one’s arms and letting loose, while strange, new feelings and sounds flood mind and body, leading to uncontrollable dancing, possible injury and definite sweat; Man, we really put the rubble in the bucket last night. WSG: ELEL\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/457", "date": "2015-10-03T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/917223334986199/", "name": "Rubblebucket w/ ELEL 10/3/15 @ Blind Pig - Ann Arbor"}, {"description": "Mon. October 5 | 8pm | 18+ | $16 adv./ $18 day of\n\nGeneWeen was a scientist, ambassador, philosopher, statesmen, writer, businessman and celebrated freethinker and wit. He has often been referred to as ‘America’s renaissance man’ and was emblematic of the fledgling American nation.\n\nGene Ween was born March 17, 1970 into a large and poor family. His father had 17 children by 2 different wives. Gene was brought up in the family business of candle making and his brother’s printing shop. Whenever he could Gene would take the opportunity to read and learn about a wide range of subjects, from Sophocles to modern science. Whilst co-workers would take a leisurely lunch break, Gene would pour over books from the bookshop munching on some raisins.\n\nAt an early age, he also started writing articles, which were published in the New Boognish Coureant under a pseudonym; Gene wrote under pseudonyms throughout his life. After several were published, he admitted to his father that he had written them under “Eddie Dingle.” Rather than being pleased his father beat him for his impudence. Therefore, aged 17, the young Gene Ween left the family business and travelled to Philadelphia. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/453", "date": "2015-10-05T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/577944782309088/", "name": "Gene Ween (of Ween) 10/5/15 @ Blind Pig - Ann Arbor"}, {"description": "Fri. October 9 | 9pm | 18+ | $16 Cover\n\nRussian Circles wsg: Cloakroom\n\nPerhaps the most immediately apparent characteristic of the fifth Russian Circles album, Memorial is its wide range of emotion. Vacillating from somber-yet-soaring melodies on one track to pummeling metal heft on the next, Memorial sounds like an album with split personalities. \n \nWhere one song showcases guitarist Mike Sullivan, drummer Dave Turncrantz and bassist/keyboardist Brian Cook's mastery of lush melancholic melody, the next exhibits their most abrasive underground metal leaning sound, with washed-out 16th-note riffs and crushing rhythms. The band's penchant for endless hooks remains a constant, but Memorial embodies their most dramatic ranges in tone.  \n \n\"We've always tried to balance our metal-influenced sounds with more nuanced, pretty, orchestral elements,\" Cook says. \"But this time, it's far more polarized in that the heavy parts are much more blown out and exaggerated while the pretty moments are far more restrained, delicate, and atmospheric.\" In the two years since Russian Circles released their landmark fourth album Empros, the Chicago trio toured worldwide nearly incessantly, encountering many heavy acts whose music seemed needlessly complicated. \"We set out to make a straightforward, intense, heavy record,\" Cook explains. \"We subconsciously gravitated toward darker and more somber sounds. We wanted to get away from the overtly flashy.\" \n \n\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/450", "date": "2015-10-09T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1611450162462333/", "name": "Russian Circles w/ Cloakroom 10/9/15 @ Blind Pig - Ann Arbor"}, {"description": "Mon. October 12 | 9pm | 18+ | $10 Cover\n\nWIDOWSPEAK has grown up in a lot of ways.The band’s third album, All Yours, is one that could only come from Molly Hamilton and Robert Earl Thomas: a honed and elegant interweaving of dream-pop and slowcore rock and roll, easygoing melodies and dusty, snaking guitars. It’s also their finest release to date: ten beautiful songs that are refreshingly straightforward yet built from the same well-chosen and deftly-used tools the band has always worked with. All Yours is ambitious without feeling labored-over, anchored in the strengths of Widowspeak’s consistent influences.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/465", "date": "2015-10-12T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/485997918227999/", "name": "Widowspeak 10/12/15 @ Blind Pig - Ann Arbor"}, {"description": "Tue. October 13 | 9pm | 18+ | $12 Cover\n\nFortunate Youth is a collaboration of South Bay reggae stand-outs. Rising from various bands, they've created a phenomenal 6-piece masterpiece bringing more fire to the stage than ever before. Combining rootsy vibes and unique bass lines united with multiple harmonies, boisterous guitar solos, and heavy keys separates Fortunate Youth from every other mainstream reggae band. With their high energy approach and positive stage presence they provide an unforgettable show to every music fan. Fortunate Youth's objective is to ensure a performance that leaves you feeling euphoric and curious of what might happen at the next show.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/428", "date": "2015-10-13T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/508479992638842/", "name": "Fortunate Youth 10/13/15 @ Blind Pig - Ann Arbor"}, {"description": "That 1 Guy live in concert!\n\nWith an extensive and amazing track record of unique and imaginative performances featuring his curious instrument and copious amounts of originality, Mike Silverman, a/k/a That1Guy, has set himself apart as a true one-of-a-kind talent that rivals any other artist currently in the entertainment industry. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/403", "date": "2015-10-16T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/916322731747958/", "name": "That 1 Guy 10/16/15 @ Blind Pig - Ann Arbor"}, {"description": "Fri. October 16 | 9pm | 18+ |  $10 Cover\n\nSaintseneca’s powerful new album Such Things is the band’s most cohesive, catchy and accessible output, and a work that solidifies the group’s singer and songwriter Zac Little’s status as one of modern indie music’s most thoughtful and talented artists. The record arrives October 9th via Anti-.\n\nThe first single, “Sleeper Hold” is a pulsating and infectious rock song that utilizes elements of punk, folk and straight up rock and roll, all centered around a soaring and beautifully anthemic chorus.\n\nSuch Things is the anticipated follow up to Saintseneca’s acclaimed album Dark Arc, which Stereogum celebrated writing, “Dark Arc shines in all the ways Saintseneca always has — gorgeous harmonies, rampant strumming, glimpses of both humanity’s fragility and power — but it also finds the band branching out into fuller arrangements and wilder instrumentation. (Wilder, even, than the plastic trash can they used to beat on.) It’s what an underground folk band stepping into the spotlight should sound like.”\n\nMoving away from the cinematic, linear quality of Dark Arc, Little sought even higher ground for the new songs, and to incorporate the synapses and charges of his fellow members. “I was pushing myself with Such Things to try to explore the pop motif further, to try to use and bend that formula of having a groove, a beat, locking in and using that as scaffolding to build a song,” he says. “And even though it oftentimes might seem like this singular vision, at the core my creative strategy for the band is one that inherently involves other people. I think the best work I’ll make involves working that way.”\n\nThose disparate pieces and parts have come together, like so many molecules, to form a solid rock object called Such Things. You can hold it in your hands and hear it in your head, this culmination of tiny, beautiful moments and fluctuations of energy and information, compressed and etched into an LP sleeve and eternity and all tied up in a rock and roll record.\n\n“It’s definitely a new way of songs manifesting, and it feels like a step forward,” Little says. “I’m gonna push myself and try this thing I’ve wanted to try. I think it’s the best thing we’ve done so far, but then again I won’t write a song that I don’t think isn’t the best thing I’ve done. When I finish it I have to feel like it’s the best thing I’ve made. And if I don’t feel that way, it’s like, why bother?”\nwith: The Sidekicks & Yowler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/464", "date": "2015-10-16T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/719914338112732/", "name": "SAINTSENECA with The Sidekicks and Yowler 10/16/15 @ Blind Pig - Ann Arbor"}, {"description": "Saturday, Oct. 17 | 9pm | 18+ | $20 Cover\n\nThe Underachievers w/ Pouyan and the Buffet Boys, Kirk Knight and Bodega Bamz\n\nVIP Tickets: http://www.etix.com/ticket/p/6732395/the-underachievers-vip-tickets-ann-arbor-blind-pig-the-blind-pig\n\nAs members of the Beast Coast movement, which includes Joey Bada$$, the Pro Era crew and Flatbush Zombies, The Underachievers are part of the new wave of rappers that have been coming out of New York. Rapper AK started rapping at 11 years old and his partner Issa Gold started 6 years ago. Raised together in Flatbush, Brooklyn, they established THE UNDERACHIEVERS in 2011 and have been creating music together ever since. In May 2012, the group released their debut video for \"So Devilish\" and everything began to take off from there. Since then, the group has gained more than 24 million views on YouTube, 125,000+ YouTube subscribers and solid reviews from all of the top music publications. The Underachievers released the critically acclaimed INDIGOISM in February of 2013. The debut mix tape received an eight out of ten from Pitchfolk.com and has since gone PLATINUM on DatPiff. The mix tape has been downloaded over 300k times and has accumulated over 745k views on the unique website. It has been heralded as one of the best projects of 2013 and it has served as an excellent tool to establish the reputation of the group. In August of 2013, UA released their second project \"The Lords of Flatbush\" produced entirely by the extraordinary producer LEX LUGER. Again the mix tape was released on DatPiff and it amassed over 155k downloads making it a GOLD release on the site. In 2014, the group headlined their first tour “Eyes of the World” across North America, Canada & Europe. In August of the same year, UA also released their debut album on the RPM MSC label entitled \"Cellar Door: Terminus Ut Exordium\". The album charted #16 on R&B/Hip-Hop Album chart, #12 on INDI Album chart, #11 on Rap Album chart and #86 on the Billboard 200 album chart in its first week. The main purpose of UA’s music is to aide in the enlightenment of their generation by providing music from a perspective that all can appreciate and enjoy but still keeping it positive and as \"true to hip hop\" as they can. By combining their strong points they have been able to establish themselves as a rising reputable force in Hip Hop and the music Industry. The Underachievers wrapped up 2014 with a co-headline tour across North America & Canada joining Flatbush Zombies for a jaunt dubbed \"Clockwork Indigo Presents The Electric Koolade Experience\". The Duo is set to pick up the second leg of \"The Electric Koolade Experience\" tour in Europe from March through April 2015.", "date": "2015-10-17T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/125351747800708/", "name": "Forevermore Express Tour feat. The Underachievers & More 10/17/15 @ Blind Pig - Ann Arbor"}, {"description": "Mon. October 19 | 8pm | 18+ | $15 Cover\n\nBoys Life\nhttps://www.facebook.com/pages/BOYS-LIFE\nwith: All Eyes West\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/422\n\nConceived in 1993 by four friends, Boys Life became known for passionate and dissonant guitar-driven rock with DIY roots and a distinctly Midwestern sound. They sought to make the kind of music they wanted to hear and in the process created something uniquely their own.\n\nBy 1995 they released their self-titled debut and toured the underground scene in nonstop support of their work, playing everywhere from basements and coffee shops to Gilman Street with bands such as Knapsack, Giant’s Chair, and Christie Front Drive. The following year brought further collaboration with Front Drive in a split 10”. With a growing fan base in an emerging genre, they were ready to create their second album, Departures and Landfalls.\n\nWhile on tour, the band became a tighter unit and developed focus by talking about music and planning their future creative direction. They all saw Departures as their first opportunity to document new songs that could help define an original sound. With stronger songcraft, a refined tone, and a solid creative process, the work they created remained abrasive but also incorporated warmth and depth.\n\nGeography and seasons affected the process; some songs were written on the road, with an ever-changing landscape, and many during the springtime and early summer. Late nights of long drives, longer talks, and doing what you love are what made Departures Boys Life’s first real record, full of new but classic sounds. They had made something of their own.\n\nDuring five days of a hot summer in Chicago in 1996, they recorded with Bob Weston in the home studio of Steve Albini. In the band’s maturity, they were rehearsing almost daily and decided to record the album live. Several first takes made the final cut, and the resulting songs sounded natural and organic, reflecting the true dynamic of the band and their live performance.\n\nAfter the record’s release, Boys Life co-headlined tours with Kerosene 454 and Bluetip. Their performances were loud, enthusiastic, and genuine, and the experience strengthened the band’s newfound bonds with those in DC sharing the same postpunk ethic. By the end of that touring cycle, however, citing exhaustion, they called it a day in the summer of 1997.\n\nNow, nearly twenty years later, Boys Life is ready to revisit their records with renewed energy. Both the band and their songs were products of a special time that can’t be replicated, only revisited. But then and now, both Boys Life and Departures and Landfalls reflect something more than nostalgia—creativity, the power of music, the roar of a thunderstorm, and the lonesome sound of a train whistle.", "date": "2015-10-19T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/398616826996922/", "name": "Boys Life 10/19/15 @ Blind Pig - Ann Arbor"}, {"description": "Sat. October 24 | 18+ | 9pm | $12 adv. $14 Day of \n\nThere is nothing like the challenges and camaraderie of the road to inspire a songwriter who thrives upon the emotional energy and exhilaration only travel can deliver. Some singers are devoted to the pursuit of perpetual motion, and Langhorne Slim releases his wild soul in ways that come out of the discipline of live performance.\n\nThe 13 songs that compose Langhorne Slim & The Law's new \"The Way We Move\" are road-tested, rollicking and very rock 'n' rolling tunes that the songwriter perfected with his loyal band, and come out of the kind of good times and bad experiences that songwriters of Langhorne's lofty stature can turn into life-affirming rock 'n' roll. You could also call what Langhorne Slim does folk music, but then there's his sly, charming and open-hearted feel for pop music -- those summertime melodies that nudge you into a grin even when the song is about something bad.\n\nFor Langhorne Slim -- Pennsylvania-born self-taught guitarist who moves to Brooklyn at 18, begins feeling out his place in a burgeoning punk-folk scene, wends his way to the West Coast, and finds himself celebrated from Newport to Portland as one of today's most original singers and songwriters -- \"The Way We Move\" represents the sound of a band devoted to living in the moment. Riding the success of his 2009 full-length Be Set Free, Langhorne went through some changes over the last three years -- he lost his beloved grandfather, who is the subject of the new record's moving \"Song for Sid,\" and moved on from a relationship that had lasted five years.\n\nAnd there was the physical moving -- the literal side of the record's title. Pulling up stakes from his home of two years, Portland, Ore., Langhorne also has been touring non-stop with The Law. As he says, \"I'm in a bit of a transitional period -- currently, the road will be home. That's just kind of my spirit, to be slightly restless.\" Perfecting their rangy sound out on the endless grey ribbon, Langhorne and The Law -- bassist Jeff Ratner, drummer Malachi DeLorenzo and banjo player and keyboardist David Moore -- went down to rural Texas in the summer of 2011 to work on new material. With some 30 tunes to consider, the quartet soaked up the Lone Star sunshine and developed arrangements and approaches for Langhorne's latest batch of songs.", "date": "2015-10-24T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/843147115782248/", "name": "Langhorne Slim & The Law 10/24/15 @ Blind Pig - Ann Arbor"}, {"description": "Monday, October 26 | 9pm | 18+ | $12 adv./ $14 day of\n\nTelekinesis - We've all heard plenty about the astonishing debut and the \"difficult\" sophomore release. But let's pause for a moment to consider the role of album four in rock and roll history. A few key examples: Radiohead – Kid A, R.E.M. – Lifes Rich Pageant, Talking Heads – Remain in Light, Wilco – Yankee Hotel Foxtrot, David Bowie – Hunky Dory ... you see where we're going with this. Album four is an opportunity for artists to reinvent, and frequently revitalize, themselves. The willingness to abandon familiar work habits and signature sounds can be risky, but it's often the difference between a safe, predictable career and a bold transformation that signals the beginning (to quote another pretty amazing fourth LP) of a new age for artist and audience alike. WSG: Say Hi & Girls Who Care\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/482", "date": "2015-10-26T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1655017594775528/", "name": "Telekinesis w/ Say Hi & Girls Who Care 10/26/15 @ Blind Pig - Ann Arbor"}, {"description": "Cosmos-wrangling Americana upstart Israel Nash returns from Texas Hill Country with his Silver Season, a deeply gorgeous and wholly immersive nine-song set that plays less like an album, and more like a cross section of time and space. The man's fourth LP ventures farther down the acid-soaked trail blazed by 2013's Rain Plans, arriving in lush and expansive territory. Here, this Missouri son sounds more assured than ever, supported by his highly capable band and production inspired by psychedelic greats. Israel Nash's Silver Season is best played loudly, and sounds wonderful in headphones. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/477", "date": "2015-10-27T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1481526608833799/", "name": "Israel Nash 10/27/15 @ Blind Pig - Ann Arbor"}, {"description": "Wed. November 11 | 9pm | 18+ \n\nWith over 1400 legendary late nights, sold-out clubs and triumphant festivals under their belts, The New Deal returns with a passion in 2015. Recently releasedtracks “Mercury Switch” and “Sabotage the System”offera preview of their upcoming fall studio releasewhich bassist Dan Kurtz describes as their “most creative” endeavor to date. “In the last few months we've been pushing ourselves to work with new sounds, new styles, new ways of arranging jams, and the stuff we've come up with has felt great and exciting to us as a result. We're listening back to the board tapes of all the shows and finding the parts, even if they're just a couple of seconds long, that sound the most inspiring and then building studio recordings around them. In some cases we'll glue a bit from one show in one city to another completely unrelated piece from another town, and create something we'd never have come up with in either just a live or just a studio setting.” WSG: Turbo Suit\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/423", "date": "2015-11-11T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/832974296787302/", "name": "theNEWDEAL w/Turbo Suit @ Blind Pig - Ann Arbor"}, {"description": "Thursday, November 12 | 9pm | $10 adv./ $12 day of | 18+\nThe Bright Light Social Hour wsg: SWIMM\n\nQuestions bring art to life. Songs can still ponder socio-political issues, the fragility and isolation of the human condition, and what lies ahead for earth. Moreover, music possesses the potential and gravitas to incite change, while reflecting the world’s faults and follies. The Bright Light Social Hour contemplate a “Future South” on their second full-length album, Space Is Still the Place [Frenchkiss Records]. The Austin artists—Curtis Roush [guitar, vocals, synths], Jack O’Brien [bass, vocals, synths], Joseph Mirasole [drums, synths]—offer a different interpretation of the space around them throughout ten thematically connected songs. They tackle a myriad of issues head on during tracks such as “Ghost Dance” and “Ouroboros,” while “Infinite Cities” contemplates loneliness and “Escape Velocity” subtly hints at a orgiastic ending. The album will pose a few questions, but you may leave with an answer or two as well.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/449\n\nSurcharge free tix at The 8 Ball Saloon", "date": "2015-11-12T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/929976707046058/", "name": "The Bright Light Social Hour with SWIMM 11/12/15 @ Blind Pig - Ann Arbor"}, {"description": "Turquoise Jeep Records rollin' through November 14th wsg: Lt.baD\nDoors 10pm | 18+ | $15 Cover\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/478", "date": "2015-11-14T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1610852672500873/", "name": "Turquoise Jeep (Late Show 10pm) 11/14/15 @ Blind Pig - Ann Arbor"}, {"description": "Sat. November 14 | 7pm | 18+ | $12 Adv./ $14 Day of\n\n“It’s all in our minds / Planted over time / Grew into a vine / That became intertwined” – from “All In Our Minds”\n\nThis lyric is the source of the title to Passafire’s fifth studio album, Vines. Though it wasn’t written with this intention, it was in retrospect that the band members – singer/guitarist Ted Bowne, drummer Nick Kubley, bassist/vocalist Will Kubley and keyboardist Mike DeGuzman – realized that it aptly described the current state of the band. Vines is a record that finds its makers at a creative peak, thanks in large part to the comfort of the current line-up, which has been solidified for a few years. They have grown up together, and over the years, as their individual stylistic preferences have changed, they’ve intertwined until the music becomes stronger like vines growing around each other. These four have become a super tight unit, which has led to a comfort level on stage and in the studio that Passafire has never achieved before.  WSG: LIONIZE\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/462", "date": "2015-11-14T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/453982398116816/", "name": "Passafire w/ Lionize 11/14/15 @ Blind Pig - Ann Arbor"}, {"description": "An Oscar-nominated piano man", "date": "2015-11-20T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/840119426073642/", "name": "Jon McLaughlin w/Tess Henley"}, {"description": "The Rev. Peyton’s Big Damn Band bridges genres and eras with an intensity and effortlessness few contemporary artists possess. And their new album So Deliciouselevates the trio’s work to a new level. Produced by Rev. Peyton, So Delicious offers the band’s most diverse collection of songs buoyed by the Rev.’s supercharged six-string virtuosity — a unique style of fingerpicking inspired by his Delta blues heroes, but taken to new, original heights.\n\nThe fifth full-length original album by the group — which includes Breezy Peyton on washboard and supporting vocals and Ben Bussell on drums and supporting vocals — is their debut on Yazoo Records, a label known for the historic reissues of blues and other old time American music that are the bedrock inspiration for the Rev.’s sound and approach.\n\n“Yazoo was my favorite record label growing up,” he explains. “For fans of old country blues and all manner of early American music, they are the quintessential label. And for me, it’s like being on the same label as Charley Patton and ‘Mississippi’ John Hurt. To think that Yazoo believes we are authentic enough to stand with the other people in their catalog means a lot.”\n\nThe Rev. Peyton’s Big Damn Band has always been strong on authenticity, playing music that blends blues, ragtime, folk, country and other traditional styles with the sleek modern energy of do-it-yourself, homespun, punk fueled rock. And performing tunes plucked from their lives, their community or from the canonical songbook that fed the Rev. Peyton’s formative creative identity. It’s a mix that’s allowed the band to win fans from all corners of the Americana and rock worlds, and bring a new generation to blues and other forms of American roots music.\n\nSo Delicious is a perfect Rev. Peyton’s Big Damn Band album, with songs that speak from the heart and capture the trio — whose sound has been honed over 250 annual tour dates during the last eight years — playing at their peak. The charging, anthemic “Raise a Little Hell,” also the set’s first video, lays out the band’s live modus operandi, thriving on Bussell’s and Breezy’s chugging beat and the Rev.’s resonator guitar riffs and mantra-like singing. The song was inspired by a show at a folk festival, where one of the promoters — struck by the Big Damn Band’s raucous, juke joint power — told the Rev., “Y’all sure raise a lot of hell.”\n\n“I said, ‘Naw we don’t,’ “ the Rev. recalls. “And then I thought, ‘Well, maybe we do raise a little hell.’\n\n\n\n“The sweet, joyful “Pot Roast & Kisses,” which the band has also committed to video, was written for Breezy. The Rev. was developing the finger-busting main riff after enjoying one of her pot roast dinners when the lyrics naturally fell into place. “Some people don’t believe that we really live the way we sing about in our songs,” he explains, “but it’s true. Breezy and me are together and really love each other. We try to keep things simple, like people have in Brown County, Indiana for a long", "date": "2015-11-21T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1663435883900279/", "name": "Reverend Peyton's Big Damn Band 11/21/15 @ Blind Pig - Ann Arbor"}, {"description": "Enduring icons of alternative country rock", "date": "2015-11-22T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1466867666970198/", "name": "Cowboy Junkies"}, {"description": "An Ark holiday tradition! Dinner-show package available with dinner at Conor O'Neill's (click on General Admission).", "date": "2015-11-27T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1704270693126637/", "name": "Matt Watroba"}, {"description": "A Thanksgiving weekend tradition", "date": "2015-11-28T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/476566185854465/", "name": "Mr. B"}, {"description": "\"Wonderful songs and singing! Delightful!\"—WQXR radio, New York", "date": "2015-11-29T13:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1608960782708984/", "name": "Gemini"}, {"description": "The at-adds couple from Squeeze", "date": "2015-11-29T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1674852719415704/", "name": "Squeeze Acoustic—\"The At Odds Couple\"—An Evening with Difford and Tilbrook"}, {"description": "Now in its 11th season", "date": "2015-11-30T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1638535083055574/", "name": "Irish Christmas in America"}, {"description": "Wed. December 2 | 9pm | 18+ | $10 Adv./ $12 Day of\n\nWhat The Sound Presents: Beat Connection\n\nBeat Connection is Reed Juenger, Tom Eddy, Jarred Katz and Mark Hunter. Formed in 2010, Beat Connection has undergone numerous changes, finally stabilizing in its current form. The band has already shared the stage with Jungle, Toro y Moi, STRFKR, Washed Out, Holy Ghost! & ODESZA; and has garnered positive looks from Pitchfork, The Fader and The Guardian. With performances scheduled this year at ACL & CHBP, Beat Connection now looks to the future to focus on constantly bringing something new to their audience by bridging the gap between the mundane and the transcendent, the pop and the avant-garde. Expect something new at every turn.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/479", "date": "2015-12-02T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/887650744615581/", "name": "What The Sound Presents: Beat Connection 12/2/15 @ Blind Pig - Ann Arbor"}, {"description": "Seasonal songs in the round. Lineup TBA.", "date": "2015-12-08T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1478250905803916/", "name": "Decembersongs"}, {"description": "New music!", "date": "2015-12-10T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/864696096958013/", "name": "Iris DeMent"}, {"description": "Thu. December 10 | 9pm | 18+ | $20 Cover\n\nThe Sword is a bladed weapon used primarily for cutting or thrusting. WSG: ROYAL THUNDER\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/480", "date": "2015-12-10T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/690897114388628/", "name": "The Sword High Country Tour wsg Royal Thunder 12/10/15 @ Blind Pig - Ann Arbor"}, {"description": "Two Nights—December 11 & 12!", "date": "2015-12-11T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/136583806684600/", "name": "The Ragbirds Present—Ebird and Friends Holiday Show Night 1"}, {"description": "Two nights—December 11 & 12!", "date": "2015-12-12T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/114890398861731/", "name": "The Ragbirds Present: Ebird & Friends Holiday Show Night 2"}, {"description": "\"Puts the heart in heartland\"—Knoxville News-Sentinel", "date": "2015-12-13T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1627782970844802/", "name": "Griffin House"}, {"description": "The king of Texas honky-tonk blues", "date": "2015-12-16T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/899661113444014/", "name": "Delbert McClinton"}, {"description": "A veteran rock and roller goes back to the roots", "date": "2015-12-20T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1123793354317511/", "name": "Jorma Kaukonen"}, {"description": "The Celtic event of the season in metro Detroit. Note special start time!", "date": "2015-12-26T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/455656784607726/", "name": "Crossroads Ceili—Night 1"}, {"description": "The Celtic event of the season in metro Detroi!", "date": "2015-12-27T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1613884542207213/", "name": "Crossroads Ceili—Night 2"}, {"description": "Start the year off right with new music by Ann Arbor's songwriting collective!", "date": "2016-01-02T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/410480645829575/", "name": "The Yellow Room Gang"}, {"description": "Monday, January 11, 2016, 7:30 pm\nHill Auditorium\n\nFounded by Sir Thomas Beecham in 1946, the Royal Philharmonic Orchestra made its UMS debut in 1950 and last performed in Hill Auditorium in 1992. This concert features Pinchas Zukerman both at the helm and as the featured soloist. \n\nMore info: http://ums.org/performance/royal-philharmonic-orchestra/", "date": "2016-01-11T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/780337908747994/", "name": "Royal Philharmonic Orchestra"}, {"description": "Wednesday, January 20, 2016, 7:30 pm\nHill Auditorium\n\n“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas) Since 1988, Wynton Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, sophisticated to spirited, it’s all sheer jazz perfection — no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/1516-jazz-at-lincoln-center-orchestra/", "date": "2016-01-20T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1604747733142781/", "name": "Jazz at Lincoln Center Orchestra with Wynton Marsalis"}, {"description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "date": "2016-01-21T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1620983154780471/", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show"}, {"description": "Friday, January 22, 2016, 8:00 pm\nRackham Auditorium\n\nThe Chamber Music Society of Lincoln Center presents chamber music of every instrumentation, style, and historical period. The six musicians performing in this concert include violinist Benjamin Beilman, an Ann Arbor native whose career has been burnished by a series of major awards recognizing his extraordinary musical talent. \n\nMore info: http://ums.org/performance/chamber-music-society-of-lincoln-center", "date": "2016-01-22T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1453480484950039/", "name": "Chamber Music Society of Lincoln Center"}, {"description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "date": "2016-01-22T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1452156068412417/", "name": "Young Jean Lee Theater Company: Straight White Men"}, {"description": "\"Sophisticated intelligence and provocative originality\"—Boston Globe", "date": "2016-01-24T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1008141132558808/", "name": "John Gorka"}, {"description": "Wednesday, January 27, 2016, 7:30 pm\nMichigan Theater\n\nBy any measure of talent and accomplishment, Lisa Fischer is a superstar. Yet, if you do not know her name, it’s likely because she has spent the past 20 years as a backup singer for the Rolling Stones, Sting, Chris Botti, and countless others. Her name may not be on the marquee, but she doesn’t care. Her astonishing range, spot-on intonation, mastery of the stage, and infectious sweet smile make her the go-to singer for the likes of Tina Turner, Chaka Khan, Beyoncé, Bobby McFerrin, Lou Reed, Dionne Warwick, Aretha Franklin, and a host of others. As one of the top session and backup singers, she’s featured in the Oscar-winning documentary 20 Feet from Stardom and celebrated for her live concert duets with Mick Jagger during “Gimme Shelter” that have also received millions of hits on YouTube. After winning Grammy Awards for “Best Female R&B Performance” (1992) and “Best Music Film” (2015), she has decided to move forward from being a backup singer, putting together her own band and claiming her well-deserved place center stage. \n\nMore info: http://ums.org/performance/ms-lisa-fischer-and-grand-baton", "date": "2016-01-27T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1020565857968750/", "name": "Ms. Lisa Fischer and Grand Baton"}, {"description": "Tuesday, February 2, 2016, 7:30 pm\nLydia Mendelssohn Theatre\n\nWith Tanya Tagaq, ancient meets modern in provocative, powerful ways. This spellbinding performance features the Inuit throat singer accompanying a screening of Nanook of the North (1922) with a live score. Tagaq’s mixed-media performance reclaims the controversial classic — considered the first feature-length documentary — capturing the sense of the sound of the Arctic spaces shown in the film and adding tremendous feeling and depth to what is a complex mix of beautiful representations and racially charged clichés.\n\nTanya Tagaq’s music is unnerving and exquisite, rooted in Inuit throat singing, but also influenced by electronica, industrial, and metal influences. It is a style that she has perfected with collaborators such as Björk and that reminds some of Meredith Monk’s vocal innovations. Winner of the 2014 Polaris Prize for “Album of the Year” (she beat out Drake and Arcade Fire), Tanya Tagaq makes her UMS debut in this one-night only event. “Nobody, anywhere, sounds like she does.” (Globe and Mail)\n\nMore info: http://ums.org/performance/tanya-tagaq/", "date": "2016-02-02T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1155115267866605/", "name": "Tanya Tagaq in concert with Nanook of the North"}, {"description": "Friday, February 5, 2016, 8:00 pm\nLydia Mendelssohn Theatre\n\nTaylor Mac is equal parts bedazzled shaman, searing social critic, radical angel, and Elizabethan fool. A critical darling of the New York downtown cabaret scene, he is beloved for his iconic beauty, disarming vulnerability, and soaring spirit. His 24-Decade History of Popular Music will eventually become an epic show performed over 24 continuous hours; in Ann Arbor, Taylor will focus on the 1960s, 70s, and 80s, connecting the decades to the vibrant music scene in Detroit. “Fabulousness can come in many forms, and Taylor Mac seems intent on assuming every one of them.” (New York Times) A UMS co-commission. \n\nMore info: http://ums.org/performance/taylor-mac-a-24-decade-history-of-american-popular-music-1960s-1980s/", "date": "2016-02-05T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1594841967471096/", "name": "Taylor Mac: A 24-Decade History of American Popular Music: 1960s–1980s"}, {"description": "Saturday, February 6, 2016, 8:00 pm\nHill Auditorium \n\n“His superb live performance confirmed the impression of his recording: A major new pianist has arrived.” (New York Times) Born in 1987, the Russian-German pianist Igor Levit received effusive praise for his two-disc debut album of Beethoven’s late piano sonatas. A relative newcomer to the United States, he makes his UMS debut with this recital appearance. \n\nMore info: http://ums.org/performance/igor-levit/", "date": "2016-02-06T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1435582513413462/", "name": "Igor Levit, piano"}, {"description": "Saturday, February 13, 2016, 8:00 pm\nPower Center\n\n“Every aspect of the dance-making here is thoroughly accomplished.” (New York Times) A prolific choreographer who danced with Ronald K. Brown’s Evidence, Rennie Harris’s Puremovement, and the Alvin Ailey American Dance Theater, Camille A. Brown brings her newest work to Ann Arbor for her UMS debut. Black Girl — Linguistic Play speaks to the complexities of carving out a positive identity as a Black female in urban American culture.\n\nIn a world where Black women are often portrayed only in terms of their strength, resiliency, or trauma, this work interrogates these narratives by presenting a fuller spectrum of the black female and the complexities of negotiating in this racially and politically charged world. The work uses elements of African-American social dancing, rhythmic play, and musical compositions to better illustrate who “Black Girl” knows herself to be. Brown’s choreography is “fun, inventive, and watchable.” (Times Square Chronicles) Program will also include other repertoire.\n\nMore info: http://ums.org/performance/camille-a-brown-dancers/", "date": "2016-02-13T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/368546533344933/", "name": "Camille A. Brown & Dancers: Black Girl — A Linguistic Play"}, {"description": "February 16, 18\nRackham Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "date": "2016-02-16T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/442008155980033/", "name": "Sir András Schiff, piano"}, {"description": "Friday, February 19, 2016, 8:00 pm\nMichigan Theater\n\nA decade after it was first brought to the screen, Benoît Charest revives the music of the Oscar-nominated film The Triplets of Belleville with a remarkable cast of musicians in this silent movie-live concert event. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His near-sighted grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas.\n\nBut the true star of the animated film is the hot jazz score written by Canadian composer Benoît Charest. This screening of the beloved French film transports audiences to the exciting streets of 1920s Paris and Le Jazz Hot.\n\nMore info: http://ums.org/performance/the-triplets-of-belleville/", "date": "2016-02-19T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1620380161539059/", "name": "The Triplets of Belleville"}, {"description": "February 20\nHill Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "date": "2016-02-20T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1611931089050428/", "name": "Sir András Schiff, piano"}, {"description": "\"The world's greatest flatpicker\"—Oklahoma Gazette", "date": "2016-02-24T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/711839748946653/", "name": "Tommy Emmanuel"}, {"description": "Nashville-based, independent artist, Ron Pope, has stood at a crossroads where so many musicians find themselves — at the intersection of record label and independence. In an ever-evolving industry filled with rejection and compromise, he has plotted a new course for his music to reach loyal listeners, taking the industry-road-less-traveled in exchange for the ultimate payback, a league of devoted fans the world over.\n\nVIP tix available here: http://www.etix.com/ticket/p/4574033/ron-pope-vip-meet-greet-ann-arbor-blind-pig-the-blind-pig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/446", "date": "2016-02-25T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1449897481978519/", "name": "Ron Pope & The Nighthawks 2/25/15 @ Blind Pig - Ann Arbor"}, {"description": "\"Music to cure what ails you\"—Michigan Times", "date": "2016-02-26T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1538895803015696/", "name": "Mustard's Retreat"}, {"description": "A journey to the land of the mind's eye. Note special start time!", "date": "2016-02-27T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1112577285437513/", "name": "The Ark's 29th Annual Storytelling Festival feat. Kevin Kling"}, {"description": "Storytelling for the family", "date": "2016-02-28T13:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1067500173261475/", "name": "Storytelling for Kids"}, {"description": "Saturday, March 5, 2016, 8:00 pm\nHill Auditorium\n\nPaddy Malone and The Chieftains celebrated 50 years of performing in 2012, and their music remains as fresh and relevant as when they first began. Recognized for reinventing traditional Irish music on a contemporary and international scale, their ability to blend tradition with modern music has made them one of the most renowned and revered musical groups to this day. Back for their fifth UMS performance and their first in nearly a decade, “they seem ageless, and so does their Irish music. If common sense tells you they can’t go on forever, you wouldn’t know it from their electrifying performance.” (Boston Globe)\n\nMore info: http://ums.org/performance/the-chieftains/", "date": "2016-03-05T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1598997080377800/", "name": "The Chieftains"}, {"description": "March 11-12\nPower Center\n\n“You can’t help but leave with a fuzzy feeling inside.” (examiner.com) The globetrotting, Montreal-based scratch DJ and music producer Kid Koala presents a magical, multi-disciplinary and theatrical adaptation of his graphic novel and soundtrack, Nufonia Must Fall. This charming story centers around a headphones-sporting robot on the verge of obsolescence who falls in love with a lonely office girl. This live adaptation unfolds via real-time filming of more than a dozen miniature stages and a cast of puppets, while Kid Koala and the Aelos Quartet provide original live scoring on piano, strings, and turntables. The result? You’ll seem to be watching an animated picture, but simultaneously seeing puppets being filmed and projected in real time. Heartfelt, hand-made, and a very cool live experience. \n\nMore info: http://ums.org/performance/nufonia-must-fall/", "date": "2016-03-11T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/488544131294497/", "name": "Nufonia Must Fall"}, {"description": "Tuesday, March 15, 2016, 7:30 pm\nSt. Francis of Assisi\n\nFresh from their 2014 performance of Monteverdi’s Vespers, Apollo’s Fire & Singers returns to St. Francis of Assisi Church with one of their signature pieces, Bach’s St. John Passion. Bursting out of the gate from the agitated opening chorus, this work is considered Bach’s most dramatic and theatrical oratorio. In this acclaimed interpretation, the story’s action is highlighted by a dramatic approach: the roles are performed by true singing actors, staged on a special theatrical platform within the orchestra. The acclaimed Apollo’s Singers evoke the wild mob with fierce intensity. \n\nMore info: http://ums.org/performance/apollos-fire-st-john-passion/", "date": "2016-03-15T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/971816919508035/", "name": "Apollo’s Fire & Apollo’s Singers: Bach’s St. John Passion"}, {"description": "Saturday, March 19, 2016, 8:00 pm\nHill Auditorium\n\nThe Montreal Symphony returns to Ann Arbor for the first time since 1989, with American conductor Kent Nagano and pianist Daniil Trifonov both making their UMS debuts. “Hearing Trifonov is like having a deep-tissue massage: you keep wanting to pull away from the sheer intensity of it, and you come out feeling as if your reality had been slightly altered…a knockout.” (Washington Post) \n\nMore info: http://ums.org/performance/montreal-symphony-orchestra/", "date": "2016-03-19T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1582133688713673/", "name": "Montreal Symphony"}, {"description": "Appalachia gone Brazilian! Photo by Vincent Soyez. This show is FREE to Ark members at the door.", "date": "2016-03-20T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1488521474793961/", "name": "Matuto"}, {"description": "Indian classical music and multicultural fusion", "date": "2016-03-23T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/962546740435420/", "name": "Maestro Khan"}, {"description": "New music from Patty!", "date": "2016-03-24T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/119883711695876/", "name": "Patty Larkin"}, {"description": "Saturday, March 26, 2016, 8:00 pm\nHill Auditorium\n\nBach’s complete Sonatas and Partitas have long been a “Mount Everest” of the violin repertoire — music that performers return to throughout their lives. In this special event, Gil Shaham collaborates with video artist David Michalek to open up new avenues for listening to and interpreting Bach’s towering masterpieces.\n\nVideo artist David Michalek, best known for his “Slow Dancing” installation at Lincoln Center, and in the capitals of Europe, says of the Bach Six Solos project: “As a contemporary artist with a particular interest in motion pictures and time, I’ve been compelled to consider how the addition of extreme slow motion might be applied to moving images of the face, the body, obliquely narrative tableaux, and also still life in ways that can both enhance and alter the meanings latent within them. As a visual strategy, extreme slowness creates a continuing sense of a pause in the action — as if the growth and evolution of the slow-moving image is itself a further manifestation of the deep and consuming absorptive state that often arises while observing it.”\n\nMore info: http://ums.org/performance/gil-shaham/", "date": "2016-03-26T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1663165150570187/", "name": "Bach Six Solos: Gil Shaham, violin"}, {"description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "date": "2016-03-31T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1390173447979498/", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "date": "2016-04-01T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/453190221522442/", "name": "Mariachi Vargas de Tecalitlán"}, {"description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "date": "2016-04-08T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/827290400697161/", "name": "Jerusalem Quartet"}, {"description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "date": "2016-04-14T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1621365181438631/", "name": "Mnozil Brass"}, {"description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus, where it blended with elements of Spanish music, then was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed Tunisian singer Sonia M’barek, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "date": "2016-04-15T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/419604171550681/", "name": "Zafir: Musical Winds from North Africa to Andalucía"}, {"description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "date": "2016-04-16T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1579924995611394/", "name": "Bavarian Radio Orchestra"}, {"description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "date": "2016-04-23T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1589849627952742/", "name": "The Bad Plus Joshua Redman"}]