[{"date": "2016-01-17T11:00:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "source": "Facebook", "url": "https://www.facebook.com/events/1657867854492206/"}, {"date": "2016-01-17T11:30:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Ann Arbor Restaurant Week and Food Gatherers are collaborating on a fundraiser this year! Participating restaurants will donate a portion of the sales of a select menu item to Food Gatherers. Look for the Food Gatherers logo to find out which restaurants are participating.\n\nRESTAURANT WEEK MENU\nSelect one dish from each course\nLunch $15 per person plus tax and gratuity\nDinner $28 per person plus tax and gratuity\n\n- first course -\nTomato Basil Bisque\nparmesan croutons\nor\nRoasted Pear And Spiced Pecan Salad\nmixed greens, roasted pear, spiced pecans, crumbled bleu cheese, Michigan dried cherries, whole grain mustard vinaigrette\n\n- second course -\nMacadamia Crusted Mahi-Mahi \nwith ginger beurre-blanc coriander rice and seasonal vegetables\nor\n10oz. Prime Rib\nwith roasted garlic mashed potatoes and house made au jus\n\n- dessert -\nCarrot Cake\nor\nChocolate Chip Cookie Sundae \nwith vanilla ice cream\n\nProceeds from select wines will be donated to Food Gatherers. Ask your server for details.", "source": "Facebook", "url": "https://www.facebook.com/events/992259070830553/"}, {"date": "2016-01-17T14:00:00-05:00", "name": "Nicola's Books Winter Local Author Event with Mary Koral, Marilyn Churchill and Chris Lord", "description": "This is Nicola’s Books first winter Local Authors Event where we can showcase local authors to the community.  By bringing multiple authors together we hope to bring in a larger crowd to give the authors more exposure and help get the word out about their creative works.", "source": "Facebook", "url": "https://www.facebook.com/events/1092767804120832/"}, {"date": "2016-01-17T18:30:00-05:00", "name": "Back-to-School Open Mic & Slam", "description": "tl;dr: \nEspresso Royale on State St.\n7pm [sign-ups open at 6:30; list fills up, come early]\nbi-weekly on 1st and 3rd Sundays\n\nEspresso Royale is back to regular times! Join us at our normal 7pm start time this Sunday in our first slam of the semester for any of you students who missed us while you were gone!\n\nBring your friends and join us in one of the most intimate and longest-running poetry slams in the nation. \n\nWe meet up every week, but only put on a show 1st and 3rd Sundays in our new home at Espresso Royale on State St, and at our new time of 7pm!\n\nThis is an ancient, yet fresh experience: you, a stage, and everything you need to say for an audience who is ready to hear it. Bring yourself, bring your story, and we'll bring the love.\n\n$5 Suggested Donation\n\nMORE ABOUT THE EVENT:\n\nSign-up to perform at 6:30; the list fills up, so get there early to guarantee a spot. The Open Mic starts at 7pm, and the Slam starts whenever the open session ends. \n\nA maximum of 10 poets compete each week [spots are guaranteed for the first 8 slammers to arrive], the final two have to work for it. All poets who get into the Slam earn points qualifying toward the City Finals in April, and a chance to be one of four poets to represent Ann Arbor at the National Poetry Slam in August 2016, in Atlanta, Georgia. Poems must be the performer's original work. Come prepared with two poems [one if you're just doing the open mic], and keep it around three minutes or less. No costumes or props are allowed (unless otherwise specifically stated for themed events). See you soon!", "source": "Facebook", "url": "https://www.facebook.com/events/1515500778744680/"}, {"date": "2016-01-17T19:00:00-05:00", "name": "Open Stage", "description": "Sunday nights are YOUR chance to shine! Do you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 5-10 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to preview your latest project among other artists. \n\nFree for performers, pay-what-you-can for spectators.", "source": "Facebook", "url": "https://www.facebook.com/events/681720501967533/"}, {"date": "2016-01-17T21:00:00-05:00", "name": "The UnClub at The Yellow Barn (1/17/16)", "description": "IF YOU'VE SKIPPED THESE INSTRUCTION BECAUSE THEY RARELY CHANGE, THIS WEEK WOULD BE A GOOD WEEK TO READ THEM.\n\nThe UnClub has been permanently moved to 9:00pm Sunday evenings at the Yellow Barn.\n\nWatch old comics develop new bits and new comics just develop at the UNclub (TM) at the Yellow Barn Theater in Ann Arbor.\n\nA $5 suggested donation at the door to cover theater overhead.\n\nCOMICS and PERFORMERS: Please click \"See More\" below for spot request instructions for 1/17/16.\n\nComics and performers, please follow these procedures for stage time:\n\n- Click \"Going\" on this Facebook Event. Even if you are thinking about it, you can click \"Interested\" so you can get updates on this page. Do this by 5:00pm, the day of the show. This does not guarantee you a spot, but not doing it puts you at the bottom of the list.\n\n- THERE ARE NO GUARANTEED SPOTS FOR THIS SHOW, but there is a pecking order.  It is as follows:\n1. Invited guests\n2. Acts who have indicted they will attend (Clicking on this Facebook event counts as an RSVP)\n\nAll other spots are given at the show-runner's discretion.\n\n- After 5:00pm Sunday, \"show ups\" can \"go up\" only if spots are available.\n- The line-up will be created after the 7:30 Stage Time show presented by the Emergent Arts Theater.\n- Those arriving after the line-up is finalized will be given spots as time permits.\n- Length of stage time will depend largely on the turn out, performer's experience, and the show-runner's discretion.\n- As always, if you show up and do not get a spot, you will be put at the top of the list for the next show.\n\n--- Want to increase your odds of getting a spot? Here's some DO's and DON'T's\nDO . . . . Share this event page with your fans on your fan page, your facebook page, your website, or your tweets, or any other social media.\nDO . . . . Volunteer for less time. If you are willing to do 3 rather than 5, or 4 rather than 7, then you are more likely to get a spot.\nDO . . . . Come to the paid shows.\nDO . . . . Stay for \"meet and greet\" after shows.\nDO . . . . Answer poll questions whenever they appear on the event page.\nDO . . . . Bring people. This is not, I repeat NOT, a \"bringer.\" But if somebody has come to see you, it will be very hard to deny you a spot. In the past, we've had shows where we've added a minute of time for every person the comic brought as a non-performing audience member. Bring three people and a five minute spot becomes an eight minute spot.\n\nContact Mark at: www.facebook.com/marksweetman", "source": "Facebook", "url": "https://www.facebook.com/events/790898567722996/"}, {"date": "2016-01-18T11:00:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "source": "Facebook", "url": "https://www.facebook.com/events/1657867854492206/"}, {"date": "2016-01-18T11:30:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Ann Arbor Restaurant Week and Food Gatherers are collaborating on a fundraiser this year! Participating restaurants will donate a portion of the sales of a select menu item to Food Gatherers. Look for the Food Gatherers logo to find out which restaurants are participating.\n\nRESTAURANT WEEK MENU\nSelect one dish from each course\nLunch $15 per person plus tax and gratuity\nDinner $28 per person plus tax and gratuity\n\n- first course -\nTomato Basil Bisque\nparmesan croutons\nor\nRoasted Pear And Spiced Pecan Salad\nmixed greens, roasted pear, spiced pecans, crumbled bleu cheese, Michigan dried cherries, whole grain mustard vinaigrette\n\n- second course -\nMacadamia Crusted Mahi-Mahi \nwith ginger beurre-blanc coriander rice and seasonal vegetables\nor\n10oz. Prime Rib\nwith roasted garlic mashed potatoes and house made au jus\n\n- dessert -\nCarrot Cake\nor\nChocolate Chip Cookie Sundae \nwith vanilla ice cream\n\nProceeds from select wines will be donated to Food Gatherers. Ask your server for details.", "source": "Facebook", "url": "https://www.facebook.com/events/992259070830553/"}, {"date": "2016-01-18T13:00:00-05:00", "name": "Stewardship Workday - MLK Day", "description": "Martin Luther King Jr. Day of Service is an opportunity to make your “day off” a “day on” for community service and environmental stewardship. Volunteers will use handsaws and loppers to remove invasive shrubs that compete with native wildflowers in Barton Nature Area. This park has a rich diversity of native plants to protect. \nPlease meet at the Barton Dam parking lot at the corner of Huron River Drive and Bird Road, wear sturdy shoes good for wet ground or snow, and dress in layers.If you are bringing a group of 5 or more, please give us a call ahead of time (734.794.6627) so we can be sure to have enough equipment and staff.  All minors must present a completed release form, and should be accompanied by a guardian. If you would like to learn more about the MLK Day of Service mission, please visit the organization’s website at www.mlkday.gov.", "source": "Facebook", "url": "https://www.facebook.com/events/797836427016524/"}, {"date": "2016-01-18T19:00:00-05:00", "name": "Great Lakes Review: Readings from Issue 6", "description": "Literati welcomes contributors from Great Lakes Review Issue 6 to read from their work! \n\nThe Great Lakes Review publishes fiction, nonfiction, drama, and poetry from Toronto, Chicago, Cleveland, Detroit, Milwaukee, Buffalo, Hamilton and the rest of the Great Lakes region. To celebrate issue 6, the journal is hosting a reading with four of the contributors from Michigan on Jan. 18. They include: \n\nMichael Zadoorian is the author of two novels, The Leisure Seeker (William Morrow, 2009) and Second Hand (W.W. Norton, 2000), and a story collection, The Lost Tiki Palaces of Detroit (Wayne State University Press, 2009). He is a recipient of a Kresge Artist Fellowship in the Literary Arts, Columbia University’s Anahid Literary Award, the Michigan Notable Book award, the Great Lakes Colleges Association New Writers Award and was long-listed for the International IMPAC Dublin Literary Award. His work has been published in The Literary Review, Beloit Fiction Journal, American Short Fiction, North American Review and Detroit Noir.\n\nMichael Steinberg is the founding editor of Fourth Genre: Explorations in Nonfiction. He’s written and co-authored five books and a stage play. Still Pitch­ing won the 2004 ForeWord Magazine/Independent Press Memoir of the Year. Peninsula: Essays and Memoirs From Michigan was a finalist for the 2000 Foreword Magazine Independent Press Anthology of the Year, as well as for the 2000 Great Lakes Book Sellers Award. Another anthology, The Fourth Genre: Contem­porary Writers of/on Creative Nonfiction (with Robert Root), is in its sixth edition. Steinberg is currently Nonfiction Writer-in-Residence in the Solstice/Pine Manor College MFA program. http://www.mjsteinberg.net \n\nLynn Pattison, former teacher of the Gifted & Talented in Kalamazoo Pub­lic Schools, attended the University of Michigan and WMU. Pattison’s poems have appeared in The Notre Dame Review, Rhino, Atlanta Review, Har­pur Palate, Rattle and Poetry East, among others, and been anthologized in several venues. Nominated twice for a Pushcart Prize, she is the author of two chapbooks: tesla’s daughter (March St. Press, 2005); Walking Back the Cat (Bright Hill Press, 2006) and a book, Light That Sounds Like Breaking (Mayapple Press, 2006).\n\nRobert James Russell is the author of the novel Mesilla (Dock Street Press), and the chapbook Don’t Ask Me to Spell It Out (WhiskeyPaper Press). He is a founding editor of the literary journals Midwestern Gothic and CHEAP POP. You can find him online at robertjamesrussell.com.", "source": "Facebook", "url": "https://www.facebook.com/events/543086292516141/"}, {"date": "2016-01-18T19:00:00-05:00", "name": "Meet U of M Graduate Nicholas Petrie for a Discussion and Signing of His Debut Novel, 'The Drifter'", "description": "Peter Ash came home from the wars in Iraq and Afghanistan with only one souvenir: what he calls his white static, the buzzing claustrophobia due to post-traumatic stress that has driven him to spend a year roaming in nature, sleeping under the stars. But when a friend from the Marines commits suicide, Ash returns to civilization to help the man's widow with some home repairs. Under her dilapidated porch, he finds more than he bargained for...\n\nNicholas Petrie received his MFA in fiction from the University of Washington, won a Hopwood Award for short fiction while an undergraduate at the University of Michigan, and his story “At the Laundromat” won the 2006 Short Story Contest in the The Seattle Review, a national literary journal. A husband and father, he runs a home-inspection business in Milwaukee. The Drifter is his first novel.", "source": "Facebook", "url": "https://www.facebook.com/events/1161100170586702/"}, {"date": "2016-01-19T10:00:00-05:00", "name": "Story Time with Ieva", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "source": "Facebook", "url": "https://www.facebook.com/events/849241661863515/"}, {"date": "2016-01-19T19:00:00-05:00", "name": "Skazat! Poetry Series featuring Justin Rogers", "description": "Kick the new year off right (write? sorry, bad pun...) with some much-needed poetry! Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Reader\n\nThis month's feature: JUSTIN ROGERS!\n\nJustin Rogers is a poet, educator, coach and venue owner from the city of Detroit, Michigan.  Rogers is an advocate for literacy among inner-city youth, and the amplification of Black voices.  Currently touring the Mid-West and North-West, Rogers actively shares poems surrounding living and growing as a Black man in America.  Rogers most recently has work published or forthcoming in Eunoia Review, Mobius Magazine, and 3 Elements Review.\n\n\nNext month's feature: DENISE MILLER!", "source": "Facebook", "url": "https://www.facebook.com/events/1657736977814225/"}, {"date": "2016-01-20T11:00:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "source": "Facebook", "url": "https://www.facebook.com/events/1657867854492206/"}, {"date": "2016-01-20T11:30:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Ann Arbor Restaurant Week and Food Gatherers are collaborating on a fundraiser this year! Participating restaurants will donate a portion of the sales of a select menu item to Food Gatherers. Look for the Food Gatherers logo to find out which restaurants are participating.\n\nRESTAURANT WEEK MENU\nSelect one dish from each course\nLunch $15 per person plus tax and gratuity\nDinner $28 per person plus tax and gratuity\n\n- first course -\nTomato Basil Bisque\nparmesan croutons\nor\nRoasted Pear And Spiced Pecan Salad\nmixed greens, roasted pear, spiced pecans, crumbled bleu cheese, Michigan dried cherries, whole grain mustard vinaigrette\n\n- second course -\nMacadamia Crusted Mahi-Mahi \nwith ginger beurre-blanc coriander rice and seasonal vegetables\nor\n10oz. Prime Rib\nwith roasted garlic mashed potatoes and house made au jus\n\n- dessert -\nCarrot Cake\nor\nChocolate Chip Cookie Sundae \nwith vanilla ice cream\n\nProceeds from select wines will be donated to Food Gatherers. Ask your server for details.", "source": "Facebook", "url": "https://www.facebook.com/events/992259070830553/"}, {"date": "2016-01-20T19:00:00-05:00", "name": "Carmel Liburdi + Tim Johnson – Unplugged Wednesdays", "description": "Yellow Barn kicks off its Unplugged Wednesdays with two great local acts.\n\n$5 at the door.\n\nCarmel Liburdi: Her music is influenced by the world around her, as well as a wide variety of genres from jazz to punk.\n\nTim Johnson: He is a multi-instrumentalist, songwriter and vocalist who loves classic R&B, Chicago blues, Motown and Memphis soul.", "source": "Facebook", "url": "https://www.facebook.com/events/112429665804284/"}, {"date": "2016-01-20T19:30:00-05:00", "name": "Jazz at Lincoln Center Orchestra with Wynton Marsalis", "description": "Wednesday, January 20, 2016, 7:30 pm\nHill Auditorium\n\n“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas) Since 1988, Wynton Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, sophisticated to spirited, it’s all sheer jazz perfection — no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/1516-jazz-at-lincoln-center-orchestra/", "source": "Facebook", "url": "https://www.facebook.com/events/1604747733142781/"}, {"date": "2016-01-21T19:00:00-05:00", "name": "Agricultural Origins, Accurate Amounts, & Anxiety", "description": "This month, Nerd Nite A2 turns FOUR! Yay, NNA2! Please join us to celebrate our anniversary and to get nerd-schooled on three fascinating topics that we likely encounter on a daily basis. If you’ve eaten food before, you’ll be interested to hear Joseph Tychonievich explain the origin stories behind fruits and veggies that we take totally for granted. Heather Wade is going to weigh the pros and cons of measurement history and it’s going to be the most accurate weighing any of you have ever experienced. Finally, Elizabeth Block is here to calmly explain how anxiety occurs and reassure you that your anxiety levels are normal - or are they???? So come on out for drinks, laughs, and some A+ nerd time. \n\nWhen: Thursday, January 21, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER! Big thanks to the Ann Arbor District Library!!\n\nJoseph Tychonievich - The Great Pleasure (and Long History) of Creating New Kinds of Plants\n\nBasically as soon as agriculture began, humans started messing with plants, controlling their sex lives in order to transform the weeds around them into the grains and vegetables we depend on today. And while the crazy origin stories of things like corn and broccoli are in the distant past, I still use the exact same traditional methods to indulge my inner mad scientist and create new varieties of plants in my garden. The results are fun (and sometimes delicious) and will make you see the produce section of the grocery store in an entirely new way.\n\nAbout Joseph: A life long gardener and lover of plants, Joseph has been a repeated guest on public radio's food show The Splendid Table, wrote a book, Plant Breeding for the Home Gardener (Timber Press, 2013), spent two years working at the famed rare plants nursery Arrowhead Alpines and was named by Organic Gardening Magazine as one of \"...six young horticulturists who are helping to shape how America gardens.\" Joseph lives and gardens with his husband and an adorable black cat in Ypsilanti. You can find him on Twitter at @gsgardens, read his blog posts at gardenprofessors.com or https://www.facebook.com/TheGardenProfessors/.\n\n\nHeather Wade - Great, and Not So Great, Moments in Measurements: Wait! What Units Were You Using?\n\nWe encounter measurements every day, from the moment our alarm clock wakes us up and we adjust the water temperature for our shower, get dressed in clothes that fit, take doses of medicine, cook our meals & coffee, drive to work, buy gas & groceries, turn on a light switch, pay our bills, use gas/electricity, watch TV, build anything, pay for anything. How do we know these measurements are correct? What happens when these measurements happen in another country? How do we know the measurements “translate” from country to country & language to language? International System of Units and metrological traceability are the backbone of measurements. What does that mean? What are examples of non-traceable measurements? What happens when measurements go wrong? Proper measurements bring confidence & peace-of-mind to our lives. Understanding what measurements are help to ensure better measurements happen and life goes more smoothly.\n\nAbout Heather: UM grad and Calibration Officer at NSF International, headquartered here in Ann Arbor, Heather is an ASQ-Certified Calibration Technician (www.asq.org). She is a co-author of The Metrology Handbook, 2nd Edition, edited by Jay Bucher and has been published in Cal Lab Magazine: The International Journal of Metrology. She just completed her terms as Chair of ASQ's Measurement Quality Division and also as Chair of ASQ's Certification Board subcommittee for the ASQ-CCT. She has presented and published at national and international conferences. She also does outreach as a Metrology Ambassador. She has worked as a microbiologist, extraction and analytical chemist, and as a physical test engineer prior to embarking on her career in metrology and calibration. \n\n\nElizabeth Block, MD - Anxiety Disorders: When Worrying Gets in the Way\n\nAnxiety disorders are among the most common mental health diagnosis in the United States. This talk will outline how anxiety is manifested in our bodies, common medications used to treat disorders, and therapeutic techniques used to manage (or alleviate) symptoms.\n\nAbout Elizabeth: Elizabeth is a third year psychiatry resident at the University of Michigan, set to begin a fellowship in Child and Adolescent Psychiatry in July. In addition to anxiety disorders, her professional interests include psychotic disorders and increasing mental health awareness.", "source": "Facebook", "url": "https://www.facebook.com/events/1685499618329372/"}, {"date": "2016-01-21T19:30:00-05:00", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "source": "Facebook", "url": "https://www.facebook.com/events/1620983154780471/"}, {"date": "2016-01-22T19:30:00-05:00", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "source": "Facebook", "url": "https://www.facebook.com/events/1620983154780471/"}, {"date": "2016-01-22T20:00:00-05:00", "name": "Chamber Music Society of Lincoln Center", "description": "Friday, January 22, 2016, 8:00 pm\nRackham Auditorium\n\nThe Chamber Music Society of Lincoln Center presents chamber music of every instrumentation, style, and historical period. The six musicians performing in this concert include violinist Benjamin Beilman, an Ann Arbor native whose career has been burnished by a series of major awards recognizing his extraordinary musical talent. \n\nMore info: http://ums.org/performance/chamber-music-society-of-lincoln-center", "source": "Facebook", "url": "https://www.facebook.com/events/1453480484950039/"}, {"date": "2016-01-22T20:00:00-05:00", "name": "Young Jean Lee Theater Company: Straight White Men", "description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "source": "Facebook", "url": "https://www.facebook.com/events/1452156068412417/"}, {"date": "2016-01-22T20:00:00-05:00", "name": "Pointless Improv with Demon Death Stab and GC", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: \"Demon Death Stab\" starring Julia Schroeder, James Quesada, Nuverre Naami, Aaron Mondry, Steve Vagts, Travis Pelto, Anna Imesch, and Andy Reid. \n\nGroup 2: \"GC\" With a very serious approach to very ridiculous things, the mission of Demon Death Stab is to say everything with a straight face. Starring Garrett Fuller and Jeremy Conn\n\nGroup 3: \"The League of Pointless Improvisers\" starring Corene Ford, Julia Schroeder, Matthew Flickinger, James Quesada, and Steve Oliver", "source": "Facebook", "url": "https://www.facebook.com/events/432472853610644/"}, {"date": "2016-01-23T11:00:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "source": "Facebook", "url": "https://www.facebook.com/events/1657867854492206/"}, {"date": "2016-01-23T11:30:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Ann Arbor Restaurant Week and Food Gatherers are collaborating on a fundraiser this year! Participating restaurants will donate a portion of the sales of a select menu item to Food Gatherers. Look for the Food Gatherers logo to find out which restaurants are participating.\n\nRESTAURANT WEEK MENU\nSelect one dish from each course\nLunch $15 per person plus tax and gratuity\nDinner $28 per person plus tax and gratuity\n\n- first course -\nTomato Basil Bisque\nparmesan croutons\nor\nRoasted Pear And Spiced Pecan Salad\nmixed greens, roasted pear, spiced pecans, crumbled bleu cheese, Michigan dried cherries, whole grain mustard vinaigrette\n\n- second course -\nMacadamia Crusted Mahi-Mahi \nwith ginger beurre-blanc coriander rice and seasonal vegetables\nor\n10oz. Prime Rib\nwith roasted garlic mashed potatoes and house made au jus\n\n- dessert -\nCarrot Cake\nor\nChocolate Chip Cookie Sundae \nwith vanilla ice cream\n\nProceeds from select wines will be donated to Food Gatherers. Ask your server for details.", "source": "Facebook", "url": "https://www.facebook.com/events/992259070830553/"}, {"date": "2016-01-23T12:30:00-05:00", "name": "Birdhouse Make-N-Take", "description": "In this kid friendly workshop you will build a birdhouse suitable for chickadees, nuthatches, downy woodpeckers and other small birds. Interactive instruction regarding wood, tools, and safety will be followed by guided use of a hand saw, rasp, power drill and hammer to assemble your birdhouse. We will end the workshop with finishing options that provide healthy homes for birds.\n\nCost is $45. This includes materials, tools, and instruction for one Birdhouse. No prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.\n\nSign up here: http://www.supersaas.com/schedule/makerworks/CheckOut", "source": "Facebook", "url": "https://www.facebook.com/events/1643307065933386/"}, {"date": "2016-01-23T20:00:00-05:00", "name": "Young Jean Lee Theater Company: Straight White Men", "description": "January 22-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nWhen Ed and his three adult sons come together to celebrate Christmas, they enjoy cheerful trash-talking, pranks, and takeout Chinese. Then they confront a problem that even being a happy family can’t solve: when identity matters and privilege is problematic, what is the value of being a straight white man? “A compassionate study of one man’s uneasy search for meaning, and his discovery that, in the world of straight white men, failure may be acceptable, but being content with a disappointed life is most definitely not.” (New York Times)\n\nMore info: http://ums.org/performance/straight-white-men/", "source": "Facebook", "url": "https://www.facebook.com/events/1452156068412417/"}, {"date": "2016-01-23T20:00:00-05:00", "name": "Pointless Improv with Javelin and Question Marky-Mark", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Javelin\" starring Bob Wieck, Gary Lehman, and James Quesada\n\nGroup 2: \"Question Marky-Mark\" starring Aaron Johnstone, Amber Hunt, Travis Pelto, RJ Cach, Erik Heilner, and Jacob Russell\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Heather Sejnowski, Mitch Socia, Jacob Russell, Emily Engelhart, and Erik Heilner", "source": "Facebook", "url": "https://www.facebook.com/events/144703845905368/"}, {"date": "2016-01-23T21:00:00-05:00", "name": "Matthew Dear (DJ Set) 1/23/16 @ Blind Pig - Ann Arbor", "description": "Sat. January 23 | 9pm | 18+ | $15 Cover\n\nMatthew Dear - Depending on whom you ask, Matthew Dear is a DJ, a dance-music producer, an experimental pop artist, a bandleader. He co-founded both Ghostly International and its dancefloor offshoot, Spectral Sound. He’s had remixes commissioned by The XX, Charlotte Gainsbourg, Spoon, Hot Chip, The Postal Service, and Chemical Brothers; He’s made mixes for Get Physicals Body Language and Fabric mix series. He maintains four aliases (Audion, False, Jabberjaw, and Matthew Dear), each with its own style and distinct visual identity. He straddles multiple musical worlds and belongs to none and he’s just hitting his stride.\n\nMatthew Dear’s 2003 full-length debut, Leave Luck to Heaven, is a suite of sparse, wickedly funky house laced with Dear’s deep, distinctive vocals, and includes the much-loved single Dog Days (voted one of Pitchforks Top 100 Songs of the Decade). The record was met with rapturous acclaim from both the dance-music establishment and the critical press, including a four-star review in Rolling Stone. The 2007 follow-up, Asa Breed, is a considerable departure from Heavens dancefloor excursions, incorporating the polyrhythms of Afrobeat, the irreverent pop sensibilities of Brian Eno, and the austere beauty of Krautrock. More four-stars reviews followed, and Dear subsequently began touring with a live three-piece band, Matthew Dear’s Big Hands, in which Dear acted as frontman, commanding the stage with a Bryan Ferry-like swagger and a gentlemans grace.\n\n2010 saw the release of Dear’s watershed third album, Black City, a darkly playful sound-world that envelops the listener like the arms of a malevolent lover. Black City was met with near-unanimous critical praise, earning top marks from Mojo, Uncut, Q, URB, and the Village Voice, ending up on countless year-end lists, and earning Pitchfork’s coveted Best New Music nod. A worldwide tour followed, in which Dear and a newly expanded band continued to hone their live chops with vicious focus.\n\nMatthew Dear’s latest full-length, 2012’s Beams, is both a drastic departure from and worthy successor to Black City’s gothic masterwork. A suite of weird, wild, and queasily optimistic rhythm-driven pop songs, Beams is the latest chapter in the continuing evolution of one of music’s most fascinating minds. After over a decade of exploring pops outer limits, Matthew Dear now inhabits a rarified corner of the musical universe: no longer tethered to any one genre, respected by his peers, and blessed with a bottomless well of creative energy. Now is Matthew Dear’s moment, and it sounds like nothing else.\n\nOn stage, Matthew Dear performs with a multi-pieced live band, unraveling the tightly wound album tracks into kaleidoscopic walls of sound. They have supported Interpol, Hot Chip and Depeche Mode on their world tours, and have performed sold-out shows from London to New York City.", "source": "Facebook", "url": "https://www.facebook.com/events/643718722398474/"}, {"date": "2016-01-23T22:30:00-05:00", "name": "Pointless Improv with Question Marky-Mark and Javelin", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Question Marky-Mark\" starring Aaron Johnstone, Amber Hunt, Travis Pelto, RJ Cach, Erik Heilner, and Jacob Russell\n\nGroup 2: \"Javelin\" starring Bob Wieck, Gary Lehman, and James Quesada\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Heather Sejnowski, Mitch Socia, Jacob Russell, Emily Engelhart, and Erik Heilner", "source": "Facebook", "url": "https://www.facebook.com/events/804289409699011/"}, {"date": "2016-01-24T15:00:00-05:00", "name": "Meet Authors Jack Dempsey & Brian James Egen for a Discussion & Signing of 'Michigan at Antietam'", "description": "America's single bloodiest day was at the Battle of Antietam, and Michigan played a prominent role. Discover the state's connections to the Lost Order, one of the Civil War's greatest mysteries. Explore George A. Custer's role as a staff officer in combat. Mourn the extraordinary losses Michiganders suffered, including one regiment losing nearly half its strength at the epicenter of the battle. The Wolverine State's contributions to secure the Union and enable the Emancipation Proclamation are vast and worthy of a monument on the battlefield. Authors Jack Dempsey and Brian James Egen provide research and analysis that shed new insights on the role of Michigan soldiers and civilians during the epic struggle.\n\nJack Dempsey is a lawyer and Michigan native. He co-founded and is the president of the Michigan Civil War Association, which is dedicated to erecting a Michigan monument at the Antietam National Battlefield. Jack is president of the Michigan Historical Commission, board member of the Michigan History Foundation and a member of the Michigan Historic Preservation Network, the Abraham Lincoln Civil War Roundtable, the Civil War Trust, Preservation Detroit, and runs the Michigan Civil War Blog.\n\nBrian James Egen is executive producer at the Henry Ford and a Michigan native. He is a co-founder of the Michigan Civil War Association, chairman of the Michigan Civil War Sesquicentennial Committee and member of the Michigan Historical Commission, Monroe County Historical Commission and Commission on the Environment, City of Monroe. Brian is an award-winning director for an independent short film and has worked on several National Park Service and historic site Civil War documentaries.", "source": "Facebook", "url": "https://www.facebook.com/events/1665558407060284/"}, {"date": "2016-01-24T18:30:00-05:00", "name": "Kelsey Lutz & Sean Gavin - In Concert", "description": "Strayaway Child Concert Series is proud to present two natives of Michigan's traditional Irish music community, for an afternoon of of tunes on flute, fiddle, and uilleann pipes!\n\n***6:30pm start time***\n\nGeneral admission - $15\nStudents - $12\nKids under 10 get in free\n\nJoin us at Conor O'Neill's beautiful Celtic Room for this show. Dinner and drinks can be ordered during the performance, and parking is FREE. \n\n\nWorkshops sponsored by Detroit IMA with both Kelsey (for fiddle) and Sean (for uilleann pipes) will be available- information will be provided soon!\n\nKelsey Lutz grew up in Ann Arbor, MI where she developed an interest in the fiddle at a very young age. She began studying with Detroit stalwart, Co. Clare fiddler Mick Gavin, at the age of nine. Encouraged by Mick, she traveled to Ireland numerous times, where she enjoyed further opportunities to play with and learn from the many fantastic musicians that country has to offer. She's also been fortunate to learn from great players on this side of the Atlantic as well, such as Seamus Connolly and Brian Conway among many others. Kelsey moved to Chicago in 2013, where she quickly became part of the city's vibrant music scene. She is now an accomplished teacher and performer, playing regularly with the Crossroads Ceili band. She also enjoys playing at local sessions and ceilis, as well as traveling to perform throughout the United States. \n\nSean Gavin’s playing on the flute and uilleann pipes reflects his lifelong immersion in and love for traditional Irish music. Encouraged by his father, Clare fiddler Mick Gavin, Sean played a variety of  instruments until settling on the flute at age eleven. He was inspired by Scariff flute player Leo MacNamara who moved to Sean's hometown of Detroit in the late 1990s. Not long after, he began work on the uilleann pipes with late teacher Al Purcell—himself a student of famed piper Leo Rowsome. Currently residing in Chicago, Sean has had the great fortune to spend time with Sligo flute legend Kevin Henry. Sean is a member of the critically acclaimed groups Bua and NicGaviskey and is active in the Irish music community of Chicago where he performs and teaches regularly.", "source": "Facebook", "url": "https://www.facebook.com/events/525458954288600/"}, {"date": "2016-01-24T19:30:00-05:00", "name": "Young Jean Lee’s Theater Company: Untitled Feminist Show", "description": "January 21-23\nPower Center\n\n“Young Jean Lee is, hands down, the most adventurous downtown playwright of her generation.” (New York Times)\n\nFor the first time ever, this week showcases Young Jean Lee’s two most recent theatrical essays on gender and identity in repertory and in conversation with one another — and performed across the street from each other in the Power Center and Lydia Mendelssohn Theatre, with the opportunity to see both works in a single day.\n\nSix utterly charismatic stars of the downtown theater, dance, cabaret, and burlesque worlds perform a fully nude, wordless celebration of identity. This exhilarating work uses a dizzying array of modes to shake up gender norms through movement and music, and to express ideas about conventional and unconventional roles and expectations. Full of paradoxes and juxtapositions of the best kind, the performance features comic vignettes, evocative video images, and contemporary dance.\n\nWith the absence of words — and clothes — what inhabits the stage is a series of ideas: those of the fiercely talented Young Jean Lee, the performers, and the audience members. Untitled Feminist Show constantly surprises, twisting and turning in hilarious ways that both reveal and challenge the viewers’ assumptions about gender politics. “One of the more moving and imaginative works I have ever seen on the American stage.” (New Yorker)\n\nUntitled Feminist Show is recommended for mature audiences; performance contains (a lot of) nudity.\n\nMore info: http://ums.org/performance/untitled-feminist-show", "source": "Facebook", "url": "https://www.facebook.com/events/1620983154780471/"}, {"date": "2016-01-26T10:00:00-05:00", "name": "Story Time with Ieva", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "source": "Facebook", "url": "https://www.facebook.com/events/1661856117430745/"}, {"date": "2016-01-27T11:00:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "source": "Facebook", "url": "https://www.facebook.com/events/1657867854492206/"}, {"date": "2016-01-27T11:30:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Ann Arbor Restaurant Week and Food Gatherers are collaborating on a fundraiser this year! Participating restaurants will donate a portion of the sales of a select menu item to Food Gatherers. Look for the Food Gatherers logo to find out which restaurants are participating.\n\nRESTAURANT WEEK MENU\nSelect one dish from each course\nLunch $15 per person plus tax and gratuity\nDinner $28 per person plus tax and gratuity\n\n- first course -\nTomato Basil Bisque\nparmesan croutons\nor\nRoasted Pear And Spiced Pecan Salad\nmixed greens, roasted pear, spiced pecans, crumbled bleu cheese, Michigan dried cherries, whole grain mustard vinaigrette\n\n- second course -\nMacadamia Crusted Mahi-Mahi \nwith ginger beurre-blanc coriander rice and seasonal vegetables\nor\n10oz. Prime Rib\nwith roasted garlic mashed potatoes and house made au jus\n\n- dessert -\nCarrot Cake\nor\nChocolate Chip Cookie Sundae \nwith vanilla ice cream\n\nProceeds from select wines will be donated to Food Gatherers. Ask your server for details.", "source": "Facebook", "url": "https://www.facebook.com/events/992259070830553/"}, {"date": "2016-01-27T11:45:00-05:00", "name": "Micro Moments - with Mike Lorenc from Google", "description": "Mobile has forever changed the way we live, and it’s forever changed what we expect of brands. It’s fractured the consumer journey into hundreds of real-time, intent-driven micro-moments. Each one is a critical opportunity for brands to shape our decisions and preferences.\n\nCome listen to Google’s own Mike Lorenc as he explains the “Micro Moments” concept and shows examples of advertisers large and small embracing, and winning in this new Mobile-First, Intent-Based world of Marketing.", "source": "Facebook", "url": "https://www.facebook.com/events/1509387692697866/"}, {"date": "2016-01-27T19:00:00-05:00", "name": "Meet Ann Arbor Author R.J. Fox for a Discussion & Signing of His Memoir 'Love & Vodka: My Surreal Adventures in Ukraine", "description": "“Love & Vodka” is a unique hybrid of travel memoir and love story that seamlessly blends outlandish humor, cultural insight and a steady stream of romance. Anyone who has traveled abroad or is considering traveling will certainly connect to this book. The same can be said for anyone who is experiencing new love or pining for a love of their own. “Love & Vodka” is a faithful reminder that there is someone out there for everyone. The world is large and rife with potential; one just needs to be willing to take a gamble and explore the possibilities that exist.\n\nR.J. Fox is the award-winning writer of several short stories, plays, poems, and fifteen feature-length screenplays. He is also the writer and director of several award-winning short films. In addition his writing and filmmaking exploits—not to mention his talents as a saxophonist—Fox teaches English and Video Production in the Ann Arbor Public Schools where he uses his own dream of making movies to inspire his students to follow their own dreams", "source": "Facebook", "url": "https://www.facebook.com/events/201303576876889/"}, {"date": "2016-01-27T19:30:00-05:00", "name": "Ms. Lisa Fischer and Grand Baton", "description": "Wednesday, January 27, 2016, 7:30 pm\nMichigan Theater\n\nBy any measure of talent and accomplishment, Lisa Fischer is a superstar. Yet, if you do not know her name, it’s likely because she has spent the past 20 years as a backup singer for the Rolling Stones, Sting, Chris Botti, and countless others. Her name may not be on the marquee, but she doesn’t care. Her astonishing range, spot-on intonation, mastery of the stage, and infectious sweet smile make her the go-to singer for the likes of Tina Turner, Chaka Khan, Beyoncé, Bobby McFerrin, Lou Reed, Dionne Warwick, Aretha Franklin, and a host of others. As one of the top session and backup singers, she’s featured in the Oscar-winning documentary 20 Feet from Stardom and celebrated for her live concert duets with Mick Jagger during “Gimme Shelter” that have also received millions of hits on YouTube. After winning Grammy Awards for “Best Female R&B Performance” (1992) and “Best Music Film” (2015), she has decided to move forward from being a backup singer, putting together her own band and claiming her well-deserved place center stage. \n\nMore info: http://ums.org/performance/ms-lisa-fischer-and-grand-baton", "source": "Facebook", "url": "https://www.facebook.com/events/1020565857968750/"}, {"date": "2016-01-29T20:00:00-05:00", "name": "Wine, Women, and Song XIV", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "source": "Facebook", "url": "https://www.facebook.com/events/1673489232898555/"}, {"date": "2016-01-29T21:00:00-05:00", "name": "Protomartyr w/ Rebel Kind & Deadbeat Beat 1/29/16 @ Blind Pig - Ann Arbor", "description": "Friday, January 29 | 9:00pm | 18+ | $12 adv./ $14 day of\n\nProtomartyr (https://www.facebook.com/protomartyr)\nwith: Rebel Kind & Deadbeat Beat\n\nShow info: http://www.blindpigmusic.com/calendar.html#!/events/591", "source": "Facebook", "url": "https://www.facebook.com/events/1070813002942671/"}, {"date": "2016-01-30T09:00:00-05:00", "name": "Intro to VCarve Pro", "description": "Join Thea Eck, expert ShopBot instructor with over 5 years of experience, and learn everything you need to know about CAD designing and CAM toolpathing.\n\nThis 1-day workshop is intended for new and beginner VCarve 8.0 users. VCarve 8.0 is the official ShopBot Tools Inc. software to be used with the ShopBot CNC Router and other milling machines.\n\nParticipants will learn how to utilize VCarve 8.0’s drawing tools (the CAD) such as creating shapes, editing nodes, adding text, and offsets. They will then learn the 3 basic toolpaths (the CAM) as well as the tool database. Concepts behind CAD and CAM such as feed and speed rates will also be discussed.\n\nThis is a hands-on, project-based workshop. Each person will have their own computer station and take home workbook.\n\nThere will be a 45-minute lunch break, taken on one’s own, at noon, and two 10-minute breaks. $100.\n\nThere are only 6 spaces available in this class, so give us a call to reserve your spot today! Reach us at (734) 222-4911 or send an email to frontdesk@maker-works.com.\n\nSaturday, January 30, 2016\n\n9am – 4:30pm", "source": "Facebook", "url": "https://www.facebook.com/events/145062129201124/"}, {"date": "2016-01-30T12:00:00-05:00", "name": "Tactical Drinking", "description": "Join The Beer Grotto and Vault of Midnight for a day of drinking, gaming, laughter, and a little education. \n\nTimeline of the day - \n12:00 - Meet at Beer Grotto\n12:30 - Beer Tasting Education Starts / Beer Flights Are Served\n12:45 - 2:30 - Socializing / Drinking / Parlor Games\n2:30 - 3:30 - Dinner Break\n3:30 - 6:30 - Play All The Games at Vault of Midnight\n6:30 - Call A Cab and Let Vault Staff Clean The Shop\n\n\nTickets will be $15.00 and purchased at Vault of Midnight.\n\nThis price includes a tasting flight at Beer Grotto lead by one of their Well Seasoned Beer Drinkers, access to the legendary Vault of Midnight Game Library, and some wonderful company with fellow gaming enthusiasts.", "source": "Facebook", "url": "https://www.facebook.com/events/1710064412573793/"}, {"date": "2016-01-30T20:00:00-05:00", "name": "Wine, Women, and Song XIV", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "source": "Facebook", "url": "https://www.facebook.com/events/1673489232898555/"}, {"date": "2016-01-31T17:00:00-05:00", "name": "Grand Re-Opening", "description": "We expanded the bar, rebuilt the bathrooms, knocked down walls, brought in some new tables and added a little fresh paint to revive and refresh the ABC that our fans have loved for 20 years.  Topping off the aesthetics with a brand new menu that is sure to please a variety of palates.  Same great beer, same great vibe. \n\nWe would love to see our friends, family and customers - new and old - as we celebrate the official re-opening of ABC. We are celebrating with a throwback beer from the original recipe book, live music by Heather Black Project at 5pm and late night happy hour prices from 8pm -close.\n\nWe can't wait to show off our new digs!", "source": "Facebook", "url": "https://www.facebook.com/events/575785055912612/"}, {"date": "2016-02-01T11:00:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "source": "Facebook", "url": "https://www.facebook.com/events/1657867854492206/"}, {"date": "2016-02-01T11:30:00-05:00", "name": "Ann Arbor Restaurant Week", "description": "Ann Arbor Restaurant Week and Food Gatherers are collaborating on a fundraiser this year! Participating restaurants will donate a portion of the sales of a select menu item to Food Gatherers. Look for the Food Gatherers logo to find out which restaurants are participating.\n\nRESTAURANT WEEK MENU\nSelect one dish from each course\nLunch $15 per person plus tax and gratuity\nDinner $28 per person plus tax and gratuity\n\n- first course -\nTomato Basil Bisque\nparmesan croutons\nor\nRoasted Pear And Spiced Pecan Salad\nmixed greens, roasted pear, spiced pecans, crumbled bleu cheese, Michigan dried cherries, whole grain mustard vinaigrette\n\n- second course -\nMacadamia Crusted Mahi-Mahi \nwith ginger beurre-blanc coriander rice and seasonal vegetables\nor\n10oz. Prime Rib\nwith roasted garlic mashed potatoes and house made au jus\n\n- dessert -\nCarrot Cake\nor\nChocolate Chip Cookie Sundae \nwith vanilla ice cream\n\nProceeds from select wines will be donated to Food Gatherers. Ask your server for details.", "source": "Facebook", "url": "https://www.facebook.com/events/992259070830553/"}, {"date": "2016-02-01T20:00:00-05:00", "name": "Wine, Women, and Song XIV", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "source": "Facebook", "url": "https://www.facebook.com/events/1673489232898555/"}, {"date": "2016-02-02T10:00:00-05:00", "name": "Story Time with Ieva", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "source": "Facebook", "url": "https://www.facebook.com/events/494458880715739/"}, {"date": "2016-02-02T19:30:00-05:00", "name": "Tanya Tagaq in concert with Nanook of the North", "description": "Tuesday, February 2, 2016, 7:30 pm\nLydia Mendelssohn Theatre\n\nWith Tanya Tagaq, ancient meets modern in provocative, powerful ways. This spellbinding performance features the Inuit throat singer accompanying a screening of Nanook of the North (1922) with a live score. Tagaq’s mixed-media performance reclaims the controversial classic — considered the first feature-length documentary — capturing the sense of the sound of the Arctic spaces shown in the film and adding tremendous feeling and depth to what is a complex mix of beautiful representations and racially charged clichés.\n\nTanya Tagaq’s music is unnerving and exquisite, rooted in Inuit throat singing, but also influenced by electronica, industrial, and metal influences. It is a style that she has perfected with collaborators such as Björk and that reminds some of Meredith Monk’s vocal innovations. Winner of the 2014 Polaris Prize for “Album of the Year” (she beat out Drake and Arcade Fire), Tanya Tagaq makes her UMS debut in this one-night only event. “Nobody, anywhere, sounds like she does.” (Globe and Mail)\n\nMore info: http://ums.org/performance/tanya-tagaq/", "source": "Facebook", "url": "https://www.facebook.com/events/1155115267866605/"}, {"date": "2016-02-04T19:00:00-05:00", "name": "Resource Management Sustainability Forum", "description": "Come join the conversation about sustainability in Ann Arbor! The City and the Ann Arbor District Library are hosting the fifth annual Sustainable Ann Arbor series.  A think tank of local stakeholders, including community organizations, local government staff, businesses, and residents will join the public to discuss local sustainability efforts and challenges in our community. \n\nThe series will include four events with each focusing on a different element of sustainability from Ann Arbor's sustainability framework (www.a2gov.org/sustainability). The events will be held from 7 p.m. to 8:30 p.m. in the Ann Arbor District Main Library at 343 South Fifth Ave on the first Thursday of January, February, March, and April of 2016. \n\nEach event will include a series of short presentations followed by a question and answer session. The forums offered an opportunity to learn more about sustainability in the Ann Arbor community. If you have comments on the forums or suggestions, please send them to sustainability@a2gov.org or call Sustainability Associate Emily Drennen at 734.794.6430 x43726.\n\nFebruary 4, 2016 – Resource Management, including discussions about improving Ann Arbor's waste diversion rate and communitywide efforts to reduce different waste streams. Speakers will include:\n\n-Roger Bowser, Zingerman's \n-Eileen Spring, Food Gatherers\n-Noelle Bowman, Washtenaw County\n-Tracy Artley, UofM Sustainability\n-Matt Naud, Environmental Coordinator, City of Ann Arbor", "source": "Facebook", "url": "https://www.facebook.com/events/157869774578366/"}, {"date": "2016-02-04T20:00:00-05:00", "name": "Wine, Women, and Song XIV", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "source": "Facebook", "url": "https://www.facebook.com/events/1673489232898555/"}, {"date": "2016-02-05T18:00:00-05:00", "name": "Mid-West Furniture ZOKU Exhibition", "description": "Co-curated by John DeHoog and Ray Wetzel\n\nOPENING RECEPTION: FRIDAY, FEBRUARY 5, FROM 6:00 TO 9:00 PM\n\nZoku, in Japanese means a loosely affiliated tribe or clan.  The title, Mid-West Furniture Zoku, refers to our regional clan of furniture makers, designers, and educators.\n\nThis exhibition (at the 117 Gallery from February 5 to March 5) is but a small sampling of a much larger group of like-minded artists, designers, and educators working in the context of furniture. The works in the show represent a broad range of techniques, styles, and personal sensibilities, while at the same time demonstrating universal respect for materials, and deep interest in the integration of form and function. On display are objects that are familiar on one level, yet poke holes in our conventional views of how furniture should look and what role furniture plays in our daily lives.\n\nFEATURED ARTISTS:\n\nAaron Blendowski •  Maxwell Davis •  John DeHoog • Laura Earle  • Nicole Hodsdon • Katie Hudnall • Chad Jenson •  Melissa Judd • Andy Kem  • Bob Marsh • Brian Nelson • Michael Neville • Matt O’Brien • Nick Stawinski •  Jim Stevens • Travis Taylor •  Marco Terenzi • Colin Tury •  Ray Wetzel \n\nJoin us for the Opening Reception on Friday, February 5, from 6:00 to 9:00 pm at the 117 Gallery in the Ann Arbor Art Center. This is a free, drop-in event! \n\n---------\n\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC \nMid-West Furniture ZOKU Exhibition is presented by Three Chairs Co.", "source": "Facebook", "url": "https://www.facebook.com/events/576089435876883/"}, {"date": "2016-02-05T20:00:00-05:00", "name": "Taylor Mac: A 24-Decade History of American Popular Music: 1960s–1980s", "description": "Friday, February 5, 2016, 8:00 pm\nLydia Mendelssohn Theatre\n\nTaylor Mac is equal parts bedazzled shaman, searing social critic, radical angel, and Elizabethan fool. A critical darling of the New York downtown cabaret scene, he is beloved for his iconic beauty, disarming vulnerability, and soaring spirit. His 24-Decade History of Popular Music will eventually become an epic show performed over 24 continuous hours; in Ann Arbor, Taylor will focus on the 1960s, 70s, and 80s, connecting the decades to the vibrant music scene in Detroit. “Fabulousness can come in many forms, and Taylor Mac seems intent on assuming every one of them.” (New York Times) A UMS co-commission. \n\nMore info: http://ums.org/performance/taylor-mac-a-24-decade-history-of-american-popular-music-1960s-1980s/", "source": "Facebook", "url": "https://www.facebook.com/events/1594841967471096/"}, {"date": "2016-02-06T13:00:00-05:00", "name": "Ultimate Build-A-Toy", "description": "Back by popular demand, the legendary Vault of Midnight Build-A-Toy-Vaganza. Spend an afternoon assembling and breathing to life the action figure of your dreams/nightmares. Craft supplies and expertise will be provided, all for a measly $10 entry fee.\n\nTICKETS ARE ON SALE NOW! ONLY 30 SEATS AVAILABLE!\n\nThe event will be run and guided by Vault of Midnight Owner and Proprietor Curtis J Sullivan. He'll walk us through the proceedings with a gentle yet stern hand. Some of the highlights he'll be presenting and teaching include:\n\n- Planning out your custom toy! The Key To Success is Planning!\n- Learn how to use super glue the \"Curtis way!\"\n- How to properly use a hobby knife and avoid serious injury to yourself or others.\n- Painting Your Creation 101\n- Best Practices for taking a selfie with your new creation.\n\nBring the kids, bring your friends, and spend a day building with your hands and MIND. Don't miss it.", "source": "Facebook", "url": "https://www.facebook.com/events/784692071662519/"}, {"date": "2016-02-06T15:00:00-05:00", "name": "Meet Photographer J. Gordon Rodwan & Author John G. Rodwan, Jr for a Discussion & Signing of 'Detroit Is: an essay in photographs'", "description": "Detroit Is: An Essay in Photographs offers a very personal depiction of an often misrepresented and maligned place. It presents multiple, diverse, contrasting aspects of the complex city.\n\nJ. Gordon Rodwan’s photographs show sides of the city that many people – residents and non residents alike – often miss rather than reproducing images already widely seen. They don’t ignore the dilapidated parts of the city, but they don’t fetishise those elements either. Instead, Rodwan juxtaposes them with images capturing efforts to cultivate and sustain creativity and vibrancy in place where too many expect to see only relics or despair. Neither ‘ruin porn’ nor an equally distorted boosterish presentation of only the positive, Detroit Is offers a highly individual look at what it’s like to live in Detroit.\n\nComplementing the photographs are an introductory essay and poems by the photographer’s son, John G. Rodwan, Jr.", "source": "Facebook", "url": "https://www.facebook.com/events/934979649873085/"}, {"date": "2016-02-06T20:00:00-05:00", "name": "Igor Levit, piano", "description": "Saturday, February 6, 2016, 8:00 pm\nHill Auditorium \n\n“His superb live performance confirmed the impression of his recording: A major new pianist has arrived.” (New York Times) Born in 1987, the Russian-German pianist Igor Levit received effusive praise for his two-disc debut album of Beethoven’s late piano sonatas. A relative newcomer to the United States, he makes his UMS debut with this recital appearance. \n\nMore info: http://ums.org/performance/igor-levit/", "source": "Facebook", "url": "https://www.facebook.com/events/1435582513413462/"}, {"date": "2016-02-07T15:00:00-05:00", "name": "Join Us for the Launch Party for Dr. Michael Petty & Fundraiser for HSHV Bountiful Bowls Program", "description": "Help us celebrate Dr. Michael Petty’s release of his new book ‘Dr. Petty’s Pain Relief for Dogs’ and when you join us for this event please if you can bring dry dog or cat food with you for the Humane Society of Huron Valley’s Bountiful Bowls program.  The Bountiful Bowls program is a pet food assistance program that helps people with financial difficulties.  For more information regarding the program go to  bit.ly/1Ywz4TQ\n\nDr. Michael Petty is a veterinarian and pain management specialist. He is the owner of the Arbor Pointe Veterinary Hospital as well as the Animal Pain Center (www.animalpaincenter.com), both in Canton, Michigan. He is the immediate-past president of the International Veterinary Academy of Pain Management and the co-author of the 2014 American Animal Hospital Association Pain Guidelines. A frequent speaker and consultant, Petty has also published articles in veterinary journals and elsewhere. He lives in rural Michigan with his wife and two daughters, two dogs, a cat, and a hedgehog.\n\nYou love your dog, and hate to see him in pain. But you don t want to head to the vet's office for hundreds of dollars worth of tests that might prove useless. Dr. Mike Petty understands this. He's a pain vet working with cutting-edge research to find the best way to relieve your pet's pain. In this book, he guides readers in three critical points:\n\n1.\tHow to determine whether a dog is in pain\n\n2.\tHow to find a veterinarian capable of treating these pain issues.\n\n3.\tWhat treatments are available, and which are worth pursuing and which are not.\n\nDr. Petty offers clear descriptions of the treatments, both traditional and holistic. This guide offers the wisdom and support that dog owners crave in these situations.", "source": "Facebook", "url": "https://www.facebook.com/events/449539918589830/"}, {"date": "2016-02-07T16:00:00-05:00", "name": "25th Anniversary Benefit w/ PROJECT TRio!", "description": "PROJECt Trio is coming to Ann Arbor to help us celebrate our 25th Anniversary!  Concert to include collaborative performances with our Classical and Jazz Studies students!\n4:00 | Reception and Auction 5:00 | Benefit Concert\nGroup Ticket rates available!", "source": "Facebook", "url": "https://www.facebook.com/events/1016509241723622/"}, {"date": "2016-02-08T19:00:00-05:00", "name": "Garth Greenwell", "description": "Literati welcomes Garth Greenwell, who will read from his debut novel, What Belongs to You, which Publishers Weekly called \"the first great novel of 2016.\"\n\nOn an unseasonably warm autumn day, an American teacher enters a public bathroom beneath Sofia’s National Palace of Culture. There he meets Mitko, a charismatic young hustler, and pays him for sex. He returns to Mitko again and again over the next few months, drawn by hunger and loneliness and risk, and finds himself ensnared in a relationship in which lust leads to mutual predation, and tenderness can transform into violence. As he struggles to reconcile his longing with the anguish it creates, he’s forced to grapple with his own fraught history, the world of his southern childhood where to be queer was to be a pariah. There are unnerving similarities between his past and the foreign country he finds himself in, a country whose geography and griefs he discovers as he learns more of Mitko’s own narrative, his private history of illness, exploitation, and want.\n\nWhat Belongs to You is a stunning debut novel of desire and its consequences. With lyric intensity and startling eroticism, Garth Greenwell has created an indelible story about the ways in which our pasts and cultures, our scars and shames can shape who we are and determine how we love.\n\n“Garth Greenwell takes us deep inside a specific Bulgarian subculture to examine the universal: the disparity between the uninhibited lives we desire and the bearable lives we choose. I began reading What Belongs to You in admiration; I ended in tears. An exquisite debut.” --Jamie Quatro, author of I Want to Show You More.\n\nGarth Greenwell is the author of Mitko, which won the 2010 Miami University Press Novella Prize and was a finalist for the Edmund White Award for Debut Fiction Award and a Lambda Award. A native of Louisville, Kentucky, he holds graduate degrees from Harvard University and the Iowa Writers’ Workshop, where he was an Arts Fellow. His short fiction has appeared in The Paris Review and A Public Space. What Belongs to You is his first novel.", "source": "Facebook", "url": "https://www.facebook.com/events/538320006348926/"}, {"date": "2016-02-08T20:00:00-05:00", "name": "Wine, Women, and Song XIV", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "source": "Facebook", "url": "https://www.facebook.com/events/1673489232898555/"}, {"date": "2016-02-09T10:00:00-05:00", "name": "Story Time with Ieva", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "source": "Facebook", "url": "https://www.facebook.com/events/201462843528819/"}, {"date": "2016-02-11T19:00:00-05:00", "name": "Beer Tasting: For the Love of Hops", "description": "the style: the American craft beer market has an unfaltering affection for humulus lupulus and so do we. In February, come sample all the IPAs, pale ales, lagers, and other styles that feature your favorite little green cone.\n\nthe event: We'll gather brews worth sampling to bring you a novel and varied experience for your palates. We’ll pair beer samples with an appetizer buffet, provide a program with tasting notes, and top off the night with a door prize drawing.\n\nthe dets: ABC’s monthly tastings run from 7-9 PM on the 2nd Thursday of each month. Tickets are available at the pub or by phone at 734-213-1393. $25 in advance, $30 day of.", "source": "Facebook", "url": "https://www.facebook.com/events/941651205915732/"}, {"date": "2016-02-11T21:00:00-05:00", "name": "Broccoli Samurai w/ Liquid Monk 2/11/16 @ Blind Pig - Ann Arbor", "description": "Thursday, Feb 11 | 9pm | 18+ | $10 Cover\n\nBroccoli Samurai is Cleveland, OH’s premiere jamtronica and EDM project. Broccoli Samurai features Ryan “Bruce” Hodson on keys and synth, Chris Walker on drums and percussion, and Josh Sebo on bass. Broccoli Samurai’s drum and bass influenced, progressive electronica has been thrilling audiences throughout the Midwest, winning the band spots at major events such as Rootwire, The Werk Out, Hyperion Fest, Summerdance, and The Mad Tea Party Jam, as well as direct support, club spots for such notable bands as Boombox, Lotus, Dopapod, Papadosio, Rusted Root, Big Gigantic, Conspirator, O.A.R., and Ozric Tentacles. Broccoli Samurai’s groove is the kind that keeps the crowd moving well into the wee hours of the morning. This band is making big moves and the time to take notice is now. \n\nWith: Liquid Monk\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/570", "source": "Facebook", "url": "https://www.facebook.com/events/1655909208022221/"}, {"date": "2016-02-13T20:00:00-05:00", "name": "Camille A. Brown & Dancers: Black Girl — A Linguistic Play", "description": "Saturday, February 13, 2016, 8:00 pm\nPower Center\n\n“Every aspect of the dance-making here is thoroughly accomplished.” (New York Times) A prolific choreographer who danced with Ronald K. Brown’s Evidence, Rennie Harris’s Puremovement, and the Alvin Ailey American Dance Theater, Camille A. Brown brings her newest work to Ann Arbor for her UMS debut. Black Girl — Linguistic Play speaks to the complexities of carving out a positive identity as a Black female in urban American culture.\n\nIn a world where Black women are often portrayed only in terms of their strength, resiliency, or trauma, this work interrogates these narratives by presenting a fuller spectrum of the black female and the complexities of negotiating in this racially and politically charged world. The work uses elements of African-American social dancing, rhythmic play, and musical compositions to better illustrate who “Black Girl” knows herself to be. Brown’s choreography is “fun, inventive, and watchable.” (Times Square Chronicles) \n\nMore info: http://ums.org/performance/camille-a-brown-dancers/", "source": "Facebook", "url": "https://www.facebook.com/events/368546533344933/"}, {"date": "2016-02-13T20:00:00-05:00", "name": "Wine, Women, and Song XIV", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "source": "Facebook", "url": "https://www.facebook.com/events/1673489232898555/"}, {"date": "2016-02-16T10:00:00-05:00", "name": "Story Time with Ieva", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "source": "Facebook", "url": "https://www.facebook.com/events/1686749728236981/"}, {"date": "2016-02-16T19:30:00-05:00", "name": "Sir András Schiff, piano", "description": "February 16, 18\nRackham Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "source": "Facebook", "url": "https://www.facebook.com/events/442008155980033/"}, {"date": "2016-02-18T18:00:00-05:00", "name": "Artist Talk - MW Furniture ZOKU", "description": "Join curators John DeHoog and Ray Wetzel, with some of the artists of Zoku, to learn about their curatorial process and artworks from the exhibition. Free and open to the public.", "source": "Facebook", "url": "https://www.facebook.com/events/553555484819957/"}, {"date": "2016-02-19T19:00:00-05:00", "name": "Artini 2016", "description": "Don't miss Artini 2016*, which in its 8th edition will once again transform the Downtown Ann Arbor area into a festive competition between the finest bars and restaurants, where the goal is to design the city's most artful martini!\n\nArtini will be on Friday, February 19, from 7:00 to 10:00 pm. Tickets will be for sale on Monday, January 4th for members of the Ann Arbor Art Center and on Wednesday, January 6th for all! As usual tickets will be sold fast, so please make sure you purchase yours as soon as possible.\n\nWHAT IS ARTINI?\n\nArtini is an annual fundraiser hosted by the Ann Arbor Art Center in which local bars and restaurants are invited to compete to create the most artful and innovative martini cocktail. Guests purchase tickets to participate in a fun bar crawl amongst the participating venues and spend the evening walking in Downtown Ann Arbor for the search of the best tasting martini.\n\nPARTICIPATING ARTINI 2016 VENUES INCLUDE:\n\n- Aventura Ann Arbor\n- Babs' Underground Lounge\n- Mélange\n- The Ravens Club\n- Vinology Wine Bar and Restaurant\n- Felix Bistro & Bar\n- Conor O'Neills Ann Arbor\n... and more to come! \n\nThe 2016 winner will be selected by a jury of individuals unaffiliated with our participating venues. These judges include Andy Mohr (Two James, sponsor), Alex Milshteyn (Real Estate Associates, sponsor), Yen Azzaro (of studio Chin-Azzaro), Horace Bomar (long-time Art Center supporter), Jessica Webster (MLive, food critic), and Jorge Avellan (WEMU, reporter).\n\n*Attendees must be 21 or older. Ticket prices are $55.\n\n--------------\n\nArtini 2016 is sponsored by Alex Milshteyn Real Estate Associates\nBeverage sponsor Two James Spirits", "source": "Facebook", "url": "https://www.facebook.com/events/1579264365729837/"}, {"date": "2016-02-19T20:00:00-05:00", "name": "The Triplets of Belleville", "description": "Friday, February 19, 2016, 8:00 pm\nMichigan Theater\n\nA decade after it was first brought to the screen, Benoît Charest revives the music of the Oscar-nominated film The Triplets of Belleville with a remarkable cast of musicians in this silent movie-live concert event. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His near-sighted grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas.\n\nBut the true star of the animated film is the hot jazz score written by Canadian composer Benoît Charest. This screening of the beloved French film transports audiences to the exciting streets of 1920s Paris and Le Jazz Hot.\n\nMore info: http://ums.org/performance/the-triplets-of-belleville/", "source": "Facebook", "url": "https://www.facebook.com/events/1620380161539059/"}, {"date": "2016-02-19T20:00:00-05:00", "name": "Wine, Women, and Song XIV", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "source": "Facebook", "url": "https://www.facebook.com/events/1673489232898555/"}, {"date": "2016-02-19T21:00:00-05:00", "name": "Mustard Plug, The Vulnerable & 1592 2/19/16 @ Blind Pig - Ann Arbor", "description": "Fri. February 19 | 9pm | 18+ | $12 adv./ $14 Day of\n\nMustard Plug with The Vulnerable [https://www.facebook.com/thevulnerable ] &  1592\n\nMustard Plug started out in the punk clubs, basements and dive bars of the Midwest, playing punk-influenced ska music before most people in the U.S. had ever heard of ska. They clung to a DIY work ethic that had been ingrained in them growing up in the 1980′s hardcore punk scene and applied it to everything they would ever do together as a band. Mustard Plug released their first cassette tape themselves (1992′s Skapocalypse Now!), and played constantly to earn enough money to record their first album – 1994′s Big Daddy Mulititude. Their debut full length was released on legendary NYC label Moon Records (home of Toasters, Hepcat, Dance Hall Crashers, and pretty much every other 90′s ska band of note). With their new found national distribution and exposure, the band climbed into their van and performed their music to new fans across North America. Twenty-one years, 1500 shows and 200,000 album sales later, it cannot be denied that the band has surpassed all expectations and permanently staked their claim in contemporary music.\n\nFor their new album, “Can’t Contain It”, Mustard Plug have returned to the DIY blueprint that the band was built upon, while at the same time embracing all the school of hard knocks craftsmanship and wisdom that the band has earned along the way. The band spent the last several years writing new material that was informed by 22 years of songwriting experience while retaining the youthful energy that has endeared them to their fans. They tracked the record at bassist Rick Johnson’s Cold War Studios, giving them the flexibility to experiment and add new layers and dimensions that were not possible given the time constraints on their previous recordings. Many of their musician friends(Dan Potthast, Sean Bonnett, Mark Petz, Corey Ruffin) were tapped to contribute, creating a denser, more intricate sound.\n\nOnce the recording process for Can’t Contain It was complete, the band turned to their fans to help finance the mixing and production of their record. Their Kickstarter campaign surpassed all their expectations, doubling their initial goal and re-confirming the support and love of their audience. The tracks were then sent to be mixed at Bill Stevenson’s Blasting Room Studios where Mustard Plug had recorded 3 of their previous albums (including 1997’s breakthrough “Evildoers Beware” and 2007’s “In Black and White”). The result is possibly their most diverse and best record to date.\n\nAfter tapping their friends and fans to help out with the recording, the band turned to more of their posse to collaborate on the artwork. Underground icon Jeff Rosenstock designed the album packaging, while noted artists Craig Horkey and Larry Kole created alternative limited edition album covers and posters. The final piece came together when at the last minute, No Idea record founder, Var Thelin heard the record and offered to partner with the band on its release. Mustard Plug is excited to be given the opportunity to collaborate with a label known for its’ strong punk rock ethics and underground credibility.\n\nUltimately, this release is about the community Mustard Plug has built during its’ 22 year existence. Coming full circle back to the DIY scene and the community that the were born out of has helped them to put out their best record to date.", "source": "Facebook", "url": "https://www.facebook.com/events/510894402424469/"}, {"date": "2016-02-20T07:30:00-05:00", "name": "Wolverine State Ski & Snowboard Trip", "description": "Tell your friends! Tell your family! Tell your dog! (But don't bring your dog!) It's the Second Annual Wolverine State Ski & Snowboard trip! \n\nThe rundown: Meet at the brewery (2019 W. Stadium, Ann Arbor, MI) at 7:30 am on Saturday, February 20th for bagels and to grab the 2016 edition of the Ski & Snowboard Club shirt! Bus departs from the brewery at 8 am and arrives at Alpine Valley around 9 am. You'll receive your lift ticket as you exit the bus, and if you're renting equipment, you'll also receive a rental slip (separate payment for equipment rental is required, but you get a group discount for coming with the brewery!) Meet back at the bus between 5 and 5:30, bus departs after final head count at 5:45 pm. \n\nTrip cost: $65 (includes bagels at the brewery, transportation to and from Alpine Valley, an all-day 9am - 5:30 pm lift ticket, a commemorative t-shirt, and beer on the bus to and from Alpine Valley. There will be room on the bus to store your equipment! \n\nEquipment rental: $21 for skis or snowboard. \n\nPlease use the eventbrite link to register! Remember to select your t-shirt size and indicate whether or not you will require rentals! You will have the option to pay for rentals on the eventbrite page. \n\nSeating is limited to 50 participants, so get on it!", "source": "Facebook", "url": "https://www.facebook.com/events/189689224712860/"}, {"date": "2016-02-20T20:00:00-05:00", "name": "Sir András Schiff, piano", "description": "February 20\nHill Auditorium\n\nOf “The Last Sonatas,” Sir András Schiff says, “’Alle guten Dinge sind drei’ — all good things are three, according to this German proverb that must have been well-known to Haydn, Mozart, Beethoven, and Schubert. Introducing their last three piano sonatas in three concerts is a fascinating project that can demonstrate the connections, similarities, and differences among these composers. The sonata form is one of the greatest inventions in Western music, and it is inexhaustible. With our four masters of Viennese classicism it reached an unprecedented height that has never been equaled, let alone surpassed.”\n\nUMS is thrilled to bring all three concerts of “The Last Sonatas” to Ann Arbor, presented over the course of a week in Rackham and Hill Auditoriums. “So successful was the evening that the critic can only throw up his hands, wish you had been there, and quote Ira Gershwin’s endearing tombstone inscription: ‘Words Fail Me.’” (New York Times)\n\nMore info: http://ums.org/performance/sir-andras-schiff-piano", "source": "Facebook", "url": "https://www.facebook.com/events/1611931089050428/"}, {"date": "2016-02-20T21:30:00-05:00", "name": "Tunde Olaniran w/ Pocket Candies 2/20/16 @ Blind Pig - Ann Arbor", "description": "Sat. February 20 | 9:30pm | 18+ | $10 Cover\n\nTunde Olaniran with: Pocket Candies\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/624", "source": "Facebook", "url": "https://www.facebook.com/events/562101443944037/"}, {"date": "2016-02-21T15:00:00-05:00", "name": "Meet Author Kristen Remenar & Illustrator Matt Faulkner for a Discussion & Signing of Their New Picture Book, 'Groundhog's Dilemma'", "description": "After Groundhog announces six more weeks of winter, half his animal friends are disappointed, while the other half are excited. Each animal asks Groundhog to make his prediction in their favor the following year. Rather than being truthful about the fact that he just “calls it like he sees it,” he leads them to believe he can control the weather, accepting their gifts of food and favor. On the next Groundhog Day, he finally admits he made promises he couldn’t keep because he was trying to please everyone and makes amends.\n\nKristen Remenar is a children's librarian, writer, teacher, and national speaker on literacy. She is married to author/illustrator Matt Faulkner. This is her first picture book.\n\nA graduate of Rhode Island School of Design, Matt Faulkner has written and illustrated a number of children's books. His work has won wide praise for its humor, exuberance and sensitivity. In addition, he is a contributing illustrator to such national periodicals as The New York Times, The Wall Street Journal and Forbes. Matt is married to author and children's librarian, Kristen Remenar. They live with their 3 kids and 3 cats on the lower right corner of the Michigan mitten. He teaches illustration at the Art Academy University in San Francisco", "source": "Facebook", "url": "https://www.facebook.com/events/1285645741460846/"}, {"date": "2016-02-23T10:00:00-05:00", "name": "Story Time with Ieva", "description": "Join us for Story Time with retired youth librarian Ieva Bates.  Stories and crafts for pre-school age kids.", "source": "Facebook", "url": "https://www.facebook.com/events/1521814471451960/"}, {"date": "2016-02-23T19:00:00-05:00", "name": "Ann Arbor/Ypsilanti Reads - Meet Author Cristina Henriquez for a Discussion & Signing", "description": "Discussion of this Year's Reads Book - \"The Book of Unknown Americans\"  Cristina Henriquez will be signing at the end of her presentation.  Books will be sold the night of the event by Nicola's Books.\n\nWriter Cristina Henriquez will discuss her work at a special appearance for the Ann Arbor / Ypsilanti Reads 2016. The public program will occur from 7:00 to 9:00 pm. Doors will open at 6 pm to offer the opportunity to connect with community agencies and representatives who will be staffing information tables in the lobby. Copies of \"The Book of Unknown Americans\" will be for sale and the event will include a book signing.\n\nTowsley Auditorium\nMorris Lawrence Building, Washtenaw Community College\n4800 E. Huron River Drive\nAnn Arbor, MI 48105\n\nAuthor: \n\nCristina Henríquez is also the author of the story collection Come Together, Fall Apart, which was a New York Times Editors’ Choice selection, and the novel The World in Half. Her work has appeared in The New Yorker, The Atlantic, The American Scholar, Glimmer Train, Virginia Quarterly Review, Ploughshares, TriQuarterly, AGNI, and Oxford American, as well as in various anthologies.\n\nBook: \n\nThe Book Of Unknown Americans centers on fifteen-year-old Maribel Rivera, who sustains a terrible injury. Her family leaves behind a comfortable life in Mexico and risks everything to come to the United States so that Maribel can have the care she needs. Once they arrive, it’s not long before Maribel attracts the attention of Mayor Toro, the son of one of their new neighbors, who sees a kindred spirit in this beautiful, damaged outsider. Their love story sets in motion events that will have profound repercussions for everyone involved.\n\nHenríquez seamlessly interweaves the story of these star-crossed lovers, and of the Rivera and Toro families, with the testimonials of men and women who have come to the United States from all over Latin America.", "source": "Facebook", "url": "https://www.facebook.com/events/526138584222040/"}, {"date": "2016-02-24T21:00:00-05:00", "name": "Aaron Carter 2/24/16 @ Blind Pig - Ann Arbor", "description": "Wed. February 24 | 18+ | 9pm | $15 / $65 VIP Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\nWSG: Dan Henig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/567", "source": "Facebook", "url": "https://www.facebook.com/events/1725536331010947/"}, {"date": "2016-02-25T21:00:00-05:00", "name": "Ron Pope & The Nighthawks w/ Truett 2/25/15 @ Blind Pig - Ann Arbor", "description": "Nashville-based, independent artist, Ron Pope, has stood at a crossroads where so many musicians find themselves — at the intersection of record label and independence. In an ever-evolving industry filled with rejection and compromise, he has plotted a new course for his music to reach loyal listeners, taking the industry-road-less-traveled in exchange for the ultimate payback, a league of devoted fans the world over. WSG: Tuett - http://www.truettofficial.com/\n\nVIP tix available here: http://www.etix.com/ticket/p/4574033/ron-pope-vip-meet-greet-ann-arbor-blind-pig-the-blind-pig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/446", "source": "Facebook", "url": "https://www.facebook.com/events/1449897481978519/"}, {"date": "2016-02-26T20:00:00-05:00", "name": "Wine, Women, and Song XIV", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "source": "Facebook", "url": "https://www.facebook.com/events/1673489232898555/"}, {"date": "2016-02-26T21:00:00-05:00", "name": "Aaron Carter w/ Dan Henig - Night Two 2/26/15 @ Blind Pig - Ann Arbor", "description": "Second Show Added for Friday, February 26th!\n\nDoors 9pm | 18+ | $15 General Admission / $65 Admission + Meet & Greet\n\nThe youngest male solo artist to have four Top 40 singles, pop sensation Aaron Carter began his career in show biz at the tender age of seven. Over the next five years he made a name for himself as an energetic and charismatic performer, both onstage and on albums such as his 1998 self-titled debut and the following year's Surfin' USA, both of which were successful in Japan and Germany as well as in the States. A single on the Pokemon: The First Movie soundtrack, opening gigs for the Backstreet Boys and Britney Spears, a biography and video collection, and appearances on Nickelodeon set the stage for his third album, 2000's Aaron's Party (Come Get It). The party continued on Oh Aaron, which was issued in summer 2001. Successful tours with both the Backstreet Boys and Britney Spears kept him busy into the next year, but by the spring of 2002 he was back in the studio again. Calling on several big-name pop producers, Carter put together Another Earthquake! during the year and released it that fall.\n\n\nWSG: Dan Henig\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/573", "source": "Facebook", "url": "https://www.facebook.com/events/1615405452043601/"}, {"date": "2016-02-28T15:00:00-05:00", "name": "Meet Michigan Author Vic Amato for a Discussion and Signing of His New Collection of Short Stories, 'Incoming: Collected Stories'", "description": "Vic Amato's sixteen tales in his Incoming: Collected Stories are literary explorations of the corridors of the human psyche, some familiar, some dark, all incorporating empathetic portraits of people, including married couples, young men on the cusp of adulthood, and even a sympathetic examination of the quirky among us.\n\nNearly every piece is set in the modern age; the one exception is \"Everyone Hates Malvolio,\" a sardonic takeoff on Twelfth Night.\n\nVic Amato holds a PhD in political science/public administration from Wayne State University, Detroit. He is a former journalist, mental health services administrator, and college instructor, and he served with the Third Infantry Division. He and his wife, Susan, live in Port Huron, Michigan.", "source": "Facebook", "url": "https://www.facebook.com/events/152137558488266/"}, {"date": "2016-03-04T20:00:00-05:00", "name": "Michael Johnson at Green Wood Coffee House", "description": "Yes, THE Michael Johnson, singer of the smash hit singles, \"Bluer Than Blue,\" \"This Night Won't Last Forever,\" \"That's That,\" and other landmark songs. Michael started playing at age 13; studied classical guitar in Barcelona; in 1968 joined the Chad Mitchell Trio with John Denver, touring for a year; and in 1969 toured for a year with the company of \"Jacques Brel Is Alive And Well And Living In Paris.\" In addition to his pop radio hits of the 1970's and '80's, he racked up top singles on the country charts with \"Give Me Wings\" and \"The Moon Is Still Over Her Shoulder.\" Michael's recent recordings feature duet partners Nanci Griffith and Alison Krauss. His music shows a diversity, depth and heart that only come from years of dedication to a labor of love. His amazing guitar work, humor and showmanship will make for a very special evening. Bring a friend! Michael's latest CD is \"Moonlight Deja Vu.\"\nhttp://www.mjblue.com/", "source": "Facebook", "url": "https://www.facebook.com/events/788876821235695/"}, {"date": "2016-03-05T20:00:00-05:00", "name": "The Chieftains", "description": "Saturday, March 5, 2016, 8:00 pm\nHill Auditorium\n\nPaddy Malone and The Chieftains celebrated 50 years of performing in 2012, and their music remains as fresh and relevant as when they first began. Recognized for reinventing traditional Irish music on a contemporary and international scale, their ability to blend tradition with modern music has made them one of the most renowned and revered musical groups to this day. Back for their fifth UMS performance and their first in nearly a decade, “they seem ageless, and so does their Irish music. If common sense tells you they can’t go on forever, you wouldn’t know it from their electrifying performance.” (Boston Globe)\n\nMore info: http://ums.org/performance/the-chieftains/", "source": "Facebook", "url": "https://www.facebook.com/events/1598997080377800/"}, {"date": "2016-03-05T20:00:00-05:00", "name": "Wine, Women, and Song XIV", "description": "Celebrating 14 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XIV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder\nLisa Tucker-Gray, director\nR. Mackenzie Lewis, piano\nJerry DePuit, repertoire consultant\n\nPerformers include: Laurie Atwood, Linda Beaupre, Wendy Bloom, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Susan Shipman, Monica Swartout-Bebow, Lisa Tucker-Gray, and Kathy Waugh.\n\nPerformances:\nFriday, January 29th at 8 PM\nSaturday, January 30th at 8 PM\nSunday. January 31st at 3 PM\nFriday, February 5th at 8 PM\nSaturday, February 6th at 8 PM\n\n\nWWS XIV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "source": "Facebook", "url": "https://www.facebook.com/events/1673489232898555/"}, {"date": "2016-03-05T21:00:00-05:00", "name": "Electric Six w/ Parlour Tricks 3/5/16 @ Blind Pig - Ann Arbor", "description": "Sat. March 5 | 9pm | $15 Cover | 18+\n\nElectric Six -  Mortality. It’s the primary reason we don’t live forever. If not for our mortality, the number of years each of us would have to roam this earth would be as infinite as the sands of time running through the earth itself. When extraterrestrials eventually make first contact with us within the next twenty years, the first glaringly obvious thing they will notice…is that we die. They will come to our planet with sinister intentions and they will immediately have the upper hand because we die…and they don’t. It’s a simple as that. And it’s all because of our mortality.\n\nWhile aliens (and the government!!!!!) will always be there to kill us, we have for generations used our cold dead hands to clutch onto whatever silver lining we could sew into the dark cloud of our everlasting mortality. Specifically, we tell ourselves that we can live forever, not in corporeal form, but through our creations of art…and our expressions of love.\n\nThusly, art and love are more important than ever, because they are now the conduits that preserve our life forces. If you don’t create art and you don’t love nobody…well then, you will be forgotten, rather quickly. No one wants to be forgotten rather quickly. No one more so…than Electric Six.\n\nElectric Six understands all this stuff as it prepares to unveil its eleventh studio album Bitch, Don’t Let Me Die!, which will be released on October 6 on Metropolis Records. The album is steeped in themes of mortality, death, discorporation and discoloration…all while it tries to convince you it is actually a work of art, a labour of love.\n\nFrom the pounding, driving opener, “Drone Strikes”, through the 1970s guitar anthem “Two Dollar Two”, Bitch, Don’t Let Me Die! reveals that Electric Six knows that it is going to die, but will not go out quietly. From there, the album moves through the pop goodness of “Kids Are Evil” and “A Variation of Elaine”, the prog-rock showmanship of “Slow Motion Man”, and even a tribute to Elvis Presley in his more rotund years with “Dime Dime Penny Dime”.\n\n“Big Red Arthur” is the anchor track of the album, as it emits a rock-opera bombast that is reminiscent of Radiohead sodomizing David Bowie in the center of his mind. It, like most of the songs on this record, is about death…but it’s kind of funny because it’s only about the death of a fake, out-of-shape drunk Santa Claus who is too fucking stupid to make it down the chimney correctly. In this case, we just end up laughing at death. And that’s uplifting.\n\nTo summarize, mortality is everywhere, and this fall, thanks to their new record Bitch, Don’t Let Me Die!, Electric Six will be everywhere too. Everybody gonna die someday, but with Electric Six’s new album, you no longer have to worry about any of it. Bitch, Don’t Let Me Die is Electric Six’s brand new record for 2015 and it is available on Metropolis Records on Oct. 2. You can come see Electric Six play in your town on the I Wanna Lick The Screen tour, starting in their home state of Michigan on Sept. 25.\n\nWSG: Parlour Tricks", "source": "Facebook", "url": "https://www.facebook.com/events/998925893483957/"}, {"date": "2016-03-06T15:00:00-05:00", "name": "Meet Ann Arbor Author Bill Loomis for a Discussion & Signing of His New Book, 'On This Day in Detroit History'", "description": "One day at a time, discover colorful Motor City moments in history spanning more than three centuries. On November 5, 1851, Voice of the Fugitive published a letter in support of escaped slaves. On July 3, 1904, Monk Parry became the first monkey to drive a car, and on January 16, 1919, the Statler Hotel menu offered whale meat for dinner. The legendary Steve Yzerman was named captain of the Red Wings on October 7, 1986. Local historian Bill Loomis covers the big events and remarkable stories of life and culture from Detroit’s founding to its recent struggles and rebirth.\n\nBill Loomis is the author of Detroit’s Delectable Past (2012), Detroit Food (2014) and numerous articles on culinary and social history. His writing has been published in the Detroit News, Michigan History Magazine, New York Times, Hour Detroit and more. Mr. Loomis was born in Detroit and lived for a number of years in the North Rosedale Park neighborhood in the city. Mr. Loomis now lives in Ann Arbor with his wife and children.", "source": "Facebook", "url": "https://www.facebook.com/events/1520482404946720/"}, {"date": "2016-03-08T19:00:00-05:00", "name": "Meet Michigan Author John Smolens for a Discussion & Signing of His New Novel, 'Wolf's Mouth'", "description": "In 1944 Italian officer Captain Francesco Verdi is captured by Allied forces in North Africa and shipped to a POW camp in Michigan s Upper Peninsula, where the senior POW, the ruthless Kommandant Vogel, demands that all prisoners adhere to his Nazi dictates. His life threatened, Verdi escapes from the camp and meets up with an American woman, Chiara Frangiapani, who helps him elude capture as they flee to the Lower Peninsula. By 1956 they have become Frank and Claire Green, a young married couple building a new life in postwar Detroit. When INS agent James Giannopoulos tracks them down, Frank learns that Vogel is executing men like Frank for their wartime transgressions. As a series of brutal murders rivets Detroit, Frank is caught between American justice and Nazi vengeance. In \"Wolf s Mouth, \" the recollections of Francesco Verdi/Frank Green give voice to the hopes, fears, and hard choices of a survivor as he strives to escape the ghosts of history.\"\n\nJohn Smolens has published nine works of fiction, including Cold, Quarantine, and The Schoolmaster’s Daughter. He lives in Marquette, Michigan.", "source": "Facebook", "url": "https://www.facebook.com/events/961213527303219/"}, {"date": "2016-03-08T21:00:00-05:00", "name": "MC Lars w/ Mega Ran 3/8/16 @ Blind Pig - Ann Arbor", "description": "Tue. March 8 | 9pm | 18+ | $10 adv./ $12 day of\n\nNorthern California rapper, MC Lars, is set to release his 4th full-length studio album, the Zombie Dinosaur LP, at the end of this coming summer. He has returned home to the Bay Area after living in Los Angeles these past three years, and is self-producing his new album with help from friends in Berkeley and San Francisco. The Zombie Dinosaur LP revisits the satirical, funny, uptempo style of Lars’ 2004 debut album, the Laptop EP. It features guest appearances by Watsky, Kool Keith, and Less than Jake’s Roger Lima. Zombie Dinosaur tackles such topics as postfeminism, in a nod to Game of Thrones (“Dragon Blood”); disappointing reunion bands with very few of their original members (“Sublime with Rome is Not the Same thing as Sublime”); hipster parenting (“Hipster Mom”); and the current state of EDM (“Signing Dubstep”). The project was funded entirely by Lars’s third highly successful Kickstarter campaign, through which he raised over $42k to create and release Zombie Dinosaur under his own label, Horris Records. In the ten years that have followed his debut release, the Laptop EP, Lars has independently produced and released three other solo full-length albums, four EPs, and a number of mixtapes. He has collaborated with KRS-One, mentored and helped develop the career of fellow Stanford alum K.Flay (with whom he collaborated on the 2009 Single and Famous EP), opened for Nas and Snoop Dogg, and played multiple summers on the Vans Warped Tour. He has also headlined club shows across the US and in Canada, Japan, Australia, New Zealand, and Europe. Lars has spoken and presented at two different TEDx conferences, performed at Carnegie Hall with a live string section (at Scholastic’s 2012 Art and Writing Awards – where he debuted the video for his song, “Flow Like Poe,” which is the lead single on his 2012 Edgar Allan Poe EP). Lars has developed and grown Horris Records in this past decade, signing the label’s first artist, Weerd Science (the solo hip-hop project of Cohered & Cambria’s drummer, Josh Eppard). Lars has continued to produce music videos for himself and his friends, including a cameo credit on past musical collaborator “Weird Al” Yankovic’s 2014 “Lame Claim to Fame” (for which Lars was given a special shout out in the liner notes to Al’s Grammy Award winning album, Mandatory Fun). Having been labeled as one of the pioneers of the underground “nerdcore hip-hop” subgenre, Lars has recently expanded from the studio to the classroom. With visiting scholar/teacher residencies at USC, and in the UK, and across the US in Nantucket, Florida, California, Alaska, and Kansas, Lars has found joy in educating young people about “lit-hop,” a subject term he coined to highlight the connections between literature, classical poetry, and the cultural history of rap. Lars has continued to work closely with the American Foundation for Suicide Prevention, teaching workshops on preventing self-harm, and positive ways to use music as creative therapy for depression. He has also worked with the American Heart Association, promoting youth heart health. It’s been quite a decade. WSG: Mega Ran", "source": "Facebook", "url": "https://www.facebook.com/events/1017884834929568/"}, {"date": "2016-03-11T18:00:00-05:00", "name": "Never Not Broken | Opening Reception", "description": "Join us for the Opening Reception & Award announcement of NEVER NOT BROKEN on Friday March 11, 6-9 pm at the 117 Gallery.\n\nAn exhibition curated by Anna van Schaap \n\n[A call for entries is open. Artists are welcome to submit all mediums. Deadline: February 14, 2016. Learn more here: https://goo.gl/3rXum7]\n\nThe circumstances of life are such that at one point or another something will break us.  The loss of a life, a love, a job, a home, will shake our foundation and we will inevitably crumble.  We then consider ourselves defeated; disheartened and utterly broken. But there is power in the acknowledgment of brokenness.\n\nNever Not Broken is taken from the Hindu Goddess Akhilanda or the 'Always Broken Goddess'. \"Akhilanda derives her power from being broke: in flux, pulling herself apart, living in different selves [and states of being] at the same time, from never becoming a whole that has limitations.\" (*1)\n\n\"Fluid connections, the celebration of ambiguity and a sense of ritual in chaos... deeply invested in the notion of complexity, this work will explore the arena of [brokenness] as an entree to rapture.  Artists working in this mode push the deconstruction and dissolution of centre, definitions and boundaries to reach the sublime terror [and beauty] of placelessness [and brokenness]\" *(2)\n\nBrokenness is not indicative of weakness or inability, but rather can be a strong driving force towards creative output as a means of analysis, internalizing, and coping for many artists.  This show seeks work that was created from a state of, and acknowledges our, Never Not Brokenness.\n\n(*1) Excerpt from the online article Why Lying Broken in a Pile on Your Bedroom Floor is a Good Idea by Julie Peters, Elephant Journal\n\n(*2) Excerpt from the Essay Beneath the Remains by Shamin M. Momin, The Gothic: Documents of Contemporary Art\n\n- Never Not Broken March 11 to March 26 at the 117 Gallery - \n-------------------------------------------------------------------------------------\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC", "source": "Facebook", "url": "https://www.facebook.com/events/788568644581287/"}, {"date": "2016-03-11T20:00:00-05:00", "name": "Nufonia Must Fall", "description": "March 11-12\nPower Center\n\n“You can’t help but leave with a fuzzy feeling inside.” (examiner.com) The globetrotting, Montreal-based scratch DJ and music producer Kid Koala presents a magical, multi-disciplinary and theatrical adaptation of his graphic novel and soundtrack, Nufonia Must Fall. This charming story centers around a headphones-sporting robot on the verge of obsolescence who falls in love with a lonely office girl. This live adaptation unfolds via real-time filming of more than a dozen miniature stages and a cast of puppets, while Kid Koala and the Aelos Quartet provide original live scoring on piano, strings, and turntables. The result? You’ll seem to be watching an animated picture, but simultaneously seeing puppets being filmed and projected in real time. Heartfelt, hand-made, and a very cool live experience. \n\nMore info: http://ums.org/performance/nufonia-must-fall/", "source": "Facebook", "url": "https://www.facebook.com/events/488544131294497/"}, {"date": "2016-03-11T20:00:00-05:00", "name": "Jim Lauderdale", "description": "Two-time Grammy-winner Jim Lauderdale is a \"songwriter's songwriter\" who has written/co-written many modern classics for iconic artists, as well as an intuitive sideman, enhancing the music of a bevy of esteemed musicians. Throughout his three-decade career, Jim Lauderdale has helped pave the way for the current Americana movement, writing songs that cross genres from country, rock, folk, and bluegrass, to R & B and blues. As a solo artist he's created a body of work spanning 28 albums of imaginative roots music.  Along the way he's won awards, garnered critical acclaim, and earned himself an engaged fan base. Jim treats his fans to a new adventure, exploring the redemptive traditional sounds of Memphis and Nashville with his double album, \"Soul Searching: Vol. 1 Memphis/Vol. 2. Nashville.\"  www.jimlauderdale.com", "source": "Facebook", "url": "https://www.facebook.com/events/1729037197315068/"}, {"date": "2016-03-11T21:00:00-05:00", "name": "Tortoise w/ Mind Over Mirrors 3/11/16 @ Blind Pig - Ann Arbor", "description": "$18 adv./ $20 day of | 18+ | 9pm\n\nSimply put, Tortoise has spent nearly 25 years making music that defies description. While the Chicago-based instrumental quintet has nodded to dub, rock, jazz, electronica and minimalism throughout its revered and influential six-album discography, the resulting sounds have always been distinctly, even stubbornly, their own. \nWSG: Mind Over Mirrors\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/521", "source": "Facebook", "url": "https://www.facebook.com/events/1622992504617740/"}, {"date": "2016-03-13T20:00:00-04:00", "name": "MC Chris w/ Nathan Anderson 3/13/16 @ Blind Pig - Ann Arbor", "description": "Sunday, March 13 | 8pm | 18+ | $16 adv. / $18 day of\n\nmc chris (always spelled in all lower case letters) is rapper from the Libertyville, Illinois, a suburb of Chicago. He was one of the first rappers to focus solely on nerd life, rapping about Star Wars, Harry Potter, ninjas and unrequited love, instead of the usual hip hop fare. He’s just as likely to make an appearance at Comicon as he is at SXSW. mc got his start as an animator on many of the shows you see on Adult Swim. He was writer, actor, songwriter and animator for Sealab 2021, The Brak Show, Space Ghost Coast to Coast and Aqua Teen Hunger Force. He has voiced characters on several Adult Swim pilots such as Welcome to Eltingville, Cheyenne Cinnamon, Your Pretty Face is Going to Hell and Tight Bros. He was also a producer of on air content for over a year before leaving Williams Street to pursue a career in music. mc has since crossed America countless times touring as a headlining act, as well as opening for bands like Pinback and Reggie and the Full Effect. He's collaborated with Talib Kweli, Andrew WK, Cee-Lo and Childish Gambino. His music has been featured in Kevin Smith’s Zak and Miri Make a Porno, Jay and Silent Bob’s Super Groovy Cartoon Movie and he has composed several themes for Smith’s Smodcast podcast network. mc's song \"hoodie ninja\" was featured in both a Honda commercial and America's Funniest Home Videos. Other songs have been featured in Comedy Central’s Broad City and Fox's So You Think You Can Dance? mc most recently started in the pilot Bunny and Frog for Disney and a national commercial for Fiat. mc raises money to fight Cystic Fibrosis. Inspired by his nephew who has CF, mc chris and his fans have raised over $150,000 for the Cystic Fibrosis Foundation through eBay sales and donations collected at live shows. mc kickstarted “the mc chris cartoon” an animated extension of the skit universe featured on his records. Thanks to donations from his fans, he raised $60,000 and produced a six minute pilot presentation with the animation company Titmouse Inc. mc is currently shopping the project.", "source": "Facebook", "url": "https://www.facebook.com/events/995090703894430/"}, {"date": "2016-03-15T19:30:00-04:00", "name": "Apollo’s Fire & Apollo’s Singers: Bach’s St. John Passion", "description": "Tuesday, March 15, 2016, 7:30 pm\nSt. Francis of Assisi\n\nFresh from their 2014 performance of Monteverdi’s Vespers, Apollo’s Fire & Singers returns to St. Francis of Assisi Church with one of their signature pieces, Bach’s St. John Passion. Bursting out of the gate from the agitated opening chorus, this work is considered Bach’s most dramatic and theatrical oratorio. In this acclaimed interpretation, the story’s action is highlighted by a dramatic approach: the roles are performed by true singing actors, staged on a special theatrical platform within the orchestra. The acclaimed Apollo’s Singers evoke the wild mob with fierce intensity. \n\nMore info: http://ums.org/performance/apollos-fire-st-john-passion/", "source": "Facebook", "url": "https://www.facebook.com/events/971816919508035/"}, {"date": "2016-03-18T20:00:00-04:00", "name": "Carlene Carter at Green Wood Coffee House", "description": "Carlene Carter, daughter of country music legends June Carter and Carl Smith, stepdaughter of Johnny Cash, and granddaughter of \"Mother\" Maybelle Carter of the original Carter Family, started her career in the late 1970s when she recorded her acclaimed debut album.  She co-wrote hit songs for Emmylou Harris and The Doobie Brothers, recorded a Top 40 pop duet, then \"came home to country\" in the 1990s with hits like, \"I Fell in Love,\" \"Come On Back,\" and, \"Every Little Thing.\" Carlene's latest release, \"Carter Girl,\" is a tribute to the timeless music of her historic family, that critics hail as \"a triumph,\" \"masterpiece,\" \"an album for the ages,\" and \"really quite perfect.\"  But while she is often referred to as \"country music royalty,\" she simply calls herself a Carter Girl. www.carlenecarter.net", "source": "Facebook", "url": "https://www.facebook.com/events/1948490602041931/"}, {"date": "2016-03-19T15:00:00-04:00", "name": "Meet Canadian Thriller Author Owen Laukkanen for a Discussion & Signing of His Latest Stevens & Windermere Novel, 'The Watcher in the Wall'", "description": "A heart-pounding new Stevens and Windermere thriller from the award-winning author of \"The Stolen Ones \"and\" The Professionals.\" \n\nKirk Stevens and Carla Windermere of the joint BCA-FBI violent crime task force have handled shocking cases before, but this one is different. Stevens s daughter, Andrea, is distraught over a classmate s suicide, but what the two investigators find is even more disturbing an online suicide club of unhappy teenagers, presided over by an anonymous presence who seems to be spurring them on. Soon, it becomes apparent that the classmate wasn t the first victim and won t be the last, either, unless they can hunt down this psychopath once and for all.\n\nOwen Laukkanen was born in Vancouver. After graduating from university in 2006, he answered an ad on Craigslist for a summer job at the World Series of Poker in Las Vegas as a poker tournament reporter for a poker website. At the end of the summer, they offered him a full-time job. You wouldn t think you could make a living at this, but you would be wrong. For the next three years he traveled around the world, reporting from the most luxurious casinos of Monaco and Macau and Australia to the sketchiest card rooms of California and Atlantic City. In 2009, having seen his fill, Laukkanen quit to concentrate on fiction. He also spends summers as a deckhand on the boats of his father and his uncle, both commercial fishermen. He is at work on more novels. \n\nHis previous Stevens and Windermere novels are \"The Professionals,\" \"Criminal Enterprise,\" \"Kill Fee,\" and \"The Stolen Ones.\" \"The Professionals\" was nominated for the Barry Award and International Thriller Writers Award for best first novel, as well as the \"Spinetingler\" Award for Best Novel: New Voice. \"Criminal Enterprise\" was nominated for the ITW Award for best novel. Both books, as well as \"Kill Fee,\" appeared on several best-of-the-year lists.", "source": "Facebook", "url": "https://www.facebook.com/events/1064114296941949/"}, {"date": "2016-03-19T20:00:00-04:00", "name": "Montreal Symphony", "description": "Saturday, March 19, 2016, 8:00 pm\nHill Auditorium\n\nThe Montreal Symphony returns to Ann Arbor for the first time since 1989, with American conductor Kent Nagano and pianist Daniil Trifonov both making their UMS debuts. “Hearing Trifonov is like having a deep-tissue massage: you keep wanting to pull away from the sheer intensity of it, and you come out feeling as if your reality had been slightly altered…a knockout.” (Washington Post) \n\nMore info: http://ums.org/performance/montreal-symphony-orchestra/", "source": "Facebook", "url": "https://www.facebook.com/events/1582133688713673/"}, {"date": "2016-03-26T20:00:00-04:00", "name": "Bach Six Solos: Gil Shaham, violin", "description": "Saturday, March 26, 2016, 8:00 pm\nHill Auditorium\n\nBach’s complete Sonatas and Partitas have long been a “Mount Everest” of the violin repertoire — music that performers return to throughout their lives. In this special event, Gil Shaham collaborates with video artist David Michalek to open up new avenues for listening to and interpreting Bach’s towering masterpieces.\n\nVideo artist David Michalek, best known for his “Slow Dancing” installation at Lincoln Center, and in the capitals of Europe, says of the Bach Six Solos project: “As a contemporary artist with a particular interest in motion pictures and time, I’ve been compelled to consider how the addition of extreme slow motion might be applied to moving images of the face, the body, obliquely narrative tableaux, and also still life in ways that can both enhance and alter the meanings latent within them. As a visual strategy, extreme slowness creates a continuing sense of a pause in the action — as if the growth and evolution of the slow-moving image is itself a further manifestation of the deep and consuming absorptive state that often arises while observing it.”\n\nMore info: http://ums.org/performance/gil-shaham/", "source": "Facebook", "url": "https://www.facebook.com/events/1663165150570187/"}, {"date": "2016-03-31T19:30:00-04:00", "name": "American Ballet Theatre: The Sleeping Beauty", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "source": "Facebook", "url": "https://www.facebook.com/events/1390173447979498/"}, {"date": "2016-04-01T19:30:00-04:00", "name": "American Ballet Theatre: The Sleeping Beauty", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "source": "Facebook", "url": "https://www.facebook.com/events/1390173447979498/"}, {"date": "2016-04-01T20:00:00-04:00", "name": "Mariachi Vargas de Tecalitlán", "description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "source": "Facebook", "url": "https://www.facebook.com/events/453190221522442/"}, {"date": "2016-04-01T20:00:00-04:00", "name": "Tom Chapin at  Green Wood Coffee House", "description": "In a career that spans 23 albums and includes three Grammy awards, Tom Chapin has covered a lot of creative ground. In addition to his work as a recording artist and concert performer, Chapin has acted on Broadway and worked in films, television and radio. Tom grew up in a family that encouraged artistic pursuits. He began performing professionally as a teenager in the early 1960s, playing in Greenwich Village folk clubs alongside his siblings, Harry and Steve, as one of The Chapin Brothers. In 1971, he began a five-year run as the host of the ABC-TV children's series, \"Make A Wish.\" Chapin and his songs were also featured in the 1970 documentary film, \"Blue Water, White Death,\" for which he spent six months sailing the Indian Ocean searching for great white sharks.\n\nAs a music-maker, Chapin has maintained two parallel careers, as a highly respected contemporary folk artist and as a pioneer in the field of children's music. In the former role, Chapin has established a reputation for insightful, heartfelt songcraft and charismatic live performances. In the latter, he continues to engage the hearts, minds and imaginations of young listeners with witty, life-affirming original songs delivered in a sophisticated array of musical styles. Chapin's infectious songs, sterling musicianship and personal warmth shine, whether he's performing on record or in a concert hall, an outdoor festival, a school, in front of a symphony orchestra, or in an intimate coffeehouse. www.tomchapin.com", "source": "Facebook", "url": "https://www.facebook.com/events/1713063788906616/"}, {"date": "2016-04-03T19:30:00-04:00", "name": "American Ballet Theatre: The Sleeping Beauty", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "source": "Facebook", "url": "https://www.facebook.com/events/1390173447979498/"}, {"date": "2016-04-06T19:30:00-04:00", "name": "American Ballet Theatre: The Sleeping Beauty", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "source": "Facebook", "url": "https://www.facebook.com/events/1390173447979498/"}, {"date": "2016-04-08T20:00:00-04:00", "name": "John McCutheon", "description": "\"The most versatile and compelling performer this reviewer has ever seen\"—Pravda", "source": "Facebook", "url": "https://www.facebook.com/events/1064500826928164/"}, {"date": "2016-04-08T20:00:00-04:00", "name": "Jerusalem Quartet", "description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "source": "Facebook", "url": "https://www.facebook.com/events/827290400697161/"}, {"date": "2016-04-08T21:00:00-04:00", "name": "The Mountain Goats 4/8/16 @ Blind Pig - Ann Arbor", "description": "Friday, April 8 | 9pm | 18+ | $22 Adv./ $25 Day of\n\nthe Mountain Goats - One thing that happened this past year was at City Winery, in April, where we did a session down in the cellar between soundcheck and the show. We hadn’t really thought a whole lot about the session in advance—on tour, your default response to things is “let’s just show up and play”—and we were kind of under the gun time-wise when we got to the club. So we decided to just do it quick and dirty, old-school style. Like the open mic nights I used to play: unamplified guitar and vocals, friends with their axes playing along, arrangements arrived at on the fly and infinitely flexible. Four songs later we felt really inspired—me and Matt played a song or two without anybody else around because we’d gotten down to the basement before the others, the total song choice was strictly “what do you figure we should play now?”, the mood was relaxed and free…we loved it. Later that night, we decided to strip down the drum kit to essentials and play a choke-the-motor set echoing and elaborating on what we’d done downstairs: a sort of small-ensemble feel, lower in volume but actually higher in intensity. Like what we do in concentrate. It was one of our two favorite performances of the year, the other being the second night at the Fillmore. It felt like acres of new terrain opening up atop an ancient foundation. As soon as it was over, we all wanted to do it again. So in 2016 we’re taking that set on the road. Not that exact set, obviously; the particulars will vary from night to night. But smaller rooms, audible frequencies, up close and personal: this is the general plan. Making eye contact with people in the back row, being able to go off-mic when I want to and still be heard. Total visibility. We couldn’t be more excited about this tour. I love the big album release shows as much as anybody, but that City Winery feel of just playing together with bare essentials in close quarters…there’s nothing like it, and when the whole room locks onto the signal, it’s really special.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/581", "source": "Facebook", "url": "https://www.facebook.com/events/554988117991170/"}, {"date": "2016-04-09T20:00:00-04:00", "name": "The Accidentals", "description": "\"Look no farther to find a new pairing to be jealous of.\"—Matt Mansfield, Z93 FM, Grand Rapids", "source": "Facebook", "url": "https://www.facebook.com/events/495921443927297/"}, {"date": "2016-04-11T20:00:00-04:00", "name": "Heather Nova", "description": "A unique engima from Bermuda", "source": "Facebook", "url": "https://www.facebook.com/events/1513669432294818/"}, {"date": "2016-04-13T20:00:00-04:00", "name": "The Johnny Clegg Band", "description": "South Africa's legendary breaker of walls", "source": "Facebook", "url": "https://www.facebook.com/events/1602568673339827/"}, {"date": "2016-04-14T19:30:00-04:00", "name": "Mnozil Brass", "description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "source": "Facebook", "url": "https://www.facebook.com/events/1621365181438631/"}, {"date": "2016-04-14T20:00:00-04:00", "name": "Kris Allen", "description": "American Idol's Season 8 winner, up close and personal!", "source": "Facebook", "url": "https://www.facebook.com/events/1662156430732435/"}, {"date": "2016-04-15T20:00:00-04:00", "name": "Tim O'Brien", "description": "Much-awaited new music from a performer bridging bluegrass and folk", "source": "Facebook", "url": "https://www.facebook.com/events/933628040025902/"}, {"date": "2016-04-15T20:00:00-04:00", "name": "Zafir: Musical Winds from North Africa to Andalucía", "description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus, where it blended with elements of Spanish music, then was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed Tunisian singer Sonia M’barek, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "source": "Facebook", "url": "https://www.facebook.com/events/419604171550681/"}, {"date": "2016-04-15T20:00:00-04:00", "name": "Scott Ainslie at Green Wood Coffee House", "description": "Scott Ainslie came of age during the Civil Rights era, and cultivated a powerful affinity for cross-cultural exchange. He has studied with elder musicians on both sides of the color line, in the old-time southern Appalachian fiddle and banjo traditions, as well as Black gospel and blues. He plays this music with affection, authority, and power. Armed with a variety of instruments -- vintage guitars, a fretless gourd banjo, a one-string, homemade diddley bow (cigar box guitar) --  and carefully chosen personal anecdotes of his encounters with senior musicians across the South, Ainslie explores the African and European roots of American music and culture, bringing the musical history of America alive.  www.cattailmusic.com", "source": "Facebook", "url": "https://www.facebook.com/events/506775856161991/"}, {"date": "2016-04-16T20:00:00-04:00", "name": "Leo Kottke", "description": "Legendary guitar mastery", "source": "Facebook", "url": "https://www.facebook.com/events/1512513839062559/"}, {"date": "2016-04-16T20:00:00-04:00", "name": "Bavarian Radio Orchestra", "description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "source": "Facebook", "url": "https://www.facebook.com/events/1579924995611394/"}, {"date": "2016-04-17T19:30:00-04:00", "name": "Will Hoge", "description": "Small-town dreams from a Grammy-nominated country and rock Nashville songwriter", "source": "Facebook", "url": "https://www.facebook.com/events/788218501301041/"}, {"date": "2016-04-18T20:00:00-04:00", "name": "Polica w/ Mothxr 4/18/16 @ Blind Pig - Ann Arbor", "description": "Monday, April 18 | 8pm | 18+ | $15 adv./ $17 day of\n\nPolica with MOTHXR \n\nUnited Crushers (out March 4, 2016) is POLIÇA’s third full-length release and most remarkable album to date. The band, which includes Channy Leaneagh, dual drummers, Drew Christopherson and Ben Ivascu and Chris Beirden on bass with producer Ryan Olson at the helm, collectively wrote the album in Minneapolis in the winter of 2015 during their first true break from two straight years of touring. The new album builds on POLIÇA’s signature synthesizer and percussion-heavy sounds with more complex arrangements and a bigger, crisper hi-fi punch due to the new approach they took to writing and recording: together, all in the same room. There's a tighter groove to these songs and a more vulnerable quality to them, especially in Leaneagh's singing. Her incredible vocal range is consistently on display throughout, beautifully raw and less electronically effected than on previous recordings. United Crushers is the follow up to 2013’s Shulamith which EW called \"propulsive enough for dance floors, and dreamy enough for headphones\" andMOJO said \"proves that intelligent pop music still has the ability to seduce and enthral.\" Their debut, 2012's Give You The Ghost, also garnered international acclaim, with Rolling Stone hailing it as \"the sound of heartbreak and celebration happening simultaneously\" and Q praising it as \"a bewitching, urgent, magical debut.\" The band has conquered massive festivals around the world from Coachella to Glastonbury in addition to performing on Late Night With Jimmy Fallon, Later With Jools Holland and more.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/564", "source": "Facebook", "url": "https://www.facebook.com/events/769930223136488/"}, {"date": "2016-04-21T20:00:00-04:00", "name": "Anne Heaton", "description": "\"Lush, introspective, elegant\"—Boston Globe. Photo by Asia Kepka.", "source": "Facebook", "url": "https://www.facebook.com/events/1088535237838163/"}, {"date": "2016-04-22T20:00:00-04:00", "name": "Nora Jane Struthers", "description": "\"Nora Jane Struthers has been creating quite a buzz.\"—The Tennessean, Nashville", "source": "Facebook", "url": "https://www.facebook.com/events/937454106322981/"}, {"date": "2016-04-22T20:00:00-04:00", "name": "Jonathan Edwards at Green Wood Coffee House", "description": "Warm as summer sunshine, real as the truth, intimate as a long overdue visit between old friends … such is a Jonathan Edwards concert. Four decades into a stellar career of uncompromising musical integrity, the man simply delivers, night after night – songs of passion, songs of insight, songs of humor, all rendered in that pure and powerful tenor which, like fine wine, has only grown sweeter with age.\nThis is one veteran performer who is neither grizzled nor nostalgic.  \nJonathan's  highly respected repertoire  includes such classics as, “Sometimes,” “One Day Closer,” “Don’t Cry Blue,” “Emma,” “Everybody Knows Her,” “Athens County,” and everyone’s favorite ode to putting a good buzz on, “Shanty.” And then, of course, there’s the anthemic “Sunshine (Go Away Today),” that fierce proclamation of protest and independence that resonated with thousands and thousands of frustrated and angry young men and women when it was first released in 1971. Almost 40 years later, at show after show, the song continues to be embraced by faithful followers and new fans alike.\nSince 1971, Jonathan has released 15 albums, including \"Blue Ridge,\" his standard-setting collaboration with bluegrass favorites the Seldom Scene, and \"Little Hands,\" his collection of children’s songs, which was honored with a National Library Association award. His brand new album is, \"Tomorrow's Child.\"\nwww.jonathanedwards.net", "source": "Facebook", "url": "https://www.facebook.com/events/1943009162591226/"}, {"date": "2016-04-23T19:30:00-04:00", "name": "Mr. B's Blues and Boogie Celebration", "description": "A blues and boogie summit! Note special start time.", "source": "Facebook", "url": "https://www.facebook.com/events/423521121176906/"}, {"date": "2016-04-23T20:00:00-04:00", "name": "The Bad Plus Joshua Redman", "description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "source": "Facebook", "url": "https://www.facebook.com/events/1589849627952742/"}, {"date": "2016-04-27T20:00:00-04:00", "name": "The Waifs", "description": "New music from an expat Australian trio", "source": "Facebook", "url": "https://www.facebook.com/events/831801416940807/"}, {"date": "2016-04-27T21:00:00-04:00", "name": "Rev. Horton Heat & Company 4/27/16 @ Blind Pig - Ann Arbor", "description": "Wed. April 27 | 9pm | 18+ | $28 Cover\n\nReverend Horton Heat with: Unknown Hinson, Nashville Pussy & Lucky Tubb & the Modern Day Troubadours Live in Concert!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/612", "source": "Facebook", "url": "https://www.facebook.com/events/991272244292924/"}, {"date": "2016-04-28T21:00:00-04:00", "name": "Chris Pureka 4/28/16 @ Blind Pig - Ann Arbor", "description": "Thursday, April 28 | 9pm | 18+ | $15 Cover\n\nIt’s rare for an artist to bridge the divide between critical acclaim and dedicated fan engagement. Chris Pureka is a Portland-based singer-songwriter whose body of work has resonated deeply with these seemingly disparate milieus. Her bold vulnerability in processing the intimacies of her life in song has long appealed to those listeners who crave authenticity. Now, five years coming, she shares with us another powerful entry in her life’s work, her sixth release, the aptly titled, Backin the Ring. Chris’s elegant emotionality as a vocalist, and her flair and immediacy as a lyricist have garnered her favorable comparisons to Gillian Welch, Ryan Adams, Bruce Springsteen, and Patty Griffin. She’s earned accolades from such distinguished taste-making outlets as The New York Times, Paste, Magnet,Billboard.com, and The AllMusic Guide. She’s shared the stage with such diverse and esteemed artists as Dar Williams, TheLumineers, The Cowboy Junkies, Gregory Alan Isakov, Martin Sexton, and Ani DiFranco. Along the way, Chris has remained fiercely independent, selling nearly 50,000 albums through her own label, Sad Rabbit Records. Chris’s journey in music mirrors her path toward self-discovery. At 16, writing songs became a way of journaling. “I was shy and introverted, and songwriting was a very personal process. I never had any intention of performing,” she shares. Post high school, she went on to complete a biology degree at Wesleyan University, and afterwards, worked in a microbiology research lab at Smith College. Meanwhile, she established a music career parallel to her biology work through touring and issuing a clutch of well-received indie releases.In 2006, when Chris found herself turning down too many opportunities as a musician, she shifted her priorities to become a full-time artist. Her latest album, Backin the Ring, is Chris’s first studio full length since 2010’s critically acclaimedHow I Learned to See in the Dark. “I’m not interested in releasing songs I can’t get behind or records I don’t love,” she says of the five-year span between albums. The title of her latest playfully suggests something of an artistic comeback, but it also references the album’s themes of relationship conflict and making the decision to fight back against dark inner demons. “My music is the outward expression of the work I’m doing internally. What I do comes from my experiences, and I strive to express these experiences authentically. Speaking my truth, and being myself, is the way that I connect with people,” Chris confides. Her rise as an esteemed artist with captivating emotional integrity has been organic and always on her own terms.For someone who never had an intention of being a professional musician, it’s been a life of far-reaching changes and unexpected rewards. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/595", "source": "Facebook", "url": "https://www.facebook.com/events/1318721681600135/"}, {"date": "2016-04-29T20:00:00-04:00", "name": "Heywood Banks", "description": "Michigan's cult hero of comedy", "source": "Facebook", "url": "https://www.facebook.com/events/480751802102134/"}, {"date": "2016-04-29T20:00:00-04:00", "name": "Don Campbell at Green Wood Coffee House", "description": "Don Campbell is a contemporary/country crossover and folk-rock singer/songwriter whose presentation of music supports the story in the song and welcomes the audience on board for the ride. Often compared to the sounds of Dan Fogelberg, Vince Gill, and Chris Isaak, Don and his ensembles are based out of New England. In 2012, Don released a double CD, \"Kites To Fly: Celebrating the Music of Dan Fogelberg,\" and in 2013 began presenting live performances of this music around his own busy schedule of Don Campbell shows.\nwww.doncampbellmusic.com", "source": "Facebook", "url": "https://www.facebook.com/events/930690620345924/"}, {"date": "2016-04-30T20:00:00-04:00", "name": "The Ben Daniels Band", "description": "\"A welcome gearshift\"—Real Detroit Weekly", "source": "Facebook", "url": "https://www.facebook.com/events/530159733818023/"}, {"date": "2016-05-02T20:00:00-04:00", "name": "The Julian Lage Trio", "description": "Genre-crossing jazz virtuosity", "source": "Facebook", "url": "https://www.facebook.com/events/1650789915178155/"}, {"date": "2016-05-06T20:00:00-04:00", "name": "Chris Smither", "description": "An American master of solo songwriting and blues", "source": "Facebook", "url": "https://www.facebook.com/events/986462064751963/"}, {"date": "2016-05-06T20:00:00-04:00", "name": "An Evening of Sam Cooke by Daughter Carla Cooke", "description": "Vocalist and composer Carla Cooke is the youngest daughter of the legendary Sam Cooke, whose musical life encompassed religion, romance, and history. Carla’s career mirrors that of her father, in that she crafted her sound in the church. Carla sought not to use her father’s name, but to build her own reputation. Now the younger Cooke knows that her roots are firmly entwined in her father's as she connects with them through his music.\n\nCarla Cooke’s style is diverse in gospel, Christian, R&B, soul, and pop styles. With a strong vocal range and warm personality, Carla shows that the apple doesn't fall far from the tree, as she channels the raw talent, emotion, beauty, and charisma of the Cooke family persona. www.carlacooke.com", "source": "Facebook", "url": "https://www.facebook.com/events/919947144747827/"}, {"date": "2016-05-07T20:00:00-04:00", "name": "Lucy Kaplansky", "description": "\"Her songs are about living, breathing people.\"—No Depression", "source": "Facebook", "url": "https://www.facebook.com/events/916584281712332/"}, {"date": "2016-05-07T20:00:00-04:00", "name": "Lucy Kaplansky", "description": "\"Her songs are about living, breathing people.\"—No Depression", "source": "Facebook", "url": "https://www.facebook.com/events/483349811834793/"}, {"date": "2016-05-13T20:00:00-04:00", "name": "Garnet Rogers", "description": "\"A profound lyricist and respected composer\"—Toronto Star", "source": "Facebook", "url": "https://www.facebook.com/events/1569905103231931/"}, {"date": "2016-05-13T20:00:00-04:00", "name": "Harmony Bones at Green Wood Coffee House", "description": "Harmony Bones is a quartet of long-time veterans of the Ann Arbor folk music scene. The band consists of Jeanne Mackey, Tom Voiles, Linda Teaman, and Laz Slomovits. The name Harmony Bones comes from an acupuncture point that harmonizes imbalances and promotes clear thinking, seeing, and hearing.\nJeanne, Tom, Linda and Laz have joined forces to explore a wide range of traditional, contemporary and original folk songs. Rich vocal harmonies and an array of instruments -- guitar, mandolin, flute, pennywhistle, fiddle, banjo, percussion, sitar -- combine to make Harmony Bones.\nSinger/songwriter Jeanne Mackey offers a blend of emotional intensity, wry humor, and global consciousness. In addition to original tunes, her repertoire ranges from Dar Williams to Patsy Cline, from Pete Seeger to Irving Berlin. A seasoned guitarist, she draws on a variety of styles -- folk, classic swing, funky blues, and more -- with the occasional sprinkle of mandolin, accordion, or banjo. Mackey rocked the 1970s East Coast topical music circuit as a young musician advocating feminist values and social justice.  In 2010, Mackey created \"Drop The Knife: A Memoir-in-Song,\" an evening of original songs and stories exploring the meaning of homeland, curses, death, and magic.\nLinda Teaman and Tom Voiles do much of their singing and playing with Nutshell, an Ann Arbor-based Celtic roots band. Nutshell plays for contra-dances and performs at festivals across North America.\nLinda is a singer who brings depth of understanding, warmth and sensitivity to the music. In 2005, her graduation recital for a degree in k-12 choral music had her singing in five languages, encompassing musical forms such as Irish sean nos singing and Italian and German arias by composers Purcell, Mozart and Brahms. She leads the Rudolf Steiner Community Singers, a small choir that sings uncommon Christmas and seasonal songs of celebration.  She hopes you'll forgive her classical background and that she is redeemed by her love of folk music.  In addition to vocals, she adds light percussion to the mix.\nTom consumes a well-rounded musical diet that ranges from Celtic to Indian to rock and roll. He enjoys mixing different styles while maintaining a respect for the traditions from which they spring. Tom has studied North Indian Classical music, Moroccan folk drumming and western classical flute. He has worked with performance artists, dancers, mimes and poets, including Hosain Mosavat, Gerry the Fool, Matthew Smith, ML Liebler and the Magic Poetry Band.\nLaz Slomovits is one of the twin brothers in Ann Arbor’s nationally-known children’s music duo, Gemini. A fine singer and multi-instrumentalist, Laz is starting his 4nd year playing music. His songs are featured in songbooks used by music teachers throughout the country, and Gemini's recordings have won numerous awards. In addition, Laz has had a notable solo career. In his solo work, Laz is best known for his powerful musical settings of the poetry of ancient Sufi mystics Rumi and Hafiz, as well as that of contemporary American poets.", "source": "Facebook", "url": "https://www.facebook.com/events/1637106023218709/"}, {"date": "2016-05-15T19:30:00-04:00", "name": "The Corn Potato String Band", "description": "The ears and eyes of America!", "source": "Facebook", "url": "https://www.facebook.com/events/1080836985282330/"}, {"date": "2016-05-20T20:00:00-04:00", "name": "Pat Donahue at Green Wood Coffee House", "description": "Grammy winner Pat Donahue is one of the most popular finger pickers in the world. His musical tastes are eclectic. Though he considers himself foremost a folk guitarist, Pat’s influences are rooted in bluesmen Blind Blake, Robert Johnson, Duke Ellington, Muddy Waters and Miles Davis.\nHaving been a songwriter and guitarist for twenty years for the “Guys All Star Shoe Band” of Minnesota Public Radio’s “A Prairie Home Companion,” Pat got to show off his savvy licks and distinctive original songs to millions of listeners each week. After wrapping up this impressive longterm gig, Pat now turns to full time concert touring, presenting master guitar workshops and attending prestigious music camps. www.patdonahue.com", "source": "Facebook", "url": "https://www.facebook.com/events/148870615480384/"}, {"date": "2016-05-21T20:00:00-04:00", "name": "Martin Sexton", "description": "\"The best live performer I've ever seen\"—John Mayer", "source": "Facebook", "url": "https://www.facebook.com/events/200517660293245/"}, {"date": "2016-05-26T20:00:00-04:00", "name": "Nick Moss", "description": "Finding the point where blues and the jam bands meet", "source": "Facebook", "url": "https://www.facebook.com/events/1513930968936295/"}, {"date": "2016-06-10T20:00:00-04:00", "name": "Josh White Jr.", "description": "A direct link to the early days of folk and the blues", "source": "Facebook", "url": "https://www.facebook.com/events/1698056820481625/"}, {"date": "2016-06-11T20:00:00-04:00", "name": "Mary Fahl", "description": "October Project's lead vocalist returns", "source": "Facebook", "url": "https://www.facebook.com/events/927935930621496/"}, {"date": "2016-07-10T19:30:00-04:00", "name": "Tim Shelton", "description": "Newfound Road's amazing lead vocalist steps out with music by Jackson Browne and more. This show has been rescheduled from June 16.", "source": "Facebook", "url": "https://www.facebook.com/events/1124052387614735/"}, {"date": "2016-09-18T21:00:00-04:00", "name": "UnDebateable, the UnPresidential Debates - Clown Car to the White House", "description": "THIS EVENT HAS BEEN POSTPONED TO LATER IN THE POLITICAL SEASON.  PLEASE CHECK OUT THE NEW NOVEMBER 1ST PROGRAM, \"JOKES IN PROCESS\" THAT WE HAVE PUT INTO ITS PLACE.  \n\nThe presidential candidates have been HILARIOUS this year, but now let's see how the professionals do.\nJoin the Emergent Art's Theater and the UnClub as they present \"UnDebateable, the UnPresidential Debates\".\n\nIf you would like to be a part of this historic event, either as a moderator, an interview, and audience reporter, or an actual campaign spokeperson, or if you can do an impression of a candidate, please click the 'Going' button.  If you can't commit, but you are interested in following this event, click 'Maybe' and we will keep you informed.\n\nWe are also looking for folks who can help us stream a webcast of this event.\n\nWant to be a sponsor?  We'll take that too.", "source": "Facebook", "url": "https://www.facebook.com/events/1690454564522707/"}]