[{"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "date": "2016-04-02T12:00:00-04:00", "source": "Facebook", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/638399229645848/", "description": "Literati is pleased to welcome James Stevens and Ralph Nelson for a discussion of their book Digital Vernacular: Architectural Principles, Tools, and Processes.\n\nDigital Vernacular addresses the why and how of digital fabrication in hundreds of step-by-step color images, illuminating a set of working principles and techniques that join theory with practice. Authors James Stevens and Ralph Nelson reconcile local traditions and innovations with globally accessible methods and digital toolsets. By combining ethics with hardware, the book will root you in the origins of making, ensuring a lasting and relevant reference for your studio practice.\n\nThe book opens with the origins and principles of the digital vernacular, then outlines digital vernacular tools including computer numerically controlled (CNC) mills, laser cutters, and 3D printers. You'll even learn to create your own digital fabrication tools out of inexpensive materials. The book concludes with the processes of the digital vernacular, including techniques for removing, joining, forming, and adding.\n\nA companion website at make-Lab.org hosts additional step-by-step processes and project outcomes.\n\nJames Stevens is an Associate Professor and the Director of makeLab, a digital fabrication studio in the College of Architecture and Design at Lawrence Technological University in Michigan, USA.\n\nRalph Nelson is an Associate Professor in the College of Architecture and Design at Lawrence Technological University and Principal of Loom, a collaborative design practice, based in Ann Arbor, Michigan, USA.", "date": "2016-04-02T19:00:00-04:00", "source": "Facebook", "name": "James Stevens & Ralph Nelson: Digital Vernacular"}, {"url": "https://www.facebook.com/events/966605056760158/", "description": "Beta Max (Cincinnati, OH)\nhttps://www.youtube.com/watch?v=NmmLdP5L6-8\n\nExperimental hip-hop from one half of Chemical Committee (REALICIDE Youth Records).\n\n\nWith local support by:\n\nWatabou (Ann Arbor, MI)\nhttps://watabou.bandcamp.com/\n\nWatabou is the solo electronic project from the mind of multi-instrumentalist Travis Jarosz. With his blend of intelligence and raw power, Watabou aims to evoke the emotions of any audience to the utmost, be it through intensive melodies, driving rhythms, powerful words, or any other number of qualities attributed to the act.\n\n\nPublic Shaming (Detroit, MI)\nhttp://www.discogs.com/artist/1141217-Thom-Elliott\nhttps://soundcloud.com/mephisto_waltz\n\nPublic Shaming is Thom Elliott & Jake Ruppert's latest cold wave/death industrial project. It combines anguished vocals over lurching, decrepit polyrhythms, tape loops and complex synth textures. PS is an attempt to communicate a visceral sonic encounter with the Void.\n\n\n$5 suggested donation for our out-of-town friends.\n\nDoors at 9, with music starting at 10.\nSHOW UP ON TIME!\n\nRespect the house and the artists.\nThis is a music event, not a house party.\nEngage and participate.", "date": "2016-04-02T21:00:00-04:00", "source": "Facebook", "name": "Beta Max (Realicide Youth, Cincinnati) w/ Watabou & Public Shaming"}, {"url": "https://www.facebook.com/events/1685542291727910/", "description": "Strayaway Child Concert Series is proud to present: Lindsay Straw & Caroline O'Shea in concert!\n\nSunday, April 3, 2016\nConor O'Neill's Celtic Room\nDoors 5pm \nShow 5:30pm\nGeneral Admission: $15\nStudents: $12\nKids under 10- Free\n\nLindsay Straw is a singer, guitarist, and Irish bouzouki player who performs traditional songs and tunes from the British Isles. Originally from Montana, she began to explore Boston’s Irish and folk music scenes while studying film scoring at Berklee College of Music. Her debut solo album My Mind From Love Being Free was released on May 1, 2015. She is a 2015 recipient of Club Passim's Iguana Fund Grant, which will enable her to make her second album in 2016.\n\nLindsay has impressed with her tender singing voice and an extensive repertoire that is rooted in the Scottish and Northern Irish traditions, but which also delves into contemporary songwriters like Richard Thompson and Bob Dylan. She has also drawn praise for her sensitive, agile accompaniment on bouzouki and guitar at many a local session and in concert as a member of the Irish quartet The Ivy Leaf, with piper Joey Abarta, and with fellow guitar & bouzouki player Owen Marshall.\nhttp://www.lindsaystraw.com/\n\nCaroline O’Shea is from Milton, MA, and has played the Irish flute and tin whistle since she was a child. As a teenager, she competed in the All-Ireland championships for four years in a row in Letterkenny, Co. Donegal and in Tullamore, Co. Offaly. She received her TTCT Diploma—a week-long certification course in Dublin for teaching traditional Irish music—in 2016, and has taught for Boston’s branch of Comhaltas Ceoltoiri Eireann (Irish music school); at the Killarney School of Music in Killarney, Co. Kerry; at the Milton Art Center; and at the Irish Cultural Centre of New England, in addition to private lessons. Caroline currently plays in a duo with singer Lindsay Straw, and plays flute, whistles, and sings with traditional Irish group The Ivy Leaf. In addition to playing flute and whistle, Caroline was recently awarded a grant from the MA Cultural Council to study the uilleann pipes with master piper Joey Abarta.\n\nSince 2010, Caroline has played flute, whistles, and sung with traditional Irish group The Ivy Leaf. Their debut CD of tunes and songs The Ivy Leaf: Traditional Irish Music was released in 2012. She plays at festivals and events with Boston-based band Devri as well, and played low and high whistles on the band’s debut CD Broad Street in 2012.\nhttps://cosheamusic.wordpress.com/", "date": "2016-04-03T17:30:00-04:00", "source": "Facebook", "name": "Lindsay Straw & Caroline O'Shea- In Concert"}, {"url": "https://www.facebook.com/events/458624760993768/", "description": "Join us for the LAST CHANCE SLAM! This is the only way to earn one of the last two spots to slam at Finals. The top two poets from this slam get an automatic bid into Finals for a chance to compete to be on the team that goes to The National Poetry Slam in Atlanta this August.\n\nRemember, it's 3 rounds! Come through as poets put it all on the line!", "date": "2016-04-03T18:30:00-04:00", "source": "Facebook", "name": "Ann Arbor Poetry LAST CHANCE Slam"}, {"url": "https://www.facebook.com/events/781623368609473/", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "date": "2016-04-03T19:00:00-04:00", "source": "Facebook", "name": "Aventura March Madness"}, {"url": "https://www.facebook.com/events/1390173447979498/", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "date": "2016-04-03T19:30:00-04:00", "source": "Facebook", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "date": "2016-04-04T12:00:00-04:00", "source": "Facebook", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/1032406803469486/", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "date": "2016-04-04T17:30:00-04:00", "source": "Facebook", "name": "TheRide’s ServiceFest"}, {"url": "https://www.facebook.com/events/910013872430895/", "description": "Literati is delighted to welcome Desiree Cooper in support of her debut, Know the Mother.\n\nWhile a mother can be defined as a creator, a nurturer, a protector—at the center of each mother is an individual who is attempting to manage her own fears, desires, and responsibilities in different and sometimes unexpected ways. In Know the Mother, author Desiree Cooper explores the complex archetype of the mother in all of her incarnations. In a collage of meditative stories, women—both black and white—find themselves wedged between their own yearnings and their roles as daughters, sisters, grandmothers, and wives.\n\nIn this heart-wrenching collection, Cooper reveals that gender and race are often unanticipated interlopers in family life. An anxious mother reflects on her prenatal fantasies of suicide while waiting for her daughter to come home late one night. A lawyer miscarries during a conference call and must proceed as though nothing has happened. On a rare night out with her husband, a new mother tries convincing herself that everything is still the same. A politician’s wife’s thoughts turn to slavery as she contemplates her own escape: \"Even Harriet Tubman had realized that freedom wasn’t worth the price of abandoning her family, so she’d come back home. She’d risked it all for love.\" With her lyrical and carefully crafted prose, Cooper’s stories provide truths without sermon and invite empathy without sentimentality.\n\nKnow the Mother explores the intersection of race and gender in vignettes that pull you in and then are gone in an instant. Readers of short fiction will appreciate this deeply felt collection.\n\nA 2015 Kresge Artist Fellow, Desiree Cooper is a former attorney, Pulitzer Prize-nominated journalist and Detroit community activist whose fiction dives unflinchingly into the intersection of racism and sexism. Using the compressed medium of flash fiction, she explores intimate spaces to reveal what it means to be human. Her fiction and poetry have appeared in Callaloo, Detroit Noir, Best African American Fiction 2010, and Tidal Basin Review, among other online and print publications. Cooper was a founding board member of Cave Canem, a national residency for emerging black poets. She is currently a Kimbilio fellow, a national residency for African American fiction writers.", "date": "2016-04-04T19:00:00-04:00", "source": "Facebook", "name": "Desiree Cooper"}]