[{"url": "https://www.facebook.com/events/1762135664019568/", "description": "Yes, believe your eyes. Vault of Midnight Detroit will be opening its doors on Monday, May 2nd at 10am, a mere two weeks from now-ish.\n\nWe'll have a full compliment of Earth's Finest comic books and graphic novels, board games, apparel, vinyl toys, and much, much more. \n\nOur custom built, one-of-a-kind shop has been gestating in our minds for the last fifteen months. We absolutely cannot wait to share it with you.\n\nThank you to Detroit for all of the kind words and good feelings you've been sending us since we announced this project. We'll try to make you proud!", "source": "Facebook", "date": "2016-05-02T10:00:00-04:00", "name": "Grand Opening!"}, {"url": "https://www.facebook.com/events/110005266066559/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 12 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 12, in store or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse = 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-05-02T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/1739721849644306/", "description": "http://cafegive.com/make_the_match/boaa-volunteermatch\nWe believe everyone should have the chance to make a difference. That's why United Way of Washtenaw County's Volunteer Center makes it easy for good people and good causes to connect. The Bank of Ann Arbor is a proud sponsor and matching all donations up to $3,000 for a grand total of $3,000 for this amazing volunteer program. www.volunteerwashtenaw.org\n\nPlease share this on your social media to help us hit our goal!!", "source": "Facebook", "date": "2016-05-02T14:00:00-04:00", "name": "Bank of Ann Arbor is matching donation up to a total of $3,000 for United Way's Volunteer program"}, {"url": "https://www.facebook.com/events/1100713003313165/", "description": "Literati is pleased to celebrate the literary, artistic, and musical culture of Detroit and Michigan at large by welcoming the authors of works chosen as 2015 and 2016 Michigan Notable Books: Ink Trails II: Michigan's Famous and Forgotten Authors by Dave and Jack Dempsey, Yamasaki in Detroit by John Gallagher, and The Orbit Magazine Anthology by Rob St. Mary.\n\nAbout Ink Trails II: From authors of bodice rippers and gallant figures to hometown poetry, hearty men, and tales of American originals, the history of literature in Michigan is deep and rich. The Wolverine State has been the birthplace, home, and inspiration to a tremendous number of men and women of letters, both the well-known and the obscure. Ink Trails II tells the stories of these fascinating and diverse writers whose talent is inextricably linked to Michigan.Exploring the hidden treasures of otherwise forgotten authors while also acknowledging the Michigan-set stories of giants like Hemingway, Dave and Jack Dempsey delve into the state’s literary heritage, as robust, diverse, and inexhaustible as the natural beauty of the place that nurtured it. This second volume of “ink trails” continues to tell the story of the remarkable writers, powerful words, and sublime nature of Michigan in the same well-researched and entertaining prose as the first.\n\nAbout Yamasaki in Detroit: Although his best-known project was the World Trade Center in New York City, Japanese American architect Minoru Yamasaki (1912–1986) worked to create moments of surprise, serenity, and delight in distinctive buildings around the world. In his adopted home of Detroit, where he lived and worked for the last half of his life, Yamasaki produced many important designs that range from public buildings to offices and private residences. In Yamasaki in Detroit: A Search for Serenity, author John Gallagher presents both a biography of Yamasaki—or Yama as he was known—and an examination of his working practices, with an emphasis on the architect’s search for a style that would express his artistic goals. Both knowledgeable fans of modernist architecture and general readers will enjoy Yamasaki in Detroit.\n\nAbout The Orbit Magazine Anthology: With a mischievous globe-headed mascot that appeared in every issue and even on Quentin Tarantino’s T-shirt in Pulp Fiction, Orbit was an instantly recognizable arbiter of 1990s Detroit culture. But its irreverent tone and unique editorial features could be traced to two earlier local publications from creator Jerry Peterson, a.k.a. Jerry Vile—White Noise (1978–1980) and Fun: The Magazine for Swinging Intelectuals [sic] (1986–1990). In The Orbit Magazine Anthology: Re-Entry, author Rob St. Mary details the full run of White Noise, Fun, and Orbit, collecting two decades’ worth of Detroit’s alternative publishing history into an oversized, heavily illustrated volume that situates the publications in the city’s pop culture and media history. Anyone interested in Detroit arts and culture or the history of alternative publishing will be grateful for The Orbit Magazine Anthology.\n\nEvent date: \nMonday, May 2, 2016 - 7:00pm", "source": "Facebook", "date": "2016-05-02T19:00:00-04:00", "name": "Michigan Notable Books: Dave & Jack Dempsey, John Gallagher, & Rob St. Mary"}, {"url": "https://www.facebook.com/events/1713725442238131/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-       May 3 - Isaac Berkowitz and Chris Bota\nIsaac Berkowitz and Chris Bota are guitarists in the Michigan rock band, Desmond Jones. As an acoustic duo, they blend blugrass and country acoustic guitar style with their band's original tunes. \nDesmond Jones is a five-piece funk/rock/jazz fusion band from Grand Rapids, Michigan. With original music written to compliment the group's sound as a whole, the music is centered around melodic guitar riffs, smooth bass lines, funky drum beats, and some saxophone. \n\nNever a cover\nAlways a good time", "source": "Facebook", "date": "2016-05-03T19:00:00-04:00", "name": "Acoustic Tuesdays: Isaac Berkowitz & Chris Bota"}, {"url": "https://www.facebook.com/events/1696645480602610/", "description": "Join us for the release party for two Young Adult Michigan authors, Kristine Krupp and Elena Bozzi. \n\nKristine Kruppa is a mechanical engineer at Ford Motor Company, writer, and world traveler. Her days are spent designing cool new car parts, but her evenings are filled with writing and cats. She has traveled solo to seventeen countries on five continents. Her other hobbies include hunting for the perfect cup of coffee, exploring used book stores, and accidentally climbing mountains. \n\nElena Bozzi's love of stories began, she imagines, before she was born. From an early age, she learned that stories were beautiful ways to connect with others. Eventually, after consuming copious amounts of written words, she decided it would be proper to give back to the book world. She hopes you will enjoy, are enjoying, or have enjoyed Puddle, her first novel. To write it, she listened deeply to many forests, and knows much of this story came directly from them.\n\n'27 Days to Midnight'\n\nEveryone in Dahlia’s world knows when they’re going to die. Except her.\n\nHer father has never shown her the pocket watch counting down the days she has left to live. When he sacrifices himself to save her from her scheduled death, Dahlia abandons her comfortable home and sets off after his murderer to uncover the secrets her father died to protect…and the time research that could bring him back to life.\n\nThen she meets Farren Reed. She should hate him. He’s an enemy soldier, a cowardly deserter, and the most insufferable man Dahlia’s ever met. Still, she needs all the help she can get, and Farren is the only chance she has to find the man who murdered her father. But Farren has only twenty-seven days left on his watch.\n\n'Puddle: A Tale for the Curious'\n\nBirch loves her garden. Her sanctuary is the nearby forest. She understands that adventures can happen at any moment, especially when there are cats involved. When she witnesses a boy crawl from a puddle that wouldn't cover a toad, she suspends her disbelief in order to see his side of the tale.\n\nGet your feet wet with Birch and Puddle as they travel to worlds by way of the reflections upon puddles. Prowl with Caht, the cat who spells its name with an h, and arrange necessary... encounters.. with Nimupara, the Watcher of Worlds. Dance all night with the Trees, as they share their stories and their secrets. And listen to the land.", "source": "Facebook", "date": "2016-05-03T19:00:00-04:00", "name": "Join Us for a Release Party for YA Authors Kristine Kruppa & Elena Bozzi"}, {"url": "https://www.facebook.com/events/446750598867331/", "description": "Finally! The Wednesday Daytime Market is back! Join us for the first one of the season at an earlier start time: 7:00am! \n\nAfter this our summer hours are in full effect: Wednesdays and Saturdays from 7:00 am to 3:00pm\n\nHope to see you there!", "source": "Facebook", "date": "2016-05-04T07:00:00-04:00", "name": "Wednesday Daytime Market"}, {"url": "https://www.facebook.com/events/866000246862709/", "description": "Your favorite Food Trucks are back along with some new choices! Join us on the first Wednesday of each month for some tasty, local food, music, and fun for family and friends! \n\n\nMay 4th\nJune 1st\nJuly 6th\nAugust 3rd\nSeptember 7th\nOctober 5th", "source": "Facebook", "date": "2016-05-04T17:00:00-04:00", "name": "First Wednesday Food Truck Rally"}, {"url": "https://www.facebook.com/events/1015114025230041/", "description": "Literati is delighted to host the launch of Chris McCormick's debut, Desert Boys, a staff favorite and our Literati Cultura pick for April! Chris will be joined in conversation by Brit Bennett, author of The Mothers (coming from Riverhead in October).\n\nA vivid and assured work of fiction from a major new voice, following the life of a young man growing up, leaving home, and coming back again, marked by the stark beauty of California's Mojave Desert and the various fates of those who leave and those who stay behind. This series of powerful, intertwining stories illuminates Daley Kushner's world--the family, friends and community that have both formed and constrained him, and his new lief in San Francisco. Back home, the desert preys on those who cannot conform: an alfalfa farmer on the outskirts of town; two young girls whose curiosity leads to danger; a black politician who once served as his school's confederate mascot; Daley's mother, an immigrant from Armenia; and Daley himself, introspective and queer. Meanwhile, in another desert on the other side of the world, war threatens to fracture Daley's most meaningful--and most fraught--connection to home, his friendship with Robert Karinger. A luminous debut, Desert Boys traces the development of towns into cities, of boys into men, and the haunting effects produced when the two transformations overlap. Both a bildungsroman and a portrait of a changing place, the book mines the terrain between the desire to escape and the hunger to belong.\n\n“Desert Boys is hilarious, devious, original, and unforgettable; Chris McCormick writes with a joyful swerve and swagger that is all his own.”―Karen Russell, New York Times bestselling author of Vampires in the Lemon Grove\n\n“Desert Boys is a show off's debut, the work of an unabashed polyglot. There seems to be nothing Chris McCormick can't do: smartypants metafictional experiment, heart-pounding thriller, eulogy for boyhood bonds, meditation on sexuality and post-9/11 intolerance. These linked stories assemble into a kind of compound eye through which we glimpse an oft-forgotten corner of California and, most superbly, a fresh take on masculine Americana. McCormick is the artsy outsider, the affectionate anthropologist, the near-feral boy with a wide-angle lens of history.”―Claire Vaye Watkins, author of Battleborn and Gold Fame Citrus\n\n\"In the hands of this young master of purified prose, ambition, love, and the restlessness of boyhood are trapped as if in a crystal vial. No reader will be able to turn away.\"―Chigozie Obioma, author of The Fishermen\n\n“Chris McCormick’s book is a gift from the new West. In the dry, highland exurbs of Los Angeles and other exotic places, McCormick crafts lustrous tales of brotherhood, immigrants, love, and paintball. Filled with unforgettable characters, Desert Boys is a deeply moving journey through the natural and emotional landscapes of the American present.”―Héctor Tobar, New York Times bestselling author of Deep Down Dark and The Barbarian Nurseries\n\n“This is a book about place, or really like so many books about place (Dubliners, Winesburg, Ohio) two places, in this case two Californias―San Francisco on the one hand; the less familiar but finely evoked small desert community from which the narrator originates on the other. But it's also a book about shame, two shames, the shame of where we come from, and the shame of leaving it. Through a series of quietly intimate confessions we learn how torn the teller is between past and present, small town and big city, and McCormick captures this tension beautifully in the contrast between his laconic, but frankly feeling prose and his restless formal innovation. Wise and vulnerable by turns, this is a quietly stunning debut.”―Peter Ho Davies, author of The Welsh Girl\n\nChris McCormick was raised in the Antelope Valley. He earned his B.A. at the University of California, Berkeley, and his M.F.A. at the University of Michigan, where he was the recipient of two Hopwood Awards. He lives in Ann Arbor, Michigan.\n\nEvent date: \nWednesday, May 4, 2016 - 7:00pm", "source": "Facebook", "date": "2016-05-04T19:00:00-04:00", "name": "Fiction at Literati: Chris McCormick"}, {"url": "https://www.facebook.com/events/1016761265082388/", "description": "Join us to celebrate Ann Arbor's young talent as students from Community High's poetry class share their original work at Bookbound. They brought some amazing work last year, so prepare to be impressed!", "source": "Facebook", "date": "2016-05-04T19:00:00-04:00", "name": "Community High School Poetry Class Reading"}]