[{"date": "2016-04-21T12:00:00-04:00", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "url": "https://www.facebook.com/events/1573275812982685/", "source": "Facebook", "name": "Fresh + Fit!"}, {"date": "2016-04-21T16:00:00-04:00", "description": "Audtions WED & THU APRIL 20-21 4-7 PM\nCallbacks SAT APRIL 23 4-7 PM, East Quad Rom 1405\n \nNo monologue needed; Be prepared to work with scenes from the play.  Many roles are double cast.  Performances in June.", "url": "https://www.facebook.com/events/557979811041512/", "source": "Facebook", "name": "SITA 2016 Auditions"}, {"date": "2016-04-21T19:00:00-04:00", "description": "When bacteria, brains, and beer converge in one amazing place, you know it’s gotta be another edition of Nerd Nite Ann Arbor. Come by to hear Ada Hagan tell of the zombie apocalypse that occurs when a certain virus attacks bacteria. Dylan Miller will explain how to take over someone’s free will with DIY neuroscience, and Ryan Engemann will explainscientific development through beer while you order another pint. Come nerd out with us at LIVE, or miss your chance to learn about the zombie virus and cockroach control while drinking an enlightening brew!\n \nWhen: Thursday, April 21, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER! cuz Ann Arbor District Library said so\n\nAda Hagan - Predator vs. Prey: A Micro Tail\nBacteria are feared by humans for their ability to cause diseases that can't always be treated with antibiotics. But do bacteria have a predator of their own? Come learn about the virus that uses its \"tail\" to prey on bacteria, turning them into zombies. Predator versus prey may be a familiar story, but hear it with some new \"micro\" characters.  \n\nAbout Ada: Ada Hagan is a doctoral student at the University of Michigan in the department of Microbiology and Immunology. She does recon on the sneaky ways bacteria find nutrients (like iron!) when they are invading our bodies. Ada is a co-founder of the graduate student science communication blog MiSciWriters. Originally hailing from the mountains of East Tennessee, Ada spends her spare time writing, walking her dogs, cooking, and comparing strollers. Follow her on Twitter @adahagan.\n\nDylan Miller - The Body’s Electricity: From Cockroaches to You!\nHave you ever had the desire to lose your free will? Or, alternatively, have you ever had the desire to take someone's free will? This talk will discuss how Backyard Brains uses DIY-style neuroscience to bring to you direct control, via your muscle electricity, over cockroaches, machines, and even other humans!\n\nAbout Dylan: Dylan Miller came to Backyard Brains as an undergraduate in neuroscience.  He has since graduated from Michigan State University, and now works at BYB as a research scientist and on marketing.  He initially joined in order to apply the RoboRoach setup to controlling scorpions, and moved on to manage several other undergraduate DIY-neuroscience projects. He also studies the behavior of scorpions in a separate research lab at MSU. Follow him on Twitter @BraconidaeBaron.\n\nRyan Engemann - The Science of Beer\nBeer has been there from the beginning of the scientific revolution.  From providing sanitary nourishment to the development of modern medicine and pasteurization, beer has been an integral influence on the development of science.  Join Certified Cicerone® Ryan Engemann and explore this fascinating topic--over a pint, of course.  \n\nAbout Ryan: A nerd by nature, Ryan started working in the craft beer industry in Northern Michigan in 2011.  He became the first Certified Cicerone in Northern Michigan and now can be found selling beers and talking science at Brewery Vivant in Grand Rapids. Check out what he’s doing at the brewery via www.breweryvivant.com, or on Facebook, Instagram or Twitter @breweryvivant.", "url": "https://www.facebook.com/events/825233070915001/", "source": "Facebook", "name": "Bacteria vs Viruses, Backyard Brains, & Beer Science"}, {"date": "2016-04-21T19:00:00-04:00", "description": "Literati is pleased to welcome three authors from Wayne State University Press's Made in Michigan series: Michael Delp, Zilka Joseph, and M.L. Liebler.\n\nMichael Delp recently retired from the Interlochen Arts Academy, where he was the director of creative writing for many years. He is the author of numerous collections of prose and poetry, with his most recent collection of short stories being As If We Were Prey. He is also the mentor and advisor to the Front Street Writers Program in Traverse City, which operates under the auspices of the National Writers Series. He lives in Interlochen with his wife, Claudia, and splits his time between there and Reeling Waters, his cabin on the Boardman River.\n\nZilka Joseph teaches creative writing and is an independent editor and manuscript coach. Her chapbooks, Lands I Live In and What Dread, were nominated for a PEN America and a Pushcart award, respectively. She was awarded a Zell Fellowship, a Hopwood Prize, and the Elsie Choy Lee Scholarship (Center for the Education of Women) from the University of Michigan.\n\nM. L. Liebler is an award-winning poet, literary arts activist, and professor. He is the author of several books of poetry, including Wide Awake in Someone Else’s Dream, and an editor of the anthology Working Words: Punching the Clock and Kicking Out the Jams. He is also co-editor of Bob Seger's House and Other Stories. He has taught at Wayne State University since 1980.\n\nEvent date: \nThursday, April 21, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1780441212177400/", "source": "Facebook", "name": "Poetry at Literati: Michael Delp, Zilka Joseph, & M.L. Liebler"}, {"date": "2016-04-21T19:00:00-04:00", "description": "Jim Ottaviani (\"Feynman\", \"Primates\") is the world s preeminent writer of comics and graphic novels about science. Notable works include a biography of Niels Bohr and the fast-paced tale of the desperate lives of early paleontologists and \"T-Minus: The Race to the Moon\", from Aladdin books. He has worked as a nuclear engineer and is currently employed as a reference librarian in Ann Arbor, Michigan.\n\nEnglish mathematician and scientist Alan Turing (1912 1954) is credited with many of the foundational principles of contemporary computer science. \"The Imitation Game\" presents a historically accurate graphic novel biography of Turing's life, including his groundbreaking work on the fundamentals of cryptography and artificial intelligence. His code breaking efforts led to the cracking of the German Enigma during World War II, work that saved countless lives and accelerated the Allied defeat of the Nazis. While Turing's achievements remain relevant decades after his death, the story of his life in post-war Europe continues to fascinate audiences today. \nAward-winning duo Jim Ottaviani (the #1 \"New York Times \"bestselling author of \"Feynman \"and \"Primates\") and artist Leland Purvis (an Eisner and Ignatz Award nominee and occasional reviewer for the \"Comics Journal\") present a factually detailed account of Turing's life and groundbreaking research as an unconventional genius who was arrested, tried, convicted, and punished for being openly gay, and whose innovative work still fuels the computing and communication systems that define our modern world. Computer science buffs, comics fans, and history aficionados will be captivated by this riveting and tragic story of one of the 20th century's most unsung heroes.", "url": "https://www.facebook.com/events/1715972678661999/", "source": "Facebook", "name": "Meet Ann Arbor Graphic Novel Author Jim Ottaviani for a Discussion & Signing of His New Novel The Imitation Game: Alan Turing Decoded"}, {"date": "2016-04-21T19:00:00-04:00", "description": "Bobby is over the moon after sharing a bike on the E.T. ride at Universal Studios with Katya. Join our “intrepid crusader” as he takes a leap of faith—traveling from comfortable “have-a-nice day … and have-a-warm-shower” suburban Detroit to the former center of Cold War Soviet missile production. And unbeknownst to anyone but himself, he’s bringing an engagement ring! Experience life in a city that, until the mid-1980s, was closed to foreign visitors.  R.J. Fox’s humorous, poignant, and memorable expedition is punctuated by a colorful cast of characters, adventures, and cultural mishaps and misunderstandings—from irate babushka women to hard-drinking uncles. Lesser mortals might have “phoned home” to be rescued. Armchair travelers and romantics—you will find yourself both schooled in hard knocks and heartened to have shared in the unforgettable experience of Love & Vodka!\n\n“If you've ever done something crazy in the name of love, R.J. Fox's adventures in Ukraine will strike a chord. This book is a delight!” (Davy Rothbart)  \n\nR.J. Fox is the award-winning writer of several short stories, plays, poems, and fifteen feature-length screenplays. He teaches English and Video Production in the Ann Arbor Public Schools where he uses his own dream of making movies to inspire his students to follow their own dreams. \n\nSigning to follow.", "url": "https://www.facebook.com/events/207122056324562/", "source": "Facebook", "name": "Love & Vodka: My Surreal Adventures in Ukraine with R.J. Fox"}, {"date": "2016-04-21T19:30:00-04:00", "description": "Ann Arbor Civic Theatre presents Neil Simon’s comedy, Barefoot in the Park, directed by Wendy Wright, April 21-24, 2016, at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org.  \n\nThis hilarious romantic comedy concerns New Yorkers Paul, a buttoned-down lawyer, and his free spirited bride Corrie. Their explosive and passionate relationship plays itself out in a five-story walk-up apartment, while an eccentric neighbor and a meddling mother conspire to test the newlywed’s marriage — all set to a 60’s groovy “Love, American Style” type setting. Director Wendy Wright, whose past A2CT shows have garnered critical and audience acclaim, says of this production, \"Barefoot was Neil Simon's first true hit and has autobiographical elements. It has a freshness and a spark, plus people can easily recognize and relate to the relationships between the characters. This stellar cast is having a ball and we can't wait for the audience to join in the fun. It's the perfect date night comedy!\"\n\nThe production stars Karl Kasischke as Paul, and Colleen Davis as Corrie. Ellen Finch plays the mother, and Larry Rusinsky neighbor Victor. The cast is rounded out by Theo Polley and Thom Johnson in supporting roles.  \n\n“A bubbling, rib-tickling comedy” is how the New York Times gushed about the show in 1963. “I don’t think anyone stopped laughing while the curtain was up last night” gushed The New York Daily News.The original production was Neil Simon’s first big hit and launched his remarkable career.\n\nEnjoy an April spring evening with Ann Arbor Civic Theatre as they go “barefoot in the park”", "url": "https://www.facebook.com/events/580331615466350/", "source": "Facebook", "name": "Barefoot in the Park"}, {"date": "2016-04-21T21:00:00-04:00", "description": "Thu. April 21 | 9pm | 18+ | $15 Cover\n\nI don’t know how to write a bio for an album. I’ve never written one. I’m a comedian. My job is to talk onstage for long enough that the trapped, drunken audience has to buy more chicken wings from the club. I am not qualified to write about music. And yet here I am, writing a bio for the new The Thermals record, We Disappear. Thank god it’s a great fucking record.\n\nThe first time I heard The Thermals was on broken headphones while riding the A Train to Rockaway, Brooklyn, flying mere feet over a frozen Jamaica Bay on a too-bright January morning. I had just fallen in love with a wonderful, terrible woman who was thousands of miles away. I was very fragile, I had no boundaries, and I was the strongest I’d ever been. And that’s how this album feels. There’s a new vulnerability here, but The Thermals’ sound is as strong as it’s ever been.\n\nThe Thermals are best at making songs you put on mixtapes named ‘Drunken Sing-alongs When You’re Sad.’ They specialize in late-night, secret conversations about feeling simultaneously romantic and resentful over being raised Catholic. They’re the soundtrack to breaking glass, and an ode to the beauty of brokenness.\n\nThey say that the mark of intelligence is the ability to hold two disparate and conflicting truths in the mind at the same time: I am a good person; I am not a good person. We Disappear lives in this delicate, in-between place: at once hard and noisy, while also soft and personal. And seeming contradictions abound on this album. We Disappear is an all-too-real, dark, and intensely personal album – in the past most of singer Hutch Harris’ lyrics have been mostly fictitious tales – about how we try to outrun demise, whether personal or physical. It is an emotional document of how two people can tear each other apart, while simultaneously making you wanna get up and jump around the room.\n\nThe deeply dark, yet oddly catchy “Heart Went Cold” plays on the double metaphor of loss of love/life and features the sad realization “I pushed you away”, but is immediately followed by the super poppy “oh-oh oh”. The classic fucking rock anthem “Hey You” is a paranoid fantasy about running from the Grim Reaper as he calls after you, about “being terrified of death,” says Harris, but “a celebration of that feeling as opposed to feeling sad about it.” A surprisingly uplifting eulogy of the death of a relationship, “Thinking Of You” is explained by Harris as “one of the most straight-forward love songs we’ve ever written, a point-blank post-break up song. It’s a song that says exactly what it means. It and a lot of the record are about regret, i.e. still loving someone after a break-up and hanging on to these feelings.”\n\nWe Disappear is also about separation in terms of technology, how it can isolate us and impact our relationships, and how humans have embraced it to the point where we’ve already assimilated into it. “The Great Dying” and “Into the Code” examine how we’re so afraid we’re going to be forgotten, or overlooked, that we upload everything about our lives onto the Internet.\n\nHarris explains, “Technology, love and death are the three obsessions of the record. Our privacy used to be so important to us and now everything has changed – we freely offer once private information about relationships and reveal everything about our day-to-day lives. We’re trying to preserve our life digitally so when we’re gone people won’t forget us. We’re using technology to become immortal. You can even set up Facebook and Twitter accounts to continue updating after you die! We Disappear is about how humans fight the inevitable.”\n\nI’m sure you want to know that the record will come out March 25th, 2016 on Saddle Creek, that it features the longest running Thermals line-up of Hutch Harris, Kathy Foster, and Westin Glass, and that it was recorded in Portland, OR at Kung Fu Bakery (The Shins, Tegan and Sara) and in Seattle, WA at The Hall of Justice (Nirvana, Mudhoney), and produced by Chris Walla (formerly of Death Cab For Cutie). But what really matters is that this record GETS IT. It walks that fine line between truth and lies, between death and life, between depression and joy – all the while recognizing that one cannot exist without the other. And it brings us with it. That’s the reason to listen to this record: Because it’s a fucking great album, by an amazing band. Long Live The Thermals.", "url": "https://www.facebook.com/events/1683772608545604/", "source": "Facebook", "name": "The Thermals w/ Summer Cannibals 4/21/16 at Blind Pig - Ann Arbor"}, {"date": "2016-04-21T22:00:00-04:00", "description": "Neti Collective presents a farwell to spring with some of A2's best.\n\nActs:\n\nAfter Hours Radio\nMunch\nTear Soup\nTravis Preston\nVest and Tyler (Tyler Denig)\nFallow Land\nParakiit (Dominic Vetuschi)\nLillian Valley", "url": "https://www.facebook.com/events/1552411291718475/", "source": "Facebook", "name": "Neti Collective Presents Spring Sendoff"}, {"date": "2016-04-22T07:00:00-04:00", "description": "To celebrate Earth Day and help teach kids how being a friend to the enviroment pays off, we're giving every child under 12 a piece of organic fruit when they bring in something to be recycled! Just have your kiddo bring their recycleable in to trade with one of our produce team members- happy Earth Day!", "url": "https://www.facebook.com/events/1736136836668228/", "source": "Facebook", "name": "Earth Day for Kids"}]