[{"date": "2016-10-02T12:00:00-04:00", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/", "source": "Facebook", "name": "POP-X"}, {"date": "2016-10-02T13:00:00-04:00", "description": "Stewardship Workday\nSunday, October 2\nBluffs Nature Area\n1 to 4 p.m.\nTucked away within Bluffs’ 39 acres is an open field filled with native prairie species. Come out and help us preserve this beautiful habitat by removing invasive shrubs, such as buckthorn and honeysuckle, which are encroaching on the prairie. Meet at the park entrance on Sunset Road. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/1039321782829774/", "source": "Facebook", "name": "Stewardship Workday-Bluffs Nature Area"}, {"date": "2016-10-02T15:00:00-04:00", "description": "Author: \n\nWilliam Ayers, formerly Distinguished Professor of Education and Senior University Scholar at the University of Illinois at Chicago (UIC) has written extensively about social justice and democracy, education and the cultural contexts of schooling, and teaching as an essentially intellectual, ethical, and political enterprise. His books include A Kind and Just Parent; Teaching toward Freedom; Fugitive Days: A Memoir; Public Enemy: Confessions of an American Dissident; On the Side of the Child; Teaching the Personal and the Political; To Teach: The Journey, in Comics; Teaching toward Democracy; and Race Course: Against White Supremacy.\n\nBook: \n\nIn an era defined by mass incarceration, endless war, economic crisis, catastrophic environmental destruction, and a political system offering more of the same, radical social transformation has never been more urgentor seemed more remote. \n\nA manifesto for movement-makers in extraordinary times, \"Demand the Impossible \" urges us to imagine a world beyond what this rotten system would have us believe is possible. \nIn critiquing the world around us, insurgent educator and activist Bill Ayers uncovers cracks in that system, raising the horizons for radical change, and envisioning strategies for building the movement we need to make a world worth living in.\n\nhttp://bit.ly/2bDtSha", "url": "https://www.facebook.com/events/518635875000773/", "source": "Facebook", "name": "Author Bill Ayers - Discussion and Signing"}, {"date": "2016-10-02T17:00:00-04:00", "description": "Join Kerrytown Concert House as we celebrate the lead-up to the 20th anniversary of our avant-garde jazz festival Edgefest (October 26-29) with a series of free concerts throughout Ann Arbor!\n\nMark Kirschenmann's Big Fun plays the electric music of Miles Davis, including material from In A Silent Way, Big Fun, On the Corner, Get Up With It, and Tutu.\n\nThe band includes: Mark Kirschenmann, trumpet/electric trumpet; Stephen Rush, keyboards; Patrick Booth, tenor/soprano saxophones; Tim Flood, electric bass; Jeremy Edwards, drums; Dan Piccolo, percussion; Jonathan Edwards, electric guitar.\n\nThis performance is made possible through the generous sponsorship of The Maxine and Stuart Frankel Foundation in honor of Maurice and Linda Binkow on the occasion of her 80th birthday and their 60th wedding anniversary.\n\nThis concert is a part of the Warming Up The Edge series leading up to Kerrytown Concert House's Edgefest festival of creative music in celebration of the festival's 20th anniversary.", "url": "https://www.facebook.com/events/1269554833089875/", "source": "Facebook", "name": "Big Fun at the UMMA | Warming Up the Edge Series"}, {"date": "2016-10-02T20:00:00-04:00", "description": "COMICS and PERFORMERS: Please click \"See More\" below for spot request instructions for 10/2/16.\n\nWatch old comics develop new bits and new comics just develop at the UNclub (TM) at The Madhouse in Ypsilanti, MI.\n\nFor non-performers, a $5 suggested donation at the door to cover overhead.\n\nComics and performers, please follow these procedures for stage time:\n\n- Click \"Going\" on this Facebook Event. Even if you are thinking about it, you can click \"Interested\" so you can get updates on this page. Do this by 4:00pm, the day of the show. This does not guarantee you a spot, but not doing it puts you at the bottom of the list.\n- After 4:00pm Sunday, \"show ups\" can \"go up\" only if spots are available.\n- The line-up will be created just before showtime.\n- Those arriving after the line-up is finalized will be given spots as time permits.\n- Length of stage time will depend largely on the turn out, performer's experience, and the show-runner's discretion.\n- As always, if you show up and do not get a spot, you will be put at the top of the list for the next show.\n- Please refrain from bringing alcohol. Beer and wine will be available for purchase. You will need to buy a membership to drink, $2 for the day, or $10 for the whole year. Layout will be basically what we had before in Ypsi, boxes and cans with a container for money. \n\n--- Want to increase your odds of getting a spot? Here's some DO's and DON'T's\nDO . . . . Share this event page with your fans on your fan page, your facebook page, your website, or your tweets, or any other social media.\nDO . . . . Volunteer for less time. If you are willing to do 3 rather than 5, or 4 rather than 7, then you are more likely to get a spot.\nDO . . . . Come to the paid shows.\nDO . . . . Stay for \"meet and greet\" after shows.\nDO . . . . Answer poll questions whenever they appear on the event page.\nDO . . . . Bring people. This is not, I repeat NOT, a \"bringer.\" But if somebody has come to see you, it will be very hard to deny you a spot. In the past, we've had shows where we've added a minute of time for every person the comic brought as a non-performing audience member. Bring three people and a five minute spot becomes an eight minute spot.\n\nContact Mark at: www.facebook.com/marksweetman\n\nChili Challis, former staff writer for The Tonight Show with Jay Leno and nationally known comedian, writer and teacher says about The UNclub,\n\n\"The ... UNclub IS as close to a pure artist's way of pursuing, grasping and understanding comedy as I have ever known; not to mention it's open and fair to every talent, EVERY talent, even ones right off the street. Comics are allowed to go 'out there' and they're permitted to fail and still be welcomed back. It doesn't get any better than that as far as I'm concerned, and I've been known to be a bit fussy. This special venue is poised for the big wave, it is so ready and worthy of being discovered by an audience...and when they do it will be pure addiction.\"﻿", "url": "https://www.facebook.com/events/300255827017458/", "source": "Facebook", "name": "The UNclub at the Madhouse, October 2, 2016"}, {"date": "2016-10-03T09:00:00-04:00", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "url": "https://www.facebook.com/events/1676692335988216/", "source": "Facebook", "name": "Maker Space Operations Bootcamp"}, {"date": "2016-10-03T19:00:00-04:00", "description": "Literati is pleased to welcome Katie Chase, reading from her story collection, Man and Wife.\n\nFiction. From Twilight Zone suburbia to cities on fire to post-Soviet Kyrgyzstan, these award-winning stories range over unexpected landscapes—and land squarely in the wildness of the human heart.\n\n\"Katie Chase's stories have a rhythm, a form, and a mesmerism all their own.\"—Kevin Brockmeier\n\n\"Toggling between the comic and the horrific, these brilliant stories rearrange the familiar into something more nuanced, fraught, and mysterious.\" —Edan Lepucki\n\n\"With sharp, confident consideration of what it takes to survive in the world as a woman, Man and Wife introduces an important new literary voice.\" —Danielle Evans\n\n\"Katie Chase's narrators sound like the girl-next-door…if you lived next door to a parallel universe.\"—Peter Ho Davies\n\n\"Captivating, haunting, and eerily smart. Every story in this collection gave me chills. Katie Chase is one of a kind.\" —Jennifer DuBois\n\n\"An imagination worth watching.\"—The New York Times\n\nKatie Chase's short fiction has appeared in the Missouri Review, Five Chapters, the Literary Review, Narrative, Prairie Schooner, ZYZZYVA, Mississippi Review, and the Best American Short Stories and Pushcart Prize anthologies. A graduate of the Iowa Writers' Workshop, she is the recipient of a Teaching-Writing Fellowship, a Provost's Postgraduate Writing Fellowship, and a Michener- Copernicus Award. She has also been a fellow of the MacDowell Colony and the Center for Steinbeck Studies at San José State University. Born and raised outside Detroit, Michigan, she lives currently in Portland, Oregon.", "url": "https://www.facebook.com/events/832373760197638/", "source": "Facebook", "name": "Fiction at Literati: Katie Chase"}, {"date": "2016-10-04T09:00:00-04:00", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "url": "https://www.facebook.com/events/1676692335988216/", "source": "Facebook", "name": "Maker Space Operations Bootcamp"}, {"date": "2016-10-04T18:15:00-04:00", "description": "Free and open to the public. Seating is first come, first serve.\nChina Miéville lives and works in London. He is a three-time winner of the prestigious Arthur C. Clarke Award (Perdido Street Station, Iron Council, and The City & the City) and has also won the British Fantasy Award twice (Perdido Street Station and The Scar). The City & The City, an existential thriller, was published in 2009 to dazzling critical acclaim and drew comparison with the works of Kafka and Orwell (The Times) and Phillip K. Dick (The Guardian). The City & The City recently won the British Science Fiction Award, the Arthur C. Clarke Award, and tied with Paolo Bacigalupi's The Windup Girl for the 2010 Hugo Award. It was also shortlisted for the Nebula Award.\nReception at 5:30 p.m. Book signing to follow the reading.", "url": "https://www.facebook.com/events/368534780202162/", "source": "Facebook", "name": "Zell Visiting Writer Series: China Miéville, International Disti"}, {"date": "2016-10-04T19:00:00-04:00", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nRyan Racine\nhttp://ryan-racine.squarespace.com/\nIt's been a twenty-plus year journey for Ryan Racine to get to where his music finds itself. Recording for the first time as a solo artist and writing without what he refers to as \"the shackles of genre\", the direction is really a culmination of the variety in his past projects. The sound is still very much grounded in American Roots music but is unbound by the narrow concepts he has applied to previous outings. \n\nRyan Racine first made a name for himself as the front man of Ann Arbor’s rockabilly outfit Lucky Haskins. Formed when he was only 15, the band burst onto the metro Detroit rockabilly scene and quickly garnered attention and a loyal fan base. Besides introducing the genre to a whole new generation in the area, they earned spots opening for legends like Carl Perkins, Johnny Cash, and Lee Rocker as well as a slot in the 1995 Detroit Music Awards.\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/176158106121056/", "source": "Facebook", "name": "Acoustic Tuesdays: Ryan Racine"}]