[{"date": "2017-01-20T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1716505231999811/", "description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "name": "Intro to Stagecraft Workshops"}, {"date": "2017-01-20T15:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/306303139753622/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe"}, {"date": "2017-01-20T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/203854936723154/", "description": "Bring your well-worn items that could use a tune up, and we'll take a look at them! \n\nOr, make someone else's day by volunteering at Fix-It Friday and repairing their items.\n\nFix-It Friday:\nThink of this as the last chance before you get rid of something; Free, but no Guarantee.\n\nWe will:\n- try to diagnose what is wrong\n- tell you if we think we may be able to fix it today\n- tell you if you'll need a part, and where you might be able to get it\n- try to fix it to the best of our ability, but in the limited time we have\n\nHowever, we may not be able to fix it. Many products are not designed to be fixed, and just opening them up may damage them. Furthermore, we may not have someone on hand with the expertise to do a proper repair. Also, it may require a special part, tools, information, or materials to repair, or it may just require more time than we have.\n\nWe may end up damaging your item even more. Please let the repairer know how comfortable you are at each stage of diagnosis and repair.\n\nItems that are often easier to repair: lamps, types of toys, broken wires, things that need epoxy/wood glue\n\nItems that are often very difficult to repair: consumer electronics such as CD/Cassette boom boxes, TVs, radios, CD players, VCRs, and DVD players", "name": "Fix-It Friday (third Friday of every month)"}, {"date": "2017-01-20T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/344427089276306/", "description": "Ann Arbor Civic Theatre presents In the Next Room or the vibrator play by Sarah Ruhl, directed by Melissa Freilich, January 19-22, 2017, at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, and $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org. \n \nAt a time when electricity was beginning to light up the dark corners of the polite Victorian home, In the Next Room introduces us to characters wondering what they want and how they are supposed to love.  Dr. Givings treats women for hysteria, and now, thanks to the invention of electricity, he has a new vibrating instrument which is getting amazing results.  On just the other side of the door in the living room, his wife Catherine struggles with her role as a wife and mother.  Each of them is beginning to wonder, and worry, about exactly what is happening in the next room.  Loosen your corset and join Ann Arbor Civic Theatre for a play full of both poetry and farce that asks whether we are so different today.\n \nDirector Melissa Freilich is working with a talented ensemble of actors and designers to develop the world of the doctor’s home.  Describing the emotional impact of the show, she says, “This play brings us into the character's lives.  We don't see what we expect from a Victorian stereotype.  Instead, we recognize real people who are struggling with their own feelings, in a way that's both beautiful and often really funny.”\n \nThe artistic staff of In the Next Room, or the vibrator play includes set designer Leo Babcock, set dressing designer Beth Duey, props designer Aaron Wade, lighting designer Brad Pritts, costume designers Jamee Zielke and Abby Zielke, undergarments designer Molly Borneman, and sound designer Matt Steward.  The talented cast includes Greg Kovas as Dr. Givings, Liana Abela as Mrs. Givings, Amanda Photenhauer as Mrs. Daldry, Ellen Blanchard as Annie, Joseph McDonald as Leo, Maegan Murphy as Elizabeth and Rob Roy as Mr. Daldry.  Stage managed by Alexa Ducsay and produced by Lindsay Harkins.", "name": "In the Next Room or the Vibrator Play"}, {"date": "2017-01-20T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/734797873344166/", "description": "Out Loud Chorus explores the concepts of safety and finding a home. Songs include: Come to My Garden, Rather Be, Somewhere Only We Know, Earth Song and Would You Harbor Me. Tickets are $15 in advance/$18 at door, $12 for seniors & students (65+). Free for children under 4 and unemployed people. Out Loud is sponsored in part by the Michigan Council of Arts and Cultural Affairs and the NEA. Our Saturday night performance is sponsored by the WCC Out-Space Club. Paul Haebig directs the chorus. Brendan Jacklin accompanies us on piano, Tamara Perkuhn plays drums and Edie Herrold rounds out the trio on bass.", "name": "Come On In, Come On Out - Friday"}, {"date": "2017-01-20T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/703366213178647/", "description": "Warm Up Winter with Beaver Island’s Best:\nHot Jazz & Cool Classical\n\nTerry Lower, piano\nPaul Keller, bass\nPete Siers, drums\nMartha Guth, soprano\nMay Phang, piano\n\nJoin us for a special concert benefitting the Beaver Island Cultural Arts Association to help raise money for the purchase of a new piano to be used at their Baroque on Beaver Island Festival and Jazz Weekend. This concert will feature some of your favorites from Beaver Island performances in both the jazz and classical genres! All proceeds from this concert benefit the Beaver Island Piano Campaign.\n\n$35 Assigned Rows 1-2\n$25 Assigned Rows 3-5\n$20 General Admission\n$10 Student", "name": "Warm Up Winter with Beaver Island’s Best"}, {"date": "2017-01-20T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/162528160891684/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Hatsy Sticksy  \nGroup 2: Listen Stupid\nGroup 3: The League of Pointless Improvisers", "name": "Pointless Improv with Hatsy Sticksy and Listen Stupid"}, {"date": "2017-01-20T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1278154148922819/", "description": "Robbie Fulks has the soul of a country singer and the mind of a vaudevillian. His cross-genre antics and clever, heartfelt writing are accompanied by his amazing guitar work in honky-tonk, country, bluegrass, power pop, or whatever style strikes his ample whimsy at the time.\nRobbie learned guitar from his dad; banjo from Earl Scruggs and John Hartford records; and ﬁddle (long since laid down in disgrace) on his own. He attended Columbia College in New York City and dropped out to focus on the Greenwich Village songwriter scene and other ill-advised pursuits. Since then he has gone on to create a multifarious career in music. He was a staff instructor at Old Town School of Folk Music; he worked on Nashville’s Music Row as a staff songwriter.\nRadio loves him too, with multiple appearances on WSM's “Grand Ole Opry;” NPR’s “Fresh Air,” “Mountain Stage,” and “World Café;” and the syndicated “Acoustic Café.” TV appearances include \"Austin City Limits,\" \"Today,\" \"Late Night with Conan O’Brien,\" and \"30 Rock.\" TV/ﬁlm use of his music includes \"True Blood,\" \"My Name Is Earl,\" and \"Very Bad Things,\" and he has voiced or sung campaigns for Budweiser, McDonalds, Nickelodeon, and Applebees. Theatrical credits include “Woody Guthrie’s American Song” and Harry Chapin’s “Cottonpatch Gospel.” He tours yearlong with various conﬁgurations and plays a weekly residency at the Hideout in Chicago. Come join us for Robbie Fulks' first visit to Green Wood! www.robbiefulks.com", "name": "Robbie Fulks at Green Wood Coffee House"}, {"date": "2017-01-20T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1213839948663153/", "description": "Fri. January 20 | 9pm | 18+ | $16 Cover\n\n\nMatthew Dear has announced a new DJ-Kicks mix–out January 27 via !K7. The mix features unreleased music from Dear, including two unheard Audion cuts. There are also tracks by Nils Frahm, Simian Mobile Disco, Pearson Sound, and others. “I always have a lot of unreleased music laying around, those I included on here seemed to fit,” Dear said in a statement. “A mix like this is always a good place to showcase my own productions, but I didn't want to oversaturate it with my own stuff.” See the artwork and tracklist below.\n\nWSG: SHIGETO", "name": "Matthew Dear wsg Shigeto 1.20.17 at Blind Pig - Ann Arbor"}, {"date": "2017-01-20T22:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1220689491333425/", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\nNo two shows are the same!\nTickets are $10.", "name": "A Pointless Display of Improvised Feats"}]