[{"source": "Facebook", "date": "2017-02-05T14:00:00-05:00", "url": "https://www.facebook.com/events/722433277934469/", "description": "Protecting Wisdom: Tibetan Book Covers from the MacLean Collection is the first major exhibition to examine the subject of Tibetan book covers. This stunning visual display illuminates a virtually unknown type of art, one that will charm and intrigue both those familiar and unfamiliar with Tibetan art. For Tibetan Buddhists, books are a divine presence in which the Buddha lives and reveals himself, and they are venerated and handled with the utmost respect. The exhibition features 33 book covers dating from the eleventh to the eighteenth century that represent the glorious iconographic array and non-figural decoration typical of these sacred items. UMMA docents will explore the construction of these hand-held relief sculptures and the images depicted, most commonly deities, important teachers, mantras, and sacred symbols.", "name": "Guided Tour Protecting Wisdom: Tibetan Book Covers from the Mac"}, {"source": "Facebook", "date": "2017-02-05T16:00:00-05:00", "url": "https://www.facebook.com/events/1713140125617477/", "description": "Winners of the grand prize at the inaugural M-Prize Chamber Music Competition at the University of Michigan in May, the Calidore String Quartet is “a miracle of unified thought,” (La Presse, Montreal).\n\nhttp://ums.org/performance/calidore-string-quartet/", "name": "Calidore String Quartet"}, {"source": "Facebook", "date": "2017-02-05T18:30:00-05:00", "url": "https://www.facebook.com/events/1323412567725529/", "description": "Join us this Sunday at the Brewpub to watch the game! Happy hour starts early for the game at 6:30pm (normally 8:00pm).\n\n***WE WILL NOT CLOSE BEFORE THE GAME IS OVER***", "name": "Super Sunday at the Brewpub"}, {"source": "Facebook", "date": "2017-02-05T19:00:00-05:00", "url": "https://www.facebook.com/events/1318197361551642/", "description": "Ashwini Bhasi lives in Ann Arbor, Michigan and writes poems to make sense of the mind-body connection of trauma and chronic pain, life in India, and the duality of her experiences as a genomic data analyst and poet. Her poems have appeared or are forthcoming in Room Magazine, Rogue Agent, Yellow Chair Review, The Feminist Wire, Driftwood Press, and Eunoia Review among others. Her poem about the 2016 presidential election was recently nominated for a Pushcart prize.", "name": "Open Mic and Feature: Ashwini Bhasi"}, {"source": "Facebook", "date": "2017-02-05T19:30:00-05:00", "url": "https://www.facebook.com/events/254338798323472/", "description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "name": "Sing Happy!"}, {"source": "Facebook", "date": "2017-02-06T00:00:00-05:00", "url": "https://www.facebook.com/events/388503011499248/", "description": "COLD-PRESSED JUICE CLEANSES ARE BACK!\n\n... and just in time for the New Year! For the month of January only– get 10% off your juice cleanse and a free yoga class with Bikram Yoga West!\n\nBook your Cleanse now with promo code JUICECLEANSEJANUARY at Store.BaboAnnArbor.com!", "name": "Babo Juice Cleanses"}, {"source": "Facebook", "date": "2017-02-06T20:00:00-05:00", "url": "https://www.facebook.com/events/195810100885174/", "description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XV"}, {"source": "Facebook", "date": "2017-02-06T20:30:00-05:00", "url": "https://www.facebook.com/events/294043017665724/", "description": "Come watch a Free live streaming of \"Gender Revolution\" as it airs on National Geographic. It's a 2 hour special on gender hosted by Katie Couric.\n\nWe'll have pizza, other light snacks, and drinks downstairs starting at 8:30, and the airing starts upstairs at 9 PM. The special airs from 9-11 PM. If anyone is interested, we'll be sticking around to discuss and debrief afterward until 11:30 PM.\n\nSpace is somewhat limited, so arrive early to secure seating.\n\nThis event is hosted at Jim Toy Community Center, which is a resource center that exists to provide information, education, social events, and advocacy by and for the Queer and Ally community in the Washtenaw County area. JTCC welcomes all who support its mission to participate in its activities.", "name": "Screening of \"Gender Revolution\" by Nat Geo"}, {"source": "Facebook", "date": "2017-02-07T18:00:00-05:00", "url": "https://www.facebook.com/events/1740380069610961/", "description": "A full sensory experience with 8 wines, cheese, and charcuterie! Enjoy tasting 8 Spanish wines served with hors d'oeuvres in a mix & mingle setting, with a briefing on each wine!\n\nWe are featuring Spanish Wines for this tasting!", "name": "Sava's Uncorked: Spanish Wines"}, {"source": "Facebook", "date": "2017-02-07T19:00:00-05:00", "url": "https://www.facebook.com/events/1638958979732559/", "description": "This program is free and open to the public. Seating is first-come, first-served.\n\nJoin two incomparable artistic duos— Amy Burton and John Musto, and William Bolcom and Joan Morris—for a cabaret evening of songs and duets by Gershwin, Porter, Coward, Bolcom, Musto and other favorites. Mr. Musto appears courtesy of the 2017 William Bolcom Guest Residency in Composition.\n\nThe SMTD@UMMA performance series is generously supported by the Katherine Tuck Enrichment Fund and the Greg Hodes and Heidi Hertel Hodes—Partners in the Arts Endowment Fund.", "name": "Double Date: SMTD at UMMA"}]