[{"date": "2016-08-06T09:00:00-04:00", "description": "What was once a construction yard for M-14 is now a natural grassland. Exotic invasive plants are invading this open habitat, and volunteer help is needed to remove them. Please meet at the park entrance on Beechwood Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Kuebler Langford Park Stewardship Workday", "url": "https://www.facebook.com/events/247419802290299/", "source": "Facebook"}, {"date": "2016-08-06T10:00:00-04:00", "description": "Now through next Thursday, all our Private Label supplements and essential oils are 25% off! Stock up on nutritional support, tintures, essential oils for health or aromatherapy, vitamins, and more. While supplies last.", "name": "25% Off Lucky's Market Supplements", "url": "https://www.facebook.com/events/268595390193528/", "source": "Facebook"}, {"date": "2016-08-06T10:00:00-04:00", "description": "Happy Birthday Ann Arbor Farmers Market! This year we're celebrating 97 years of bringing the community together over fresh, local, delicious food and more! Join us as we thank our vendors and community for their loyal support.  We're one year closer to the big 100! \n\nIn addition to the regular market hours 7am-3pm, we are so excited to have games and activities for market-goers of all ages 10am-2pm on Detroit Street. Come decorate a birthday card for a market vendor and pick up some tasty treats from some of our favorite local food trucks.\n\nFood Gatherers will be onsite 7am-3pm, accepting donations of fresh fruits and vegetables. This is fantastic opportunity to give back right at the market! The market's birthday kicks off this fantastic partnership, which will be ongoing throughout the month of August.\n\nLiterati Bookstore will be showcasing local food, cooking and gardening books with great examples for ingredients that you can buy right at the market!\n\nA #TasteofMusic performance by the Ann Arbor Symphony Orchestra starting at 12:30 with an instrument petting zoo for kids of all ages from 10am-2pm.\n\nDon't forget to tag us in your pictures with #a2marketbday\nWe're on Twitter and instagram too!", "name": "97th Birthday Celebration!", "url": "https://www.facebook.com/events/1254446424585433/", "source": "Facebook"}, {"date": "2016-08-06T11:00:00-04:00", "description": "Calling all IPA lovers!! Today we come together to share our love of Humulus lupulus!\nWe will feature 5 ABC IPA's on tap kicking off at 11:00am.\n\n- Precious Metal IPA\n6.8% ABV 43 IBU\nSingle-Hopped IPA with El Dorado\n\n- Shark Jumper DIPA\n8.9% ABV 90 IBU\nResinous and dank with hints of apricot and meyer lemon.\n\n- Sacred Cow Cask IPA\n6.9% ABV 80 IBU\nTangy, citrusy hops with distinct ruby-red grapefruit\n\n- Buzzsaw American IPA\n7.5% ABV 51 IBU\nBold hop-forward west coast style with notes of pine, grapefruit, and apricot\n\n - Largebeat Wheat IPA\n8% ABV 90 IBU\nImperial wheat IPA with loads of hops", "name": "IPA Day!", "url": "https://www.facebook.com/events/1673599989630250/", "source": "Facebook"}, {"date": "2016-08-06T13:00:00-04:00", "description": "Walk along Malletts Creek, watch the birds at the pond, play a game of disc golf, or ride your bike on the paved path – no matter what you’re doing in this park, you’re sure to see the effects of ongoing restoration work. Mary Beth Doyle Park has been transformed by volunteers! Help continue the effort by removing trash and invasive weeds in the open areas of this park. Please meet at the end of Verle Road, two blocks west of Platt Road. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Mary Beth Doyle Nature Area Park Stewardship Workday", "url": "https://www.facebook.com/events/238795023164171/", "source": "Facebook"}, {"date": "2016-08-06T17:00:00-04:00", "description": "This is your last chance to see the Ann Arbor Derby Dimes play at Buhr Park this year!!!! Come watch these two fabulous bouts for one low price!\n\n6:00- Arbor Bruising Co. vs. Flint City Derby Girls\n\n7:30- Ypsilanti Vigilantes vs. Killamazoo Derby Darlins Kill Squad \n\nBouts include kid-friendly activities, half-time entertainment, sponsored concessions, and giveaways! \n\nDoors open at 5:00, first whistle at 6:00!\n\nAfter party location: * Aubree's Pizzeria and Grill* 39 E. Cross Street, Ypsilanti, MI 48198 * http://aubrees.com/", "name": "Ann Arbor Roller Derby Double Header", "url": "https://www.facebook.com/events/1558006737841380/", "source": "Facebook"}, {"date": "2016-08-06T18:00:00-04:00", "description": "Come join us for a night out with handcrafted non-alcoholic drinks, good community, and games! Some games will be provided, but you are welcome to bring your own as well.\n\nCo hosts/sponsors Vault of Midnight and Brillig Dry Bar", "name": "OUTFest Board Game Night", "url": "https://www.facebook.com/events/1590324857926798/", "source": "Facebook"}, {"date": "2016-08-06T20:00:00-04:00", "description": "Join us on Friday, Saturday & Sunday, August 5-7 for OUTFest 2016!  OUTFest is free and open to the public. \n\n~~ Friday, August 5, 2016 ~~\n\nMovie Night: Rent in Braun Court: 8:00 PM\nNecto Pride Night at Necto: 9:00 PM - 2:00 AM\n\n~~ Saturday, August 6, 2016 ~~\n\nFestival Booths & Exhibits at Kerrytown N. 4th Ave.: 10:00 AM-8:00 PM\n\nJim Toy Community Center Open House: 10:00 AM-5:00 PM\n\nDJ Selina Style at N. 4th Ave. Stage: 10:00 AM-Noon\n\nRedi and the Midnight Hour Perform at N. 4th Ave. Stage: Noon-2:00 PM\n\nKid Zone in Braun Court at Braun Court Parking Lot: Noon-6:00 PM\n\nElemental Meaning Performs at N. 4th Ave. Stage: 2:00-3:00 PM\n\nDrag Revue at Kerrytown N. 4th Ave. Stage: 3:00-4:30 PM\n\nBeer & Wine Garden at Braun Court Parking Lot: 4:00 PM-Midnight\n\nSilent Auction at Beer & Wine Garden: 4:00-7:00 PM\n\nCivil Rights & Equal Protection Talk at The Bar at 327 Braun Ct: 4:00-5:00 PM\n\nAlise King Performs at Kerrytown N. 4th Ave. Stage: 4:30-5:30 PM\n\nPoetry Slam w/ Jason B. Crawford at The Bar at 327 Braun Ct: 5:00-6:00 PM\n\nOut Loud Chorus Performs at N. 4th Ave. Stage: 5:30-6:30 PM\n\nBoard Game Night at Brillig Dry Bar/Mighty Good (N. Main): 6:00-10:00 PM\n\nBurlesque Show with Queens of Cups at Kerrytown N. 4th Ave. Stage: 6:00-7:00 PM\n\nSam Tolson Performs at Kerrytown N. 4th Ave. Stage: 7:00-8:00 PM\n\nOUTFest Drag Revue w/ Jadein Black & Sabin at N. 4th Ave. Stage: 8:00-9:00 PM\n\nNecto Pride Dance Party with DJ Jace at N. 4th Ave. Stage: 9:00 PM-Midnight\n\nOUTFest After Party at Circus Bar: Midnight-2:00 AM\n\n~~ Sunday, August 7, 2016 ~~\n\nWashtenaw County Pride Picnic at Wheeler Park: Noon-4:00 PM\n\n\nFor a complete and evolving schedule of events, visit www.a2outfest.com\n\nPresenting Sponsors:\nComcast Michigan\nBetween The Lines Newspaper\nWolverine State Brewing Co.\nBarefoot Wine & Bubbly\nNecto Pride\n\nSponsors:\nMANI Osteria & Bar & Isalita\nDomino's Pizza\nComerica Bank\nCare One, Inc.\nVisit Ann Arbor! & Ypsi Real\nOut Post\nBill's Beer Garden\nTrillium Real Estate\nBlue Cross Blue Shield of Michigan\nbank of ann arbor\nPNC\nDuo Security\nAut Bar & Common Language Bookstore\nUNIFIED - HIV Health and Beyond\nAmerican Red Cross of Southeast Michigan\nUniversity of Michigan Spectrum Center\nCorner Health Center\nWoodland Mews & Harbor House at Ann Arbor\n327 Braun Court\nThe Wurst Bar\nMighty Good Coffee\nBrillig Dry Bar\nWilson P. Tanner III, PLC\nCircus Bar and Billiards Ann Arbor\nColor Pet Productions\n\nFriend of Jim Toy:\n Zingerman’s, Queer Young Professionals, Plum Market\n\nHonorary Chairs:\nJim Toy, Sheriff Jerry Clayton, State Representative Adam Zemke, State Representative Kristy Pagan, Commissioner Felicia Brabec,  Commissioner Andy LaBarre, Commissioner Yousef Rabhi, City Council member Anne Brown, Leigh Greden, Jason Frenzel, Cynthia Dunitz, Jim Simpson, Jeremy Merklinger, Heather Wold-Gallagher, Jennie Hale, Mary Larkin, Christine Kitora, Meg Wyzlic, Renee & John Greden\n\nOur Mission: We envision an inclusive community where people of diverse sexual orientation and gender identity are visible and live together in equality, respect and happiness.", "name": "OUTFest & Pride Picnic 2016", "url": "https://www.facebook.com/events/503218819864337/", "source": "Facebook"}, {"date": "2016-08-06T20:00:00-04:00", "description": "It's movie night at Pointless! \"Silver Screenings Playbook\" is a curated collection of comedic video shorts from Detroit area filmmakers and actors. Our League of Pointless Improvisers will open the show with some hilarious improv, then the films start rolling, giving you a wide variety of some of the best homegrown comedy around. One weekend only!\n\nFriday, August 5 @ 8 pm\nSaturday, August 6 @ 8 pm", "name": "Silver Screenings Playbook", "url": "https://www.facebook.com/events/1029166527138447/", "source": "Facebook"}, {"date": "2016-08-06T21:00:00-04:00", "description": "Saturday, August 6 | 9pm | 18+ | $8 adv./ $10 day of\n\nPhish Tribute feat: The Powerful Pills - Phish Tribute", "name": "Phish Tribute: Powerful Pills & Dead Ahead Ohio 8/6/16 at Blind Pig - Ann Arbor", "url": "https://www.facebook.com/events/1729703780616950/", "source": "Facebook"}]