[{"date": "2016-05-18T19:00:00-04:00", "description": "Literati is pleased to host Teen Spirit, an award-winning publication of the Skyline High School Writing Center. Teen Spirit is a literary magazine that allows the entire school’s creative community to exhibit their writing, artwork, and multimedia creations.\n\nThis event will feature several exceptional Skyline student writers reading their fiction, poetry, and essays from Teen Spirit publicly for the first time.\n\nAn editorial board comprised of students in the Skyline Writing Center curate, layout, and edit Teen Spirit. This year’s editorial board consists of general editors Celia Arsen (‘16), Leah Bauer (‘16), Kelsey Carpenter (‘16), and Christopher Morgan-Martin (‘17),  art editors Star Su (‘17) and Eleana Tworek (‘16), and promotions directors Anna Dang (‘17), Ella Horwedel (‘16), and Kaelan Oldani (‘16) .  \n\nThe first two editions of Teen Spirit (‘13 and ‘14) received a superior rating from the National Council of Teachers of English (NCTE), which is the competition’s highest possible rating.  The third edition of Teen Spirit (‘15) received an excellent rating from the NCTE, which was the magazine’s third consecutive top-five finish.\n\nThe Skyline Writing Center is a student-centered peer tutoring and mentoring organization that provides high quality writing support to students every hour of every school day.  Each year, 35 qualified juniors and seniors are trained to work with all students on a wide variety of genres at any stage of the writing process.  Since its founding in 2012, the Writing Center has made more than 4,000 student contacts.  \n\nJeffrey Austin, a Skyline English teacher, is the program’s founder and director.\n\nTwitter: @Skyline_WC\n\nWebsite: tinyurl.com/skylinewc\n\nFacebook: Skyline Writing Center", "url": "https://www.facebook.com/events/629992600482127/", "name": "Skyline High's Teen Spirit issue reading", "source": "Facebook"}, {"date": "2016-05-18T19:00:00-04:00", "description": "John Hart is the author of the upcoming REDEMPTION ROAD, and of four New York Times bestsellers, THE KING OF LIES, DOWN RIVER, THE LAST CHILD and IRON HOUSE. The only author in history to win the best novel Edgar Award for consecutive novels, John has also won the Barry Award, the Southern Independent Bookseller's Award for Fiction, the Ian Fleming Steel Dagger Award and the North Carolina Award for Literature. His novels have been translated into thirty languages and can be found in over seventy countries. A former defense attorney and stockbroker, John spends his time in North Carolina and Virginia, where he writes full-time.\n\nImagine:\nA boy with a gun waits for the man who killed his mother.\nA troubled detective confronts her past in the aftermath of a brutal shooting.\nAfter thirteen years in prison, a good cop walks free as deep in the forest, on the altar of an abandoned church, a body cools in pale linen…\nThis is a town on the brink.\nThis is Redemption Road.\nBrimming with tension, secrets, and betrayal, Redemption Road proves again that John Hart is a master of the literary thriller.", "url": "https://www.facebook.com/events/1530634843907556/", "name": "Meet NYT Bestselling Author John Hart for a Discussion & Signing of His New Novel, 'Redemption Road'", "source": "Facebook"}, {"date": "2016-05-18T20:00:00-04:00", "description": "All of our bands will perform!\n\nCome and hear some great music.\n\nTunes by Pat Metheny, Thad Jones, Kenny Dorham, Wayne Shorter and more!", "url": "https://www.facebook.com/events/1707886979428452/", "name": "Jazz showcase at Kerrytown  concert house", "source": "Facebook"}, {"date": "2016-05-18T20:00:00-04:00", "description": "All of our Jazz groups will perform! \n\nWe'll be playing tunes by Pat Metheny, Wayne Shorter, Antonio Carlos Jobim, Thad Jones and more.\n\nCome out and hear some great music!", "url": "https://www.facebook.com/events/163456910723631/", "name": "Jazz Showcase at Kerrytown Concert House", "source": "Facebook"}, {"date": "2016-05-19T11:30:00-04:00", "description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: Strawberries & Cream - Cream soda meets fresh-picked strawberry in this juicy rendition of the infamous Strawberry Blonde. Smooth scents of vanilla flood the nose and taste buds at first sip, followed by the bite of strawberry and a satisfying finish.. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "url": "https://www.facebook.com/events/158066451258466/", "name": "American Craft Beer Week", "source": "Facebook"}, {"date": "2016-05-19T18:00:00-04:00", "description": "Benjamin Weatherston is a commercial and editorial photographer based in Ann Arbor, MI and the photographer and photo editor of The Ann magazine. He considers himself less an artist and more of a skilled tradesman who has been shooting professionally since 1997.  Weatherston works for businesses and publications to visually communicate in creative ways what they do and how they do it. He has a small downtown studio where he meets with clients and does a lot of his portrait and product work while at least half of what he does is on location. He regularly does public speaking engagements and has done a lot of teaching, both privately and in workshop formats. \nWeatherston’s favorite work is “definitely portraiture”. Having created thousands of Ann Arbor portraits over the years, he wants to show how Ann Arbor has some of the most interesting people in the world.", "url": "https://www.facebook.com/events/1777669515797048/", "name": "Ann Arbor Portraits Opening", "source": "Facebook"}, {"date": "2016-05-19T19:00:00-04:00", "description": "Kelly Barson: \n\nK.A. (Kelly) Barson earned her MFA in Writing for Children and Young Adults from Vermont College of Fine Arts. She is the author of 45 Pounds (More or Less) and Charlotte Cuts It Out, both from Viking Children's, an imprint of Penguin Random House. She lives in Jackson with her husband, a pack of unruly designer dogs, and a cat named Karen. \n\nCori McCarthy: \n\nCori McCarthy studied poetry and screenwriting before falling in love with writing for young adults at Vermont College of Fine Arts. She is the author of You Were Here, Breaking Sky, and The Color of Rain. Breaking Sky is in development at Sony Pictures to become a film, while You Were Here is a mixed format contemporary, including word art poetry and graphic novel chapters. Cori lives in western Michigan with her family.\n\n'Charlotte Cuts It Out':\n\nLydia and I were in eighth grade when we came up with our Grand Plan to go to cosmetology school and get jobs to build our clientele while we earned business degrees. Then we’d open our own salon . . .  \n\nNow Charlotte and Lydia are juniors, in a Cosmetology Arts program where they’ll get on-the-job training and college credits at the same time. The Grand Plan is right on schedule.\n\nWhich means it’s time for Step Two: Win the Winter Style Showcase, where Cos Arts and Fashion Design teams team up to dazzle the judges with their skills.\n\nCharlotte is sure that she and Lydia have it locked up—so sure, in fact, that she makes a life-changing bet with her mother, who wants her to give up cos for college.\n\nAnd that’s when things start going off the rails.\n\n'You Were Here': \n\nCori McCarthy delivers an emotionally taut page-turner from multiple points of view combined with stunning illustrations.\n\nJaycee is about to accomplish what her older brother Jake couldn't: live past graduation.\nJaycee is dealing with her brother's death the only way she can by re-creating Jake's daredevil stunts. The ones that got him killed. She's not crazy, okay? She just doesn't have a whole lot of respect for staying alive.\n\nJaycee doesn't expect to have help on her insane quest to remember Jake. But she's joined by a group of unlikely friends all with their own reasons for completing the dares and their own brand of dysfunction: the uptight, ex-best friend, the heartbroken poet, the slacker with Peter Pan syndrome, and... Mik. He doesn't talk, but somehow still challenges Jayce to do the unthinkable-reveal the parts of herself that she buried with her brother.\n\nCori McCarthy's gripping narrative defies expectation, moving seamlessly from prose to graphic novel panels and word art poetry, perfect for fans of E. Lockhart, Jennier Niven, and Jandy Nelson. From the petrifying ruins of an insane asylum to the skeletal remains of the world's largest amusement park, You Were Here takes you on an unforgettable journey of friendship, heartbreak and inevitable change.", "url": "https://www.facebook.com/events/1161062693925432/", "name": "Meet Michigan YA Authors K. A. Barson & Cori McCarthy for a Disucssion & Signing of Their New Novels", "source": "Facebook"}, {"date": "2016-05-19T20:00:00-04:00", "description": "Red Electric Shark - goof rock/experimental animal songs\n\ncig butts - jangly blues rock : back to the basics\n\nSIPS - heavy lounge\n\ndoor @ 8, music @ 9\nsuggested donation 25cent-$1,000", "url": "https://www.facebook.com/events/280289085641992/", "name": "Red Electric Shark // Cig Butts // SIPS at Club Above", "source": "Facebook"}, {"date": "2016-05-20T15:00:00-04:00", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/1747640632114260/", "name": "Drink & Draw / Imbibe & Inscribe", "source": "Facebook"}, {"date": "2016-05-20T17:00:00-04:00", "description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nBUY JUNE 11 TICKETS: http://bpt.me/2538000\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule", "url": "https://www.facebook.com/events/192972824428594/", "name": "Ann Arbor Derby Dimes 2016 season", "source": "Facebook"}]