[{"source": "Facebook", "date": "2016-05-04T07:00:00-04:00", "description": "Finally! The Wednesday Daytime Market is back! Join us for the first one of the season at an earlier start time: 7:00am! \n\nAfter this our summer hours are in full effect: Wednesdays and Saturdays from 7:00 am to 3:00pm\n\nHope to see you there!", "name": "Wednesday Daytime Market", "url": "https://www.facebook.com/events/446750598867331/"}, {"source": "Facebook", "date": "2016-05-04T17:00:00-04:00", "description": "Your favorite Food Trucks are back along with some new choices! Join us on the first Wednesday of each month for some tasty, local food, music, and fun for family and friends! \n\n\nMay 4th\nJune 1st\nJuly 6th\nAugust 3rd\nSeptember 7th\nOctober 5th", "name": "First Wednesday Food Truck Rally", "url": "https://www.facebook.com/events/866000246862709/"}, {"source": "Facebook", "date": "2016-05-04T19:00:00-04:00", "description": "Literati is delighted to host the launch of Chris McCormick's debut, Desert Boys, a staff favorite and our Literati Cultura pick for April! Chris will be joined in conversation by Brit Bennett, author of The Mothers (coming from Riverhead in October).\n\nA vivid and assured work of fiction from a major new voice, following the life of a young man growing up, leaving home, and coming back again, marked by the stark beauty of California's Mojave Desert and the various fates of those who leave and those who stay behind. This series of powerful, intertwining stories illuminates Daley Kushner's world--the family, friends and community that have both formed and constrained him, and his new lief in San Francisco. Back home, the desert preys on those who cannot conform: an alfalfa farmer on the outskirts of town; two young girls whose curiosity leads to danger; a black politician who once served as his school's confederate mascot; Daley's mother, an immigrant from Armenia; and Daley himself, introspective and queer. Meanwhile, in another desert on the other side of the world, war threatens to fracture Daley's most meaningful--and most fraught--connection to home, his friendship with Robert Karinger. A luminous debut, Desert Boys traces the development of towns into cities, of boys into men, and the haunting effects produced when the two transformations overlap. Both a bildungsroman and a portrait of a changing place, the book mines the terrain between the desire to escape and the hunger to belong.\n\n“Desert Boys is hilarious, devious, original, and unforgettable; Chris McCormick writes with a joyful swerve and swagger that is all his own.”―Karen Russell, New York Times bestselling author of Vampires in the Lemon Grove\n\n“Desert Boys is a show off's debut, the work of an unabashed polyglot. There seems to be nothing Chris McCormick can't do: smartypants metafictional experiment, heart-pounding thriller, eulogy for boyhood bonds, meditation on sexuality and post-9/11 intolerance. These linked stories assemble into a kind of compound eye through which we glimpse an oft-forgotten corner of California and, most superbly, a fresh take on masculine Americana. McCormick is the artsy outsider, the affectionate anthropologist, the near-feral boy with a wide-angle lens of history.”―Claire Vaye Watkins, author of Battleborn and Gold Fame Citrus\n\n\"In the hands of this young master of purified prose, ambition, love, and the restlessness of boyhood are trapped as if in a crystal vial. No reader will be able to turn away.\"―Chigozie Obioma, author of The Fishermen\n\n“Chris McCormick’s book is a gift from the new West. In the dry, highland exurbs of Los Angeles and other exotic places, McCormick crafts lustrous tales of brotherhood, immigrants, love, and paintball. Filled with unforgettable characters, Desert Boys is a deeply moving journey through the natural and emotional landscapes of the American present.”―Héctor Tobar, New York Times bestselling author of Deep Down Dark and The Barbarian Nurseries\n\n“This is a book about place, or really like so many books about place (Dubliners, Winesburg, Ohio) two places, in this case two Californias―San Francisco on the one hand; the less familiar but finely evoked small desert community from which the narrator originates on the other. But it's also a book about shame, two shames, the shame of where we come from, and the shame of leaving it. Through a series of quietly intimate confessions we learn how torn the teller is between past and present, small town and big city, and McCormick captures this tension beautifully in the contrast between his laconic, but frankly feeling prose and his restless formal innovation. Wise and vulnerable by turns, this is a quietly stunning debut.”―Peter Ho Davies, author of The Welsh Girl\n\nChris McCormick was raised in the Antelope Valley. He earned his B.A. at the University of California, Berkeley, and his M.F.A. at the University of Michigan, where he was the recipient of two Hopwood Awards. He lives in Ann Arbor, Michigan.\n\nEvent date: \nWednesday, May 4, 2016 - 7:00pm", "name": "Fiction at Literati: Chris McCormick", "url": "https://www.facebook.com/events/1015114025230041/"}, {"source": "Facebook", "date": "2016-05-04T19:00:00-04:00", "description": "Join us to celebrate Ann Arbor's young talent as students from Community High's poetry class share their original work at Bookbound. They brought some amazing work last year, so prepare to be impressed!", "name": "Community High School Poetry Class Reading", "url": "https://www.facebook.com/events/1016761265082388/"}, {"source": "Facebook", "date": "2016-05-05T12:00:00-04:00", "description": "To celebrate Cinco de Mayo, we're doing made-to-order tostadas, just 2/$5. Olé!\n\n12-2\n\n5-7", "name": "Cinco de Mayo Tostada Bar", "url": "https://www.facebook.com/events/775039052632347/"}, {"source": "Facebook", "date": "2016-05-05T12:00:00-04:00", "description": "To celebrate Cinco de Mayo, we're doing made-to-order tostadas, just 2/$5. Olé!\n\n12-2\n\n5-7", "name": "Cinco de Mayo Tostada Bar", "url": "https://www.facebook.com/events/271437596531040/"}, {"source": "Facebook", "date": "2016-05-05T12:00:00-04:00", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 12 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 12, in store or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse = 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "name": "Fresh + Fit!", "url": "https://www.facebook.com/events/110005266066559/"}, {"source": "Facebook", "date": "2016-05-05T19:00:00-04:00", "description": "Literati is thrilled to welcome Jennifer Haigh in support of her latest novel, Heat and Light, a staff favorite and our Literati Cultura pick for May!\n\nMairead's review:\n\n“Heat & Light is a many-voiced and multi-faceted portrait of a place--small-town, fracking-bound Pennsylvania--and its people: pastors and farmers, environmentalists and drill rig workers, prison guards and their prisoners. The book is wildly ambitious--spanning more than thirty years, its many events seen through the eyes of a dozen different characters--and just as wildly successful. In prose that zips and smarts, taut and electric, Haigh renders every one of her many characters in all their moving and human complexity. The result is a fully realized world, and an unforgettable novel.”\n\nJennifer Haigh returns to the Pennsylvania town at the center of her iconic novel Baker Towers, in this ambitious, achingly human story of modern America and the conflicting forces at its heart.\n\nForty years ago, Bakerton coal fueled the country. Then the mines closed, and the town wore away like a bar of soap. Now Bakerton has been granted a surprise third act: it sits squarely atop the Marcellus Shale, a massive deposit of natural gas. To drill or not to drill?  Prison guard Rich Devlin leases his mineral rights to finance his dream of farming. He doesn’t count on the truck traffic and nonstop noise, his brother’s skepticism or the paranoia of his wife, Shelby, who insists the water smells strange and is poisoning their frail daughter.  Meanwhile his neighbors, organic dairy farmers Mack and Rena, hold out against the drilling—until a passionate environmental activist disrupts their lives.\n\nHeat and Light depicts a community blessed and cursed by its natural resources. Soaring, ambitious, it zooms from drill rig to shareholders’ meeting to the Three Mile Island nuclear reactor to the ruined landscape of the “strippins,” haunting reminders of Pennsylvania’s past energy booms.  This is a dispatch from a forgotten America—a work of searing moral clarity from one of the finest writers of her generation, a courageous and necessary book.\n\n“Heat and Light achieves pure novelistic virtuosity. It’s brilliant beginning to end.” — Richard Ford\n\n“Heat and Light is a work of tremendous sweep and ambition, a timely, inventive novel powered by Jennifer Haigh’s remarkable compassion for her characters.” — Jess Walter, author of Beautiful Ruins\n\n“Paragraph by paragraph, the prose is full of marvelous texture and material sensation. Heat and Light is an intricate and ambitious novel, firmly grounded in history and our time. The narrator’s encyclopedic knowledge and keen insights about the physical world and social life make the novel a thrilling page turner.” —Ha Jin, National Book Award-winning author of Waiting\n\nJennifer Haigh is the author of four previous novels: Faith, The Condition, Baker Towers, and Mrs. Kimble, winner of the PEN/Hemingway Award for debut fiction. Her short story collection News from Heaven won the Massachusetts Book Award and the PEN New England Award in Fiction. Haigh's short stories have appeared in The Atlantic, Granta, The Best American Short Stories and many other places. She lives in Boston.", "name": "Fiction at Literati: Jennifer Haigh", "url": "https://www.facebook.com/events/264298877243879/"}, {"source": "Facebook", "date": "2016-05-05T19:00:00-04:00", "description": "Learn how to make beautiful paper flowers while helping AOT prepare for the inaugural James K. Berg Award gala on May 20th.  The paper flowers will be sold to raise funds and awareness of an upcoming tour of our “La Traviata” adaptation, which addresses the stigma surrounding mental illness and suicide.  They will also be used to create large topiaries that will be featured at the gala.  No experience is necessary, but it would be useful to bring a good pair of paper scissors and a glue gun (if you have one).  We will provide the papers, the instruction and other tools needed to create gorgeous, paper flowers.  They’d even make a wonderful gift for any woman you wish to honor this mother’s day.\n\nLight refreshments will be provided - Park along the street, as this is the home of artistic director, Shawn McDonald", "name": "Paper Flower Making Party 2", "url": "https://www.facebook.com/events/1084674421593287/"}, {"source": "Facebook", "date": "2016-05-06T14:00:00-04:00", "description": "http://cafegive.com/make_the_match/boaa-volunteermatch\nWe believe everyone should have the chance to make a difference. That's why United Way of Washtenaw County's Volunteer Center makes it easy for good people and good causes to connect. The Bank of Ann Arbor is a proud sponsor and matching all donations up to $3,000 for a grand total of $3,000 for this amazing volunteer program. www.volunteerwashtenaw.org\n\nPlease share this on your social media to help us hit our goal!!", "name": "Bank of Ann Arbor is matching donation up to a total of $3,000 for United Way's Volunteer program", "url": "https://www.facebook.com/events/1739721849644306/"}]