[{"description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "date": "2016-04-09T10:30:00-04:00", "url": "https://www.facebook.com/events/1734203926824540/", "source": "Facebook", "name": "Little Peeps PlayGround - \"Toys\""}, {"description": "We're down to the Final Four! Come out to sample and vote for your favorite local beer- here are the competitors:\n\n\nGriffin Claw Brewing Company (GCBC)- El Rojo\nWolverine State Brewing Co. Premium Lager\nPerrin Brewing Company 98 Problems\nFounders Brewing Co. Imperial Stout", "date": "2016-04-09T13:00:00-04:00", "url": "https://www.facebook.com/events/243217779358606/", "source": "Facebook", "name": "Sweet 16 Beers- The Final Four!"}, {"description": "Melissa Grunow is the author of Realizing River City: A Memoir (Tumbleweed Books, 2016). Her writing has appeared in Creative Nonfiction, River Teeth, New Plains Review, Blue Lyra Review, Temenos, and Yemassee, among many others. She is also a live storyteller who competes in Detroit's The Moth StorySLAM.  \n\nAn award-winning writer, Melissa was a semi-finalist for the 2015 DISQUIET International Literary Lisbon Writing Program, a Pushcart Prize nominee for her essay \"Home,\" a two-time recipient of the Detroit Working Writers creative nonfiction prize, and is featured in Poets & Writers  Directory of Writers. \n\nShe is a volunteer reader for Creative Nonfiction magazine, screening general submissions for publication and and editor for Grey Wolfe Publishing. She is a member of Detroit Working Writers, Michigan Writers, and the Association of Writers and Writing Programs (AWP).  \n\nMelissa holds a Bachelor of Science in English-creative writing and journalism from Central Michigan University, a Master of Arts in English from New Mexico State University, and a Master of Fine Arts in Creative Writing with distinction from National University.\n\nAt times, life can feel like a challenging feat of survival. Whether it’s living through abusive relationships or figuring out the complexities of what it means to be a woman searching for love, Realizing River City is a memoir that proves how despite the troubles we may face, there is hope in the way we continually risk ourselves in search for the life we want to live. In her poetic exploration of past relationships, Melissa Grunow’s honest words do not falter in the face of so much loss. Taking the rage we all feel about grief and pain, and funneling it into truth, beauty, and ultimately redemption on each page, Realizing River City is about discovering how the most important relationship is the one we have with ourselves.", "date": "2016-04-09T15:00:00-04:00", "url": "https://www.facebook.com/events/1721699551382115/", "source": "Facebook", "name": "Meet Local Author Melissa Grunow for a Discussion & Signing of Her Memoir 'Realizing River City'"}, {"description": "ÆPEX Contemporary Performance is proud to present SIGHT/SOUND, an immersive concert experience designed in collaboration with the Ann Arbor Art Center to accompany ART NOW: NEW DIRECTIONS IN CONTEMPORARY PHOTOGRAPHY. \n\n- This is a free, drop-in event - \n\nThe concert's program includes world premieres of Garrett Schumann's Moments, for string trio, and Spencer Arias' InTerLuDes, for solo flute, and will take advantage of the Art Center's unique gallery space to merge patrons' experiences of the music and the visual art.\n\nSIGHT/SOUND will feature performances by ÆPEX Artists Zan Berry, Erin Napier, and Tiffany Kang, as well as flutist Brice Smith of the Sphinx Symphony. The concert's program will be presented three times from 4-6 PM, with the performances beginning at:\n\n4:00 PM\n\n4:45 PM\n\n5:30 PM\n\nÆPEX will also be having an end-of-season/fundraiser party at the Beer Grotto immediately after (from 6-8 PM) feel free to join them! \n--------------------------------\nÆPEX Contemporary Performance was founded by conductor Kevin Fitzgerald and composer Garrett Schumann, ÆPEX Contemporary Performance is concert-presenting organization dedicated to bringing the world’s best new music to audiences in Ann Arbor and across Southeast, Michigan. Featuring five outstanding concerts, ÆPEX’s inaugural season includes six world premieres, daring and thoughtfully crafted programming, along with solo appearances by rising stars in the world of American contemporary music.\n\nTo stay connected to ÆPEX Contemporary Performance and learn more about its inaugural season, personnel, and future programming, follow us on Facebook and Twitter (@aepexcp). You can find infortmation about supporting ÆPEX's ambitious second season by visiting aepexcontemporary.org/support. \n \nÆPEX’s leaders are Artistic Director Garrett Schumann, Music Director Kevin Fitzgerald, and Development and Engagement Manager Spencer Arias.", "date": "2016-04-09T16:00:00-04:00", "url": "https://www.facebook.com/events/1241585872576950/", "source": "Facebook", "name": "SIGHT/SOUND an ÆPEX Contemporary Performance"}, {"description": "Sat. April 9 | 8pm | 18+ | $10 adv./ $12 day of\n\nFlint Eastwood with: Marcus Alan Ward, Jacob Sigman & The Timbre of Cedar\n\nFlint Eastwood is the evolution of the creative side of Detroit-based multi-talented artist Jax Anderson. Flint Eastwood is what happens when friends and family gather in the forgotten spaces of an embattled city and are left to create with no rules, no boundaries, and nothing holding them back. Jax's endless creativity is a byproduct of growing up in a talented family.\n\nHer father was one of ten kids, each of whom played guitar and sang. Her oldest brother, Sam, played in punk bands, and Jax spent her teenage years learning the value of passion and acceptance at DIY shows. As she got older, her other brother (and Flint Eastwood collaborator and producer) Seth started playing in bands throughout the Detroit garage rock scene. Their dad worked as a curb address painter to pay the bills once the housing crash made his job as a mortgage broker invalid. During this time, Jax and her brothers went door to door, passing out flyers advertising her father's services, through some of the toughest residential neighborhoods in Detroit. These struggles helped form the vision that drives Flint Eastwood: to give everyone listening (whether live or on record) a momentary escape from the problems we all have.\n\nBetween helping around the house, Jax spent her days in her family's Detroit-area home, without cable and internet, teaching herself to play her father's 12-string Taylor guitar that he left for them in the living room. It was also during this time that her mother's love for Motown music began to influence Jax's knack for the theatrics and power of the Detroit sound, as Mom played records from The Temptations, the Jackson Five, and Earth Wind & Fire.\n\nOnce old enough to break out on her own, Jax briefly moved to a small German tourist town in rural Georgia, where the only station in town played solely pop and country. There, she fell in love with the hooks and harmonies that define American pop music. Later, she moved with Seth to Los Angeles, to mainly focus on writing for licensing opportunities and playing small clubs and house parties around town. While in LA, Jax developed a love for film, hopping on tour with bands every chance she could get as a self-taught videographer. Her experiences on the West Coast still influence Jax's push to make her musical endeavors into well-rounded multimedia presentations (mixing music with theatrical lighting, video projection, and costumes).\n\nUpon returning home to Detroit at the very beginning of the much-maligned city's recent resurgence, Jax's explosive and endearing personality on stage became the driving force behind Flint Eastwood. But through it all, it was the songs that were always the focus.\n\nOn their now sold-out debut EP Late Nights In Bolo Ties (2013), Jax and her friends mixed elements of pulsing electronic tracks with blistering bluesy guitar licks, all with a spaghetti-western backdrop, inspired by Sunday night movie sessions with Jax and her father.\n\nOn the forthcoming EP, Small Victories (to be released October 23), Jax has returned to her Detroit roots, mixing a taste of the theatricality of Motown music with her more recently found love for pop music. The result is six songs full of hooks. The type of tracks that you turn up a little too loud, close your eyes, and forget where you are for four minutes. In a live setting, the songs are taken to another level entirely, mixing a CHVRCHES-like depth with a twenty | one | pilots-style flair for the dramatic. This approach has led the band to rapidly gain an ever-growing fanbase. Their last two hometown headline plays have sold out (400+ tickets per show), and the band has toured heavily through the Midwest, mixing festival looks like Electric Forest, MoPop Festival, and Midpoint Music Festival with club appearances alongside acts such as Foxy Shazam, Mayer Hawthorne, Betty Who, X Ambassadors, and Andrew WK.\n\nSmall Victories was crafted and polished in Detroit’s second oldest church, now repurposed as Assemble Sound, a hub of Detroit creativity that fosters artists through collaboration. In this crumbling but inspiring location, the new record was created as a coping mechanism to help Jax deal with the loss of her mother, who was her biggest fan and inspiration. As the listener makes their way through the EP, they experience Jax making her way through her mother's illness and passing, railing against it, dealing with the aftermath associated with such a loss, eventually accepting it, and using it as a driving force to continue to create.\n\nJax broke the EP down in one simple thought:\n\n\"Small Victories comes from the idea that doing anything creative in life takes a lot of persistence, struggle, and hustle. It's easy to expect that the spoils will come easily and be immediately fruitful. But if you focus on the little things, the \"small victories\", you realize that it's those things that are the most rewarding. That's what keeps me going.\"\n\nThe lead single is the EP's first track, \"Find What You're Looking For\", which is Jax's interpretation of her mother's final words to her:\n\n\"Don't let this break you\".", "date": "2016-04-09T20:00:00-04:00", "url": "https://www.facebook.com/events/1217913291571431/", "source": "Facebook", "name": "Flint Eastwood w/ Marcus Alan Ward, Jacob Sigman & The Timbre of Cedar 4/9/16 at Blind Pig - Ann Arbor"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Dis Guys\" starring Aaron Mondry and Steve Oliver\n\nGroup 2: \"T-Wrecks\" starring Doug Kolbicz, Maggie O'Reilly, Erik Heilner, Mitch Socia, and Tom Novik\n\nGroup 3: \"The League of Pointless Improvisers\" starring Erik Heilner, Matt Swartz, Mitch Socia, Moni Jones, and Andy Reid", "date": "2016-04-09T20:00:00-04:00", "url": "https://www.facebook.com/events/1727458780828305/", "source": "Facebook", "name": "Pointless Improv with Dis Guys and T-Wrecks"}, {"description": "Jive Colossus returns to Club Above with Funk, Afro-Caribbean, R&B, Jazz and more...bring your dancing shoes! Doors 9:00, Show 9:30-12:00  $5 cover", "date": "2016-04-09T21:00:00-04:00", "url": "https://www.facebook.com/events/1053797478014170/", "source": "Facebook", "name": "Jive Colossus at Club Above"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"T-Wrecks\" starring Doug Kolbicz, Maggie O'Reilly, Erik Heilner, Mitch Socia, and Tom Novik\n\nGroup 2: \"Dis Guys\" starring Aaron Mondry and Steve Oliver\n\nGroup 3: \"The League of Pointless Improvisers\" starring Erik Heilner, Matt Swartz, Mitch Socia, Moni Jones, and Andy", "date": "2016-04-09T22:00:00-04:00", "url": "https://www.facebook.com/events/1558044607858105/", "source": "Facebook", "name": "Pointless Improv with T-Wrecks and Dis Guys"}, {"description": "Enjoy hilarious video shorts created by some of our very own improvisers and also by professional, amateur and even wannabe film makers in and around the community!!\n\nHere’s how it works: Each month we’ll get a new suggestion from the audience to use as inspiration for the next month’s “Pointless 730 Hour Video Challenge.\" Next, get to work creating your prerecorded masterpiece. Submissions can be no longer than two minutes in length.\n\nAnd the coolest part - We will be taking your video and using it as the suggestion for an improv scene!!! IT'S A FREAKING VIDEO NIGHT/IMPROV JAM!!! People will LITERALLY be DISSECTING your video in the name of improvised comedy. What will they do with it??? Show up to find out.\n\nSend your finished product to pointlessvideoshorts@gmail.com no later than the Saturday before the video night. And finally, come and watch the crowd go wild over your creative and hysterical work of digital media art.\n\nNot into making vids but love watching them? Submit your favorite one from YouTube related to that month’s “suggestion” and we might play it on that Sunday! That’s right, you can share with the world that video you accidentally stumbled upon late one night while browsing the interwebs that made you cry with laughter.\n\nOf course, you are not required to participate in any way. Simply come, enjoy a microbrew, sit back and laugh with some fellow funny people. Admission is pay-what-you-can.\n\nLet’s get ROLLIN’!.", "date": "2016-04-10T19:00:00-04:00", "url": "https://www.facebook.com/events/1530743860554065/", "source": "Facebook", "name": "Pointless 730 Hour Video Challenge - April's Theme \"Environment\""}, {"description": "AFTER THE STAGE TIME SHOW . . . . \nWatch old comics develop new bits and new comics just develop at the UNclub (TM) at the Yellow Barn Theater in Ann Arbor.\n\nFor non-performers, a $5 suggested donation at the door to cover theater overhead.\n\nCOMICS and PERFORMERS: Please click \"See More\" below for spot request instructions for 3/6/16.\n\nComics and performers, please follow these procedures for stage time:\n\n- Click \"Going\" on this Facebook Event. Even if you are thinking about it, you can click \"Interested\" so you can get updates on this page. Do this by 5:00pm, the day of the show. This does not guarantee you a spot, but not doing it puts you at the bottom of the list.\n\n- After 5:00pm Sunday, \"show ups\" can \"go up\" only if spots are available.\n- The line-up will be created after the 8:00 Stage Time show presented by the Emergent Arts Theater.\n- Those arriving after the line-up is finalized will be given spots as time permits.\n- Length of stage time will depend largely on the turn out, performer's experience, and the show-runner's discretion.\n- As always, if you show up and do not get a spot, you will be put at the top of the list for the next show.\n\n--- Want to increase your odds of getting a spot? Here's some DO's and DON'T's\nDO . . . . Share this event page with your fans on your fan page, your facebook page, your website, or your tweets, or any other social media.\nDO . . . . Volunteer for less time. If you are willing to do 3 rather than 5, or 4 rather than 7, then you are more likely to get a spot.\nDO . . . . Come to the paid shows.\nDO . . . . Stay for \"meet and greet\" after shows.\nDO . . . . Answer poll questions whenever they appear on the event page.\nDO . . . . Bring people. This is not, I repeat NOT, a \"bringer.\" But if somebody has come to see you, it will be very hard to deny you a spot. In the past, we've had shows where we've added a minute of time for every person the comic brought as a non-performing audience member. Bring three people and a five minute spot becomes an eight minute spot.\n\nContact Mark at: www.facebook.com/marksweetman", "date": "2016-04-10T21:30:00-04:00", "url": "https://www.facebook.com/events/1581705252142989/", "source": "Facebook", "name": "The UNclub at The Yellow Barn (4/10/16)"}]