[{"source": "Facebook", "date": "2016-09-08T18:30:00-04:00", "name": "Nature Walk with Ann Arbor District Library-Stapp Nature Area", "description": "Nature Walk with Ann Arbor District Library\nThursday, September 8\n6:30 to 8 p.m.\nStapp Nature Area\nStapp Nature Area is a small park adjacent to the Traverwood Branch of the AADL. It contains mature oak-hickory forest and a vernal pond that is home to plentiful frogs, toads, turtles and salamanders! The nature area was named after William Stapp, who was a Professor of Environmental Education at the School of Natural Resources of the University of Michigan. Professor Stapp was internationally known for founding environmental education programs in 135 countries.\nThis nature walk is a collaboration between the AADL and Natural Area Preservation, and is part of a series that takes place each month throughout the summer and fall. For this one, parking will be available at the Traverwood Branch of the AADL, and we will meet just down the road at the entrance to the park. Wear comfortable shoes and bring water and bug spray if desired. Some of the AADL Science Tools will be available for use during the walk, too!", "url": "https://www.facebook.com/events/615888508589460/"}, {"source": "Facebook", "date": "2016-09-08T19:00:00-04:00", "name": "Peter Ho Davies for 'The Fortunes'", "description": "Peter Ho Davies is the author of two novels, The Fortunes and The Welsh Girl (long-listed for the Man Booker Prize), and two short story collections, The Ugliest House in the World(winner of the John Llewelyn Rhys Prize) and Equal Love (A New York Times Notable Book).\n\nHis work has appeared in Harpers, The Atlantic, The Paris Review, The Guardian and Washington Post among others, and has been widely anthologized, including selections for Prize Stories: The O. Henry Awards and Best American Short Stories. In 2003 Granta magazine named him among its Best of Young British Novelists.\n\nThe Book: \nSly, funny, intelligent, and artfully structured, The Fortunes recasts American history through the lives of Chinese Americans and reimagines the multigenerational novel through the fractures of immigrant family experience.Inhabiting four lives—a railroad baron’s valet who unwittingly ignites an explosion in Chinese labor, Hollywood’s first Chinese movie star, a hate-crime victim whose death mobilizes Asian Americans, and a biracial writer visiting China for an adoption—this novel captures and capsizes over a century of our history, showing that even as family bonds are denied and broken, a community can survive—as much through love as blood.Building fact into fiction, spinning fiction around fact, Davies uses each of these stories—three inspired by real historical characters—to examine the process of becoming not only Chinese American, but American.", "url": "https://www.facebook.com/events/945414925587833/"}, {"source": "Facebook", "date": "2016-09-08T19:00:00-04:00", "name": "RHINO 40 Readings 40 Cities - Ann Arbor Edition", "description": "We're kicking off our fall Open Mic series by celebrating RHINO's 40th birthday as part of their #RHINO40Readings40Cities project.\n\nWe begin with a brief open mic session followed by poets who have appeared in the RHINO poetry journal including Matthew Landrum and Simon Mermelstein, along with Monica Rico, Jennifer Metsker, Julie Babcock, John Buckley, and Ashwini Bhasi.", "url": "https://www.facebook.com/events/1253843057967373/"}, {"source": "Facebook", "date": "2016-09-08T19:30:00-04:00", "name": "The 25th Annual Putnam County Spelling Bee", "description": "Ann Arbor Civic Theatre opens their 2016-2017 season with the musical comedy The 25th Annual Putnam County Spelling Bee, directed by Wendy Sielaff, September 8-11, 2016, at UM’s Lydia Mendelssohn Theatre, 911 N. University, Ann Arbor, 48109.  Performances are Thursday at 7:30 pm, Friday and Saturday at 8pm, with a 2pm matinee on Sunday.  Friday, Saturday and Sunday tickets are $26, with tickets at $23 for seniors and $14 for students. On Thursday only, all seats are $20, with $14 tickets for students. Tickets and information are available online at www.a2ct.org, through the A2CT office at 734-971-2228, or at the door of the theater before each performance.\n\nWinner of a Tony and a Drama Desk Award for Best Book, The 25th Annual Putnam County Spelling Bee sees six contestants in a high school gym vie for the title of Spelling Bee Champion. It’s a fast-paced, uproariously funny and wild ride, complete with audience participation.  Says director, Wendy Sielaff, “Don't be fooled by the age of our spellers - each of them comes with their own quirks. In a very funny score, creative dancing, and of course some spelling we see each speller truly trying to win the trophy.” With its terrific book and score and impressive cast, Spelling Bee is a witty and touching production that is sure to spell F-U-N. \n\nThe show does contain some mature content, and is recommended for those 16 and up.\n\nMusic direction for The 25th Annual Putnam County Spelling Bee is by Debra Nichols, with choreography by Reilly Conlon. The talented cast includes Allison Ackerman as Rona Lisa Peretti, Brandon Cave as Douglas Panch, Emily Fishman as Olive Ostrovsky, Hallie Fox as Marcy Park,Nick Rapson as Mitch Mahoney, Nathan King as Leaf Coneybear, Keshia Oliver as Logainne Schwartzandgrubenierre,Bob Cox as Chip Tolentino, and Connor Rhoades as William Barfee.", "url": "https://www.facebook.com/events/1364500856898234/"}, {"source": "Facebook", "date": "2016-09-08T20:30:00-04:00", "name": "Nights at the Museum", "description": "Nights at the Museum, UMMA’s first-ever exterior media art initiative, is open to the public, and will run from September 2-9 from 8:30 p.m. to dawn along its State Street-side facade.\n\nNights at the Museum begins Friday, Sept. 2, during Artscapade!, a Welcome Week event for new U-M students, and concludes on Friday, Sept. 9 at UMMA’s twice-annual After Hours community celebration.\n\nOn Friday, Saturday, and Sunday, from dusk to dawn, UMMA will showcase a digital art installation by Quayola called Pleasant Places. Inspired by the work of Vincent Van Gogh, Quayola has returned to the same countryside of Provence 125 years later to create of a series of digital paintings exploring the boundary between representation and abstraction. Pleasant Places will also be projected overnight throughout the remainder of the week. \n\nFor the Full Schedule Check Here: http://www.umma.umich.edu/news/2016/umma-to-light-up-campus-with-nights-at-the-museum", "url": "https://www.facebook.com/events/1770837316505091/"}, {"source": "Facebook", "date": "2016-09-09T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-09-09T16:30:00-04:00", "name": "The Second Great Lakes Herb Faire", "description": "The second Great Lakes Herb Faire will be happening this September 9-11th, 2016 in Chelsea, MI. Register now for an herbal educational extravaganza! We will offer dozens of classes on Herbal Medicine from well seasoned herbalists such as Matt Wood, Jim McDonald, Dr. Jody Noe, Lisa Rose and many more! Some class titles include \"Wisdom of Nature: What we Gain as Herbalists in Service of Nature\", \"Medical Herbal Strategies for Integrative Cancer Therapies\", \"Blessed Bitters\" and \"Introduction to West African Herbalism\". There will be kids classes such as\"Let’s Meddle with Nettles!\" and \"Wisdom of the Elders\".  There will be delicious and nutritious food available for those who sign up and music, entertainment and additional classes in the evenings for all. The Tree of Life Drummers and Dancers will get the Faire going at opening ceremony and Saturday night \"Eyes Unclouded\", an amazing local band will play. We will also have an open mic of sorts on Friday evening so bring your talents!\n\nDon't miss out on this amazing an unique opportunity! There will be much to be learned by both beginning and experienced herbalists, many connections will be made with other regional herbalists as well as with the beautiful lands of the Waterloo Recreation area.\n\nPlease see our website for more details!\nhttp://www.greatlakesherbfaire.org\n\nSee you at the Faire!\n-The Great Lakes Herb Faire organizers", "url": "https://www.facebook.com/events/631172927032422/"}, {"source": "Facebook", "date": "2016-09-09T17:00:00-04:00", "name": "Back to School Beer Tasting", "description": "Come get scholarly about some of our favorite beers!", "url": "https://www.facebook.com/events/1761402564145210/"}, {"source": "Facebook", "date": "2016-09-09T17:00:00-04:00", "name": "Back to School Wine Tasting", "description": "The kids are back in school, now it's wine time! We're pouring some of our favorites to help you celebrate.", "url": "https://www.facebook.com/events/322134998120508/"}, {"source": "Facebook", "date": "2016-09-09T17:30:00-04:00", "name": "Riverside Arts Center", "description": "• Opening Reception: Sept 9, 5.30 - 7.30 pm \n• Exhibit Dates: Sept 9 - Oct 1, 2016\n• Gallery hours: Thurs - Sat 3 - 8 pm & Sun 1.30 - 4 pm\n• Riverside Arts Center Gallery, 76 N. Huron St, (between               Michigan Ave and Cross St), Ypsilanti\n• RiverSide Arts Center Gallery", "url": "https://www.facebook.com/events/988178937957475/"}, {"source": "Facebook", "date": "2016-09-09T18:00:00-04:00", "name": "Re: Formation Opening Reception", "description": "Gallery Project presents Re: Formation, a contemporary art exhibit in which over 50 local, regional and national artists address the push back that is occurring in communities nationwide around issues such as water access and safety, marginalization of the poor, the murder and incarceration of African American youth, and decay of urban infrastructure. The exhibit also highlights, as a form of push back, people’s shifting views and interactions with Nature, technology, and each other. Re: Formation is Gallery Project’s 4th annual dual-site, multi-media exhibition.\n\nThis event is FREE and open to the public.\n\nEXHIBITING ARTISTS INCLUDE:\nHeather Accurso, Hiba Ali, John James Anderson, Michael Arrigo, Siobhan Arnold, Nick Azzaro, Darryl Baird, Barchael (Barry Whittaker and Mike Bernhardt), Morgan Barrie, Carolyn Barritt, Beehive Design Collective (Meg Lemieur), Mark Bleshenski, Jada Bowden, Seder Burns, Ruth Crowe, Dana DePew, Rocco DePietro, James Dickerson, Desiree Duell, Elton Monroy Duran, Dianne Farris, Anthony Fontana, Mark Hereld, Dan Hernandez, Stephanie Howells, Doug Kampfer, Tohru Kanayama,  Yusuf Lateef, K.A. Letts, Kate Levy, Julianne Lindsey, Jeremy Link, Melanie Manos, Shanna Merola, Ken Milito, Michael Nagara, Jefferson Nelson, Endi Poskovic, Gloria Pritschet, Sharon Que, Raizup Collective (Antonio Cosme), Boris Rasin, Roger Rayle, Jesse Richard, Arturo Rodriguez, Gary Setzer, Meagan Shein, Anna van Schaap, Sheida Soleimani, Brian Spolans, Jessica Tenbusch, Alex Tsocanos, Ellen Wilt, Robin Wilt, and Viktor Witkowski.\n\nImage Credit: Nick Azzaro, \"Progress at the Old Smith Furniture Building\"\n\n\nREVIEWS:\n\nDetroit Art Review: http://goo.gl/yr8MGa\n\nK. A. Letts: https://goo.gl/koLXtJ\n\nToledo City Paper: http://goo.gl/TTDywo\n\n-----------\nFor more information about Re: Formation, go here: http://goo.gl/YAxfvd\n-----------\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC.\n\nCatering generously provided by Laura's Catering (http://laurascatering.com/)", "url": "https://www.facebook.com/events/524758664380525/"}, {"source": "Facebook", "date": "2016-09-09T19:00:00-04:00", "name": "UMMA After Hours", "description": "Drop in during this free community event to browse the galleries and enjoy new special exhibitions including: new and recent work by Los Angeles-based contemporary photographer Catherine Opie; Whistler prints and South Asian folk art donated to UMMA from the private collection of Nesta and Walter Spink; new photography and a site-specific sculptural installation by artist and architect Catie Newell; 23 fantastical photographs from UMMA’s collection in Manuel Álvarez Bravo: Mexico’s Poet of Light; conceptual drawings by architect Mira Henry; and Mark Bradford: Spiderman. Enjoy live music performed by The Heather Black Project (HBP). Led by vocalist Heather Schwartz (aka Heather Black), this versatile ensemble puts an original spin on vintage jazz and incorporates modern elements of R&B, soul, and hip-hop. Curators’ conversations and light refreshments round out the event.\nUMMA After Hours is generously sponsored by Fidelity Investments. The media sponsor for UMMA After Hours is the Ann Arbor Observer.", "url": "https://www.facebook.com/events/1607470706217717/"}, {"source": "Facebook", "date": "2016-09-09T19:00:00-04:00", "name": "Ken Foster", "description": "Literati is pleased to welcome Ken Foster in support of the his New York Times-bestselling memoir, The Dogs Who Found Me.\n\nIn concert with Ken's visit, we'll be holding a fundraiser for the Humane Society of Huron Valley's wonderful Bountiful Bowls program, which helps people keep pets instead of surrendering them to a shelter. HSHV accepts and distributes 40,000 pounds of pet food each year, and we're grateful for the work they do as well as their participation in this event. Food donations, as well as donations by cash or check, will be accepted at the event, or you can donate online. \n\nNow regarded as a classic in dog literature, Ken Foster's memoir chronicles his journey from first-time dog owner to rescuer—and all the lessons and mistakes he made along the way. Bookended by the tragedies of 9/11 and Katrina, Foster finds that dogs open his eyes to the benefits of compassion, selflessness, and the chaotic beauty of living each day in the moment. \n\nBut more than Foster's own story, readers remember the dogs. Among them are Duque, a Costa Rican stray; Brando, Foster's first adopted dog and a supposed pit bull mix who outgrew his Manhattan studio apartment; Rocco, a clownish red pit bull whose owner mistakenly gives him away to the wrong person; Zephyr, a cheerful Rottweiler mix who awakens Foster by sitting on his chest when his heart stops working; and Sula, the tiny lost pit bull who showed up at Foster's door one day and stayed. \n\nWhether bearing witness to national tragedy, grieving the death of a friend, or dealing with his own mortality, Foster finds strength in his dogs, and in the reciprocal nature of rescue. \n\n\"Generosity and gratitude power this compelling account of the reciprocal nature of rescue. Ken Foster illuminates a profound lesson about saving a life: Doing it makes you able to do it.\"–Amy Hempel, author of The Dog of the Marriage and Reasons to Live\n\nKen Foster is the editor of two anthologies, including Dog Culture, and the author of Dogs I Have Met and I’m a Good Dog. His collection of short stories, The Kind I'm Likely to Get, was a New York Times Notable Book. His work has appeared in The New York Times Book Review, The San Francisco Chronicle, McSweeney's, and The Believer. He has taught at The New School, Florida State University, and the University of Southern Mississippi. In 2008, he founded The Sula Foundation, which promotes responsible dog ownership among the pit bull population and sponsors education and outreach in the New Orleans area. He lives in New Orleans, with at least three dogs.", "url": "https://www.facebook.com/events/516806575181956/"}, {"source": "Facebook", "date": "2016-09-09T19:30:00-04:00", "name": "The 25th Annual Putnam County Spelling Bee", "description": "Ann Arbor Civic Theatre opens their 2016-2017 season with the musical comedy The 25th Annual Putnam County Spelling Bee, directed by Wendy Sielaff, September 8-11, 2016, at UM’s Lydia Mendelssohn Theatre, 911 N. University, Ann Arbor, 48109.  Performances are Thursday at 7:30 pm, Friday and Saturday at 8pm, with a 2pm matinee on Sunday.  Friday, Saturday and Sunday tickets are $26, with tickets at $23 for seniors and $14 for students. On Thursday only, all seats are $20, with $14 tickets for students. Tickets and information are available online at www.a2ct.org, through the A2CT office at 734-971-2228, or at the door of the theater before each performance.\n\nWinner of a Tony and a Drama Desk Award for Best Book, The 25th Annual Putnam County Spelling Bee sees six contestants in a high school gym vie for the title of Spelling Bee Champion. It’s a fast-paced, uproariously funny and wild ride, complete with audience participation.  Says director, Wendy Sielaff, “Don't be fooled by the age of our spellers - each of them comes with their own quirks. In a very funny score, creative dancing, and of course some spelling we see each speller truly trying to win the trophy.” With its terrific book and score and impressive cast, Spelling Bee is a witty and touching production that is sure to spell F-U-N. \n\nThe show does contain some mature content, and is recommended for those 16 and up.\n\nMusic direction for The 25th Annual Putnam County Spelling Bee is by Debra Nichols, with choreography by Reilly Conlon. The talented cast includes Allison Ackerman as Rona Lisa Peretti, Brandon Cave as Douglas Panch, Emily Fishman as Olive Ostrovsky, Hallie Fox as Marcy Park,Nick Rapson as Mitch Mahoney, Nathan King as Leaf Coneybear, Keshia Oliver as Logainne Schwartzandgrubenierre,Bob Cox as Chip Tolentino, and Connor Rhoades as William Barfee.", "url": "https://www.facebook.com/events/1364500856898234/"}, {"source": "Facebook", "date": "2016-09-09T20:00:00-04:00", "name": "John Ford Coley at Green Wood Coffee House", "description": "There are songs that transport you to good times remembered. Songs like, “I’d Really Love To See You Tonight,” “Nights Are Forever Without You,” and, “Love Is The Answer” have that effect on many of us. These songs and numerous others have made John Ford Coley a singing legend.\nJohn is most revered as half of the duo England Dan and John Ford Coley. The classically-trained pianist and talented guitarist continues performing the gold and platinum record hits for audiences around the world. Some of Coley’s other hits are, “Gone Too Far,” “We’ll Never Have To Say Goodbye Again,” and, “Sad To Belong.\"\nJohn’s experiences comprise a broad background. Although he performed throughout high school and college as a classical and rock pianist, he chose to major in English Literature in college, and is an avid student of history. In the mid-1980’s, John began acting in television and in feature films. He recently penned a book, \"Backstage Pass,\" about his years in the music industry.\nwww.johnfordcoley.com", "url": "https://www.facebook.com/events/1675656812706888/"}, {"source": "Facebook", "date": "2016-09-09T21:00:00-04:00", "name": "Jive Colossus at Club Above", "description": "Jive Colossus returns to Ann Arbor's Club Above for a raucous night of Afrobeat, Funk, R&B, Jazz and Caribbean music and dancing! Come on out and get down with us! 2 sets! $5 cover", "url": "https://www.facebook.com/events/236343853429993/"}, {"source": "Facebook", "date": "2016-09-09T22:00:00-04:00", "name": "A Pointless Display of Improvised Feats", "description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!", "url": "https://www.facebook.com/events/1767158700196974/"}, {"source": "Facebook", "date": "2016-09-10T09:00:00-04:00", "name": "Stewardship Workday-National Day of Service-Stapp Nature Area", "description": "Stewardship Workday-National Day of Service\nSaturday, September 10\nStapp Nature Area\n9 a.m. to noon\nStapp Nature Area is one of our more pristine natural areas, with native plants composing nearly eighty percent of the total flora. The park’s mature oak-hickory forest is home to deer and several cavity-dwelling bird species, while a vernal pool draws frogs, toads, and salamanders. Volunteers and NAP staff have worked hard throughout the years to maintain the high environmental quality of this park, but invasive shrubs are threatening to undo these efforts! Join us to cut back invasive honeysuckle and buckthorn to make room for our native plants to flourish. Please meet us at the park entrance on the corner of Huron Parkway and Tuebingen Parkway. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/584832978387396/"}, {"source": "Facebook", "date": "2016-09-10T10:30:00-04:00", "name": "The Spunky Sprite and the Endless Night", "description": "\"The Spunky Sprite and the Endless Night\" follows a plucky young sprite who is desperate to learn how Mother Nature brings the world to life each day. Caught up in her desire to do everything by herself, the sprite unwittingly lets a darkness into the land that threatens their very way of life. Only by finally accepting help is she able to return nature back to full health. It is then that she realizes working together makes us stronger.\n \n\"The Spunky Sprite and the Endless Night\" is an original play, developed specifically for babies through elementary school children. Told largely through music and movement, this show speaks the language of our youngest theatre-goers. Highly interactive, \"The Spunky Sprite and the Endless Night\" welcomes the audience into the world of the play, and encourages them to wiggle, make noise, clap, and sing.\n\nTickets: $10 for adults, $5 for children", "url": "https://www.facebook.com/events/1824235374473797/"}, {"source": "Facebook", "date": "2016-09-10T11:00:00-04:00", "name": "Private Label Tasting", "description": "When you see our Lucky's Market logo on products throughout our store, you can feel secure in knowing that they have all natural ingredients, taste great, and are a fantastic value. We'll be showing off some of our favorites, so be sure to join us for samples! We'll be giving away a special basket of our Private Label products to one Lucky's winner, so make sure you sign up at the table for a chance to win!", "url": "https://www.facebook.com/events/1961357197423880/"}, {"source": "Facebook", "date": "2016-09-10T13:00:00-04:00", "name": "Read to Rikki the Reading Therapy Dog", "description": "Rikki the Golden Retriever loves to have kids read to her according to her owner, special education teacher Shelly Schwartz.  If your child has a difficult time reading outloud in class or reading in general bring them to the store to read to Rikki.  Experience has shown that reluctant readers are more comfortable reading to a dog than to another person. \nOr just bring your kids if they would like to read to Rikki!  \nNicola’s Books is pleased to have Rikki as part of the staff!", "url": "https://www.facebook.com/events/1140185116037592/"}, {"source": "Facebook", "date": "2016-09-10T16:00:00-04:00", "name": "Icebreakers^2", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/512096392314717/"}, {"source": "Facebook", "date": "2016-09-10T18:00:00-04:00", "name": "Homegrown Festival", "description": "Please join us at the 9th annual HomeGrown Festival!  It is a grassroots community celebration of our region’s locally grown food, drink, music and fun. \n\nThis years festival will include:\n- Tasty locally sourced food prepared by some of your favorite local chefs\n- Beer, wine, mead, kombucha, and more, from some of Michigans greatest brewers and fermentors\n- Three popular local bands providing live music on the Main Stage\n- Local vendors promoting their products\n- A silent auction\n- Hands-on and educational activities for kids \n\nPlus much more!  Please bring your friends and family and enjoy a great night celebrating all things Local!\n\nThis is a FREE event!  Can't wait to see you there!", "url": "https://www.facebook.com/events/318769471800834/"}, {"source": "Facebook", "date": "2016-09-10T20:00:00-04:00", "name": "Pointless Improv with Green Gables and Moxie by Proxy", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Green Gables\nGroup 2: Moxie by Proxy\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/995844083846145/"}, {"source": "Facebook", "date": "2016-09-10T21:00:00-04:00", "name": "Country Club Disco with Golf Clap 9/10/16 at Blind Pig - Ann Arbor", "description": "Saturday, Sept. 10 | 9pm | $10 Cover | 18+\n\nCountry Club Disco \n\nGolf Clap & friends\nwww.countryclubdisco.com\nhttps://www.facebook.com/golfclapdet/\nhttps://twitter.com/golfclapdet\nhttps://soundcloud.com/golfclapdet\n\n\n:: Golf Clap ::\nDJs; producers; club headliners; after-party enthusiasts: Golf Clap are Hugh Cleal and Bryan Jones, a Detroit duo with an unmatched passion for house music and a seemingly endless supply of studio and club-focused creativity. And with releases on some of the world’s most influential house labels already under their belts, along with a lauded Boiler Room session and beyond, they’re only just getting started.\n\nWith roots in the Detroit underground, booking local and international DJs to play at their own parties, Golf Clap have established themselves as in-demand artists and performers in their own right, via an irresistible combination of hard work, talent and consistently being the last guys standing, wherever the party ends up.", "url": "https://www.facebook.com/events/1745875622317080/"}, {"source": "Facebook", "date": "2016-09-10T21:00:00-04:00", "name": "Spectrum • Mynah • Tetra • Funk-A •", "description": "Help us reach our goal of $500!  Proceeds to benefit the Robert Bruce Dunlap Fund for Homeless & Foster Youth.\n\nLive Musical Performances by:\nMynah\nTetra\nFunk-A\n\nLocated at:\nClub Above | 215 N. Main Street | Ann Arbor, MI\n$10 Cover | 18+ W Valid ID\nDoors open at 9 PM\n\nFor more information, visit tetramusicproject.wix.com/tetrashouse", "url": "https://www.facebook.com/events/977676935676920/"}, {"source": "Facebook", "date": "2016-09-10T22:00:00-04:00", "name": "Pointless Improv with Moxie by Proxy and Green Gables", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Moxie by Proxy\nGroup 2: Green Gables\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/1160731270640407/"}, {"source": "Facebook", "date": "2016-09-11T09:00:00-04:00", "name": "Back to School Scavenger Hunt", "description": "Back to School Scavenger Hunt! If you find it, you can keep it*. We'll have our scavenger hunt clue list at our front entrance- figure out our riddles to have some fun througout the store! Some clues even have multiple answers- see if you or your kids can figure them out.\n\nKids of all ages welcome ♥\n\n*Grown-ups, please limit your kiddos to 1 of what they find- thank you!", "url": "https://www.facebook.com/events/847197395380414/"}, {"source": "Facebook", "date": "2016-09-11T09:00:00-04:00", "name": "Stewardship Workday- National Day of Service- Kuebler Langford Nature Area", "description": "Stewardship Workday-National Day of Service\nSunday, September 11\nKuebler Langford Nature Area\n9 a.m. to noon\nDespite some parts of the park being used as a staging area for the construction of M-14, the majority of Kuebler Langford was fortunately left in good ecological condition. The north side of the wooded ravine hosts the park’s greatest biological diversity with wild ginger, maiden-hair fern and doll’s eyes decorating the slopes. The park also features a prairie remnant, but invasive shrubs are encroaching on this beautiful habitat. Come out to help us remove these harmful species and help this prairie thrive! Please meet at the park entrance on Beechwood Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/1654574404862037/"}, {"source": "Facebook", "date": "2016-09-11T10:30:00-04:00", "name": "14th Annual Kerrytown BookFest", "description": "http://bit.ly/14Wkytl\n\nNicola's Books is a major sponsor of the Kerrytown BookFest and will have a booth as well as selling books at some of the author panels.  Hope to see lots of you there!\n \nSCHEDULE OF EVENTS PER VENUE - \n\nMain Tent\n\n10:30 – 11 a.m. 9th Annual Community Book Award Presentation to Washtenaw Literacy. Director Amy Goodman will accept the award, presented by board member Dallas Moore. Free coffee and donuts will be served in the Main Tent to help celebrate Washtenaw Literacy and kick off the day.\n\n11:00 a.m.- Noon Under the Radar Michigan’s Tom Daldin talks about Michigan’s undiscovered gems.\n\n12:15 – 1:15 p.m. The Quest for Identity Writers Desiree Cooper (Know the Mother), Kelly Fordon (Garden of the Blind), and Andrew Mozina (Contrary Motion) discuss their work with moderator and author Donald Lystra (Something That Feels Like Truth).\n\n1:30 – 2:30 p.m. A Mysterious Sense of Place Mystery writers William Kent Krueger (Manitou Canyon), Hank Phillippi Ryan (What You See) and Patricia Abbott (Shot in Detroit) discuss the sense of place in their novels with author and moderator Carrie Smith (Silent City).\n\n2:45 – 3:45 p.m. Travel through Time with author B.A. Shapiro, who discusses her novels The Art Forger and The Muralist with art historian Ellen Longsworth.\n\n4 p.m. Travel North with John Smolens as he discusses his writing and his latest novel Wolf’s Mouth with writer and moderator Benjamin Busch (Dust to Dust).\n\nKerrytown Concert House\n\n11:00 a.m. – Noon Writing for Hire Join writers Casey Daniels (Irish Stewed), Vicky Delany (Reading up a Storm) and Sarah Zettel (A Familiar Tail) as they discuss the many ways to make a living writing. All of them have written books “for hire” from science fiction to cozy mysteries to flashcards to Goosebumps installments. They’ll discuss the state of publishing today with writer and moderator Barbara Gregorich (Guide to Writing the Mystery Novel: Lots of Examples, Plus Dead Bodies).\n\n12:15 – 1:15 p.m. Stride’s Duluth Thriller writer Brian Freeman illustrates with photos taken on photo safari in Duluth, Minnesota, how he uses the setting to inform his Jonathan Stride novels. He’ll read a passage from one of them to show how his setting influences his writing.\n\n1:30 – 2:30 p.m. Eating Wildly with Ava Chin, who discusses her book on urban foraging with bookseller and moderator Rachel Pastiva, the manager of Crazy Wisdom.\n\n2:45 – 3:45 p.m. Travel the Lakes with Loreen Niewenhuis, who has written a trilogy about her 1,000-Mile Great Lakes Adventures, and Maureen Dunphy, who visited 136 Great Lakes Basin islands and wrote the travel guide and travelogue Great Lakes Island Escape: Ferries and Bridges to Adventure. They’ll present a dynamic slideshow and engage in a lively discussion about their favorite Great Lakes islands.\n\n4 p.m. The ABCs of Washtenaw Literacy, an informative tour of the agency’s highly effective programs including a video and a presentation from learners.\n\nChildren’s Tent\n\n11-11:45 a.m. the beloved Mother Goose shares nursery rhymes with the littlest BookFest visitors\n\n11:45 a.m. – 12:15 p.m. Shanda Trent reads her new book Giddy-Up, Buckaroos\n\n12:15 – 1 p.m. Writer Kristen Remenar and illustrator Matt Faulkner read their latest collaboration Groundhog’s Dilemma\n\n1 – 1:45 p.m. author Kelly DiPuccio shares Dragon was Terrible and Everyone Loves Cupcakes.\n\n2 – 3;30 p.m. Storytellers Laura Pershin Raynor and Kayla Coughlin present fall stories.  Create your own autumn adornment for cruising through the festival! This event is intended for pre-school-grade 3.\n\n3:30 – 5 p.m. writer & illustrator Ruth McNally Barshaw (Ellie McDoodle) leads a drawing workshop – “How to make a Lion from a 5″\n\nWriter in Residence R.J. Fox, ongoing through the day.  Mr. Fox will critique the first twenty pages of your manuscript. For information and to reserve a slot, contact Hart Johnson at hartjohnson23@gmail.com.", "url": "https://www.facebook.com/events/1721427041453987/"}, {"source": "Facebook", "date": "2016-09-11T10:30:00-04:00", "name": "The Spunky Sprite and the Endless Night", "description": "\"The Spunky Sprite and the Endless Night\" follows a plucky young sprite who is desperate to learn how Mother Nature brings the world to life each day. Caught up in her desire to do everything by herself, the sprite unwittingly lets a darkness into the land that threatens their very way of life. Only by finally accepting help is she able to return nature back to full health. It is then that she realizes working together makes us stronger.\n \n\"The Spunky Sprite and the Endless Night\" is an original play, developed specifically for babies through elementary school children. Told largely through music and movement, this show speaks the language of our youngest theatre-goers. Highly interactive, \"The Spunky Sprite and the Endless Night\" welcomes the audience into the world of the play, and encourages them to wiggle, make noise, clap, and sing.\n\nTickets: $10 for adults, $5 for children", "url": "https://www.facebook.com/events/1824235374473797/"}, {"source": "Facebook", "date": "2016-09-11T13:00:00-04:00", "name": "Guided Tour Engaging with Art", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "url": "https://www.facebook.com/events/514188362104937/"}, {"source": "Facebook", "date": "2016-09-11T14:00:00-04:00", "name": "Guided Tour - Catherine Opie: 700 Nimes Road", "description": "This exhibition presents new and recent work by Los Angeles-based artist Catherine Opie, one of the essential figures in contemporary photography. Beginning in 2010, Opie spent six months taking photographs at the residence of Elizabeth Taylor (1932–2011), capturing the essence of the Hollywood legend through her personal objects and mementos. She portrays Taylor’s life experience and eccentricity as an illusory subject, one that cannot be specifically designated or precisely described. UMMA docents will explore Taylor’s celebrity and humanity through these images.", "url": "https://www.facebook.com/events/1001944953254261/"}, {"source": "Facebook", "date": "2016-09-11T16:00:00-04:00", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "url": "https://www.facebook.com/events/182553475489986/"}, {"source": "Facebook", "date": "2016-09-11T19:00:00-04:00", "name": "Pointless 730 Hour Video Challenge - September's Theme \"Growth\"", "description": "Enjoy hilarious video shorts created by some of our very own improvisers and also by professional, amateur and even wannabe film makers in and around the community!!\n\nHere’s how it works: Each month we’ll get a new suggestion from the audience to use as inspiration for the next month’s “Pointless 730 Hour Video Challenge.\" Next, get to work creating your prerecorded masterpiece. Submissions can be no longer than two minutes in length.\n\nAnd the coolest part - We will be taking your video and using it as the suggestion for an improv scene!!! IT'S A FREAKING VIDEO NIGHT/IMPROV JAM!!! People will LITERALLY be DISSECTING your video in the name of improvised comedy. What will they do with it??? Show up to find out.\n\nSend your finished product to pointlessvideoshorts@gmail.com no later than the Saturday before the video night. And finally, come and watch the crowd go wild over your creative and hysterical work of digital media art.\n\nNot into making vids but love watching them? Submit your favorite one from YouTube related to that month’s “suggestion” and we might play it on that Sunday! That’s right, you can share with the world that video you accidentally stumbled upon late one night while browsing the interwebs that made you cry with laughter.\n\nOf course, you are not required to participate in any way. Simply come, enjoy a microbrew, sit back and laugh with some fellow funny people. Admission is pay-what-you-can.\n\nLet’s get ROLLIN’!.", "url": "https://www.facebook.com/events/579076205584933/"}, {"source": "Facebook", "date": "2016-09-11T19:30:00-04:00", "name": "The 25th Annual Putnam County Spelling Bee", "description": "Ann Arbor Civic Theatre opens their 2016-2017 season with the musical comedy The 25th Annual Putnam County Spelling Bee, directed by Wendy Sielaff, September 8-11, 2016, at UM’s Lydia Mendelssohn Theatre, 911 N. University, Ann Arbor, 48109.  Performances are Thursday at 7:30 pm, Friday and Saturday at 8pm, with a 2pm matinee on Sunday.  Friday, Saturday and Sunday tickets are $26, with tickets at $23 for seniors and $14 for students. On Thursday only, all seats are $20, with $14 tickets for students. Tickets and information are available online at www.a2ct.org, through the A2CT office at 734-971-2228, or at the door of the theater before each performance.\n\nWinner of a Tony and a Drama Desk Award for Best Book, The 25th Annual Putnam County Spelling Bee sees six contestants in a high school gym vie for the title of Spelling Bee Champion. It’s a fast-paced, uproariously funny and wild ride, complete with audience participation.  Says director, Wendy Sielaff, “Don't be fooled by the age of our spellers - each of them comes with their own quirks. In a very funny score, creative dancing, and of course some spelling we see each speller truly trying to win the trophy.” With its terrific book and score and impressive cast, Spelling Bee is a witty and touching production that is sure to spell F-U-N. \n\nThe show does contain some mature content, and is recommended for those 16 and up.\n\nMusic direction for The 25th Annual Putnam County Spelling Bee is by Debra Nichols, with choreography by Reilly Conlon. The talented cast includes Allison Ackerman as Rona Lisa Peretti, Brandon Cave as Douglas Panch, Emily Fishman as Olive Ostrovsky, Hallie Fox as Marcy Park,Nick Rapson as Mitch Mahoney, Nathan King as Leaf Coneybear, Keshia Oliver as Logainne Schwartzandgrubenierre,Bob Cox as Chip Tolentino, and Connor Rhoades as William Barfee.", "url": "https://www.facebook.com/events/1364500856898234/"}, {"source": "Facebook", "date": "2016-09-12T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-09-12T19:00:00-04:00", "name": "Peter Kornbluh", "description": "We are thrilled to welcome acclaimed journalist and author Peter Kornbluh, who accompanied President Obama on his historic visit to Cuba, to Literati Bookstore. Peter will be joined in conversation by the University of Michigan's Jesse Hoffnung-Garskof. Refreshments will be provided thanks to UM's Eisenberg Institute for Historical Studies and Center for Latin American and Caribbean Studies, generous co-sponsors of this event. \n\nAbout Back Channel to Cuba:\n\nHistory is being made in U.S.-Cuban relations. Updated to tell the real story behind the stunning December 17, 2014 announcement by President Obama and President Castro of their move to restore full diplomatic relations, this powerful book is essential to understanding ongoing efforts toward normalization in a new era of engagement. Challenging the conventional wisdom of perpetual conflict and aggression between the United States and Cuba since 1959, Back Channel to Cuba chronicles a surprising, untold history of bilateral efforts toward rapprochement and reconciliation. William M. LeoGrande and Peter Kornbluh here present a remarkably new and relevant account, describing how, despite the intense political clamor surrounding efforts to improve relations with Havana, negotiations have been conducted by every presidential administration since Eisenhower's through secret, back-channel diplomacy. From John F. Kennedy's offering of an olive branch to Fidel Castro after the missile crisis, to Henry Kissinger's top secret quest for normalization, to Barack Obama's promise of a new approach, LeoGrande and Kornbluh uncovered hundreds of formerly secret U.S. documents and conducted interviews with dozens of negotiators, intermediaries, and policy makers, including Fidel Castro and Jimmy Carter. They reveal a fifty-year record of dialogue and negotiations, both open and furtive, that provides the historical foundation for the dramatic breakthrough in U.S.-Cuba ties. \n\nPeter Kornbluh directs the Cuba Documentation Project and the Chile Documentation Project at the National Security Archive in Washington, DC, and is co-author, with William M. LeoGrande, of Back Channel to Cuba: The Hidden History of Negotiations Between Washington and Havana. Kornbluh is also the author of The Pinochet File: A Declassified Dossier on Atrocity and Accountability and Bay of Pigs Declassified: The Secret CIA Report on the Invasion of Cuba. He writes regularly for The Nation.\n\nJesse Hoffnung-Garskof is Associate Professor of History, American Culture, and Latina/o Studies at the University of Michigan. He is the author of A Tale of Two Cities: Santo Domingo and New York After 1950.\n\nEvent date: \nMonday, September 12, 2016 - 7:00pm", "url": "https://www.facebook.com/events/523370911192071/"}, {"source": "Facebook", "date": "2016-09-12T19:00:00-04:00", "name": "Ken Foster", "description": "Literati is pleased to welcome Ken Foster in support of the his New York Times-bestselling memoir, The Dogs Who Found Me.\n\nIn concert with Ken's visit, we'll be holding a fundraiser for the Humane Society of Huron Valley's wonderful Bountiful Bowls program, which helps people keep pets instead of surrendering them to a shelter. HSHV accepts and distributes 40,000 pounds of pet food each year, and we're grateful for the work they do as well as their participation in this event. Food donations, as well as donations by cash or check, will be accepted at the event, or you can donate online. \n\nNow regarded as a classic in dog literature, Ken Foster's memoir chronicles his journey from first-time dog owner to rescuer—and all the lessons and mistakes he made along the way. Bookended by the tragedies of 9/11 and Katrina, Foster finds that dogs open his eyes to the benefits of compassion, selflessness, and the chaotic beauty of living each day in the moment. \n\nBut more than Foster's own story, readers remember the dogs. Among them are Duque, a Costa Rican stray; Brando, Foster's first adopted dog and a supposed pit bull mix who outgrew his Manhattan studio apartment; Rocco, a clownish red pit bull whose owner mistakenly gives him away to the wrong person; Zephyr, a cheerful Rottweiler mix who awakens Foster by sitting on his chest when his heart stops working; and Sula, the tiny lost pit bull who showed up at Foster's door one day and stayed. \n\nWhether bearing witness to national tragedy, grieving the death of a friend, or dealing with his own mortality, Foster finds strength in his dogs, and in the reciprocal nature of rescue. \n\n\"Generosity and gratitude power this compelling account of the reciprocal nature of rescue. Ken Foster illuminates a profound lesson about saving a life: Doing it makes you able to do it.\"–Amy Hempel, author of The Dog of the Marriage and Reasons to Live\n\nKen Foster is the editor of two anthologies, including Dog Culture, and the author of Dogs I Have Met and I’m a Good Dog. His collection of short stories, The Kind I'm Likely to Get, was a New York Times Notable Book. His work has appeared in The New York Times Book Review, The San Francisco Chronicle, McSweeney's, and The Believer. He has taught at The New School, Florida State University, and the University of Southern Mississippi. In 2008, he founded The Sula Foundation, which promotes responsible dog ownership among the pit bull population and sponsors education and outreach in the New Orleans area. He lives in New Orleans, with at least three dogs.", "url": "https://www.facebook.com/events/516806575181956/"}, {"source": "Facebook", "date": "2016-09-12T19:00:00-04:00", "name": "Book Lovers Night w/Sales Reps from Harper, Macmillan Penguin & Random House", "description": "Meet Random House Reps Bridget Piekarz and Laura Baratto, Penguin Rep Brian Wilson, Macmillan Rep Melissa Weisberg and Harper Collins Rep Kate McCune for a sneak peek at the hot new titles from late summer and upcoming fall titles.  This is a great opportunity for book club members or any avid readers to get a look at what's just come out and what is on the horizon of new books from these great publishers before anyone else.  So come and join us for an evening of book discussion, giveaways and refreshments!  If you come to this event and purchase two of the select titles featured receive a 10% discount off your purchase of those titles.", "url": "https://www.facebook.com/events/297607503930486/"}, {"source": "Facebook", "date": "2016-09-12T20:30:00-04:00", "name": "Nights at the Museum", "description": "Nights at the Museum, UMMA’s first-ever exterior media art initiative, is open to the public, and will run from September 2-9 from 8:30 p.m. to dawn along its State Street-side facade.\n\nNights at the Museum begins Friday, Sept. 2, during Artscapade!, a Welcome Week event for new U-M students, and concludes on Friday, Sept. 9 at UMMA’s twice-annual After Hours community celebration.\n\nOn Friday, Saturday, and Sunday, from dusk to dawn, UMMA will showcase a digital art installation by Quayola called Pleasant Places. Inspired by the work of Vincent Van Gogh, Quayola has returned to the same countryside of Provence 125 years later to create of a series of digital paintings exploring the boundary between representation and abstraction. Pleasant Places will also be projected overnight throughout the remainder of the week. \n\nFor the Full Schedule Check Here: http://www.umma.umich.edu/news/2016/umma-to-light-up-campus-with-nights-at-the-museum", "url": "https://www.facebook.com/events/1770837316505091/"}, {"source": "Facebook", "date": "2016-09-13T07:30:00-04:00", "name": "Stewards' Circle", "description": "Stewards’ Circle\nTuesday, September 13\nBruegger’s Bagels, 709 N University Ave.\n7:30 to 8:30 a.m.\nAre you interested in learning more about how to care for our natural areas? Then join the Stewardship Network's Huron Arbor Cluster for an informal discussion on a monthly topic with volunteer and professional land stewards, plus others interested in nature. Free! This month’s topic: Ducks Unlimited: Ducks Unlimited was created in 1937 to restore and protect North American waterfowl populations where severe droughts were threatening their habitat. Ducks Unlimited is now the world's leader in wetlands and waterfowl conservation. Join us for a discussion on DU and their conservation projects in Michigan with Jason Hill, Manager of Conservation Programs for the Great Lakes Regional Office located in Ann Arbor!", "url": "https://www.facebook.com/events/1605462809744946/"}, {"source": "Facebook", "date": "2016-09-13T10:30:00-04:00", "name": "The Spunky Sprite and the Endless Night", "description": "\"The Spunky Sprite and the Endless Night\" follows a plucky young sprite who is desperate to learn how Mother Nature brings the world to life each day. Caught up in her desire to do everything by herself, the sprite unwittingly lets a darkness into the land that threatens their very way of life. Only by finally accepting help is she able to return nature back to full health. It is then that she realizes working together makes us stronger.\n \n\"The Spunky Sprite and the Endless Night\" is an original play, developed specifically for babies through elementary school children. Told largely through music and movement, this show speaks the language of our youngest theatre-goers. Highly interactive, \"The Spunky Sprite and the Endless Night\" welcomes the audience into the world of the play, and encourages them to wiggle, make noise, clap, and sing.\n\nTickets: $10 for adults, $5 for children", "url": "https://www.facebook.com/events/1824235374473797/"}, {"source": "Facebook", "date": "2016-09-13T16:00:00-04:00", "name": "Playmaking Class, ages 10-13", "description": "Over the course of the semester, students will create and perform their own original play. Each 10 week semester develops skills such as community building, critical thinking, writing, improv, acting, directing, movement, editing, and general stagecraft. Students will work together under the guidance of teacher Michelle Weiss (MA Theatre Education) doing improv, writing, and movement exercises on a relevant theme of their choice to make a play which will be shown on the last day of class.\n\nTuesdays, 4:00 pm - 6:00 pm\nFall Semester: September 13 - November 15, 2016\nSpring Semester: February 7 - April 18, 2017 (no class April 4)", "url": "https://www.facebook.com/events/1554292084878947/"}, {"source": "Facebook", "date": "2016-09-13T19:00:00-04:00", "name": "The Tomato Dinner featuring author Amelia Saltsman", "description": "When the Roadhouse opened in 2003 Chef Alex had a vision for hosting monthly dinners featuring specific regions, cuisines, chefs and authors that brought together our community to enjoy a great meal and hear great stories. Thirteen years later we are honored and humbled to be celebrating Special Dinner #200. It is fitting this dinner falls in the peak of the harvest season and is just 2 days before our anniversary of opening our doors.\n\nTo celebrate we have invited back to the Roadhouse award-winning cookbook author Amelia Saltsman. Author of The Santa Monica Farmers' Market Cookbook and the newly released The Seasonal Jewish Kitchen, Amelia's passion for making the connection between seasonal, small-farmed foods and real-life meals makes her the perfect guest speaker and collaborator on the menu with Chef Alex.\n\nPlated Amuse:\nGreen Melon and Green Tomato Gazpacho\nSmoked Salt Blanched Soy Beans\nShelly Pea Hummus with Za’atar\n\nBread:\nFresh Grilled Pita and Zingerman’s Bakehouse Tomato Bread\n\nFeaturing:\nCornman Farms’ Heirloom Tomato Bar\nWith handmade mozzarella, really good olive oil, basil, salt and pepper\n\nDinner Buffet:\nGolden Bari Dates with Blueberries and Wheat Berries\nIsraeli Salad with Five Tomatoes\nKohlrabi and Carrot Slaw\nPickled Green Tomato with Halvah and French Feta\nRomanian Ratatouille (Gvetch) with Eggs\nLamb Kabobs with Tahini and Smokey Harissa\nMatboucha (Moroccan Tomato Sauce) with Fresh Red Peas\nGrape Leaf-Wrapped Sardines with Tomato and Roasted Lemon\nSpatchcock of Cornish Hen with Green Garlic Jus\nBeef and Rice stuffed Patty Pan Squash\n\nDessert:\nTahini Gelato Sundae Bar with Silan Syrup and Fresh Berries\nBlood Orange and Olive Oil Polenta Upside Down Cake\nPoppy Seed Hamantaschen", "url": "https://www.facebook.com/events/249910972068199/"}, {"source": "Facebook", "date": "2016-09-13T19:00:00-04:00", "name": "Acoustic Tuesdays: Dale Osborn", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nDale Osborn, Currently living in Chelsea, Michigan, talented folk fingerstylist Dale Osborn has been playing guitar for over 20 years. Performing both instrumental and vocal music, he plays fingerstyle 6-and 12-string guitar and croons with a pleasant baritone\n\n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1820674041545146/"}, {"source": "Facebook", "date": "2016-09-13T19:00:00-04:00", "name": "Nathan Hill", "description": "We are delighted to welcome Nathan Hill in support of The Nix, a 2016 BEA buzz pick and a staff pick here at Literati.\n\nA Nix can take many forms. In Norwegian folklore, it is a spirit who sometimes appears as a white horse that steals children away. In Nathan Hill’s remarkable first novel, a Nix is anything you love that one day disappears, taking with it a piece of your heart. It’s 2011, and Samuel Andresen-Anderson—college professor, stalled writer—has a Nix of his own: his mother, Faye. He hasn’t seen her in decades, not since she abandoned the family when he was a boy. Now she’s reappeared, having committed an absurd crime that electrifies the nightly news, beguiles the internet, and inflames a politically divided country. The media paints Faye as a radical hippie with a sordid past, but as far as Samuel knows, his mother was an ordinary girl, who married her high-school sweetheart. Which version of his mother is true? Two facts are certain: she’s facing some serious charges, and she needs Samuel’s help.\n\nTo save her, Samuel will have to embark on his own journey, uncovering long-buried secrets about the woman he thought he knew, secrets that take him across generations and countries, and stretch all the way back to Norway, the original home of the mysterious Nix. In doing so, Samuel will not only confront Faye’s losses, but also his own lost love, and relearn everything he thought he knew about his mother, and himself. From the suburban Midwest to New York City to the 1968 riots that rocked Chicago, and beyond, The Nix explores—with sharp humor and a fierce tenderness—the resilience of love and home, even in times of radical change\n\n\"The Nix is a mother-son psychodrama with ghosts and politics, but it’s also a tragicomedy about anger and sanctimony in America. Even the minor characters go to extremes—among them, a Home Ec teacher from Hell and an unrepentant plagiarist with presidential aspirations. ‘A maestro of being awful,’ the son calls his mom. ‘Every memory is really a scar,’ she tells him. For this mother and son, disappointment is ‘the price of hope’—a cost they will both bear. Nathan Hill is a maestro of being terrific.\" — John Irving\n\n\"Pay attention. This is what a Great American Novel looks like. The Nix is culturally relevant, politically charged, historically sweeping, sad, full of yearning, sometimes dark but mostly hilarious. Nathan Hill is a literary powerhouse who will deservedly earn many comparisons to John Irving and Jonathan Franzen.\" — Benjamin Percy\n\n“Once in a while a novel arrives at the perfect moment to reflect, skewer, and provide context for the world as we know it. This—now—is that novel.” — Christina Baker Kline\n\nNathan Hill's short stories have appeared in The Iowa Review, AGNI, Gulf Coast, The Denver Quarterly, Fugue, The Gettysburg Review, and many other journals. He was the winner of the annual Fiction Prize from the journal Fiction, a finalist for the Donald Barthelme Prize in Short Prose, a Pushcart Prize nominee, and the recipient of an Artist Grant from the Minnesota State Arts Board.", "url": "https://www.facebook.com/events/547799282080505/"}, {"source": "Facebook", "date": "2016-09-13T20:00:00-04:00", "name": "Basement w/ Eskimeaux & Ovlov 9/13/16 at Blind Pig - Ann Arbor", "description": "Tue. September 13 | 8pm | 18+ | $15 adv./ $18 day of\n\nBasement with: eskimeaux & Ovlov\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/735", "url": "https://www.facebook.com/events/1002229809876123/"}, {"source": "Facebook", "date": "2016-09-13T21:00:00-04:00", "name": "Ghastly - Necto - 9.13.16", "description": ">>TICKETS ON SALE JULY 6 AT 10 AM EST <<\nhttp://ghastlynecto.eventbrite.com/?aff=FBevent\n\nPrime Social Group presents...\n\nGHASTLY\n=============================\nNECTO NIGHTCLUB \n=============================\nSeptember 13, 2016 // 9:00PM Doors // 18+\n=============================\nPrimeSocial.com \n\n>>>MUSIC<<<\n\nGHASTLY\nhttps://soundcloud.com/ghastly\n\nYACHT CLUB\nhttps://soundcloud.com/yachtclubperiod\n\n>>>ABOUT<<\n\nGHASTLY\nGhastly's approachable yet hard-hitting style ushers a forward-thinking dynamic that is not often seen in today’s saturated scene, and his solo productions and collaborations present an unequivocal level of determination and finesse that fuses multiple styles together. \n\nUniquely creating hybrid blends of house, trap, and dubstep into a pot-pourri of bass, the young producer definitively pushes the boundaries of the entire EDM scene today, and a handful of the industry’s finest have recognized his potential including Skrillex, Diplo, Dillon Francis, Tchami, DJ Snake, Datsik, Borgore, Zomboy, and Zeds Dead. \n\nWith slew of mentally-stimulating originals and physically-altering collaborations under his belt, such as his original “Miami Connection” with Jauz and single “Crank It” with Mija & Lil Jon, it’s safe to say that Ghastly is on a mission to redefine dance music for all.\n\nYACHT CLUB\nYacht Club, a duo hailing from Columbus, OH, won Galantis‘ official remix contest for \"Runaway (U & I)\" which can be heard on their official SoundCloud page. The pair consisting of Adam and Hayden dropped a solid remix of Miike Snow‘s \"Genghis Kahn\" in 2016 solidifying their emerging success.\n\nwww.PrimeSocial.com\n===============================\nGET INVOLVED: Want to get involved with PSG? Join the team by visiting http://primesocial.com/get-involved/\n===============================", "url": "https://www.facebook.com/events/1304934352869435/"}, {"source": "Facebook", "date": "2016-09-14T09:00:00-04:00", "name": "Chrome Sparks wsg Roland Tings 9/14/16 at Blind Pig - Ann Arbor", "description": "Wed. September 14 | 9pm | 18+ | $15 adv./ $18 day of\n\nChrome Sparks wsg: Roland Tings\n\nChrome Sparks is the solo project of Jeremy Malvin, a Brooklyn transplant from Pittsburgh by way of Ann Arbor. In 2014, after having self released a small handful of singles and two EPs on Bandcamp, Malvin signed to the taste making Sydney based label Future Classic. Under the new label, he rereleased Sparks EP and released the Goddess EP. His next EP, Parallelism is slated to be released with Future Classic on November 6.\n\nInspired by a background in classical percussion and an obsession with synthesizers, Malvin creates dazed, melodic beat-centric tunes that loosely hang between down-tempo head nodders and up-tempo club bangers. FADER has described his music as ‘form-shifting beats [that] seem to resonate with spaced-out chillers and hyperactive party kids alike’.\n\nIn 2012, while on Warped Tour as the drummer for Stepdad, Malvin released the slow burning, bass heavy single “Marijuana” on a Bandcamp compilation highlighting music from he and his friends in Ann Arbor. It quickly rocketed to #1 on Hype Machine and has since become an internet-stoner anthem. It has subsequently been rereleased by Future Classic and Kitsuné.", "url": "https://www.facebook.com/events/622227574608143/"}, {"source": "Facebook", "date": "2016-09-14T19:00:00-04:00", "name": "Mitten Made Beer Tasting", "description": "ABC's Mitten Made Beer Tasting\nJoin us on Wednesday, September 14 to explore why Michigan IS the great beer state!\n\nWe will revel in the best of the best in our Great Beer State.  Make merry with our samplings of new beers and breweries from across the pleasant peninsulas, featuring over two dozen or so beers from the craft breweries throughout our state. Classics, seasonals & innovative brews as well as special “drink local” corner featuring our Washtenaw County neighbors, all in one great night of Michigan Love. \nWe will pair beer samples with a locally sourced appetizer buffet, provide a program with style and tasting notes, and top off the night with door prizes. \n\n7-9 PM  / $30 / Tickets are available at the brewpub or on Eventbrite", "url": "https://www.facebook.com/events/176948129391837/"}, {"source": "Facebook", "date": "2016-09-14T19:00:00-04:00", "name": "Alexander Weinstein", "description": "Literati is thrilled to launch Children of the New World by Alexander Weinstein.\n\nChildren of the New World introduces readers to a near-future world of social media implants, memory manufacturers, dangerously immersive virtual reality games, and frighteningly intuitive robots. Many of these characters live in a utopian future of instant connection and technological gratification that belies an unbridgeable human distance, while others inhabit a post-collapse landscape made primitive by disaster. Children of the New World grapples with our unease in this modern world and how our ever-growing dependence on new technologies has changed the shape of our society. Alexander Weinstein is a visionary new voice in speculative fiction for all of us who are fascinated by and terrified of what we might find on the horizon.\n\n�\"Taken together, these stories present a fully-imagined vision of the future which will disturb you, provoke you, and make you feel alive. Weinstein is brilliant, incisive and fearless.” —Charles Yu, author of How to Live Safely in a Science Fictional Universe\n\n�\"In each of the gripping stories in Children of the New World, Alexander Weinstein offers a glimpse into an unnerving, not-so-distant, and all-too-possible future. Weinstein explores what-ifs with both wit and sensitivity, and his cautionary tales demand to be read (before it’s too late).” —Judy Budnitz, author of Nice Big American Baby\n\nAlexander Weinstein is the Director of The Martha’s Vineyard Institute of Creative Writing and the author of the short story collection Children of the New World (Picador 2016). His fiction and translations have appeared in Cream City Review, Hayden's Ferry Review, Notre-Dame Review, Pleiades, PRISM International, World Literature Today, and other journals. He is the recipient of a Sustainable Arts Foundation Award, and his fiction has been awarded the Lamar York, Gail Crump, Hamlin Garland, and New Millennium Prize. His stories have been nominated for Pushcart Prizes, and appear in the anthologies 2013 New Stories from the Midwest, and the 2014 & 2015 Lascaux Prize Stories. He is an Associate Professor of Creative Writing and a freelance editor, and leads fiction workshops in the United States and Europe.\n\nEvent date: \nWednesday, September 14, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1803114446641680/"}, {"source": "Facebook", "date": "2016-09-14T19:00:00-04:00", "name": "Kristina Johnsen", "description": "KRISTINA JOHNSEN is a singer and multi-instrumentalist based in Ann Arbor, Michigan, bringing an organic and introspective, yet whimsical flair to alt-pop. Drawing inspiration from Baroque-Pop acts and Alt-Indie rockers, her diverse influences include the Killers, Florence + the Machine, Marty Robbins, Jack White, Ásgeir, Lady Gaga, and Norah Jones. More info at: http://www.ouryellowbarn.com/event/kristina-johnsen/?instance_id=22565", "url": "https://www.facebook.com/events/1787541938199395/"}, {"source": "Facebook", "date": "2016-09-14T19:00:00-04:00", "name": "Children of the New World: Book Release Party and Concert", "description": "Dear Friends and Family,\n\nYou're all invited to the Release Party for my debut short story collection, Children of the New World! The reading/book signing will be at 7 pm at Literati Bookstore in Ann Arbor. Come hear me read from my debut collection and get a signed copy!\n\nFollowing the reading, you're invited to join the After Party at The Yellow Barn (410 W Huron Street) from 9-11:30 with Mark Kirschenmann's incredible band \"Big Fun\", an 8-piece electric jazz band that will be playing the electric period music of Miles Davis. The concert is open to all, with a suggested donation of $10 per person, as all proceeds go directly to the band with thanks for their generosity for playing the after-party concert!\n\nLooking forward to celebrating this big day together with you at Literati and dancing the night away!", "url": "https://www.facebook.com/events/995928763853289/"}, {"source": "Facebook", "date": "2016-09-15T17:30:00-04:00", "name": "Zell Visiting Writers Series: John Freeman and Valeria Luiselli", "description": "John Freeman was the editor of Granta until 2013. His books include How to Read a Novelist and Tales of Two Cities: the Best and Worst of Times in Today’s New York. He is an executive editor at the Literary Hub and teaches at the New School. His work has appeared in the New Yorker, the New York Times, and the Paris Review.\n\nValeria Luiselli was born Mexico City in 1983 and grew up in South Africa. A novelist (Faces in the Crowd) and essayist (Sidewalks), her work has been translated into many languages and has appeared in publications including the New York Times, the New Yorker, Granta, and McSweeney’s. In 2014, Faces in the Crowd was the recipient of the Los Angeles Times Art Seidenbaum Award for First Fiction and the National Book Foundation’s 5 Under 35 award. Her latest novel, The Story of My Teeth, is available through Coffee House Press.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please visit the LSA's Zell Visiting Writer Series website.", "url": "https://www.facebook.com/events/955485917930514/"}, {"source": "Facebook", "date": "2016-09-15T18:00:00-04:00", "name": "Beer VS Wine", "description": "Beer expert VS wine expert!  Who will pair the best beverage with Chef Adam's food?  You decide!  Guests get to vote after dinner.\n\n$75 per person + tax & gratuity (advance tickets)\n$85 per person + tax & gratuity (day of event)", "url": "https://www.facebook.com/events/1617178331914188/"}, {"source": "Facebook", "date": "2016-09-15T19:00:00-04:00", "name": "Anthony Ervin, Olympic gold medalist", "description": "Literati Bookstore is thrilled to welcome 2000 & 2016 Olympic gold medalist Anthony Ervin and author Constantine Markides to discuss Ervin's memoir, Chasing Water.  \n\nChasing Water tells the dramatic, surprising, and sometimes provocative path that Anthony Ervin has taken to become one of those captivating Olympic heroes. Not your typical sports memoir, Chasing Water also contains arresting black-and-white drawings and a graphic story extra, as well as an inventive and mercurial narrative style that morphs chapter by chapter to reflect Ervin’s restless, multifaceted life. Ervin won a gold medal at the 2000 Sydney Olympic Games at the age of nineteen. He is an athlete branded with a slew of titles including being the first US Olympic swimmer of African American descent, along with Jewish heritage, who also grew up with Tourette’s syndrome. He shocked the sporting world by retiring soon after claiming two world titles following the 2000 Olympics. Auctioning off his gold medal for charity, he set off on a part spiritual quest, part self-destructive bender that involved Zen temples, fast motorcycles, tattoo parlors, and rock ’n’ roll bands. Then Ervin resurfaced in 2012 to not only make the US Olympic team twelve years after his first appearance, but to continue his career by swimming faster than ever before, and faster than anyone else. \n\n\"Here Ervin and swim trainer and journalist Markides combine talents to create a biography that is part first-hand narrative by Ervin, with Markides filling in the details and providing context. The formula works, pulling readers into Ervin's experience of the thrill of victory and search for meaning....Featuring more depth, breadth, truth, and the effects of reckless choices than found in traditional athlete biographies, this gripping account is just in time for the gear up to the Rio 2016 Olympics. Readers will understand the psyche and life of elite athletes as never before, then cheer Ervin on in his attempt to make another Olympic team.\"--Library Journal\n\n\"A celebrated Olympian recounts how he rose to the top of his sport, crashed, and found redemption....This book, which tells his story through a narrative that interweaves the former gold medalist's memories with commentary by his friend and colleague Markides, reveals the extreme highs and lows that characterized Ervin's remarkable life and career....The author never flinches at revealing his less-than-perfect past, and the humility he demonstrates at coming to terms with his own egotism and personal shortcomings makes the book frequently compelling. A provocative and refreshingly honest redemption memoir.\"--Kirkus Reviews\n\n\"Markides smartly combines his own journalistic account with a parallel narrative in which Ervin...explains his life and style. Some talents simply defy explanation, however, and Ervin may be in that category....The story of his comeback at 31 (ancient for a swimmer) is rendered more amazing by the contrast with what went before.\"--Booklist \n\n\"Most memoirs from Olympians are puff pieces, ghost-written so blandly you fall asleep trying to make it to the end of the first chapter. Chasing Water is the opposite of that, an intimate, visceral experience you will appreciate.\"--SwimSwam \n\n\"A refreshingly unexpected athlete biography void of eye-rolling, cliched, self help propaganda bullshit.\"--Gary Hall, Jr., swimmer, ten-time Olympic medalist", "url": "https://www.facebook.com/events/1635855363397658/"}, {"source": "Facebook", "date": "2016-09-15T19:30:00-04:00", "name": "The Magic Negro and Other Blackness", "description": "Have you ever pondered the idea that Dr. Seuss Green Eggs and Ham might be racially charged? Is it possible to skip and listen to hip hop at the same time? Do black people actually carry around race cards? Well, maybe its time to take a closer look. Mark Kendall uses a series of comedic sketches to examine the representation of black males in the media in his critically acclaimed one-man show.  From prison to white flight, and even Reading Rainbow  well explore some of the ways these images influence our views on race in everyday life. There will also be cookies.\n\nMark first got into comedy while studying film at Northwestern University. He had a chance to work at Comedy Central through the Chris Rock Summer School Program for up and coming comedy writers of color. During his time at Comedy Central, he got to pitch jokes to the writing staffs of \"The Daily Show\" and \"The Colbert Report.\" Mark performs comedy in Atlanta at Dad's Garage Theatre Company and Highwire Comedy. He also teaches improv and sketch writing. He is currently touring with his one man show \"The Magic Negro and Other Blackness\" a sketch show that examines the depiction of black men in the media. For his work with the show, he was recently awarded \"Best Professional Funny Man\" by Creative Loafing Atlanta.", "url": "https://www.facebook.com/events/1813498772197691/"}, {"source": "Facebook", "date": "2016-09-15T21:00:00-04:00", "name": "Gold Panda w/ Open Mike Eagle 9/15/16 at Blind Pig - Ann Arbor", "description": "Thursday, September 15 | 9pm | 18+ | $15 Cover\n\nGold Panda wsg: Open Mike Eagle\n\nThe story of Gold Panda’s journey from an acclaimed debut record to now, as he prepares to release his third full length album, is an entirely circular one. Hailing from Chelmsford Essex in the UK, in the six years since the release of his genre-defining debut album ‘Lucky Shiner’, the electronic artist most comfortable with the moniker Derwin Panda spent the subsequent years splitting the majority of his time between London, Berlin and countless excursions to Japan. As he created his third album ‘’Good Luck And Do Your Best’ he ultimately found himself back where he began, in the East of England.\n\nOrigin stories can be fundamentally boring by nature, packed with non-essential details and overly stressed homilies to roots and influences. But the core nature of an artist that has produced some of the most beloved and emotionally-infused electronic music of this decade is deeply rooted in the constant desire to return to where his musical world began.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/710", "url": "https://www.facebook.com/events/1186311131413949/"}, {"source": "Facebook", "date": "2016-09-15T21:00:00-04:00", "name": "Stefano Noferini w/ MEDMA at Necto", "description": "Michigan Electronic Dance Music Association (MEDMA) & Necto present...\n\nStefano Noferini\n\nwith opening sets by MEDMA\nMain Floor & Patio\n\nAbout Stefano Noferini:\nKnown to have a golden touch when it comes to dance floor destroyers, Noferini is a shining example that true talent rises to the top.\n\nA long time champion of house music in all its forms, Stefano has been building his legend for some time. Always innovating sounds and crossing into a broad range of genres has been a key factor in his well-deserved rise. Never one to stagnate, Stefano has merged all the musical elements at his disposal into a brilliant sound experience that no one can match.\nHailing from Italy, Stefano Noferini is one of the nations most respected DJs and producers. Having been a pivotal force in Italy's burgeoning house music scene with his national radio show, Stefano forged a musical symbiosis with his homeland that still exists today. Years of top productions have cemented his status at the top of the dance music food chain. One peek inside ANY DJs CD wallet and you can bet they're packing something from this hit maker. \n\nTechnical prowess notwithstanding, Stefano Noferini is truly a DJs DJ. When he takes charge of the wheels of steel, everyone is absorbed in the musical journey. Fellow DJs, who would normally hide in their dressing rooms, are always sure to catch Stefano if they share the bill with him. Something magical happens with Stefano on the decks, a real energy takes hold and people get connected to music in a way that is beautifully pure. If you want to lose yourself in music, Stefano is for you! \nOf course, Stefano is also a top seller on Beatport, holding numerous #1 positions in just about every genre they have. His original music and remixes are charted heavily by a diverse range of talented DJs both of the commercial and underground variety. He's also been named Beatports \"Breakout Artist of the Year\" in 2010, and was nominated as their \"Artist of the Year\" in 2011. He has even crossed into a more commercial territory by overtaking artists like Pitbull, Shakira, Lady Gaga and Beyoncé to score a #1 hit on Billboard's Hot Dance chart. \nOn the clubbing circuit, Stefano Noferini is a top draw. Ministry of Sound, Euphoria, H20, F-135, Space Miami, Space Ibiza, Cocoon Frankfurt, Lief Festival, Sankeys and Row 14 have all seen Noferini pack the house on any night he plays. His infectious driving rhythms and brilliant command of the music he plays keeps people dancing until the very last beat drops. And then they want more!\n\nIt seems there is only an upward momentum swirling around this incredible talent, but the man at the center of it all stays humbled by all the attention. He continues to expand his global reach by growing his well-known radio program, Club Edition, into new territories each month. The show currently is heard by millions of people in some 15 countries worldwide. His imprint, Deeperfect Records is bringing superior sounds to the masses with sexy tech inspired grooves penned by today's most relevant producers: Stefano Noferini, Wally Lopez and Paolo Mojo to name a few. It is one of the most respected dance labels today, no question. \n\nBut it's Stefano's incredible DJ sets that keep fans clamoring for more from this innovative Italian master. While other DJs just mix music, Stefano Noferini takes the art of the DJ to a whole other level. Stefano has the ability to tap right into our primal need to dance, you may miss the subtle expertise filling your mind with proper house grooves, but your body will hail the call, understand, and you'll be dancing like you've never danced before. \nHe is what dance music is all about.\n\nAbout MEDMA:\nMEDMA is a student group of music fans, musicians, producers, and DJs focused on spreading the awareness and appreciation of electronic music on campus as well as in Ann Arbor. They host and attend events all around Ann Arbor, on the University of Michigan campus, and Detroit. MEDMA also sponsors DJ tutorials and music mastering workshops throughout the school year. For more information on joining, email medma-board@umich.edu.\n\nThursday September 15, 2016\nDoors open at 9pm • 18 & over are welcome with proper ID\n\nTickets on sale now\nwww.eventbrite.com\n\nFor VIP services: info@thenecto.com\n\nNecto: 516 E Liberty • Ann Arbor, MI 48104\n734.994.5436 • www.necto.com", "url": "https://www.facebook.com/events/527579917366775/"}, {"source": "Facebook", "date": "2016-09-16T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-09-16T10:30:00-04:00", "name": "The Spunky Sprite and the Endless Night", "description": "\"The Spunky Sprite and the Endless Night\" follows a plucky young sprite who is desperate to learn how Mother Nature brings the world to life each day. Caught up in her desire to do everything by herself, the sprite unwittingly lets a darkness into the land that threatens their very way of life. Only by finally accepting help is she able to return nature back to full health. It is then that she realizes working together makes us stronger.\n \n\"The Spunky Sprite and the Endless Night\" is an original play, developed specifically for babies through elementary school children. Told largely through music and movement, this show speaks the language of our youngest theatre-goers. Highly interactive, \"The Spunky Sprite and the Endless Night\" welcomes the audience into the world of the play, and encourages them to wiggle, make noise, clap, and sing.\n\nTickets: $10 for adults, $5 for children", "url": "https://www.facebook.com/events/1824235374473797/"}, {"source": "Facebook", "date": "2016-09-16T15:00:00-04:00", "name": "Drink & Draw / Imbibe & Inscribe", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/624021437767239/"}, {"source": "Facebook", "date": "2016-09-16T19:00:00-04:00", "name": "Mark Webster Reading Series", "description": "One MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.\nThis week's reading features Austin Blaze (introduced by Bryce Pope) and Marlin Jenkins (introduced by Danez Smith)\nAustin Blaze is a writer from Northern California. His fiction was once described as \"humor infused with sadness,\" which is pretty much what he's going for.\nMarlin M. Jenkins was born and raised in Detroit, where he recently taught poetry to middle-schoolers through the Inside Out program. His poems have recently found homes in The Collagist, The Journal, and Word Riot.", "url": "https://www.facebook.com/events/928734097252368/"}, {"source": "Facebook", "date": "2016-09-16T19:00:00-04:00", "name": "Dr. Jeffrey Kutcher & Joanne C. Gerstner", "description": "Literati is pleased to welcome Dr. Jeffrey Kutcher and journalist Joanne Gerstner for a discussion of Back in the Game: Why Concussion Doesn't Have to End Your Athletic Career.\n\nBack in the Game, co-authored by pioneering sports neurologist Jeffrey S. Kutcher and award-winning sports journalist Joanne C. Gerstner, is the definitive guide to sports and concussion for youth parents, coaches and athletes. The topic of concussion in youth sports was relatively unheard of 10 years ago. Today, concerned parents are considering removing their children from participation in contact sports such as football or soccer. Back in the Game is a real-world based discussion of concussion and youth sports, with Dr. Kutcher’s clinical expertise blended with Gerstner’s reporting. World Cup and Olympic champion Kate Markgraf, X Games superstar Ellery Hollingsworth, former NFL quarterback Eric Hipple and an array of today’s youth coaches, parents and athletes honestly discuss concussion.\n\nJeffrey S. Kutcher MD is an internationally recognized sports neurologist and pioneering physician researcher. He is a graduate of the Tulane University School of Medicine and the University of Michigan Neurology Residency program. He founded the American Academy of Neurology’s Sports Neurology Section and was the neurologist for Team USA at the Sochi 2014 Winter Olympics. Kutcher is the national division chief of The Sports Neurology Clinic at The CORE Institute.\n\nJoanne C. Gerstner is an award-winning multimedia sports journalist, who focuses on sports and medicine. Her work has appeared on ESPN.com, in the The New York Times, USA Today, Detroit News, and other publications. She is a graduate of the Medill School at Northwestern University, a 2012 University of Michigan Knight-Wallace Fellow, and 2015 Jacobs Foundation Neuroscience Fellow. Gerstner is a professor of sports journalism in the School of Journalism at Michigan State University.", "url": "https://www.facebook.com/events/292667507761004/"}, {"source": "Facebook", "date": "2016-09-16T19:00:00-04:00", "name": "Trivia Night- U of M edition", "description": "Join us for a special University of Michigan trivia night- our questions will be maize and blue focused, so come see if you know it all for the chance to win $25!", "url": "https://www.facebook.com/events/1144263282300140/"}, {"source": "Facebook", "date": "2016-09-16T20:00:00-04:00", "name": "What The Sound Presents: Munch / Isaac Castor / Awkward Theory / Broccoli / Dude Madison", "description": "Join What The Sound for our second showcase of the school year! We're  beyond excited to announce a stacked lineup with artists from SE Michigan. This show is on September 16th at Blind Pig - Ann Arbor, MI. Doors are at 8pm and music will begin shortly after. Price of admission is $10 (21+) and $13 (18+). Tickets are available both online and at the door. The concert will include live music from: \n\nMunch wsg/ nuntheless & bhuti - After making waves with his latest project \"Beaches\", Munch aims to set the bar even higher with his currently untitled, soon-to be released follow up EP. Munch's focus behind his new project revolves around one central idea: being more honest with himself. This approach has allowed Munch to find a new energy through his sound that showcases his growth as an artist over the previous years. He's very excited to share his new tunes with the world. Hear MUNCH's music here: https://soundcloud.com/munchmusic/tracks\n\nIsaac Castor - an Ann Arbor rapper who teams up with producer Arjun Singh. In 2015, the two released High Art, a collaborative full length project that features an eclectic mix of musical styles and received praise in XXL Magazine, Hear HIGH ART here: https://soundcloud.com/isaaccastor/sets/high-art\n\nAwkward Theory - an alternative hip hop group born and raised in Detroit. They are noted for intermixing classic hip hop styles, with genres such as: rock, pop, punk, and folk strings. Known for their distinctive beat compositions, they create a perfect juxtaposition of soft vocals, gritty lyrics, and complex sounds that captures the heart and soul of a young person growing up in a“forgotten” community in which \"revitalization\" efforts would rather marginalize and replace them, than stabilize and uplift them. Hear AWKWARD THEORY's sounds here: https://soundcloud.com/awkward-theory/tracks\n\nBroccoli Unofficial - is a performance artist that uses hip hop music as a medium to explore concepts of identity, personality, and the relationship between an artist and their work. He performs as a new character for each show, often premiering new music along with the new persona. Broccoli wants you to be chill with whatever. Hear BROCCOLI's music here: https://soundcloud.com/nutothelo. Watch a clip from his live set here: http://bit.ly/2aOeTSF\n\nDude Madison - a sophomore UMich Student hailing from NYC. You can catch him bringing the #goofyvibes to life on campus. His \"Withavision\" project is set to drop later this year. Hear DUDE MADISON's tracks here: https://soundcloud.com/dudemadison/tracks", "url": "https://www.facebook.com/events/1062992837118233/"}, {"source": "Facebook", "date": "2016-09-16T20:00:00-04:00", "name": "Pointless Improv with Listen, Stupid and Unicornucopia", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Listen, Stupid\nGroup 2: Unicornucopia\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/1677570632569236/"}, {"source": "Facebook", "date": "2016-09-16T20:00:00-04:00", "name": "Melanie at Green Wood Coffee House", "description": "At Woodstock, as a New York kid barely known outside the coffeehouse circuit in Greenwich Village, she sang her song, \"Beautiful People\" and inspired the first panorama of candles and cigarette lighters ever raised at a concert event. That, in turn, moved the young singer to write \"Lay Down (Candles in the Rain\"), which sold more than one million copies in 1970 and prompted Billboard, Cashbox, Melody Maker, Record World, and Bravo to anoint her as female vocalist of the year. Her single, \"Brand New Key,\" topped the charts in 1971.\nWith guitar in hand and a combination of amazing vocal talent, disarming humor, and a vibrant engagement with life, she was booked as the first solo pop/rock artist ever to appear at the Royal Albert Hall, Carnegie Hall, and the Metropolitan Opera House, and later opened the New Metropolitan Opera House in New York, the Sydney Opera House, and in the General Assembly of the United Nations, where she was invited to perform on many occasions as delegates greeted her performances with standing ovations.\nThe top television hosts of all time -- Ed Sullivan, Johnny Carson, and Dick Cavett -- battled to book her.\nUNICEF made her its spokesperson; Jimi Hendrix's father introduced her to the multitude assembled for the twentieth anniversary of Woodstock. Her records continued to sell -- more than eighty million to date. She's had her songs covered by singers as diverse as Cher, Dolly Parton, and Macy Gray. She's raised a family, won an Emmy, opened a restaurant, and written a musical about Wild Bill Hickok and Calamity Jane.\nThis is a rare opportunity to experience Melanie live and in person in an intimate venue. Don't miss it!\nwww.melaniesafka.com", "url": "https://www.facebook.com/events/1653085994944878/"}, {"source": "Facebook", "date": "2016-09-16T22:00:00-04:00", "name": "A Pointless Display of Improvised Feats", "description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!", "url": "https://www.facebook.com/events/511871919008784/"}, {"source": "Facebook", "date": "2016-09-17T09:00:00-04:00", "name": "Stewardship Workday-Huron Parkway Nature Area", "description": "Stewardship Workday\nSaturday, September 17\nHuron Parkway Nature Area\n9 a.m. to noon\nHuron Parkway is full of many types of wildlife – everything from birds to turtles can be found in this secluded nature area. During this workday we will remove invasive honeysuckle and buckthorn to allow more native plant species to become established and provide food and habitat for wildlife. Meet us at 3470 Woodland Road off East Huron River Drive, home of one of the Park Stewards. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "url": "https://www.facebook.com/events/273763186316149/"}, {"source": "Facebook", "date": "2016-09-17T12:00:00-04:00", "name": "Intro to Sketch Writing Workshop", "description": "Always wanted to learn how to take a funny idea and mold it into a comedy sketch? Always enjoyed writing but wanted to give comedy a try? Well check out, INTRODUCTION TO SKETCH WRITING with Mark Kendall, an introduction to the basics of writing sketch comedy. Using in class writing exercises and video clips, students will come away with a basic understanding of sketch structure and brainstorming techniques. \nCost: $30\n\nABOUT MARK KENDALL\nMark first got into comedy while studying film at Northwestern University. He had a chance to work at Comedy Central through the Chris Rock Summer School Program for up and coming comedy writers of color. During his time at Comedy Central, he got to pitch jokes to the writing staffs of \"The Daily Show\" and \"The Colbert Report.\" Mark performs comedy in Atlanta at Dad's Garage Theatre Company and Highwire Comedy. He also teaches improv and sketch writing. He is currently touring with his one man show \"The Magic Negro and Other Blackness\" a sketch show that examines the depiction of black men in the media. For his work with the show, he was recently awarded \"Best Professional Funny Man\" by Creative Loafing Atlanta.", "url": "https://www.facebook.com/events/1146816402007835/"}, {"source": "Facebook", "date": "2016-09-17T16:00:00-04:00", "name": "Icebreakers^2", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/780575198712033/"}, {"source": "Facebook", "date": "2016-09-17T19:00:00-04:00", "name": "Abby Wambach", "description": "***Tickets on sale now: http://www.brownpapertickets.com/event/2594725 ***\n\nLiterati is thrilled to welcome two-time Olympic gold medalist and FIFA World Cup champion Abby Wambach to Rackham Auditorium in Ann Arbor, in celebration of her memoir, Forward.\n\nAbout Forward\n\nAbby Wambach has always pushed the limits of what is possible. At age seven she was put on the boys' soccer team. At age thirty five she would become the highest goal scorer--male or female--in the history of soccer, capturing the nation's heart with her team's 2015 World Cup Championship. Called an inspiration (and \"badass\" by President Obama), Abby has become a fierce advocate for women's rights and equal opportunity, pushing to translate the success of her team to the real world. As she reveals in this searching memoir, Abby's professional success often masked her inner struggle to reconcile the various parts of herself: ferocious competitor, daughter, leader, wife. \n\nWith stunning candor, Abby shares her inspiring and often brutal journey from girl in Rochester, New York, to world class athlete. Far more than a sports memoir, Forward is gripping tale of resilience and redemption and a reminder that heroism is, above all, about embracing life's challenges with fearlessness and heart.\n\nAbout the Event\n\nFeaturing a conversation with Doug Tribou, host of Morning Edition for Michigan Radio, and former reporter and producer for NPR's Only A Game, this event will take place at Rackham Auditorium on September 17th, 2016, at 7pm. Doors for seating will open at 6:15pm. There are two ticket options: a $10 dollar general admission ticket, and a $30 dollar general admission and hardcover book bundle. Though both ticketing options provide general admission seating, book-bundle ticket holders will have first access to the signing line following the event. Book-bundle ticket holders will pick up their books at the event, and not before. Additional copies of Forward will be available to purchase in the lobby, including a young reader's edition.\n\nGeneral admission ticket holders may also have books signed, and are asked to join the signing line after book-bundle ticket holders. Due to time constraints, Abby will only be signing books. There will no posed photographs during the signing (though you are welcome to take pictures while you are in the signing line). Books will not be personalized.", "url": "https://www.facebook.com/events/130844247363538/"}, {"source": "Facebook", "date": "2016-09-17T20:00:00-04:00", "name": "Pointless Improv with HugSquared and Wilderness Girls", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: HugSquared\nGroup 2: Wilderness Girls\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/576611239177299/"}, {"source": "Facebook", "date": "2016-09-17T20:30:00-04:00", "name": "Nights at the Museum", "description": "Nights at the Museum, UMMA’s first-ever exterior media art initiative, is open to the public, and will run from September 2-9 from 8:30 p.m. to dawn along its State Street-side facade.\n\nNights at the Museum begins Friday, Sept. 2, during Artscapade!, a Welcome Week event for new U-M students, and concludes on Friday, Sept. 9 at UMMA’s twice-annual After Hours community celebration.\n\nOn Friday, Saturday, and Sunday, from dusk to dawn, UMMA will showcase a digital art installation by Quayola called Pleasant Places. Inspired by the work of Vincent Van Gogh, Quayola has returned to the same countryside of Provence 125 years later to create of a series of digital paintings exploring the boundary between representation and abstraction. Pleasant Places will also be projected overnight throughout the remainder of the week. \n\nFor the Full Schedule Check Here: http://www.umma.umich.edu/news/2016/umma-to-light-up-campus-with-nights-at-the-museum", "url": "https://www.facebook.com/events/1770837316505091/"}, {"source": "Facebook", "date": "2016-09-17T22:00:00-04:00", "name": "Pointless Improv with Wilderness Girls and HugSquared", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Wilderness Girls\nGroup 2: HugSquared\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/869467216519698/"}, {"source": "Facebook", "date": "2016-09-17T22:00:00-04:00", "name": "Reggae Rebel (8) back to school edition", "description": "DJ RUDY \nDJ ADRENALIN\nANN ARBOR REGGAE\n(dancehall/reggae/hiphop)", "url": "https://www.facebook.com/events/1263433497022594/"}, {"source": "Facebook", "date": "2016-09-18T13:00:00-04:00", "name": "Guided Tour Engaging with Art", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.\nEngaging with Art tours are generously supported by the Berkowitz Family Endowed Fund.", "url": "https://www.facebook.com/events/196688857412454/"}, {"source": "Facebook", "date": "2016-09-18T13:00:00-04:00", "name": "Stewardship Workday-Foxfire West", "description": "Stewardship Workday\nSunday, September 18\nFoxfire West Park\n1 to 4 p.m.\nThis little park is nestled in a neighborhood in the northern reaches of Ann Arbor. Help us remove invasive honeysuckle and buckthorn to improve the habitat for the many frog and toad species that call this area home. Meet us at the park entrance on Birchwood Drive between Hickory Point Drive and Timbercrest Court. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "url": "https://www.facebook.com/events/1169454713118416/"}, {"source": "Facebook", "date": "2016-09-18T14:00:00-04:00", "name": "Guided Tour - Manuel Álvarez Bravo: Mexico's Poet of Light", "description": "Manuel Álvarez Bravo spent nearly his entire career photographing his native Mexico. His style drew upon numerous international influences including, among others, Modernism and Surrealism. Although not strictly Surrealist, many of Álvarez Bravo’s works manifest a similarly fantastical mood. One of the artist’s most arresting qualities is his ability to imbue scenes of everyday life with an otherworldly, metaphysical power. The photographs in the exhibition, from UMMA’s collections, show the artist using motifs drawn from Mexican religious and indigenous works as well as plant forms, in a Modernist approach to image making. UMMA docents will discuss these motifs and the artist’s use of light as a metaphor and revealer of life, animating even the emptiest and most silent of Álvarez Bravo’s scenes.", "url": "https://www.facebook.com/events/1665144867135831/"}, {"source": "Facebook", "date": "2016-09-18T16:00:00-04:00", "name": "20th Concert4aCause!", "description": "This Is My Song\n\nNorthside Community and First Baptist Churches present This Is My Song on Sunday, September 18th at 4:00 PM. The 20th Concert4aCause will benefit Ann Arbor's Jim Toy Community Center.\n\nFeaturing music by Caroline Helton, Kayla Hill, Sarah Cleveland, Kathryn Goodson, Out Loud Chorus, Girlnoise, the UMSMTD Campbell Trumpet Trio, and the Yost Handbell Choir.\n\nFree Event! \n\nDonations to the Jim Toy Community Center Encouraged.", "url": "https://www.facebook.com/events/171122096629760/"}, {"source": "Facebook", "date": "2016-09-18T16:00:00-04:00", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "url": "https://www.facebook.com/events/1126104104127165/"}, {"source": "Facebook", "date": "2016-09-18T19:00:00-04:00", "name": "The Arcade - A Pointless Improv Jam", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/144085719370909/"}, {"source": "Facebook", "date": "2016-09-20T10:30:00-04:00", "name": "The Spunky Sprite and the Endless Night", "description": "\"The Spunky Sprite and the Endless Night\" follows a plucky young sprite who is desperate to learn how Mother Nature brings the world to life each day. Caught up in her desire to do everything by herself, the sprite unwittingly lets a darkness into the land that threatens their very way of life. Only by finally accepting help is she able to return nature back to full health. It is then that she realizes working together makes us stronger.\n \n\"The Spunky Sprite and the Endless Night\" is an original play, developed specifically for babies through elementary school children. Told largely through music and movement, this show speaks the language of our youngest theatre-goers. Highly interactive, \"The Spunky Sprite and the Endless Night\" welcomes the audience into the world of the play, and encourages them to wiggle, make noise, clap, and sing.\n\nTickets: $10 for adults, $5 for children", "url": "https://www.facebook.com/events/1824235374473797/"}, {"source": "Facebook", "date": "2016-09-20T19:00:00-04:00", "name": "Acoustic Tuesdays: James Cornelison", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nJames Cornelison\nChicago Native James Cornelison has been working as a multi-instrumentalist in Michigan for 5 years. He has played locally with Theo Katzman, the Macpodz, Tree City, Madelyn Grant, Antwaun Stanley, Anna Ash, Heather Black Project, MC Kadence and Chis Good in addition to a number of jazz groups across Detroit and Ann Arbor.  James grew up playing and singing in the Chicago blues scene and currently works as a producer for Michigan based artists.  James is increasingly stepping out from working behind the scenes and as a sideman to pursue his own projects. Join us for James' LAST Acoustic Tuesday SHOW before he moves to LA!\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/1671418046512529/"}, {"source": "Facebook", "date": "2016-09-20T19:00:00-04:00", "name": "SMTD: Composing a Space", "description": "This program is free and open to the public. Seating is first come, first served.\nArchitect Mira Henry's conceptual drawings offer a new way of seeing architecture and architectural elements, including the historically female domains of interior spaces and decorative elements. U-M Composition faculty members Roshanne Etezady and Kristin Kuster think about the concept of the feminine in music and discuss creating new work with and against the male-dominated grain. Colleagues and SMTD students perform works by Etezady and Kuster.\nThe SMTD@UMMA performance series is generously supported by the Katherine Tuck Enrichment Fund and the Greg Hodes and Heidi Hertel Hodes—Partners in the Arts Endowment Fund.\nLead support for the exhibition Mira Henry: The View Inside is provided by the Herbert W. and Susan L. Johe Endowment.", "url": "https://www.facebook.com/events/505768019612859/"}, {"source": "Facebook", "date": "2016-09-20T21:00:00-04:00", "name": "Bakermat x Sam Feldt ll Necto ll 9.20.16", "description": ">>TICKETS: http://samfeldtnectonightclub.eventbrite.com/?aff=FBE\n\nPrime Social Group presents...\n\nBAKERMAT x SAM FELDT\n=============================\nNECTO NIGHTCLUB\n=============================\nTuesday, September 20 // 9:00 PM doors // 18+\n=============================\n\n>>TICKETS ON SALE: http://samfeldtnectonightclub.eventbrite.com/?aff=FBE\n\n>>>MUSIC: \nhttps://soundcloud.com/bakermatmusic/\nhttps://soundcloud.com/samfeldt\n\nWho is Bakermat?\n\nIt all started in 2012 when 20 year old Lodewijk Fluttert took a semester off of hisstudy Psychology to discover different sides of himself. For two months he danced, filmed, made music, did standup comedy, wrote and much more, untill he found out what he loved doing most: making music. He uploaded a couple of tracks on Youtube and Soundcloud, and Bakermat was born. Since then he stepped in a rollercoaster ride he could have never imagined. First official single ‘Vandaag (One Day)’ became a huge hit all over Europe hitting top 10 spots in almost every country. The early succes got rewarded with platinum records in France, Germany, The Netherlands and Belgium. The succes was largely attributed to the fact that he came with an entirely different and new sound, combining minimal and deep house with jazz and soul. It laid a foundation for the genres we now know as ‘tropical house’ or ‘melodic house’, in which he is still seen as the founder and pioneer. He keeps trying to bring new and refreshing music out, always trying to be as unique and renewing as possible. A huge succes was his record released in 2015 “Teach Me” where he mixedSoul, Gospel and Disco to a record that set a new standard in the ‘melodic house’ genre. \n\nBakermat also became well know because of his innovative performances and stage hostings. He did shows in Paris, London and other big cities with an entire band called ‘The Bakermat Live Band’. In Paris he even played in the legendary L’Olympia with his band, a sold out show. He played at almost every big festival there is over the last 3 years like I Love Techno, Ultra Miami, Sensation White, Mainsquare, Montreux Jazz Festival, Tomorrowland, Mysteryland, South West Four and the list goes on and on. He is also the host of stages at the biggest festivals like the ‘Bakermat & Friends’ stage at Tomorrowland every year, or the “Bakermat’s Gospel Church’ at Kingsday Festival and a lot more. As one of the founders his goal is to bring new talent or fellow colleagues to the stage and that's exactly what he does when he's curating a stage. Artists like Klingande, Thomas Jack, The Avener, Robin Schulz and Oliver Heldens are often guests at one of his stages. Bakermat’s new album ‘Bon Voyage’ is his first studio album and will be released in 2015, it contains a lot of new material and new styles/ production techniques, because according to Bakermat this was an opportunity for him to “ really be free of restrictions and make exactly what I want”. With his album, remixes, releases and confirmed shows at the biggest festivals lined up, it seems 2016 will be a great year for Bakermat once again.\n\n\nWho is Sam Feldt?\n\nDeemed a \"Modern House superstar\" by Billboard, Sam Feldt broke onto the scene in 2013 with remixes including \"On Trees and Birds and Fire\" from I Am Oak. In 2015, he released a remake of \"Show Me Love\" from Robin S. which charted highly across the world. \n\nThe Dutch DJ, born August 1, 1993, is currently signed to Spinnin' Records and most recently released \"Summer On You\", a melodic and deep tropical track with Lucas & Steve featuring Wulf.\n\nwww.PrimeSocial.com\n===============================\nGET INVOLVED: Want to get involved with PSG? Join the team by visiting http://primesocial.com/get-involved/\n===============================", "url": "https://www.facebook.com/events/1033650563369677/"}, {"source": "Facebook", "date": "2016-09-21T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-09-21T19:00:00-04:00", "name": "Kristin Rebecca with Joe Holt", "description": "Kristin Rebecca is a captivating performer who combines her powerful, angelic voice, unique guitar rhythms and rare harp ability into a show unlike any other.  Joe Holt is a folk singer/songwriter described by Indie, Bikes and Beer as \"a smart songwriter with a rich voice.\" More info at: http://www.ouryellowbarn.com/event/kristin-rebecca-with-joe-holt/?instance_id=22566", "url": "https://www.facebook.com/events/1071944319522170/"}, {"source": "Facebook", "date": "2016-09-21T19:00:00-04:00", "name": "Author Nisi Shawl Discussion & Signing", "description": "Nisi Shawl is a writer of science fiction and fantasy short stories and a journalist. She is the co-author (with Cynthia Ward) of \"Writing the Other: Bridging Cultural Differences for Successful Fiction.\" Her short stories have appeared in \"Asimov's SF Magazine,\" \"Strange Horizons,\" and numerous other magazines and anthologies.\n\n\"Everfair \"is a wonderful Neo-Victorian alternate history novel that explores the question of what might have come of Belgium's disastrous colonization of the Congo if the native populations had learned about steam technology a bit earlier. Fabian Socialists from Great Britian join forces with African-American missionaries to purchase land from the Belgian Congo's \"owner,\" King Leopold II. This land, named Everfair, is set aside as a safe haven, an imaginary Utopia for native populations of the Congo as well as escaped slaves returning from America and other places where African natives were being mistreated.\n\nhttp://bit.ly/2bsc2RP", "url": "https://www.facebook.com/events/861030390698582/"}, {"source": "Facebook", "date": "2016-09-22T12:00:00-04:00", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/"}, {"source": "Facebook", "date": "2016-09-22T17:30:00-04:00", "name": "Zell Visiting Writers Series: Bob Hicok Poetry Reading", "description": "Bob Hicok was born in 1960 in Michigan and worked for many years in the automotive die industry. A published poet long before he earned his MFA, Hicok is the author of several collections of poems, including The Legend of Light, winner of the Felix Pollak Prize in Poetry in 1995 and named a 1997 ALA Booklist Notable Book of the Year; Plus Shipping(1998); Animal Soul (2001), a finalist for the National Book Critics Circle\nAward; Insomnia Diary (2004); This Clumsy Living (2007), which received the Rebekah Johnson Bobbitt National Prize for Poetry from the Library of Congress; Words for Empty, Words for Full (2010); and Elegy Owed (2013), a finalist for the National Book Critics Circle Award. His work has been selected numerous times for the Best American Poetry series. Hicok has won Pushcart Prizes and fellowships from the Guggenheim Foundation and the National Endowment for the Arts, and has taught creative writing at Western Michigan University and Virginia Tech.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please visit the LSA's Zell Visiting Writer Series website.", "url": "https://www.facebook.com/events/1635741953403427/"}, {"source": "Facebook", "date": "2016-09-22T19:30:00-04:00", "name": "Test Batch", "description": "Test Batch features the newest crop of improv groups in our community. Come and watch these troupes test their chops on the Pointless stage. When they are all inevitably famous, you can say \"I saw them way back when….\"\n\nFeaturing:\n\"Twelve-Second Countdown\" with Blake Charlebois, Matt Townsend, Jenny Blair, Cyrus Naheedy, Ramon Martinez, and Judy Irvine\n�\n\"Jalopy\" with Jim Harper, Andy Gaitens, Jon Miller, Annelyse Miller, Scott Sanford, and Dan Zemke\n�\n\"Gladstoned\" with Mike Dobmeier, Cynthia D'Amour, Hank Greenspan, and Frank Ankomah-Boateng\n�\n\"Unfiltered\" with Dawn, John, and Mark\n�\n\"Raptor Attack\" with Allyson Miko and Katie Parzych\n�\n\"Downstairs Cardigans\" with Sue Durso, Shawn Golden, Sara Wilder, Lily Keyes, Ester Navarez, and Jeff Horst", "url": "https://www.facebook.com/events/632338420262699/"}, {"source": "Facebook", "date": "2016-09-22T21:00:00-04:00", "name": "Matoma at Necto: Thursday, Sept. 22nd", "description": "Thursday September 22nd\nreact presents\n\n:: Matoma ::\n\nWith Special Guests\n\nCheat Codes\n\nPlus\nSteve Void & Baynk\n\nDoors at 9:00pm\n18+ Welcome\n\nNecto\n516 E. Liberty\nAnn Arbor, MI\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet", "url": "https://www.facebook.com/events/1743733792544393/"}, {"source": "Facebook", "date": "2016-09-23T12:00:00-04:00", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/"}, {"source": "Facebook", "date": "2016-09-23T15:00:00-04:00", "name": "Drink & Draw / Imbibe & Inscribe", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/1269740253038700/"}, {"source": "Facebook", "date": "2016-09-23T18:30:00-04:00", "name": "UMMA Dialogue: Vishakha Desai and Martha Tedeschi", "description": "Vishakha Desai, Senior Advisor for Global Affairs to the President, Columbia University, and Senior Research Scholar in the School of International & Public Affairs, Columbia University, and Martha Tedeschi, the newly appointed Elizabeth and John Moors Cabot Director of the Harvard Art Museums, join us to honor the legacy of Walter and Nesta Spink. Moderated by UMMA Director Joseph Rosa and including exhibition co-curators, Carole McNamara and Natsu Oyobe, this UMMA Dialogue will explore the exhibition and include a discussion of university museums within the larger museum and cultural fields and preparing future scholars and leaders to operate in our global culture.\n\nThe exhibition gallery will be open and light refreshments provided from 5-6:30 p.m. before the program.\nEstablished through the generosity of Dr. Herbert Sloan, the annual Doris Sloan Memorial Program honors one of the Museum’s most ardent friends and supporters, Doris Sloan, a\nlong-time UMMA docent.\n\nLead support for this exhibition is provided by the University of Michigan Office of the Provost. Additional generous support is provided by the University of Michigan Center for South Asian Studies.", "url": "https://www.facebook.com/events/566862733512346/"}, {"source": "Facebook", "date": "2016-09-23T20:30:00-04:00", "name": "Nights at the Museum", "description": "Nights at the Museum, UMMA’s first-ever exterior media art initiative, is open to the public, and will run from September 2-9 from 8:30 p.m. to dawn along its State Street-side facade.\n\nNights at the Museum begins Friday, Sept. 2, during Artscapade!, a Welcome Week event for new U-M students, and concludes on Friday, Sept. 9 at UMMA’s twice-annual After Hours community celebration.\n\nOn Friday, Saturday, and Sunday, from dusk to dawn, UMMA will showcase a digital art installation by Quayola called Pleasant Places. Inspired by the work of Vincent Van Gogh, Quayola has returned to the same countryside of Provence 125 years later to create of a series of digital paintings exploring the boundary between representation and abstraction. Pleasant Places will also be projected overnight throughout the remainder of the week. \n\nFor the Full Schedule Check Here: http://www.umma.umich.edu/news/2016/umma-to-light-up-campus-with-nights-at-the-museum", "url": "https://www.facebook.com/events/1770837316505091/"}, {"source": "Facebook", "date": "2016-09-23T22:00:00-04:00", "name": "A Pointless Display of Improvised Feats", "description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!", "url": "https://www.facebook.com/events/247785798949494/"}, {"source": "Facebook", "date": "2016-09-23T22:00:00-04:00", "name": "8-Bit Above w/ DJ Jaw , Dragon56 , The Fleshy Timeclock , TBA", "description": "DJ Jaw\nLeader and organizer of a new chip and dj collective on the west side of Michigan called Neko Gala!\nhttp://soundcloud.com/dj-jaw-3\n\nThe Fleshy Timeclock\nDark landscape ambient pads and industrial beats made on Nintendo DS and other electronic instruments.\n\nDragon 56\nGameboy dance and game tunes!\nhttp://soundcloud.com/ragon56\n\nDJ Meowmix\n\nMoar TBA!\n\n$5 Suggested donation", "url": "https://www.facebook.com/events/1061829117247283/"}, {"source": "Facebook", "date": "2016-09-24T09:00:00-04:00", "name": "Stewardship Workday- Argo Nature Area", "description": "Stewardship Workday\nSaturday, September 24\nArgo Nature Area\n9 a.m. to noon\nCome enjoy a day by the river in this 22-acre park. Learn how to identify and cut invasive species such as buckthorn and honeysuckle. Doing so will allow native species to thrive and provide natural habitat for wildlife.  Meet in the parking lot north of the Argo Canoe Livery, off Longshore Drive. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/908820275930383/"}, {"source": "Facebook", "date": "2016-09-24T16:00:00-04:00", "name": "Icebreakers^2", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/780333248774014/"}, {"source": "Facebook", "date": "2016-09-24T21:00:00-04:00", "name": "The Slackers 9/24/16 at Blind Pig - Ann Arbor", "description": "Sat. September 24 | 9pm | 18+ | $15 Cover\n\nThe Slackers wsg: Duppies\n\nThe Slackers are self styled masters of Reggae, Ska and Rock’n’Roll from New York City. The Slackers began in 1991 in NYC. After years of local gigs and rehearsing in a dingy basement in Manhattan’s lower east side, the band released its debut album, Better Late Than Never, in 1996. The band’s success resulted in the release of a second album, Red Light, on the Epitaph label in 1997. Since then the Slackers have released 11 more studio albums (The Question, Wasted Days, Slackers & Friends, Close My Eyes, Slackers in Dub, Peculiar, Boss Harmony Sessions, Self Medication, Lost and Found, The Great Rocksteady Swindle, and The Slackers [self-titled, 2016] ) 3 live albums (Live at Ernestos, Upsettin Ernestos, Slack in Japan), several EPs (International War Crimminal, My Bed is a Boat), and numerous singles and compilation tracks. Since 1997 the Slackers have played over 100 shows every year in a total of 46 american states, 7 Canadian provinces, 22 European countries, 5 Latin American countries, and 2 Asian countries. The band’s musical style is distinct from their contempories; a mix of early Jamaican music with classic 50’s and 60s American styles. There are influences from 50s and 60s Rock’n’Roll, Rythmn and Blues, Jazz and Latin music. Singer Vic Ruggiero has coined the term ‘Jamaican Rock’nRoll.’ to describe it. He says, “The band might play a classic Jamaican style but the vocals are distinctly American east coast, revealing the obvious connection of Jamaican music to the Doo-Wop of Harlem and the Bronx.” With the demise of record companies over the last 5 years, the Slackers have successfully used crowdfunding (www.bigtun.es/theslackers.) to release new music including the latest release, The Slackers [self-titled] in February 2016.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/671", "url": "https://www.facebook.com/events/992824104100196/"}, {"source": "Facebook", "date": "2016-09-25T10:30:00-04:00", "name": "The Spunky Sprite and the Endless Night", "description": "\"The Spunky Sprite and the Endless Night\" follows a plucky young sprite who is desperate to learn how Mother Nature brings the world to life each day. Caught up in her desire to do everything by herself, the sprite unwittingly lets a darkness into the land that threatens their very way of life. Only by finally accepting help is she able to return nature back to full health. It is then that she realizes working together makes us stronger.\n \n\"The Spunky Sprite and the Endless Night\" is an original play, developed specifically for babies through elementary school children. Told largely through music and movement, this show speaks the language of our youngest theatre-goers. Highly interactive, \"The Spunky Sprite and the Endless Night\" welcomes the audience into the world of the play, and encourages them to wiggle, make noise, clap, and sing.\n\nTickets: $10 for adults, $5 for children", "url": "https://www.facebook.com/events/1824235374473797/"}, {"source": "Facebook", "date": "2016-09-25T12:00:00-04:00", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/"}, {"source": "Facebook", "date": "2016-09-25T13:00:00-04:00", "name": "Guided Tour: Engaging with Art", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.\nEngaging with Art tours are generously supported by the Berkowitz Family Endowed Fund.", "url": "https://www.facebook.com/events/243563482709889/"}, {"source": "Facebook", "date": "2016-09-25T14:00:00-04:00", "name": "Guided Tour The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink", "description": "The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink celebrates gifts to the museum from two accomplished scholars with eclectic interests, a keen appreciation of form, and a love of learning from objects. Nesta Spink, curator at UMMA from 1967 to 1979, is regarded as the preeminent authority on the lithographs of J a.m.es McNeill Whistler. U-M professor emeritus Walter Spink is a world-renowned specialist on early Buddhist art and architecture in India. UMMA docents will discuss the exquisite Whistler prints, a rich representation of South Asian folk art, and other highlights from their gifts", "url": "https://www.facebook.com/events/166502213757646/"}, {"source": "Facebook", "date": "2016-09-25T15:00:00-04:00", "name": "Launch Party for Shutta Crum & Kristin Bartley Lenz", "description": "Shutta Crum is an author, lecturer, teacher, and retired librarian, all in the field of children s books. Among her most popular titles are Thunder-Boomer (Clarion), which received four starred reviews, was nominated for a Cybil Award, and was an SLJ Best Book, a Smithsonian Magazine Notable Book, and an ALA Notable Book, and Mine (Knopf), which also received four starred reviews. She lives in Michigan. Learn more at www.shutta.com.\n\nKristin Bartley Lenz is a writer and social worker whose career has taken her through rural Appalachia, the California Bay Area, and inner-city Detroit. She graduated from the University of Michigan and Wayne State University, and co-edits the Michigan Chapter blog for the Society of Children’s Book Writers and Illustrators. Her debut young adult novel,The Art of Holding On and Letting Go, is a Junior Library Guild Fall 2016 Selection. Learn more at www.kristinbartleylenz.com.\n\n\nhttp://bit.ly/2bQGKoc", "url": "https://www.facebook.com/events/1005664552885633/"}, {"source": "Facebook", "date": "2016-09-25T16:00:00-04:00", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "url": "https://www.facebook.com/events/1321163281246884/"}, {"source": "Facebook", "date": "2016-09-25T17:30:00-04:00", "name": "Aislinn Gagliardi- Irish Harp Concert", "description": "The Celtic Room at Conor O'Neill's Pub\n318 South Main St, Ann Arbor, MI 48104\nShow starts at 5:30pm - Doors at 5:00pm\nGeneral: $15 | Students: $12 | Kids under 10 free\n_________________________________________\nAislinn Gagliardi is an Irish harpist and composer based in Chicago, and is well sought after as a performer, teacher and recording artist. Drawing from her background in Irish dance, and influenced by a diverse musical range from classical to Cape Breton, Aislinn’s distinct style shines through her music in an open and honest way. Known for her syncopated and rhythmic accompaniment, her compositions and arrangements offer a fresh perspective to the Irish music tradition.\n\nRaised immersed in the Irish culture (the shared heritage on both sides of her family) Aislinn learned about Irish customs through dance, music and language lessons. She was drawn to the harp from an early age, and studied with various Irish and Celtic harpers including Janet Harbison and Michael Rooney. Aislinn also spent a semester abroad at the University of Limerick where she worked closely with Irish harper Fionnuala Rooney.\n\nAislinn’s recently released debut solo harp album The Thin Place has been called “stunning, a monumental piece of work from a very talented and driven harper” and “for a first CD it’s a winner” (Jack Baker of Irish American News). The album blends popular traditional Irish tunes with those less commonly played, and features four of her own compositions including one with the album’s namesake. Joining Aislinn on select tracks are some of Chicago’s finest Irish musicians: Liz Carroll (fiddle), Teresa Shine (fiddle) and John Williams (concertina). Aislinn’s tune The Thin Place and accompanying track is also featured on the Irish Traditional Music Archive’s Newly Composed Tunes and Songs in the Irish Tradition playlist. Listen to a sample here.\n\nFrom performing annually at Irish festivals including the Milwaukee Irish Fest, to private events and traditional Irish music sessions, Aislinn is in high-demand as a performer and keeps a busy schedule. She is a featured musician for the annual iBAM! (Irish Books Arts & Music) Gala Dinner, and played for celebrations honoring the opening of the Ireland: Crossroads of Art & Design, 1690-1840 exhibit at the Art Institute of Chicago.\n\nAislinn holds a B.F.A. in Inter-Arts (music and dance), an interdisciplinary major in Ethnic Studies and a certificate in Celtic Studies. She has taught workshops at the Milwaukee Irish Fest School of Music (MIFSM), the Milwaukee Irish Fest Summer School, the Great Lakes Harpers (GLH) Regional Conference, and the Madison Folk Harp Society. Currently Aislinn teaches from her private studio in Chicago and via Skype, is on faculty at the MIFSM, and teaches workshops at the Old Town School of Folk Music.\n\nVisit Aislinn on the web at www.aislinnmusic.com\n\nThis project is partially supported by an Individual Artist Program Grant from the City of Chicago Department of Cultural Affairs & Special Events, as well as a grant from the Illinois Arts Council, a state agency through federal funds provided by the National Endowment for the Arts.", "url": "https://www.facebook.com/events/1160032467389616/"}, {"source": "Facebook", "date": "2016-09-25T19:00:00-04:00", "name": "Open Stage", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/251267431933919/"}, {"source": "Facebook", "date": "2016-09-25T21:00:00-04:00", "name": "Songbook: A Night Of Stories & Songs with Blitezen Trapper 9/25/16 at Blind Pig - Ann Arbor", "description": "Sunday, September 29 | 9pm | 18+ | $17 adv./ $20 day of\nSongbook: A Night Of Stories & Songs with:\nBlitzen Trapper and special guest Kacy & Clayton\n\nOver the course of 15 years and seven full-length albums, Blitzen Trapper has crafted one of the more compelling and varied catalogs in contemporary rock and roll. Indeed, singer and guitarist Eric Earley, who is also the Portland, Oregon-based band's primary songwriter, is possessed of a musical and lyrical sensibility that is remarkably deep and wide; big ideas and universal emotions are wrung from the seemingly plainspoken details of small-screen and often highly personal stories, and set to music that reaches way, way back to old-timey folk and bluegrass, travels through everything from country, psychedelia and soul to prog, garage and metal, indulges gloriously in the classic rock of the 70s and 80s, and makes occasional side trips into hip-hop, skewed pop and noisey freakouts.", "url": "https://www.facebook.com/events/832214916910877/"}, {"source": "Facebook", "date": "2016-09-27T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-09-27T19:00:00-04:00", "name": "Acoustic Tuesdays: Tike Anderson", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nTike Anderson Music\nTike Anderson’s songs are genuine testaments to life on the road, life at home, life in the center of the fire and life in the Motor City. He is an accomplished guitar player with a voice that sounds trained but feels honest. Tike’s songwriting blends road worn soul with the roots rock grit of the motor city and a hint of the easy intellectual earth tones of Ann Arbor.\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/325821474423026/"}, {"source": "Facebook", "date": "2016-09-27T20:00:00-04:00", "name": "Anderson East - Devil in Me Tour 9/27/16 at Blind Pig - Ann Arbor", "description": "Tue. September 27 | 8pm | 18+ | $15 adv./ $17 day of\n\nann arbor's 107one presents: Anderson East\n\nAnderson East learned to sing and play guitar at 11 years old. He is the grandson of a southern Baptist preacher, while his mother played piano in the church. After spending much of his time touring and engineering records, he was discovered by Dave Cobb at Nashville's Bluebird Café.\n\nHis debut album on Low Country Sound / Elektra, entitled 'Delilah,' was released on July 10th, 2015. Before the release East started touring nationally in January 2015 as direct support for Sturgill Simpson. In addition to his own sold-out headline shows, he has toured with Brandi Carlile, The Lone Bellow, Jason Isbell, and John Butler Trio. \"Satisfy Me\" was the first single released off the record. It instantly went top 10 viral on Spotify and received regular radio airplay. NPR music called 'Delilah' an \"eclectic, fully formed debut album.\" Daytrotter wrote, \"It's one of those 10-song records that's damned near perfect, traveling through the old, smoky bars of older days and down the twisted back roads of love.\" On July 15th, 2015 East made his television debut on \"Late Night with Seth Meyers,\" and also appeared on \"CBS This Morning Saturday\" in support of his album.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/724", "url": "https://www.facebook.com/events/1190479254318296/"}, {"source": "Facebook", "date": "2016-09-28T12:00:00-04:00", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/"}, {"source": "Facebook", "date": "2016-09-28T21:00:00-04:00", "name": "Tritonal: Painting With Dreams - Ann Arbor", "description": "We're bringing the Painting With Dreams tour to Necto Nightclub in Ann Arbor!\n\nNew album, a brand new stage production, and most important, all of our Tritonians of Michigan under one roof!!!!\n\nMore info and tickets - http://paintingwithdreams.com/\n\nSee you this fall!", "url": "https://www.facebook.com/events/1731098520471774/"}, {"source": "Facebook", "date": "2016-09-30T15:00:00-04:00", "name": "Drink & Draw / Imbibe & Inscribe", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/1766304530274477/"}, {"source": "Facebook", "date": "2016-09-30T17:30:00-04:00", "name": "Bird Walk- Argo Nature Area", "description": "Bird Walk \nFriday, September 30 \nArgo Nature Area \n5:30 to 7:30 p.m.\nJoin City Ornithologist Juliet Berger for a walk through Argo Nature Area and the Argo Cascades in search of southward migrating songbirds and waterfowl! We’ll also observe many birds that stay the winter in the Argo area, and we’ll see the beginnings of autumn color in the trees and shrubs. Meet in the parking area closest to the dam. Bring binoculars if you have them, but they are not necessary. Be prepared for uneven terrain, mosquitoes and rainy or muddy conditions. Free.", "url": "https://www.facebook.com/events/1558232137817484/"}, {"source": "Facebook", "date": "2016-09-30T20:00:00-04:00", "name": "Jeremy Horn at Green Wood Coffee House", "description": "Jeremy Horn grew up in Memphis -- \"Home of the Blues\" and \"Birthplace of Rock and Roll\" -- but his music sounds more like the Beatles than B.B. King or Elvis.  He writes songs for the church and songs for the radio, yet his songs are more complex than either has traditionally allowed.  He lives in a city that is known as much for its racial unrest and inner-city violence as it is for being the place Elvis called home, yet he leads worship at one of the largest multicultural churches in the South, where half the congregation is African-American. When you meet Jeremy, he looks and sounds just like the \"guy next door\" -- if the guy next door has a traditional southern drawl.  Making music has preoccupied  Jeremy Horn ever since he received his first guitar at age fifteen. Growing up on the sounds of James Taylor and the Beatles, Jeremy spent most of his early years emulating the sounds and songwriting styles of the popular culture. \"I used to write songs about social injustices in the world,\" says Horn. After a few years and conversations with a wise, older friend, Jeremy realized he could also write songs that aspired to give people hope, and not just write what everybody else was writing. Says Horn, \"That progressed into writing songs for Jesus, and that was the process that unexpectedly led me to become a worship leader.\" That progression started Jeremy Horn on the path of continued discovery --listening to artists both Christian and not -- to figure out how to express feelings and concepts that came from within, rather than from the evening news.  Jeremy's music is a fixture on Michigan's 17 Smile-FM Contemporary Christian music stations; his \"I Will See Angels 'Round Your Throne\" and \"First Love\" are two of his popular hits. Jeremy's new CD is No Other Love. This is a rare opportunity to see Jeremy Horn in a small venue setting. Bring a friend!\nwww.jeremyhornmusic.com", "url": "https://www.facebook.com/events/517141991807074/"}, {"source": "Facebook", "date": "2016-09-30T21:00:00-04:00", "name": "Goblin Cock w/ Super Thing & The Highborn 9/30/16 at Blind Pig - Ann Arbor", "description": "Fri. September 30 | 9pm | 18+ | $10 adv./ $12 day of\n\nFuzz Fest Showcase feat: Goblin Cock, Super Thing & The Highborn\n\n\"SO STUPID!!!\" bemoans Lord Phallus as he gazes pensively from the curtain wall of his modest stronghold.\n\n\"They don't know what they have, nor understand what they can do for one another or how short a time they have to do it in.\"\n\nHead in hands, the lead singer, guitar-player, and sole songwriter of histories most beloved Comic-Book Metal band knows what must be done.\n\n\"I must make a gesture\", he says.\n\n\"A frivolous gesture, perhaps, but a dear one nonetheless\"\n\nUpon snapping his bony fingers, an immense stone murphy bed plummets from a nearby rock wall, immiting all manner of bats, cobwebs, and forgotten paraphernalia until, coughing and wheezing, the auxiliary members of Goblin Cock appear one by one, shaken and disturbed, yet hungry for battle.\n\n\"It's the Humans again!\" Phallus intones, \"they've made it so increasing hard to for themselves to breathe their own air, eat their own food, love the ones they truly love, or generally have a full life without destroying the lives of innocents!\"\n\n\"But why, oh Lord?\" speak his bandmates in chilling unison, \"Why must they all live in such obvious denial?\"\n\n\"Beats me!\", Phallus ponders hesitantly, \"but instead of risking you all falling back to sleep through boorish philosophizing, lets put out a new record and get back on the road where we belong before they finish turning this lovely blue sphere into a burned out garbage planet!\"\n\n\"Hooray for that!\" cheer his hyper-enthusiastic bandmates.\n\nSo, Phallus went to work on his most concise album to date, invoking the spirit of Pure Fun while appeasing his love of Doomed Art.\n\nIt is a crushingly brutal Dear John letter to society.\n\nIt is a rock falling from space that knocks you unconscious that you, in turn, shove in your pajama pocket for safe keeping upon awakening.\n\nThese are songs about True Love.\n\nThese are songs about Revolution.\n\nThese are songs about 70's Children's Television.\n\nGoblin Cock have delivered an auditory tome of such importance that it needs to be experienced before the Secret Bastards find a way to marginalize it out of existence forever.\n\nNECRONOMIDONKEYKONGIMICON.\n\nIt is their gift to us.\n\nDon't squander it.", "url": "https://www.facebook.com/events/1807171166184117/"}, {"source": "Facebook", "date": "2016-10-01T10:30:00-04:00", "name": "The Spunky Sprite and the Endless Night", "description": "\"The Spunky Sprite and the Endless Night\" follows a plucky young sprite who is desperate to learn how Mother Nature brings the world to life each day. Caught up in her desire to do everything by herself, the sprite unwittingly lets a darkness into the land that threatens their very way of life. Only by finally accepting help is she able to return nature back to full health. It is then that she realizes working together makes us stronger.\n \n\"The Spunky Sprite and the Endless Night\" is an original play, developed specifically for babies through elementary school children. Told largely through music and movement, this show speaks the language of our youngest theatre-goers. Highly interactive, \"The Spunky Sprite and the Endless Night\" welcomes the audience into the world of the play, and encourages them to wiggle, make noise, clap, and sing.\n\nTickets: $10 for adults, $5 for children", "url": "https://www.facebook.com/events/1824235374473797/"}, {"source": "Facebook", "date": "2016-10-01T11:00:00-04:00", "name": "Children's Author Adam Rex & Illustrator Christian Robinson Discussion & Signing", "description": "Author: \n\nAdam Rex has written several books for young readers, including the \"New York Times\" bestselling \"Frankenstein Makes a Sandwich \"and \"The True Meaning of Smekday. \"His first day of school was at Lookout Mountain Elementary in Phoenix. He lives now with his wife and son in Tucson.\n\nIllustrator: \n\nChristian Robinson's award-winning books for young readers include \"Josephine, \" which was a Coretta Scott King Honor Book as well as a Sibert Honor Book and \"Harlem's Little Blackbird, \"which was an NAACP Image Award nominee. His latest book \"Last Stop on Market Street \" earned four starred reviews and was on the \"New York Times\" bestseller list. This is his first book for Roaring Brook Press.\n\nBook: \n\nIt's the first day of school at Frederick Douglass Elementary and everyone's just a little bit nervous, especially the school itself. What will the children do once they come? Will they like the school? Will they be nice to him?\nThe school has a rough start, but as the day goes on, he soon recovers when he sees that he's not the only one going through first-day jitters.", "url": "https://www.facebook.com/events/1741498216102456/"}, {"source": "Facebook", "date": "2016-10-02T12:00:00-04:00", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/"}, {"source": "Facebook", "date": "2016-10-02T13:00:00-04:00", "name": "Stewardship Workday-Bluffs Nature Area", "description": "Stewardship Workday\nSunday, October 2\nBluffs Nature Area\n1 to 4 p.m.\nTucked away within Bluffs’ 39 acres is an open field filled with native prairie species. Come out and help us preserve this beautiful habitat by removing invasive shrubs, such as buckthorn and honeysuckle, which are encroaching on the prairie. Meet at the park entrance on Sunset Road. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/1039321782829774/"}, {"source": "Facebook", "date": "2016-10-02T15:00:00-04:00", "name": "Author Bill Ayers - Discussion and Signing", "description": "Author: \n\nWilliam Ayers, formerly Distinguished Professor of Education and Senior University Scholar at the University of Illinois at Chicago (UIC) has written extensively about social justice and democracy, education and the cultural contexts of schooling, and teaching as an essentially intellectual, ethical, and political enterprise. His books include A Kind and Just Parent; Teaching toward Freedom; Fugitive Days: A Memoir; Public Enemy: Confessions of an American Dissident; On the Side of the Child; Teaching the Personal and the Political; To Teach: The Journey, in Comics; Teaching toward Democracy; and Race Course: Against White Supremacy.\n\nBook: \n\nIn an era defined by mass incarceration, endless war, economic crisis, catastrophic environmental destruction, and a political system offering more of the same, radical social transformation has never been more urgentor seemed more remote. \n\nA manifesto for movement-makers in extraordinary times, \"Demand the Impossible \" urges us to imagine a world beyond what this rotten system would have us believe is possible. \nIn critiquing the world around us, insurgent educator and activist Bill Ayers uncovers cracks in that system, raising the horizons for radical change, and envisioning strategies for building the movement we need to make a world worth living in.\n\nhttp://bit.ly/2bDtSha", "url": "https://www.facebook.com/events/518635875000773/"}, {"source": "Facebook", "date": "2016-10-03T09:00:00-04:00", "name": "Maker Space Operations Bootcamp", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "url": "https://www.facebook.com/events/1676692335988216/"}, {"source": "Facebook", "date": "2016-10-04T09:00:00-04:00", "name": "Maker Space Operations Bootcamp", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "url": "https://www.facebook.com/events/1676692335988216/"}, {"source": "Facebook", "date": "2016-10-04T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-10-04T19:00:00-04:00", "name": "Acoustic Tuesdays: Ryan Racine", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nRyan Racine\nhttp://ryan-racine.squarespace.com/\nIt's been a twenty-plus year journey for Ryan Racine to get to where his music finds itself. Recording for the first time as a solo artist and writing without what he refers to as \"the shackles of genre\", the direction is really a culmination of the variety in his past projects. The sound is still very much grounded in American Roots music but is unbound by the narrow concepts he has applied to previous outings. \n\nRyan Racine first made a name for himself as the front man of Ann Arbor’s rockabilly outfit Lucky Haskins. Formed when he was only 15, the band burst onto the metro Detroit rockabilly scene and quickly garnered attention and a loyal fan base. Besides introducing the genre to a whole new generation in the area, they earned spots opening for legends like Carl Perkins, Johnny Cash, and Lee Rocker as well as a slot in the 1995 Detroit Music Awards.\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/176158106121056/"}, {"source": "Facebook", "date": "2016-10-04T20:00:00-04:00", "name": "The Bronzed Chorus, Fallow Land, Bobbi Palace, Parker Projection", "description": "I am incredibly excited for this one! Every band on the bill is amazing!  \n\nThe Bronze Chorus is coming all the way from North Carolina to promote their upcoming record! In the meantime, check out some of their fantastic older tunes: https://thebronzedchorus.bandcamp.com/ \n\nBobbi Palace is a great band from Ann Arbor. Check em out: https://bobbipalace.bandcamp.com/\n\nParker Projection is also sweet and local!: https://parkerprojection.bandcamp.com/releases\n\nFallow Land sucks. \n\nDoors at 8, $7 a ticket", "url": "https://www.facebook.com/events/675299135959740/"}, {"source": "Facebook", "date": "2016-10-06T09:00:00-04:00", "name": "Maker Space Operations Bootcamp", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "url": "https://www.facebook.com/events/1676692335988216/"}, {"source": "Facebook", "date": "2016-10-06T19:00:00-04:00", "name": "Children's Author Laurie Halse Anderson Discussion & Signing", "description": "Author: \n\nLaurie Halse Anderson is a New York Times bestselling author known for tackling tough subjects with humor and sensitivity. Her work has earned numerous ALA and state awards. Two of her books, Speak and Chains, were National Book Award finalists. Chains also received the 2009 Scott O’Dell Award for Historical Fiction, and Laurie was chosen for the 2009 Margaret A. Edwards Award. Mother of four and wife of one, Laurie lives in Northern New York, where she likes to watch the snow fall as she writes. You can follow her adventures on Twitter @HalseAnderson, or visit her at www.MadWomaninthForest.com\n\nBook: \n\nReturn to the American Revolution in this blistering conclusion to the trilogy that began with the bestselling National Book Award Finalist Chains and continued with Forge, which The New York Times called “a return not only to the colonial era but to historical accuracy.”\n\nAs the Revolutionary War rages on, Isabel and Curzon have narrowly escaped Valley Forge—but their relief is short-lived. Before long they are reported as runaways, and the awful Bellingham is determined to track them down. With purpose and faith, Isabel and Curzon march on, fiercely determined to find Isabel’s little sister Ruth, who is enslaved in a Southern state—where bounty hunters are thick as flies.\n\nHeroism and heartbreak pave their path, but Isabel and Curzon won’t stop until they reach Ruth, and then freedom, in this grand finale to the acclaimed Seeds of America trilogy from Laurie Halse Anderson.", "url": "https://www.facebook.com/events/1646167612272291/"}, {"source": "Facebook", "date": "2016-10-07T12:00:00-04:00", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/"}, {"source": "Facebook", "date": "2016-10-07T20:00:00-04:00", "name": "Lou and Peter Berryman at Green Wood Coffee House", "description": "Lou and Peter Berryman were both raised in Appleton, WI, and began playing music together in high school during the sixties. During the following nomadic decade, Lou studied classical voice and music theory in college while Peter continued an unfocused fascination with surrealist art, beatnik poetry, and jug band music. Early influences of American and British musical comedy and folk music fed a growing repertoire of original songs. A brief marriage in the early seventies resolved into a lifelong friendship, and by the late seventies and early eighties the two were honing their skills playing regular weekly concerts in Madison, becoming full-time musicians and songwriters in 1979. During those early years they wrote new songs every week, many about the history, cheese, beer and strange politics of their home state. By the mid '80s they were traveling all across the country, still writing and singing, but now with a broader perspective, finding that the quirks of their home state were not so much Midwestern as human. In twenty-five years of performing together, Lou and Peter have released twenty albums and four songbooks worth of hilarious, quirky, yet oddly profound songs, rich with word play and interesting images. Pete Seeger, Tom Paxton and Tom Lehrer count themselves among their fans. Their work has appeared in numerous compilations such as the popular \"Rise Up Singing\" songbook, in periodicals like \"SING OUT! Magazine\", and in many audio compilations. Berryman songs are being sung around the world by a legion of professional musicians including Peter, Paul and Mary, Garrison Keillor and Peggy Seeger. They have appeared numerous times on such national programs as NPR's \"A Prairie Home Companion\" and \"Weekend Edition.\"\nwww.louandpeter.com", "url": "https://www.facebook.com/events/964923176923370/"}, {"source": "Facebook", "date": "2016-10-07T20:00:00-04:00", "name": "Wolf Eyes, Windy & Carl, Aaron Dilloway: benefit concert", "description": "Maize & Blue Velvet: a benefit concert for the David Lynch Foundation\nticket proceeds to benefit the Chicago division of the David Lynch Foundation and the Ann Arbor Film Festival\n\nwith special guests\n\nWindy & Carl\n\nWolf Eyes\n\nAaron Dilloway\n\nAbout the Foundation\nThe David Lynch Foundation’s core mission is to heal traumatic stress and raise performance in at risk populations, including veterans suffering from PTSD and mothers and their families who have lost loved ones to violence. Specifically through the implementation of Transcendental Meditation (TM) programs in order to improve their health, cognitive capabilities and performance in life.\nwww.davidlynchfoundation.org\n\nAbout the Ann Arbor Film Festival\nThe Ann Arbor Film Festival is the longest standing experimental film festival in the country and serves as an Academy Award®-qualifying festival in the United States for the Short Films category.\nhttp://www.aafilmfest.org/\n\n8pm doors | 21 and up event\n$20 advance  tickets | $25 at the door\n\nTickets available at: https://www.eventbrite.com/e/wolf-eyes-windy-carl-aaron-dilloway-benefit-for-david-lynch-foundation-tickets-27309124326\n\nClub Above\n215 North Main Street\nDowntown Ann Arbor\nabove the Heidelberg Restaurant\nwww.club-above.com", "url": "https://www.facebook.com/events/325333901135326/"}, {"source": "Facebook", "date": "2016-10-08T10:00:00-04:00", "name": "4th Fall Holistic & Psychic Expo, Oct. 8-9, 2016", "description": "Join us for Intuitives Interactive's 4th Annual FALL HOLISTIC & PSYCHIC EXPO! The largest event of its kind in Michigan! Once again, TWO DAYS LONG! Saturday-Sunday, October 8-9, 2016\n\nLOCATION: \nThe beautiful EMU Student Center\nEastern Michigan University in Ypsilanti (next-door to Ann Arbor)\n900 Oakwood Street, 2nd floor Ballroom and Auditorium \n(ground floor as you enter from the parking lot)\nYpsilanti, MI 48197\n~ TONS of FREE PARKING ~ \n(on Oakwood Street and N. Huron River Drive)\n\nSPONSORED BY: Body Mind Spirit Guide & Body Mind Spirit Radio, Crazy Wisdom Bookstore & Tea Room, and the Enlightened Soul Center\n\n- SATURDAY, OCTOBER 8, 2016 - 10:00 am - 6:00 pm\n      Doors open 9:30 am for registration on Saturday\n      STAY for the SPECIAL PRESENTATION at 6 pm Saturday:\n      International Psychic Medium LORI LIPTEN!!\n- SUNDAY, OCTOBER 9, 2016 - 11:00 am - 5:00 pm\n     Doors open 10:30 am for registration on Sunday\n\n**FIRST 50 PAID ATTENDEES EACH DAY**\nGET A GIFT BAG valued at $20 & CHANCE TO WIN A FULL-LENGTH\nHEALING or READING!\nEnergy Work/Medical Intuitive Session with Lori Irvin, ZSource\nConnection, OR a Channeled Psychic Reading with Amy Garber, Metafizzy LLC, Show Co-Director; Co-Founder, Intuitives Interactive\n\nTO APPLY FOR A BOOTH as a reader, bodyworker, or vendor: http://www.holisticpsychicexpo.com/#!apply-1/dyc85\nAPPLICATION DEADLINE: September 9\nLate applications will be accepted until we are full, but may not be included in the promotions or handouts.\n\nADMISSION: \n$10 Daily Adult Ticket / $9 Online in advance by Oct. 6\n$15 Adult Weekend Pass / $13 Online in advance by Oct. 6\n$8 College students (daily pass)\n$5 Kids 12-17 yrs / Under 12 free \nPAID ADMISSION includes FREE presentations both days! \n\nADVANCE DISCOUNTED TICKETS ONLINE (thru Oct. 6):\nhttp://www.holisticpsychicexpo.com/#!purchase-tickets/p2a3m\n\n~ FEATURED PRESENTATION ~\nSaturday, October 8, 6:00 PM in the Auditorium:\nMEDIUMSHIP GALLERY READING with\n internationally acclaimed Psychic Medium LORI LIPTEN! \nREADINGS of DEPARTED LOVED ONES for the audience\nand sometimes CELEBRITIES COME THROUGH TOO!\n~ FREE with paid Expo Admission ~\n\nREADINGS: BOTH IN OUR PRIVATE READER ROOM (with Concierge Service and no interruptions) & AROUND THE VENDOR BALLROOM! \nThere will be Mediums, Psychics, Tarot & Angel Card Readers, and Intuitive & Channeled Readings...and more! \nSPECIALTY READINGS: Crystal Ball, Rare Hungarian Gypsy Cards, Runes, Numerology, Psychic Artist, Shamanic Stone Bowl...and more!\nhttp://www.holisticpsychicexpo.com/#!readers-1/xuu0n\n\nOTHER GREAT OFFERINGS INCLUDE: Aura Photography, Body & Energy Workers, Pyramids, Vendors of Holistic & Metaphysical Products, Crystals & Stones, Jewelry, FREE Yoga Demos, and More!\nhttp://www.holisticpsychicexpo.com/#!vendors/tcvqd\n\nSCHEDULE of PRESENTATIONS free with Expo admisison at:\nhttp://www.holisticpsychicexpo.com/#!presentations/zngx1\n\nVOLUNTEERS NEEDED! Volunteers get special perks in exchange for their dedicated service. SIGN UP NOW at:\nhttp://www.holisticpsychicexpo.com/#!volunteer/glc6s\n\nMAILING LIST: Join our mailing list by filling out the form at:\nhttp://holisticpsychicexpo.com/\n\nThanks and we look forward to seeing YOU and your friends at this transformative event!!!", "url": "https://www.facebook.com/events/749295545208940/"}, {"source": "Facebook", "date": "2016-10-08T10:30:00-04:00", "name": "The Spunky Sprite and the Endless Night", "description": "\"The Spunky Sprite and the Endless Night\" follows a plucky young sprite who is desperate to learn how Mother Nature brings the world to life each day. Caught up in her desire to do everything by herself, the sprite unwittingly lets a darkness into the land that threatens their very way of life. Only by finally accepting help is she able to return nature back to full health. It is then that she realizes working together makes us stronger.\n \n\"The Spunky Sprite and the Endless Night\" is an original play, developed specifically for babies through elementary school children. Told largely through music and movement, this show speaks the language of our youngest theatre-goers. Highly interactive, \"The Spunky Sprite and the Endless Night\" welcomes the audience into the world of the play, and encourages them to wiggle, make noise, clap, and sing.\n\nTickets: $10 for adults, $5 for children", "url": "https://www.facebook.com/events/1824235374473797/"}, {"source": "Facebook", "date": "2016-10-08T16:00:00-04:00", "name": "Robert Lopez and Samuel Ligon Discussion & Signing", "description": "Robert Lopez is the author of two novels, 'Part of the World' and 'Kamby Bolongo Mean River', and two story collections, 'Asunder' and 'Good People'. A new novel, All Back Full, will be published by Dzanc Books in February, 2017. He teaches at Pratt Institute, The New School, and Columbia University.\n\nSamuel Ligon is the author of two novels—'Among the Dead' and 'Dreaming and Safe in Heaven Dead'—and two collections of stories, 'Wonderland', illustrated by Stephen Knezovich, and 'Drift and Swerve'. He edits the journal Willow Springs, teaches at Eastern Washington University, and is Artistic Director of the Port Townsend Writers’ Conference.", "url": "https://www.facebook.com/events/1790543537848554/"}, {"source": "Facebook", "date": "2016-10-09T09:00:00-04:00", "name": "Maker Space Operations Bootcamp", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "url": "https://www.facebook.com/events/1676692335988216/"}, {"source": "Facebook", "date": "2016-10-09T10:00:00-04:00", "name": "4th Fall Holistic & Psychic Expo, Oct. 8-9, 2016", "description": "Join us for Intuitives Interactive's 4th Annual FALL HOLISTIC & PSYCHIC EXPO! The largest event of its kind in Michigan! Once again, TWO DAYS LONG! Saturday-Sunday, October 8-9, 2016\n\nLOCATION: \nThe beautiful EMU Student Center\nEastern Michigan University in Ypsilanti (next-door to Ann Arbor)\n900 Oakwood Street, 2nd floor Ballroom and Auditorium \n(ground floor as you enter from the parking lot)\nYpsilanti, MI 48197\n~ TONS of FREE PARKING ~ \n(on Oakwood Street and N. Huron River Drive)\n\nSPONSORED BY: Body Mind Spirit Guide & Body Mind Spirit Radio, Crazy Wisdom Bookstore & Tea Room, and the Enlightened Soul Center\n\n- SATURDAY, OCTOBER 8, 2016 - 10:00 am - 6:00 pm\n      Doors open 9:30 am for registration on Saturday\n      STAY for the SPECIAL PRESENTATION at 6 pm Saturday:\n      International Psychic Medium LORI LIPTEN!!\n- SUNDAY, OCTOBER 9, 2016 - 11:00 am - 5:00 pm\n     Doors open 10:30 am for registration on Sunday\n\n**FIRST 50 PAID ATTENDEES EACH DAY**\nGET A GIFT BAG valued at $20 & CHANCE TO WIN A FULL-LENGTH\nHEALING or READING!\nEnergy Work/Medical Intuitive Session with Lori Irvin, ZSource\nConnection, OR a Channeled Psychic Reading with Amy Garber, Metafizzy LLC, Show Co-Director; Co-Founder, Intuitives Interactive\n\nTO APPLY FOR A BOOTH as a reader, bodyworker, or vendor: http://www.holisticpsychicexpo.com/#!apply-1/dyc85\nAPPLICATION DEADLINE: September 9\nLate applications will be accepted until we are full, but may not be included in the promotions or handouts.\n\nADMISSION: \n$10 Daily Adult Ticket / $9 Online in advance by Oct. 6\n$15 Adult Weekend Pass / $13 Online in advance by Oct. 6\n$8 College students (daily pass)\n$5 Kids 12-17 yrs / Under 12 free \nPAID ADMISSION includes FREE presentations both days! \n\nADVANCE DISCOUNTED TICKETS ONLINE (thru Oct. 6):\nhttp://www.holisticpsychicexpo.com/#!purchase-tickets/p2a3m\n\n~ FEATURED PRESENTATION ~\nSaturday, October 8, 6:00 PM in the Auditorium:\nMEDIUMSHIP GALLERY READING with\n internationally acclaimed Psychic Medium LORI LIPTEN! \nREADINGS of DEPARTED LOVED ONES for the audience\nand sometimes CELEBRITIES COME THROUGH TOO!\n~ FREE with paid Expo Admission ~\n\nREADINGS: BOTH IN OUR PRIVATE READER ROOM (with Concierge Service and no interruptions) & AROUND THE VENDOR BALLROOM! \nThere will be Mediums, Psychics, Tarot & Angel Card Readers, and Intuitive & Channeled Readings...and more! \nSPECIALTY READINGS: Crystal Ball, Rare Hungarian Gypsy Cards, Runes, Numerology, Psychic Artist, Shamanic Stone Bowl...and more!\nhttp://www.holisticpsychicexpo.com/#!readers-1/xuu0n\n\nOTHER GREAT OFFERINGS INCLUDE: Aura Photography, Body & Energy Workers, Pyramids, Vendors of Holistic & Metaphysical Products, Crystals & Stones, Jewelry, FREE Yoga Demos, and More!\nhttp://www.holisticpsychicexpo.com/#!vendors/tcvqd\n\nSCHEDULE of PRESENTATIONS free with Expo admisison at:\nhttp://www.holisticpsychicexpo.com/#!presentations/zngx1\n\nVOLUNTEERS NEEDED! Volunteers get special perks in exchange for their dedicated service. SIGN UP NOW at:\nhttp://www.holisticpsychicexpo.com/#!volunteer/glc6s\n\nMAILING LIST: Join our mailing list by filling out the form at:\nhttp://holisticpsychicexpo.com/\n\nThanks and we look forward to seeing YOU and your friends at this transformative event!!!", "url": "https://www.facebook.com/events/749295545208940/"}, {"source": "Facebook", "date": "2016-10-09T15:00:00-04:00", "name": "Art & Essence of Canine Massage Disccusion w/Demos", "description": "http://bit.ly/2b6eyb1\n\nJonathan Rudinger, RN LMT has been instrumental in developing the field of canine massage for people at home and PetMassageTM at the professional level since the mid-1990’s. PetMassage workshops draw students from all over the worlds.  Jonathan has authored several books and DVD’s and taught over 300 professional level canine massage workshops. \n\nJonathan is often called upon for interviews in national media, invited to lecture about canine massage, and is recognized as a lobbyist supporting the rights for animal massage practitioners to practice legally. Recognized as an authority on massage for dogs, he has been featured in Whole Dog Journal, Dog Fancy Magazine, Natural Dog, Cosmopolitan, AARP, Glamour, Massage Magazine, Animal Wellness Magazine, Massage Today, Massage Therapy Journal, the New York Times and Wall Street Journal.  Jonathan has given live demonstrations at human massage, dog training, and veterinary conferences, at the Westminster Dog Show in New York and Crufts in the United Kingdom.\n\nJonathan's vision for the canine massage industry expands beyond this school. He is the founder and president of the International Association of Animal Massage and Bodywork. www.iaamb.org.", "url": "https://www.facebook.com/events/1820337424868650/"}, {"source": "Facebook", "date": "2016-10-09T21:00:00-04:00", "name": "SCARBONI's Birthday with Reggae Workers of the World/Dirty Notion ", "description": "Reggae Workers of the World ( Vic Ruggiero (the Slackers), Jesse Wagner (Aggrolites) and Nico Leonard (Moon Invaders and Caroloregians)\nDirty Notion \n$7 \nmore tba", "url": "https://www.facebook.com/events/531633113686471/"}, {"source": "Facebook", "date": "2016-10-11T19:00:00-04:00", "name": "Acoustic Tuesdays: Andrew Langdon Brown", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nAndrew Langdon Brown, Guitar player and songwriter from Appleseed Collective was born the son of a Motown session musician. After a brief trip to New Orleans as a teenager he became obsessed with fusing an eclectic blend of pre-World-War II american roots music, bluegrass and jazz with modern and genre bending, and poetic songwriting. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1236019013104688/"}, {"source": "Facebook", "date": "2016-10-11T20:00:00-04:00", "name": "The Record Company 10/11/16 at Blind Pig - Ann Arbor", "description": "Tue. October 11 | 8pm | 18+ | $15 Cover\n\nann arbor's 107one presents: The Record Company\n\nL.A.-based buzz band The Record Company has signed with Concord Music Group, which released its debut album Give It Back to You on February 12, 2016.", "url": "https://www.facebook.com/events/603317689846712/"}, {"source": "Facebook", "date": "2016-10-12T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-10-13T09:00:00-04:00", "name": "Maker Space Operations Bootcamp", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "url": "https://www.facebook.com/events/1676692335988216/"}, {"source": "Facebook", "date": "2016-10-13T12:00:00-04:00", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/"}, {"source": "Facebook", "date": "2016-10-14T20:00:00-04:00", "name": "Laurie McClain at Green Wood Coffee House", "description": "While Americana folk singer/songwriter Laurie McClain accompanies herself expressively on guitar, ukulele and harmonica, her honey voice soothes and her powerful lyrics heal bruised hearts. Reminiscent of 60s/70s folk, her music is predominantly folk/alternative country with a touch of the blues woven through. She brings passion and humor to the stage, performing original songs as well as unique covers of other excellent songwriters' gems. Her song, \"My Heaven\" is a favorite of listeners of folk radio programs around the world. In 2003 Laurie released The Trumpet Vine: A Tribute To Kate Wolf, a collection of her loving interpretations of the late songstress's works. Her latest CD is Ascend. www.lauriemcclain.com", "url": "https://www.facebook.com/events/197527007266742/"}, {"source": "Facebook", "date": "2016-10-14T21:00:00-04:00", "name": "Broccoli Samurai w/ Everyday Junior 10/14/16 at Blind Pig - Ann Arbor", "description": "Fri. October 14 | 9pm | 18+ | $10 Cover\n\nBroccoli Samurai with Everyday Junior\n\nSince forming in the Rustbelt of Cleveland, OH in 2010, Broccoli Samurai has been taking the club and festival scene by storm. The band's synth-laden, drum and bass influenced, progressive electronica has been thrilling audiences throughout the Midwest, Mid-Atlantic, and Northeast markets, winning them a massive and fiercely loyal fanbase. Eager fans pack dance floors and late-night festival sets with smiles across their faces, waiting to get lost in the band's ambient soundscapes, anticipating every bass drop that will force them to move with reckless abandon. Broccoli Samurai's line-up includes founding members Ryan \"Bruce\" Hodson on keys and synth, and Chris Walker on drums and percussion. Accomplished bassist Zachary Wolfe Nagi-Schehl anchors the rhythm section, while guitarist Michael Vincent weaves in and out, exploring new sonic territory.\n\nThe band has played countless festivals such as The Werk Out, BIG What?!, Domefest, Paradise Music and Art Festival, Rootwire, The Mad Tea Party Jam, The Ville, SummerDance, Disc Jam, Night Lights Fall Music Festival, The Gathering At Chaffee's, Utica Music and Art Festival, and Hyperion Fest. Broccoli Samurai has directly supported and toured with many known bands including Dopapod, Papadosio, Lotus, Conspirator, The Werks, Ozric Tentacles, BoomBOX, Big Gigantic, Rusted Root, O.A.R., Pigeons Playing Ping Pong, Aqueous, and BIG Something. Broccoli Samurai's extensive tour schedule has them playing high profile venues and major cities regularly, and the band will be increasing the number of performances and expanding their reach into the West Coast and Southern markets in 2015. This band is making big moves and the time to take notice is now.", "url": "https://www.facebook.com/events/524849711054672/"}, {"source": "Facebook", "date": "2016-10-15T11:00:00-04:00", "name": "Heritage Park Group Ride and Tour", "description": "The Potawatomi Mountain Biking Association is excited to welcome a new trail system into our chapter. Join us for a group ride and tour at Heritage Park on Saturday, October 15, 2016. \n\nHeritage Park is located at 322 N Adrian Hwy, in Adrian. \n\nMeet Saturday morning at the main trail head in the back of the park at 11:00 am for a meet and greet, info session, and tour/ride. \n\nLunch/Dinner will follow at Fiesta Ranchera – 1675 E. US Highway 223, Adrian.\n\nAfter dinner beers at Cotton Brewing (optional) – 625 Oak St, Adrian.\n\nStay the weekend and camp with us! Camping will be at W.J. Hayes State Park (24 min from Heritage Park) - 1220 Wamplers Lake Rd, Onsted.", "url": "https://www.facebook.com/events/1170840429655142/"}, {"source": "Facebook", "date": "2016-10-16T11:00:00-04:00", "name": "Arbor Brewing Company B2B Ride", "description": "We're teaming up with a few of our friends again this fall for a casual ride on the border to border trail (or as we like to call it - the brewery to brewery trail!)\n\nSunday, October 16\n11am - depart Arbor Brewing Company Brewpub in Ann Arbor, 114 E. Washington\n\nThe ride will take most people somewhere between 45 and 75 minutes\n\n12ish - grab a bite to eat at Arbor Brewing Company Microbrewery in Ypsilanti. 720 Norris.\n\nAfter brunch we'll ride back to the Brewpub and relax with a pint of our B2B Trail Ale.\n\nThere is no charge or purchase required to participate but we do ask that all participants pre-register and sign a waiver. \n\nProceeds from the B2B Trail Ale benefit the Friends of the Border to Border Trail: A group of individuals working to see that the Border To Border Trail is completed, maintained, enhanced and most of all, used. \n\nRide notes:\n\n-        The ride is moderate as the total distance is 20 miles with some hills\n\n-        Solo Riders must be 12 years of age and trailers are aok\n\n-        What to bring: water, spare tire tube, helmet\n\n-        What not to bring: headphones\n\n-        Remember it is the law to obey all traffic rules\n\n-        Don’t forget to check your bike before the ride: breaks, gears, tires", "url": "https://www.facebook.com/events/896942743751358/"}, {"source": "Facebook", "date": "2016-10-18T19:00:00-04:00", "name": "Acoustic Tuesdays: Rich Delcamp", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nDickie D. - Richard Delcamp, Singer-songwriter-guitar-banjo artist from Dragon Wagon, one of Michigan's premier bluegrass outfits,  playing a little bit of everything, Acoustic rock/Americana/traditional roots/bluegrass/folk/blues/original songwriting!\n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/278610785853131/"}, {"source": "Facebook", "date": "2016-10-19T21:00:00-04:00", "name": "The Main Squeeze 10/19/16 at Blind Pig - Ann Arbor", "description": "Wednesday, Oct. 19 | 9pm | 18+ | $10 Cover\n\nSeamlessly blending Funk, Soul, and Rock n’ Roll, THE MAIN SQUEEZE promises to keep your body moving with their infectious feel-good musical gumbo.\n\nThe energetic five-piece found its roots in Bloomington Indiana’s surprisingly vibrant live music scene, and they have been leaving audiences “Freshly Squozen” since 2010.\n\nTheir ability to fluidly blend and bend genres is unparalleled, and creates for an unforgettable live experience. Every performance is different from the last, showcasing each member’s virtuosic talent with soulful vocals, intricate jams, tight grooves and powerful solos.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/765", "url": "https://www.facebook.com/events/200433560358995/"}, {"source": "Facebook", "date": "2016-10-20T12:00:00-04:00", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/"}, {"source": "Facebook", "date": "2016-10-21T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-10-21T19:30:00-04:00", "name": "Nick Offerman Presented by Nicola's Books at the Michigan Theater", "description": "Public sale of Tickets available beginning 10:00 am on Friday, August 26th at Nicola's Books, Ticketmaster.com, and all Ticketmaster outlets. Charge by phone 800-745-3000.\n\nTicket/book packages are $39.50 and $49.50 with limited Gold Circle seating available.  All tickets purchased come with a copy of the book Good Clean Fun. Copies purchased with tickets can then be picked up from the Nicola's Books designated table the night of event.  Additional books will also be on sale on the night of the show at the Michigan Theater. \n\nNick Offerman is a man of many talents: actor on stage and screen, humorist, author of two New York Times bestsellers: Paddle Your Own Canoe and Gumption, and a woodworker. This fall, he is releasing the humorous how-to guide GOOD CLEAN FUN: Misadventures in Sawdust at Offerman Woodshop (scheduled for release on October 18), featuring how-to, mirth, fashion tips, recipes, odes to wood, and assorted tomfoolery. He will be stopping by the Michigan Theater as part of an exclusive 12-stop tour in honor of the book's release.\n\nLovers of all things crafty are invited to join him for a good ol' fashioned discussion & book signing, where you will get to know more about the craftsman side of Offerman as well as the entire Offerman Woodshop team. In the words of Offermanhimself, \"you will find that making things with your hands brings you solace (when you're not cussing out a visible glue seam) and better hand-eye coordination.\"\n\nPresented in partnership with Nicola's Books.", "url": "https://www.facebook.com/events/295094260857468/"}, {"source": "Facebook", "date": "2016-10-21T21:00:00-04:00", "name": "Joe Hertler & The Rainbow Seekers 10/21/16 at Blind Pig - Ann Arbor", "description": "Fri., October 21 | 9pm | $15 Cover | 18+\n\nJoe Hertler & The Rainbow Seekers will make a sprightly young groove doctor out of anyone. With spectacular energy pulsating from every member of the band, the Rainbow Seekers could illuminate the very chambers of Heaven. Lead singer Joe Hertler splashes through lyrical puddles of golden rain, leaving his audience wearing flowery crowns and bubbling smiles. A ride on the Rainbow will take you across the mountains of Motown, through the fjords of folk, over the archipelagos of Americana, and-at last-into a funky firth, where only the fiercest of friendships can be found.\n\nThe Rainbow Seekers began their quest beneath the fingertips of songwriter Joe Hertler. Bassist and producer Kevin Pritchard, recently thawed from an extremely rare prehistoric groove glacier, discovered the forlorn Hertler in a twinkling, mysteriously fortuitous place called The Quilted Attic. Alongside legendary glacier-hunter Rick Hale-who would later spend decades forging a drum set from pure, white-hot, ancient stardust to mark the occasion-Pritchard changed the world: He wrangled Hertler into musical collaboration. And the lonely little songsmith, it turned out, was not quite as alone as he seemed: With him came the irresistibly sexy blues guitar prodigy who is now known to the world as Ryan Hoger.", "url": "https://www.facebook.com/events/746969122072900/"}, {"source": "Facebook", "date": "2016-10-25T21:00:00-04:00", "name": "Foy Vance w/ Trevor Sensor 10/25/16 at Blind Pig - Ann Arbor", "description": "Tue. October 25 | 9pm | 18+ | $15 adv./ $20 day of\n\nPresented by ann arbor's 107one\n\nFoy Vance knows how to write a song. It’s a naturally-born but dedicatedly-finessed skill that has led him to collaborate with artists as diverse as Plan B, Sheryl Crow and Rudimental, synced his music on multiple TV shows ranging from Grey’s Anatomy to the finale of Sons Of Anarchy, and caught the ears of some of the biggest players (in every sense) in music, from Elton John to Ed Sheeran. \n\nSo it is that in the run-up to the release of his new album, Vance travelled to Nashville. It’s a long way from home for the Irishman, both from the place of his birth (Bangor, Northern Ireland) and the place of his residence (Aberfeldy, Scotland). But for an inveterate songwriter, Music City is an irresistible draw, a place where Vance can work with the best of the best. Not, Vance clarifies, for himself or his own material. For one thing, he’s already completed his new album, and with songs of the calibre and single-minded brilliance of the dozen that comprise The Wild Swan, there’s no need for any outside assistance. \n\nWSG: Trevor Sensor\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/681", "url": "https://www.facebook.com/events/1158475607517012/"}, {"source": "Facebook", "date": "2016-10-26T17:00:00-04:00", "name": "Edgefest 20: 20 Years At The Edge!", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia, and Blue Dog.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation for Art, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest page of our website: \nwww.kerrytownconcerthouse.com/edgefest", "url": "https://www.facebook.com/events/1606056323056977/"}, {"source": "Facebook", "date": "2016-10-26T21:00:00-04:00", "name": "Elephante at Necto: October 26th", "description": "react presents\n\n:: Elephante ::\n\n& Ben Phipps\n\nDoors at 9:00pm\n18+ Welcome\n\nNecto\n516 E. Liberty\nAnn Arbor, MI\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet", "url": "https://www.facebook.com/events/168320503594873/"}, {"source": "Facebook", "date": "2016-10-27T17:00:00-04:00", "name": "Edgefest 20: 20 Years At The Edge!", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia, and Blue Dog.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation for Art, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest page of our website: \nwww.kerrytownconcerthouse.com/edgefest", "url": "https://www.facebook.com/events/1606056323056977/"}, {"source": "Facebook", "date": "2016-10-27T19:00:00-04:00", "name": "BarkBox Cartoonist Dave Coverly & HSHV Fundraiser", "description": "Please bring dry dog or cat food to this event to donate to the HSHV’s Bountiful Bowls Program to help families in financial difficulties be able to keep their pets instead of having to surrender them to the shelter.  If you cannot come to the event you can still donate food at the store through the month of October.  \n\nCartoonist Dave Coverly - \n\nThe BarkBox doodles are everywhere- on the box, in our newsletter, and on our Facebook page. And while we affectionately call these pup drawings “doodles,” the artist behind them is a full-blown cartoonist.\n\nThey’re by Dave Coverly, one of the top cartoonists in the country. (Seriously.) His “Speed Bump” comic strip is syndicated in more than 400 newspapers and websites, including the Washington Post, Torontopr Globe & Mail, Detroit Free Press, Chicago Tribune, and the Indianapolis Star. In 2009 he was given the prestigious Reuben Award for Outstanding Cartoonist of the Year—the highest honor awarded by the National Cartoonists Society.\n\nDave lives with his wife and two daughters in Ann Arbor, Michigan, and he took a few moments to chat with us about dogs, cartoons, dogs, BarkBox, and more dogs. (courtesy of BarkPost)\n\nClick on the link to read BarkPost’s interview of Dave Coverly http://bit.ly/2bzZ6Es\n\nHumane Society of Huron Valley Bountiful Bowls Program -\nFor decades, \"Meals on Wheels\" programs have provided millions of elderly, disabled and at-risk people with meals, so that they can remain healthier in their homes.\n\nAnd for nearly a decade, HSHV's \"Bountiful Bowls\" program has provided families who've fallen on hard times with pet food, so that they can keep their pets in their homes.\n\nLast year, HSHV distributed nearly 40,000 pounds of pet food through the Bountiful Bowls safety net program. This year, we've already distributed over 16,000 pounds-- and that's just through May! The donated food is given to pre-approved families both through a weekly program at the shelter and with community partnerships, like YMOW.", "url": "https://www.facebook.com/events/1781501162113597/"}, {"source": "Facebook", "date": "2016-10-27T20:00:00-04:00", "name": "Brett Dennen w/ Lily and Madeleine 10/27/16 at Blind Pig - Ann Arbor", "description": "Thu. October 27 | 8pm | All Ages | $25 Cover\n\nann arbor's 107one Presents:\nBrett Dennen wsg: Lily & Madeleine\n\nAs common and simple as it is, \"por favor\" is such an evocative expression. From Spanish, it translates to \"please,\" a word that suggests a need for something, a desire to make a change. \"Por favor' was something I kept saying every day in the studio, and I got the other musicians saying it,\" says Brett Dennen. \"We were goofing around, and Dave Cobb, my producer, said it should be the title of my new record. I laughed it off at first, but then I really thought about it.\"\n\n\"When you say please, you're asking something to come into your life,\" Dennen adds. \"It might mean that you're weak and need something to make you strong. But you're admitting to some sort of weakness or some form of humility.\"\n\nThat notion is at the heart of Por Favor, Dennen's intimate and revealing new album that Elektra Records will release on May 20. Produced by Cobb, fresh from his Grammywinning work with Chris Stapleton and Jason Isbell, the record strips Dennen to his core as a songwriter with nothing to hide.\n\n\"All these songs came from a time of sadness for lots of different reasons. They came at a point when I wasn't feeling confident about myself,\" he says. \"When I'm not feeling confident, I'm not a nice person to be around. I don't take care of my health, my relationships, my stuff, and it all cycles into a miserable place. And I have a really hard time admitting that I'm in that place.\"\n\nA followup to 2013's Smoke and Mirrors, his sixth studio album dives deep into loneliness, loss, and love and all its side effects. It's the sound of an artist working through his insecurities in song, and thereby letting go of them. But it's by no means a sad affair, nor is it the \"rainyday record\" Dennen initially thought he was making.\n\nOften framed by uplifting choruses and bright acoustic arrangements, these songs brim with optimism, the palpable sense that the tide is turning. \"And I want to love you for the way you are/ Not the way I am/ So let's go now/ Back to the bonfire where we began,\" he sings over a chugging groove on \"Bonfire.\"\n\nOn \"Where We Left Off,\" the album's emotional powder keg, Dennen lays himself bare over the slack strum of guitar and one of his most unvarnished vocals ever recorded. The opening lines go straight for the jugular: \"Everyone knows I'm a happy man/ But I haven't been right.\"\n\n\"Vulnerable was another word that kept coming up when I was making this record,\" Dennen admits. \"Is there something I'm scared to say? Can I dig a little deeper, reveal a little bit more? How far can I go That was my direction, and once I got that in place, I started shooting down things that weren't in that zone.\"\n\n\"I kept telling myself that all I have to do is be authentic and make the songs about the lyrics and how they interact with my guitar,\" he continues. \"I don't have to worry about whether they'll be on the radio or if they're different from my previous stuff.\"\n\nHoled up at Cobb's Nashville studio, with musicians the producer assembled, Dennen and Cobb worked fast and kept the songs rough around the edges. Dennen appreciated Cobb's insistence on capturing them in just a few takes. \"We recorded it the way people made records in the '60s - really fast, all on analog gear, very few rehearsals,\" he says. \"We didn't do anything more than five times. We didn't secondguess ourselves - we just went with it. It's not sloppy, but it's in that right place between loose and tight and feelgood but not labored.\"\n\nCobb adds, \"I worked with Brett because of his beautiful balance of wit and melody. He's very timeless in his writing and you really can hear his personality in every note he sings. The record was made totally live and we recorded all the vocals live with the band. It really was produced as stopped down as possible - we tried to make every note matter.\"\n\nMore than a decade after his selftitled debut catapulted him to stardom, Dennen was once again attracted to how he made his earliest recordings. \"My whole approach was that I wanted to write and sing the songs from the same place that I wrote the first record, which was a place of trying to discover who I am,\" he says.\n\nThat marked a detour from his most recent releases. With those he felt like he was exercising his craftsmanship - \"being a songwriter for the sake of being a songwriter,\" as he puts it. \"I really wanted this new album to come across as a whole piece,\" Dennen says. \"I consider it to be a batch of songs that all live together and complement each other.\"\n\nWhich brings us back to the album title. Please.\n\n\"What was I asking for with this album\" Dennen says. \"I wanted to be a good person and feel good about myself again, but in a way that I knew it was OK to be sad. That's part of life, the ups and downs. But with these songs, I want to make people feel good about themselves and about life through the good and bad.\"\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/718", "url": "https://www.facebook.com/events/1735261526750729/"}, {"source": "Facebook", "date": "2016-10-28T12:00:00-04:00", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/"}, {"source": "Facebook", "date": "2016-10-28T20:00:00-04:00", "name": "Chuck Brodsky at Green Wood Coffee House", "description": "There is no better storyteller than Chuck Brodsky.  Ranging from poignant to hilarious, his songs are about the little things in the lives of everyday people.  Chuck's soulful and compassionate voice brings his characters to life, and is the perfect instrument for infusing his lyrics with heartfelt humanity or biting wit. His spoken introductions to his songs can be as spellbinding as his colorful lyrics, which he brings to life with a well-travelled voice and a delivery that's natural and conversational. His groove-oriented strumming and fingerpicking draw on influences from the mountains of western North Carolina where he now lives, and from lots of different good old traditional folk stuff of all kinds. Chuck is widely known for his many wonderful songs about the heroes -- and zeroes -- of baseball. His latest CD is The Tell Tale Heart.\nwww.chuckbrodsky.com", "url": "https://www.facebook.com/events/147078752335941/"}, {"source": "Facebook", "date": "2016-10-29T17:00:00-04:00", "name": "Edgefest 20: 20 Years At The Edge!", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia, and Blue Dog.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation for Art, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest page of our website: \nwww.kerrytownconcerthouse.com/edgefest", "url": "https://www.facebook.com/events/1606056323056977/"}, {"source": "Facebook", "date": "2016-10-31T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-10-31T21:00:00-04:00", "name": "MC chris w/ MC Lars & Megaran 10/31/16 at Blind Pig - Ann Arbor", "description": "Mon. October 31 | 9pm | 18+ | $16 adv./ $18 day of\n\nmc chris wsg: MC Lars & Megaran\n\nmc chris (always spelled in all lower case letters) is rapper from the Libertyville, Illinois, a suburb of Chicago. He was one of the first rappers to focus solely on nerd life, rapping about Star Wars, Harry Potter, ninjas and unrequited love, instead of the usual hip hop fare. He’s just as likely to make an appearance at Comicon as he is at SXSW.\n\nmc got his start as an animator on many of the shows you see on Adult Swim. He was writer, actor, songwriter and animator for Sealab 2021, The Brak Show, Space Ghost Coast to Coast and Aqua Teen Hunger Force. He has voiced characters on several Adult Swim pilots such as Welcome to Eltingville, Cheyenne Cinnamon, Your Pretty Face is Going to Hell and Tight Bros. He was also a producer of on air content for over a year before leaving Williams Street to pursue a career in music.\n\nmc has since crossed America countless times touring as a headlining act, as well as opening for bands like Pinback and Reggie and the Full Effect. He's collaborated with Talib Kweli, Andrew WK, Cee-Lo and Childish Gambino. His music has been featured in Kevin Smith’s Zak and Miri Make a Porno, Jay and Silent Bob’s Super Groovy Cartoon Movie and he has composed several themes for Smith’s Smodcast podcast network. mc's song \"hoodie ninja\" was featured in both a Honda commercial and America's Funniest Home Videos. Other songs have been featured in Comedy Central’s Broad City and Fox's So You Think You Can Dance? mc most recently started in the pilot Bunny and Frog for Disney and a national commercial for Fiat.\n\nmc raises money to fight Cystic Fibrosis. Inspired by his nephew who has CF, mc chris and his fans have raised over $150,000 for the Cystic Fibrosis Foundation through eBay sales and donations collected at live shows.\n\nmc kickstarted “the mc chris cartoon” an animated extension of the skit universe featured on his records. Thanks to donations from his fans, he raised $60,000 and produced a six minute pilot presentation with the animation company Titmouse Inc. mc is currently shopping the project. \n\nmc chris lives in Los Angeles with his wife and son.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/719", "url": "https://www.facebook.com/events/315153365502594/"}, {"source": "Facebook", "date": "2016-11-01T17:00:00-04:00", "name": "Edgefest 20: 20 Years At The Edge!", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia, and Blue Dog.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation for Art, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest page of our website: \nwww.kerrytownconcerthouse.com/edgefest", "url": "https://www.facebook.com/events/1606056323056977/"}, {"source": "Facebook", "date": "2016-11-04T09:00:00-04:00", "name": "Randy & Mr. Lahey 11/4/16 at Blind Pig - Ann Arbor", "description": "Fri. November 4 | 8pm | $25 Cover | 18+\n\nThe Randy & Mr Lahey LIVE show is a silly, sexist, drunken hour and a half of songs and skits, audience participation, profanity, Shakespeare, and general hilarity. Over the past eight years it has developed into the fastest moving two man show in the known universe.\n\nFrom Newfoundland to Vancouver Island several hundred thousand people have thrilled to Randy and Lahey's shennanigins. It's a constantly moving showcase of two television icons who pull no punches when battering the audience with \"Batman and Robin\" or \"The Shit Rap.\" The innocent honesty of an out- of-control drunken ex-cop Trailer Park Supervisor and his side-kick Randybobandy the cheeseburger eating ex male prostitute, weekend Trailer Park Supervisor is pants pissing humour at its warmest.\n\nThe show itself is roughly based on the T.V. series and movies, but being live, necessitates a different format and different is the operative word here. There is nothing like it anywhere. Shit talk and poetry; sodomy and sweet talk all thrown together with music and mayhem. What more could a room full of fun seekers want.", "url": "https://www.facebook.com/events/261603764205728/"}, {"source": "Facebook", "date": "2016-11-04T20:00:00-04:00", "name": "Sally Barris at Green Wood Coffee House", "description": "Nashville-based artist and Wrensong Publishing writer Sally Barris has managed to be successful in the mainstream world of country music without giving up her folk and Celtic roots. Her unique style, influenced by artists such as Tony Rice, Dougie Maclean and Richard Thompson, is what makes her stand out in a city known for “cookie cutter” talent. Her songwriting highlights include, “Let The Wind Chase You” (Trisha Yearwood), “Reluctant Daughter” (Martina McBride), “Some Things I Know” (Lee Ann Womack), “I’m On My Way” (Kellie Pickler), “The Innocent Years” (Kathy Mattea) and “Honeysuckle Sweet” (Jessi Alexander), which was featured in the Miramax film, “An Unfinished Life.”  The Minnesota native is currently on tour with her latest CD, \"The Road In Me.\"\n“Sally Barris has a voice like sparkling crystal. You could have knocked me over with a feather the first time I heard her. Her writing is from a deep, yet innocent, place and her point of view is just a bit off center. I am excited for her; she is standing at the beginning of her journey in this town, with all of it ahead of her. It reminds me of the first time I heard Beth Nielson-Chapman or Nanci Griffith. It’s going to be fun to watch.” – Kathy Mattea    www.sallybarris.com", "url": "https://www.facebook.com/events/241375029564095/"}, {"source": "Facebook", "date": "2016-11-06T11:00:00-05:00", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/"}, {"source": "Facebook", "date": "2016-11-06T19:30:00-05:00", "name": "The Gonzalo Bergara Quartet", "description": "Django-style jazz, mixed with sounds of Paris and Argentina", "url": "https://www.facebook.com/events/1816557595246685/"}, {"source": "Facebook", "date": "2016-11-07T20:00:00-05:00", "name": "Patty Griffin w/Joan Shelley", "description": "\"Earthy, enthralling\"—Milwaukee Journal Sentinel", "url": "https://www.facebook.com/events/335576650115795/"}, {"source": "Facebook", "date": "2016-11-09T20:00:00-05:00", "name": "Mandolin Orange", "description": "\"Wistful and contemplative without being somber\"—WNYC radio, New York", "url": "https://www.facebook.com/events/582786561882737/"}, {"source": "Facebook", "date": "2016-11-09T21:00:00-05:00", "name": "Lemaitre at Necto", "description": "TICKETS ON SALE NOW: http://bit.ly/1XZq5zj\n\nNecto & React Detroit presents...\n\nLemaitre\nwww.lemaitremusic.com\n\nopening sets TBA\n\nwww.necto.com\nwww.reactpresents.com\n\nDoors at 9pm | 18 & over welcome with proper ID \n\nNecto located at 516 E Liberty Street, Ann Arbor, MI 48104\nFor VIP services contact info@necto.com", "url": "https://www.facebook.com/events/1254743334545390/"}, {"source": "Facebook", "date": "2016-11-10T20:00:00-05:00", "name": "Willie Nile", "description": "\"Lyrical insights ... indelible hooks\"—Buffalo News", "url": "https://www.facebook.com/events/147425395682439/"}, {"source": "Facebook", "date": "2016-11-11T08:00:00-05:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-11-11T20:00:00-05:00", "name": "Bob Schneider", "description": "An Ypsilanti-born Austin phenomenon", "url": "https://www.facebook.com/events/185456868532163/"}, {"source": "Facebook", "date": "2016-11-12T20:00:00-05:00", "name": "Joe Crookston", "description": "A believer in stories", "url": "https://www.facebook.com/events/262655380758171/"}, {"source": "Facebook", "date": "2016-11-12T20:00:00-05:00", "name": "Alex G 11/12/16 at Blind Pig - Ann Arbor", "description": "Sat. November 12 | 8pm | 18+ | $12 adv./ $15 day of\n\nSANDY Alex G with: LVL UP & Brandon Can't Dance\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/766", "url": "https://www.facebook.com/events/990524291045821/"}, {"source": "Facebook", "date": "2016-11-12T20:00:00-05:00", "name": "Mary Gauthier at Green Wood Coffee House", "description": "Her songs? They’re about as idiosyncratic as anything in the wide world of “popular music.” They’re painfully personal, yet they somehow infiltrate the souls of her listeners, no matter how different the paths they’ve followed through their lives.\n\nSongs aren’t so much written as harvested by Gauthier. Though she lives not far from the hit-making mills of Music Row, she admits to knowing nothing about how to write on command.  She says, “I have to be called to write. The call comes from somewhere I don’t understand, but I know it when I hear it.”\n\nThat call first came to her a long time ago. Her life to that point had led her to extremes, plenty of negatives and a few brilliant bright spots. An adopted child who became a teenage runaway, she found her first shelter among addicts and drag queens. Eventually she achieved renown as a chef even while balancing her restaurant responsibilities with the demands of addiction to heroin.\n\nTwo more successful restaurants, an escalating addiction, and a subsequent arrest led her into sobriety. It was rehearsal for what was to follow, when she wrote her first song in her mid-thirties. From that point, Gauthier channeled a long line of eloquent works, including the achingly beautiful, \"Mercy Now.\" She says of her new CD, Trouble and Love, “I started the process in a lot of grief. I’d lost a lot. So the first batch of songs was just too sad. It was like walking too close to the fire. I had to back off from it. The truth is that when you’re in the amount of grief I was in, it’s an altered state. Life is not that. You go through that. We human beings have this built-in healing mechanism that’s always pushing us toward life. I didn’t want to write just darkness, because that’s not the truth. I had to write through the darkness to get to the truth. Writing helped me back onto my feet again. This record is about getting to a new normal. It’s a transformation record.” We are so pleased to welcome Mary Gauthier into our Series. www.marygauthier.com", "url": "https://www.facebook.com/events/676020209212879/"}, {"source": "Facebook", "date": "2016-11-13T19:30:00-05:00", "name": "Richard Shindell", "description": "\"A master builder of songs\"—Boston Globe", "url": "https://www.facebook.com/events/140061109732194/"}, {"source": "Facebook", "date": "2016-11-14T20:00:00-05:00", "name": "Seth Walker", "description": "\"He's the real deal\"—Marcia Ball", "url": "https://www.facebook.com/events/494085454134532/"}, {"source": "Facebook", "date": "2016-11-16T20:00:00-05:00", "name": "Dave Simonett of Trampled By Turtles and Carl Broemel of My Morning Jacket", "description": "Tickets on sale Friday, 8/19, at 10 a.m. at TheArk.org!", "url": "https://www.facebook.com/events/1790043767908763/"}, {"source": "Facebook", "date": "2016-11-17T20:00:00-05:00", "name": "Jay Stielstra", "description": "Michigan's folk songwriting treasure", "url": "https://www.facebook.com/events/1796899840545340/"}, {"source": "Facebook", "date": "2016-11-17T21:00:00-05:00", "name": "El Ten Eleven w/ Bayonne 11/17/16 at Blind Pig - Ann Arbor", "description": "Thursday, November 17 | 9pm | 18+ | $14 adv./ $16 day of\n\nEl Ten Eleven wsg: Bayonne\n\n\"It’s surprising this record even got made,” bass player and songwriter Kristian Dunn reflects. “[Drummer] Tim’s dad died just before the recording was to begin. Obviously he needed to go back to Pittsburgh to be with his family. He returned to California relatively quickly, ready to work, and then I was struck with serious food poisoning.”\n\nAs soon as one band member in the duo was ready to work, it seemed the other had something come up. Even their engineer, Chris Cheney, had to leave in the middle of recording to go DJ for the Arizona Diamondbacks baseball team. Deadlines were rapidly approaching and the record wasn’t finished. “It was stressful, but it seemed to all work out,” Tim Fogarty adds.\n\nAppropriately, the record is all about family and the connection between parent and child. Opening with “Point Breeze” (an area in Pittsburgh in which Tim’s dad used to hang out when young) and moving right into “Scott Township” (an area of Pittsburgh where Fogarty did the same), the record is alive with sounds both futuristic and anachronistic.\n\nThe album is full of parental nods. “’Fast Forward’ is a band name my dad would always suggest when I was starting new bands in high school. I thought it was stupid and would blow him off! Now I actually think it’s cool. It really represents something that is old, but also forward looking and inventive.” Dunn explains. “Peter and Jack” is a thank you to father and son team Peter Hook (of New Order and Joy Division) and Jack Bates who, after playing some shows with El Ten Eleven, suggested to Dunn that he employ one of the six string basses they were using.\n\n“Not to exaggerate, but the effect those two had on El Ten Eleven is sort of incalculable. I wouldn’t have even considered the Bass VI if it weren’t for them. And the direction of the band definitely changed because of it,” Dunn says.\n\nThe record was written at their homes and practice studio in Atwater Village, and recorded with Cheney at Costa Mesa Recording Studio in Costa Mesa, CA. Dunn and Fogarty are the only musicians that appear on Fast Forward; everything you hear was done by the two of them using two basses, electronic drums, acoustic drums, and myriad looping pedals and effects.\n\nWhile most artists use looping technology improvisationally, Dunn and Fogarty see the loopers themselves as another instrument. Over a decade plus together they’ve attained hard-won virtuosity with the devices, and can now concentrate on songwriting itself rather than logistics. “Nothing we do is improvised” explains Dunn. “When we first started playing shows we’d sometimes run into troubles with the loops and have to stop and retry songs!”\n\n“It’s almost like our rig itself is an instrument we’ve had to master,” he continues. “I’ll loop Tim’s electronic drums with one of my pedals while looping my own bassline, then switch to my six string bass midsong while he moves to playing acoustic drums, layering up the sonics and shaping the song as it all grows.” By refusing to use anything pre-recorded live they’ve pushed themselves into new territory, now able to deftly recreate their complex compositions nightly.", "url": "https://www.facebook.com/events/619658961515550/"}, {"source": "Facebook", "date": "2016-11-18T20:00:00-05:00", "name": "Jonatha Brooke", "description": "New music from a folk icon", "url": "https://www.facebook.com/events/962264457225114/"}, {"source": "Facebook", "date": "2016-11-18T20:00:00-05:00", "name": "Don Henry at Green Wood Coffee House", "description": "Grammy Award winner Don Henry's songs have been recorded by legends such as Ray Charles, Patti Page and Conway Twitty; by country crooners including Gene Watson, John Conlee and B.J. Thomas; and by today's hitmakers such as Blake Shelton, Miranda Lambert, and Kathy Mattea. But his songs shine most when performed by the very artist who wrote them. Don Henry is a 37 year veteran in the music business. Wit and wisdom grace Don's songs, from campfire favorites, to the poignant tribute to Martin Luther King, \"Beautiful Fool;\" or, of course, the Grammy award-winning country classic, \"Where've You Been.\" In addition to the Grammy, Kathy Mattea's version of \"Where've You Been\" took Song of the Year honors from the Academy of Country Music, The Country Music Association and Nashville Songwriter's Association International - the first song ever to be awarded all four honors in the same year.  Expect an exceptional evening of music and humor. www.donhenry.com", "url": "https://www.facebook.com/events/1513216465641630/"}, {"source": "Facebook", "date": "2016-11-18T21:00:00-05:00", "name": "Louis The Child 11/18/16 at Blind Pig - Ann Arbor", "description": "Fri. November 18 | 9pm | 18+ | $15 Cover + VIP Available\n\nLouis The Child wsg: Quinn XCII\n\nHailing from Chicago, Louis The Child is an electronic music duo with the simple goal of creating music that makes people happy. Their single, “It's Strange”, has been played on BBC, Triple J, and KCRW, and racked up over 5 million plays on both Spotify and SoundCloud.  In 2016, SnapChat listed Louis The Child as one of 3 EDM Artists to Watch, and Mix Mag ranked LTC as the #1 Artist Taking Dance Music to the Next Level.  2015 involved numerous tours supporting Madeon, Kaskade and The Chainsmokers. Currently embarking on their first headlining tour, LTC is on the rise.", "url": "https://www.facebook.com/events/1752094781672292/"}, {"source": "Facebook", "date": "2016-11-20T19:30:00-05:00", "name": "Steve Poltz", "description": "\"A master of darkly comic songwriting\"—San Diego CityBeat", "url": "https://www.facebook.com/events/1137237919653257/"}, {"source": "Facebook", "date": "2016-11-23T08:00:00-05:00", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"source": "Facebook", "date": "2016-11-26T20:00:00-05:00", "name": "Mr. B", "description": "Mr. B's Thanksgiving weekend shows are legendary!", "url": "https://www.facebook.com/events/823779797757077/"}, {"source": "Facebook", "date": "2016-11-27T13:00:00-05:00", "name": "Gemini", "description": "Music for the family. \"Beautiful songs and singing!\"—WQXR, New York", "url": "https://www.facebook.com/events/175058409589129/"}, {"source": "Facebook", "date": "2016-12-01T20:00:00-05:00", "name": "Jen Cass & The Lucky Nows", "description": "New music and a new band from a legendary Detroit songwriter", "url": "https://www.facebook.com/events/851911334943175/"}, {"source": "Facebook", "date": "2016-12-02T20:00:00-05:00", "name": "Enter the Haggis", "description": "The haggis returns!", "url": "https://www.facebook.com/events/271040036590005/"}, {"source": "Facebook", "date": "2016-12-02T20:00:00-05:00", "name": "Don White & Christine Lavin at Green Wood Coffee House", "description": "Back by popular demand! Don White combines heartfelt, serious lyrics with side-splitting laughs to provide an evening not to be forgotten. This Massachusetts comedian/singer/songwriter/author is best-known in these parts for his radio gems, \"Rascal,\" \"Psycho Mom and Dad\" and \"I Know What Love Is.\"  A Don White show promises to delight new audiences and devoted \"repeat offender\" fans, alike.\ndonwhite.net/don-christine/", "url": "https://www.facebook.com/events/1694208660853014/"}, {"source": "Facebook", "date": "2016-12-02T21:00:00-05:00", "name": "Sweater Beats12/2/16 at Blind Pig - Ann Arbor", "description": "Saturday, Dec. 2 | 9pm | 18+ | $12 adv./ $15 day of\n\nThe Philippines and suburban Maryland aren’t exactly R&B or dance music hot beds, but they didn’t need to be for Antonio Cuna aka Sweater Beats to ingest both genres and spit out an exciting hybrid, melding the sensuality of contemporary R&B with the immediacy of dance music. Born in the Philippines, Cuna moved to Maryland, adapting to his new environment by engaging with music and skate culture. But it wasn’t long before R&B entered the picture, first as an obsession and later, while Cuna was at university in New York, as a creative outlet. Growing up in the 2000s, it’s no surprise that Cuna’s heroes include R&B producer mavens like Pharrell and Timbaland, as well as French dance music behemoths Daft Punk, but it’s how he’s filtered those influences into the ingenious sonic aesthetic, a sound equally fitting both the festival stage and bedroom play, that makes Sweater Beats such an unavoidably intriguing project.\n\nSince bubbling up in the dance world with the premiere of his debut single “Mlln Dllr” on Annie Mac’s Radio1 show, Sweater Beats has constantly pushed the limits of his own sound. With support from the likes of Diplo, Omarion, and JoJo, plus tours with artists like Chance the Rapper, Flume and Chet Faker, the producer has clearly caught the eye some of a wide variety of tastemakers. Featured by the likes of Billboard, Entertainment Weekly, Boiler Room and The FADER, Cuna has also received admiration from music journalists the world over, drawing almost universal praise from disparate outlets. With countless collaborations, mixes, and remixes, on top of a constant touring schedule, Cuna has garnered a reputation for his incessant work rate and willingness to push his sound into new and uncharted territory. And that’s part of the reason why Cuna connects with his fan base on such a visceral level, eschewing traditional industry methods for his own unique, intimate manner of going about business.\n\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/768", "url": "https://www.facebook.com/events/1759418600997980/"}, {"source": "Facebook", "date": "2016-12-03T20:00:00-05:00", "name": "Jeffrey Foucault", "description": "New music!", "url": "https://www.facebook.com/events/1063936000310431/"}, {"source": "Facebook", "date": "2016-12-04T19:30:00-05:00", "name": "Carrie Newcomer", "description": "\"Music that challenges and heals\"—The Third Way", "url": "https://www.facebook.com/events/1702249903360615/"}, {"source": "Facebook", "date": "2016-12-09T20:00:00-05:00", "name": "Chuck Mitchell at Green Wood Coffee House", "description": "Chuck Mitchell started singing in Detroit folk clubs in the 1960s. In Toronto, on his first out of town gig, he met Canadian songwriter Joni Anderson. They married, and as a duo Chuck and Joni Mitchell played the coffeehouse circuit, and gin rummy, until they divorced in 1968. Mitchell's credits include A Prairie Home Companion and repertory theatre in Texas and in England. He has played Harold Hill in The Music Man and Woody Guthrie in Woody Guthrie's American Song. Most recently, he wrote and produced Mr. Foster & Mr. Twain, in which Stephen Foster joins Mark Twain for an evening of story and song. A Chuck Mitchell's show combines his seasoned skills as an actor, singer and guitarist with a selection of delightful material. He sings cabaret songs by Brecht and Weil -- \"Mack the Knife\" and \"The Bilbao Song\" -- and whimsical songs by Flanders & Swann -- \"The Gnu\" and \"Have Some Madeira, M'dear\". He roves the room singing \"Freeborn Man\" by Ewan McColl, or \"Necessity\" from Finian's Rainbow. He weaves poetry by Robert Frost and T.S. Eliot into his shows. He has been called a renaissance man, and thinks he is old enough to be one.\nwww.mitchellsong.com", "url": "https://www.facebook.com/events/277240782615400/"}, {"source": "Facebook", "date": "2016-12-11T19:30:00-05:00", "name": "Delbert McClinton w/Brian Dunne", "description": "King of the Texas honky-tonk blues. Americana singer-songwriter Brian Dunne opens.", "url": "https://www.facebook.com/events/614261878737257/"}, {"source": "Facebook", "date": "2016-12-14T21:00:00-05:00", "name": "Dopapod & Pigeons Playing Ping Pong at Blind Pig - Ann Arbor", "description": "Wed. Dec. 14 | 9pm | 18+ | $15 adv./ $18 Day of\n\nLive For Live Music Presents\nDopapod & Pigeons Playing Ping Pong\nat Blind Pig\nAnn Arbor, MI\n\nTickets: http://tktwb.tw/2asPQDi\n\nWant to earn a FREE ticket to the show? Sign up for the street team by clicking here: http://bit.ly/2b3tDvt\n\nDOPAPOD: \n\nThe Boston born, now generally Northeast based, but ever on-the-go Dopapod has come a long way from their college basement, DIY party roots. While maintaining to be as grassroots as their humble beginnings, the group has earned praise from taste making critics like Rolling Stone, Huffington Post, Jambase, Relix, and The Boston Herald, all the while tending to their ever expanding community of devoted listeners. The past 4 years have individually held the weight of about 150 shows, which have included numerous festival appearances like Bonnaroo, Wakarusa, Summer Camp, Electric Forest, Camp Bisco, Peach Fest, & Gathering Of the Vibes. All of this time on stage with each other has given the band the opportunity to explore the wide variety of influences that has impacted them to be the players they are today. But, don’t be quick to think that the no holds barred experimentation is unguided. While the brush in their hand uses every color, it’s the stroke on the canvas that gives Dopapod a distinct voice in the way of crafty songwriting.\n\nThat calculated, compositional mindset and restless nature to never sit too still is what has allowed Dopapod to fully realize their fourth studio release, Never Odd Or Even. Guitarist/vocalist Rob Compa giddily tells, “We really felt that the material this time around represented a big leap forward, not just in the way we’ve been interacting as a band, but in the way our focus has become sharper in paying attention to things like melody, theme, lyrical imagery, and structure – all the elements that make a great song.”\n\nDetermined to have that maturity translate in the studio, the band enlisted friend and producer Jason “Jocko” Randall to both engineer and produce the record. Keys/vocalist Eli Winderman couldn’t be happier about how things went. “We lived at his studio for about a month for these sessions and it just clicked right away. Jocko immediately became another member of band in many ways. With his attitude and approach to the recording process, we were able to really dial in the sounds we wanted, get those perfect takes we were aiming for, and have a blast the whole way through.” Released in November of 2014, Never Odd Or Even serves as the spark that the band has ignited to launch them into and exciting 2015.", "url": "https://www.facebook.com/events/1574155032886638/"}, {"source": "Facebook", "date": "2016-12-16T20:00:00-05:00", "name": "Katie Geddes and Friends at Green Wood Coffee House", "description": "Katie Geddes sings traditional and contemporary folk, country-folk, and folk-pop tunes. A deft interpreter of beloved songs, her captivating voice and velvety-smooth delivery bring new life to the compositions of writers such as John Prine, Buffy Sainte-Marie, Michael Nesmith and Lennon and McCartney. Katie’s latest CD release, We Are Each Other’s Angels, features an inspired roster of guest artists including Michael Johnson, Mary McCaslin, Don Henry and Small Potatoes, and has received extensive airplay across the country and around the world.When not doing her own gigs, Katie has been known to “moonlight” singing harmony for folk- rock legend Melanie and local favorite Matt Watroba.\n\n\nVocal trio All About Eve (Katie Geddes, Deb Wood, David Vaughn) offers up a variety of close-harmony pop covers and traditional and contemporary folk and gospel songs, accompanied by Dan Reynolds on guitar.", "url": "https://www.facebook.com/events/253901491631138/"}, {"source": "Facebook", "date": "2016-12-17T11:00:00-05:00", "name": "Blackthorn", "description": "A musical ramble across Ireland", "url": "https://www.facebook.com/events/1059455814109206/"}, {"source": "Facebook", "date": "2017-01-12T20:00:00-05:00", "name": "The Sweet Water Warblers", "description": "May Erlewine, Rachael Davis, and Lindsay Lou Rilko", "url": "https://www.facebook.com/events/999093406875272/"}, {"source": "Facebook", "date": "2017-01-15T19:30:00-05:00", "name": "The Hot Club of Cowtown", "description": "The new wave in Western swing", "url": "https://www.facebook.com/events/1762991087285346/"}, {"source": "Facebook", "date": "2017-01-19T20:00:00-05:00", "name": "Red Tail Ring", "description": "New music from West Michigan's old-time innovators", "url": "https://www.facebook.com/events/283749408648270/"}, {"source": "Facebook", "date": "2017-01-20T20:00:00-05:00", "name": "On Behalf of Nature: Meredith Monk & Vocal Ensemble", "description": "For her newest music-theater work, Meredith Monk offers a poetic meditation on our intimate connection to the natural world and the fragility of its ecology.\n\nMore info: http://ums.org/performance/on-behalf-of-nature/", "url": "https://www.facebook.com/events/1172029342847930/"}, {"source": "Facebook", "date": "2017-01-21T20:00:00-05:00", "name": "Takács Quartet: Beethoven Quartet Cycle Concerts 3 & 4", "description": "“They are not for you, but for a later age!”\n\nSo wrote Ludwig van Beethoven about his Op. 59 quartets, which will be performed in Ann Arbor as part of a complete Beethoven string quartet cycle by the Takács Quartet over six concerts (three weekends) in the 2016-17 season. Composed against the turbulent backdrop of the Napoleonic Wars and their aftermath, this radical music is as invigorating now as it was for its first performers and audiences.\n\nMore info: http://ums.org/performance/takacs-quartet/", "url": "https://www.facebook.com/events/600305573465226/"}, {"source": "Facebook", "date": "2017-01-29T16:00:00-05:00", "name": "Inon Barnatan, Anthony McGill & Alisa Weilerstein", "description": "Inon Barnatan, piano\nAnthony McGill, clarinet\nAlisa Weilerstein, cello\n\nThis powerhouse trio brings together some familiar faces.\n\nInon Barnatan was the featured piano soloist with the New York Philharmonic last fall, Anthony McGill is the New York Philharmonic’s principal clarinetist, and Alisa Weilersten has performed on both the Choral Union Series and the Chamber Arts Series in recent years. This concert of beloved clarinet trios includes a new work by Joseph Hallman, a prolific young composer based in Philadelphia, which was co-commissioned by UMS as part of the Music Accord commissioning consortium.\n\nMore info: http://ums.org/performance/inon-barnatan-piano-anthony-mcgill-clarinet-alisa-weilerstein-cello/", "url": "https://www.facebook.com/events/270514846618930/"}, {"source": "Facebook", "date": "2017-02-02T19:30:00-05:00", "name": "Bruckner Orchester Linz", "description": "This unlikely mashup features an Austrian orchestra performing works by composers who wrote about the experience of Africans and African-Americans.\n\nThe program includes Alexander Zemlinsky’s Africa Sings, which was written in 1929 and features poetry by Langston Hughes and other prominent writers from the Harlem Renaissance. The program also features Phillip Glass’s recent collaboration with the Beninese singer Angélique Kidjo based on three poems of Ifé, one of the most important Yorùbán kingdoms.\n\nMore info: http://ums.org/performance/bruckner-orchester-linz/", "url": "https://www.facebook.com/events/523093904564649/"}, {"source": "Facebook", "date": "2017-02-03T20:00:00-05:00", "name": "Estonian Philharmonic Chamber Choir", "description": "When the Estonian Philharmonic Chamber Choir landed in New York for its first North American tour in 1995 (including a stop in Ann Arbor for UMS’s very first concert at St. Francis), they were known only as the performers on the best-selling CD of fellow-Estonian Arvo Pärt’s austere Te Deum.\n\nThe concerts showed much more — a virtuosic ensemble that could dazzle in everything from Bach to folk songs. Now they return with newly-named artistic director Kaspars Putniņš with music by Pärt, Schnittke, Ligeti, Brahms, and Tormis. “So wondrously talented…the selections and performances were so fine that they left you feeling like an ingrate, greedily hungry for more.” (New York Times)\n\nMore info: http://ums.org/performance/estonian-philharmonic-chamber-choir/", "url": "https://www.facebook.com/events/102986336775427/"}, {"source": "Facebook", "date": "2017-02-05T16:00:00-05:00", "name": "Calidore String Quartet", "description": "Winners of the grand prize at the inaugural M-Prize Chamber Music Competition at the University of Michigan in May, the Calidore String Quartet is “a miracle of unified thought,” (La Presse, Montreal).\n\nhttp://ums.org/performance/calidore-string-quartet/", "url": "https://www.facebook.com/events/1713140125617477/"}, {"source": "Facebook", "date": "2017-02-10T20:00:00-05:00", "name": "Budapest Festival Orchestra", "description": "Pianist Richard Goode joins the Budapest Festival Orchestra for this all-Beethoven program, which also features the UMS Choral Union in a performance of Beethoven’s Ninth Symphony.\n\nMore info: http://ums.org/performance/budapest-festival-orchestra/", "url": "https://www.facebook.com/events/226856454345333/"}, {"source": "Facebook", "date": "2017-02-18T19:30:00-05:00", "name": "The Love Hangover: A Benefit for the Breakfast at St. Andrew's", "description": "Featuring The Flutter and Wow, The Whiskey Charmers, and Plain Jane Glory, plus special guest Lisa Tucker-Gray. Note special start time.", "url": "https://www.facebook.com/events/1784599778489237/"}, {"source": "Facebook", "date": "2017-02-18T20:00:00-05:00", "name": "Beyond Sacred: Voices of Muslim Identity: Ping Chong + Company", "description": "Ping Chong + Company creates theater that crosses boundaries of identity, community, and form.\n\nHis projects have explored a wide variety of subject matter, from a hidden genocide in Africa to class struggles in America and modernization in China, but the common thread is a unifying commitment to artistic innovation and social responsibility.\n\nThis interview-based theater production, part of Chong’s 25-year series entitled Undesirable Elements, explores the diverse experiences of young Muslim New Yorkers. The five participants in Beyond Sacred share the common experience of coming of age in a post-9/11 New York City, at a time of increasing Islamophobia. Participants come from a range of cultural and ethnic backgrounds and include young men and women who reflect a range of Muslim identities, including those who converted to Islam, those who were raised Muslim but have since left the faith, those who identify as “secular” or “culturally” Muslim, and those who are observant on a daily basis.\n\nMore info: http://ums.org/performance/beyond-sacred-voices-of-muslim-identity/", "url": "https://www.facebook.com/events/1756234927931657/"}, {"source": "Facebook", "date": "2017-02-19T16:00:00-05:00", "name": "Jelly and George - Aaron Diehl and Cécile McLorin Salvant", "description": "Timeless classics are elevated by modern masters when gifted jazz pianist and arranger Aaron Diehl and 26-year-old vocalist extraordinaire Cécile McLorin Salvant join forces to revisit and revitalize the works of George Gershwin and Jelly Roll Morton.\n\nMore info: http://ums.org/performance/jelly-and-george-aaron-diehl-and-cecile-mclorin-salvant/", "url": "https://www.facebook.com/events/1062809883742057/"}, {"source": "Facebook", "date": "2017-02-19T19:30:00-05:00", "name": "Ladysmith Black Mambazo", "description": "South Africa's legendary vocal harmonizers", "url": "https://www.facebook.com/events/1771705793073037/"}, {"source": "Facebook", "date": "2017-03-04T20:00:00-05:00", "name": "Jazz at Lincoln Center with Wynton Marsalis", "description": "“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas)\n\nSince 1988, Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, it’s all sheer jazz perfection — and no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/jazz-at-lincoln-center-with-wynton-marsalis/", "url": "https://www.facebook.com/events/1204202942946225/"}, {"source": "Facebook", "date": "2017-03-09T19:30:00-05:00", "name": "The Beauty Queen of Leenane: Druid", "description": "Druid, which made its acclaimed UMS debut in 2011 with The Cripple of Inishmaan, returns with a new production of Martin McDonagh’s dark comedy The Beauty Queen of Leenane.\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.\n\nMore info: http://ums.org/performance/the-beauty-queen-of-leenane/", "url": "https://www.facebook.com/events/614995318650187/"}, {"source": "Facebook", "date": "2017-03-10T19:30:00-05:00", "name": "The Beauty Queen of Leenane: Druid", "description": "Druid, which made its acclaimed UMS debut in 2011 with The Cripple of Inishmaan, returns with a new production of Martin McDonagh’s dark comedy The Beauty Queen of Leenane.\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.\n\nMore info: http://ums.org/performance/the-beauty-queen-of-leenane/", "url": "https://www.facebook.com/events/614995318650187/"}, {"source": "Facebook", "date": "2017-03-11T20:00:00-05:00", "name": "Beethoven’s Missa Solemnis", "description": "Beethoven spent more time writing his massive Missa Solemnis than any other work he composed.\n\nMissa Solemnis has been performed only four times in all of UMS’s history: at three May Festivals (with the Chicago Symphony in 1927 and the Philadelphia Orchestra in 1947 and 1955), and most recently by the Detroit Symphony Orchestra in 1977. The UMS Choral Union and Ann Arbor Symphony Orchestra, under the direction of Scott Hanoian, bring this monumental work to UMS audiences for the first time in 40 years. Soloists to be announced.\n\nMore info: http://ums.org/performance/beethovens-missa-solemnis/", "url": "https://www.facebook.com/events/717745095032202/"}, {"source": "Facebook", "date": "2017-03-12T20:30:00-04:00", "name": "The Beauty Queen of Leenane: Druid", "description": "Druid, which made its acclaimed UMS debut in 2011 with The Cripple of Inishmaan, returns with a new production of Martin McDonagh’s dark comedy The Beauty Queen of Leenane.\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.\n\nMore info: http://ums.org/performance/the-beauty-queen-of-leenane/", "url": "https://www.facebook.com/events/614995318650187/"}, {"source": "Facebook", "date": "2017-03-16T19:30:00-04:00", "name": "Snarky Puppy", "description": "This once Texan, now New York-based quasi-collective has gone from a best-kept secret to one of the biggest bands on the international scene.\n\nAlthough still “underground” in many respects, the band followed up its first Grammy in 2014 (“Best R&B Performance”) with its second this past February for “Best Contemporary Instrumental Album.” They have earned high praise from critical stalwarts like the BBC, Village Voice, The Guardian, and the New York Times, as well as from the world’s most respected musicians, from Pat Metheny to Prince. Formed in 2004 at the acclaimed music school of the University of North Texas, the group was voted “Best Jazz Group” in Downbeat’s 2015 Reader’s Poll as well as “Best New Artist” in JazzTimes’s 2014 Reader’s Poll. Their music is a mixture of funk, jazz, gospel, rock, and R&B that strikes a perfect balance between pure musical virtuosity and raw soulful simplicity.\n\nMore info: http://ums.org/performance/snarky-puppy/", "url": "https://www.facebook.com/events/1742640832682915/"}, {"source": "Facebook", "date": "2017-03-17T20:00:00-04:00", "name": "Betroffenheit: Kidd Pivot and Electric Company Theatre", "description": "Some questions are impossible to answer and some experiences too personal to express.\n\nCrystal Pite, the choreographer who brought The Tempest Replica to Ann Arbor four seasons ago, is back with her 2015 work for Kidd Pivot and Electric Company Theatre: Betroffenheit, which means a sort of shock, speechlessness, and bewilderment. This searing work has its roots in a deeply personal tragedy, the deaths of writer Jonathon Young’s teenage daughter and two cousins in a fire. With unflinching honesty, it achieves broad resonance as it touches on themes of loss, trauma, addiction, and recovery through a boundary-stretching hybrid of theater and dance. “A stunning testament to what can happen when life turns into art.” (The Globe and Mail)\n\nMore info: http://ums.org/performance/betroffenheit/", "url": "https://www.facebook.com/events/240524153002004/"}, {"source": "Facebook", "date": "2017-03-18T20:00:00-04:00", "name": "Steve Reich at 80", "description": "The Guardian in London asserts, “There’s just a handful of living composers who can legitimately claim to have altered the direction of musical history, and Steve Reich is one of them.”\n\nReich, who has been called “our greatest living composer” (New York Times), celebrates his 80th birthday in 2016, and the year also marks the 40th anniversary of the premiere of Music for 18 Musicians, considered by many to be his greatest composition. Two of Chicago’s world-class ensembles, Eighth Blackbird and Third Coast Percussion, team up to perform this seminal composition.\n\nMore info: http://ums.org/performance/steve-reich-80/", "url": "https://www.facebook.com/events/1701619326773112/"}, {"source": "Facebook", "date": "2017-03-18T20:00:00-04:00", "name": "Betroffenheit: Kidd Pivot and Electric Company Theatre", "description": "Some questions are impossible to answer and some experiences too personal to express.\n\nCrystal Pite, the choreographer who brought The Tempest Replica to Ann Arbor four seasons ago, is back with her 2015 work for Kidd Pivot and Electric Company Theatre: Betroffenheit, which means a sort of shock, speechlessness, and bewilderment. This searing work has its roots in a deeply personal tragedy, the deaths of writer Jonathon Young’s teenage daughter and two cousins in a fire. With unflinching honesty, it achieves broad resonance as it touches on themes of loss, trauma, addiction, and recovery through a boundary-stretching hybrid of theater and dance. “A stunning testament to what can happen when life turns into art.” (The Globe and Mail)\n\nMore info: http://ums.org/performance/betroffenheit/", "url": "https://www.facebook.com/events/240524153002004/"}, {"source": "Facebook", "date": "2017-03-24T20:00:00-04:00", "name": "Mitsuko Uchida, piano", "description": "Renowned for her interpretations of Mozart and Schumann, the legendary pianist Mitsuko Uchida has also illuminated the music of new composers.\n\nShe will perform the US premiere of a new work by the German composer Jörg Widmann in her first UMS concert since her 1998 debut.\n\nMore info: http://ums.org/performance/mitsuko-uchida-piano/", "url": "https://www.facebook.com/events/1061640283908926/"}, {"source": "Facebook", "date": "2017-03-25T20:00:00-04:00", "name": "Takács Quartet: Beethoven Quartet Cycle Concerts 5 & 6", "description": "“They are not for you, but for a later age!”\n\nSo wrote Ludwig van Beethoven about his Op. 59 quartets, which will be performed in Ann Arbor as part of a complete Beethoven string quartet cycle by the Takács Quartet over six concerts (three weekends) in the 2016-17 season. Composed against the turbulent backdrop of the Napoleonic Wars and their aftermath, this radical music is as invigorating now as it was for its first performers and audiences.\n\nMore info: http://ums.org/performance/takacs-quartet-3/", "url": "https://www.facebook.com/events/135653360170391/"}, {"source": "Facebook", "date": "2017-03-29T19:30:00-04:00", "name": "DakhaBrakha", "description": "Drones and beats, crimson beads, and towering black lambswool hats all serve as a striking backdrop for an unexpected, refreshingly novel vision of Eastern European roots music.\n\nThis hit Ukrainian folk-punk quartet stirs up a mesmerizing sound that melds traditional Ukrainian folk music, African grooves, Eastern colors, and a contemporary, trans-national sensibility that the band calls “ethno-chaos.” With one foot in the urban avant-garde and the other in Ukrainian village culture, DakhaBrakha made NPR music host Bob Boilen’s “Top 10 Events of 2015” — no small feat given the 506 concerts he attended that year. Rolling Stone’s report on their Bonnaroo appearance was equally enthusiastic: “Ukrainian folkdrone Björkpunk quartet DakhaBrakha ended up with one of the most receptive crowds of the weekend…turning the tent into a happy menagerie.”\n\nMore info: http://ums.org/performance/dakhabrakha/", "url": "https://www.facebook.com/events/1099676823415727/"}, {"source": "Facebook", "date": "2017-03-30T19:30:00-04:00", "name": "The Encounter: Complicite / Simon McBurney", "description": "In 1969, National Geographic photographer Loren McIntyre became hopelessly lost in a remote part of the Brazilian rainforest while searching for the Mayoruna people.\n\nHis encounter tested his perception of the world, bringing the limits of human consciousness into startling focus. Threading scenes of his own life with details of McIntyre’s journey, Complicité artistic director Simon McBurney incorporates objects and sound effects into this solo performance to evoke a rainforest landscape. Transmitted directly to the audience through provided headphones, the show’s groundbreaking technology and sound design plugs into the power of the imagination, questioning our perceptions of time, communication, and our own consciousness. McBurney transports us into the humid depths of the Amazon, its intense soundscape a new approach to site-specific theater.\n\nMore info: http://ums.org/performance/the-encounter/", "url": "https://www.facebook.com/events/1802665646634100/"}, {"source": "Facebook", "date": "2017-03-31T19:30:00-04:00", "name": "The Encounter: Complicite / Simon McBurney", "description": "In 1969, National Geographic photographer Loren McIntyre became hopelessly lost in a remote part of the Brazilian rainforest while searching for the Mayoruna people.\n\nHis encounter tested his perception of the world, bringing the limits of human consciousness into startling focus. Threading scenes of his own life with details of McIntyre’s journey, Complicité artistic director Simon McBurney incorporates objects and sound effects into this solo performance to evoke a rainforest landscape. Transmitted directly to the audience through provided headphones, the show’s groundbreaking technology and sound design plugs into the power of the imagination, questioning our perceptions of time, communication, and our own consciousness. McBurney transports us into the humid depths of the Amazon, its intense soundscape a new approach to site-specific theater.\n\nMore info: http://ums.org/performance/the-encounter/", "url": "https://www.facebook.com/events/1802665646634100/"}, {"source": "Facebook", "date": "2017-04-01T20:00:00-04:00", "name": "Michael Fabiano, tenor & Martin Katz, piano", "description": "A University of Michigan alumnus, Michael Fabiano received the 2014 Richard Tucker Award and the  2014 Beverly Sills Artist Award, the first-ever winner of both awards in the same year.\n\n“A marvel…Fabiano’s sound was so beautiful, and the transition from the bottom to the top of his range so seamless as to proclaim him ‘the’ tenor that we have all been waiting for.” (San Francisco Classical Voice)", "url": "https://www.facebook.com/events/1547896382170720/"}, {"source": "Facebook", "date": "2017-04-02T19:30:00-04:00", "name": "The Encounter: Complicite / Simon McBurney", "description": "In 1969, National Geographic photographer Loren McIntyre became hopelessly lost in a remote part of the Brazilian rainforest while searching for the Mayoruna people.\n\nHis encounter tested his perception of the world, bringing the limits of human consciousness into startling focus. Threading scenes of his own life with details of McIntyre’s journey, Complicité artistic director Simon McBurney incorporates objects and sound effects into this solo performance to evoke a rainforest landscape. Transmitted directly to the audience through provided headphones, the show’s groundbreaking technology and sound design plugs into the power of the imagination, questioning our perceptions of time, communication, and our own consciousness. McBurney transports us into the humid depths of the Amazon, its intense soundscape a new approach to site-specific theater.\n\nMore info: http://ums.org/performance/the-encounter/", "url": "https://www.facebook.com/events/1802665646634100/"}, {"source": "Facebook", "date": "2017-04-12T19:30:00-04:00", "name": "A Far Cry with Roomful of Teeth", "description": "A Far Cry stands at the forefront of an exciting new generation in classical music.\n\nThe 17-member, self-conducted chamber music collective joins forces with virtuosic vocalists Roomful of Teeth to create a sonic patchwork that is ever-changing with its fleeting burst of colors, timbres, and visions. The program opens with the lush writing of Caroline Shaw (2013 Pulitzer Prize winner), with the second half devoted to two raw, energetic, and captivating works by Ted Hearne.\n\nMore info: http://ums.org/performance/a-far-cry-with-roomful-of-teeth/", "url": "https://www.facebook.com/events/256549731357007/"}, {"source": "Facebook", "date": "2017-04-15T20:00:00-04:00", "name": "Sanam Marvi", "description": "With compelling interpretations that draw deeply from one of the world’s great music traditions, Sanam Marvi is Pakistan’s next inspiring diviner of South Asia’s Sufi texts.\n\nA vocal warrior for tolerance and peace, this contemporary daughter of the Sindh province is a brilliant interpreter of South Asia’s spiritual, folk, and classical poetry. Her performances balance immediacy and elegant ornamentation, lending new light to her well-loved repertoire of sufi, ghazal, qawwali, and folk songs. An in-demand performer too rarely heard outside émigré circles, she makes her first extended tour to the US.\n\nMore info: http://ums.org/performance/sanam-marvi/", "url": "https://www.facebook.com/events/1065809183457276/"}, {"source": "Facebook", "date": "2017-04-21T20:00:00-04:00", "name": "King Sunny Adé", "description": "Since the evolution of jùjú music in Nigeria in the 1930s, no one has made a more lasting impact in the genre than King Sunny Adé.\n\nAs a singer, composer, and guitarist, this pioneer of modern world music has succeeded in taking Nigerian social music to international heights. Adé formed his first band in 1967 and has been in the limelight in Nigeria ever since. Singing in his native Yorùbá language, Adé went on to define the terms “Afropop” and “World Beat” and to open the door to the West for other African musicians. King Sunny Adé & His African Beats last toured North America in 2005. He will lay down his trademark mix of talking drum-driven grooves, multi-guitar weaves, lilting vocal harmonies, and pedal steel guitar accents, taking the audiences on an intoxicating journey.\n\nMore info: http://ums.org/performance/king-sunny-ade/", "url": "https://www.facebook.com/events/996900117032146/"}, {"source": "Facebook", "date": "2017-04-22T20:00:00-04:00", "name": "Yo-Yo Ma, Edgar Meyer & Chris Thile", "description": "This special concert at the end of UMS’s season brings together three artists who have been collaborating for the better part of a decade, most notably on the bestselling recording The Goat Rodeo Sessions.\n\nYo-Yo Ma’s multi-faceted career is a testament to his continual search for new ways to communicate with audiences and to his personal desire for artistic growth and renewal. Here, he is joined by mandolinist Chris Thile (Punch Brothers, Nickel Creek) and bass virtuoso Edgar Meyer for a special concert that brings together three string masters who come from wildly different backgrounds yet excel in virtually all genres. They pool their talents for a fresh, new perspective on brilliantly conceived music by Johann Sebastian Bach. The program includes transcriptions of excerpts from The Art of the Fugue and various keyboard works, as well as organ and viola da gamba trio sonatas.\n\nMore info: http://ums.org/performance/yo-yo-ma-edgar-meyer-chris-thile/", "url": "https://www.facebook.com/events/197458777307457/"}, {"source": "Facebook", "date": "2017-04-25T19:30:00-04:00", "name": "Handel’s Ariodante", "description": "Contemporary opera composer Jake Heggie enthused in Gramophone magazine, “The staggering, joyful artistry of Joyce DiDonato reminds us that in any generation there are a few giants…Those who know her repertoire are in awe of her gifts, and those who know nothing of it are instantly engaged.”\n\nDiDonato enchants audiences across the globe with her 24-carat voice and performances that “leave one bereft of superlatives.” (The Telegraph) This concert opera with The English Concert and conductor Harry Bicket will be performed in only two places in the country: Hill Auditorium and Carnegie Hall.\n\nMore info: http://ums.org/performance/handels-ariodante/", "url": "https://www.facebook.com/events/1003698069678193/"}]