[{"url": "https://www.facebook.com/events/192972824428594/", "description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nRSVP on FB: http://bit.ly/29dSJv0\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule\n\n______________________________________________\n\n\nPreviously this season:\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nRSVP on FB: http://bit.ly/29dSikp\nBUY JUNE 11 TICKETS: http://bpt.me/2538000", "source": "Facebook", "date": "2016-10-14T17:00:00-04:00", "name": "Ann Arbor Derby Dimes 2016 season"}, {"url": "https://www.facebook.com/events/192829154482653/", "description": "You asked for it- Trivia Night is now a regular thing! Every other Friday, our Trivia Master Kevin will be hosting this super fun event, and the winner will receive a $25 gift card. Our taps will be flowing with great beer as always, just $2 a pint. Come see if you really are a know it all!", "source": "Facebook", "date": "2016-10-14T18:00:00-04:00", "name": "Trivia Night"}, {"url": "https://www.facebook.com/events/977255609064551/", "description": "Join us on Friday, October 14th, from 6:00 to 9:00PM for the Opening Reception of our 94th Annual All Media Exhibition.\n\nThis event is FREE and open to the public.\n\nEstablished in 1922, the Annual All Media Exhibition at The Ann Arbor Art Center has a long and rich history. This show highlights artists from all over the country working in any media.\n\nAbout the Juror: \n\nPaul Kotula is currently an Associate Professor of Ceramics at Michigan State University and has also worked as a gallery director for Pewabic Pottery, Swidler Gallery, REVOLUTION (Detroit and New York) and Paul Kotula projects. Working with an international list of artists, he has formed over 200 solo and group exhibitions pertinent to the field of contemporary art and visual culture.\n\nImage Credit: Free Wet Hugz, by Analicia Honkanen (Berkley, MI)\n\nFor more information about our 94th Annual All Media Exhibition, go here: https://goo.gl/VVlfvi \n-----------\nThe 117 Gallery 2016/ 2017 season is generously supported by Vintage Financial Services LLC.", "source": "Facebook", "date": "2016-10-14T18:00:00-04:00", "name": "94th Annual All Media Opening Reception"}, {"url": "https://www.facebook.com/events/845428365593328/", "description": "Literati is pleased to welcome Jordan Zandi, reading from his collection Solarium. UM Zell Fellows in Poetry Amanda Rybin Koob and Hannah Webster will also read.\n\n\"Solarium is a completely original gem of a book. I have never met Jordan Zandi, but I would like to, for there is a sweet spirit haunting his guileless poems. His inner world is always interacting with the outer world, and as a result everything seems to be shining. 'Walking across the binary field, / what does the young man see?' Zandi asks, searching for signs with his subtle eyes. The answer seems to be the great opium of simply being content within oneself—with a heart that receives and watches (if a heart watches), while resisting the systems that hurt us—and remaining awake to experience.\"—Henri Cole, from the Foreword  \n\nJordan Zandi is the author of Solarium (Sarabande Books), which was chosen by Henri Cole as the winner of the Kathryn A. Morton Prize. The New Yorker named it one of the twelve best poetry-related books of 2015, calling it, \"A first book made eventful by the weirdness and clarity of Zandi's mind.\" He holds an M.F.A. in poetry from Boston University, where he was an Elizabeth Leonard Fellow and a Robert Pinsky Global Fellow to Bolivia, and his poems have appeared in The New Republic, Little Star, and Verse Daily, among others. He is founder and co-editor of Prodigal, an independent print and online journal of poetry and prose and currently lives in Indianapolis with his wife and their two rabbits.  \n\nEvent date: \nFriday, October 14, 2016 - 7:00pm", "source": "Facebook", "date": "2016-10-14T19:00:00-04:00", "name": "Poetry at Literati: Jordan Zandi"}, {"url": "https://www.facebook.com/events/541805179338204/", "description": "Ride the Poto, backwards, at night! The ride will be staging at the Silver Lake Parking lot. Arrive at 7:00pm and ride at 7:30pm. We will have a first group of faster riders doing the full loop, and a second group of \"normal\" riders doing part of the trail. After the ride, we will have a campfire and typically riders bring food to share. Come out and ride the Poto backwards with lights!\n\nWhat you should bring:\n 1. light\n 2. back-up light\n 3. cell phone\n 4. trail map, tools, survival gear (just kidding - no man left behind!)\n 5. food/beverages/change of clothes for post ride", "source": "Facebook", "date": "2016-10-14T19:00:00-04:00", "name": "Batman Ride"}, {"url": "https://www.facebook.com/events/1113787048700803/", "description": "The Annual Argus Museum Conference is being held October 13-16 and opens on Thursday evening at 7 pm with the photography exhibition “Homage to the Holga” showcasing work by the Ann Arbor Area Crappy Camera Club (A3C3).  Attendees are encouraged to participate in the photography competition, “On My Way to Ann Arbor”.  (Contact the museum curator for details.)\n \nFriday’s schedule includes special viewing hours for the Washtenaw County Historical Society’s Museum on Main Street exhibit, “Community Helpers”, a tour of the Clements Library, dinner at the Argus Museum generously donated by Argus Collectors Group (ACG) members, and the presentation, “Argus in the 1950s”. The presentation, given by ACG member, Bob Kelly, will look at key players, innovation and marketing, significant products, transition points, merger impacts and the situation as Argus completed 25 years in business in June of 1961.\nSaturday is another full day with presentations and the premier of recently-digitized Argus films in the morning followed by lunch and discussions with former Argus employees and members of their families. The group then heads to the privately-owned Macon Creek Mill for a tour and photo-ops.  The Banquet, catered by The Movable Feast, will also be held at the mill which will include awards, the results of the photography competition and an auction of camera-and-photography-related “stuff”.\n\nOn Sunday, guests are encouraged to attend the annual Michigan Photographic Historical Society’s 41st Annual Photographica Show & Sale being held at Royal Oak’s Elks Lodge.  Plenty of camera equipment, vintage photographs and postcards and other photo-related items will be for sale and deals are to be had!", "source": "Facebook", "date": "2016-10-14T19:00:00-04:00", "name": "ACG/Argus Museum Conference"}, {"url": "https://www.facebook.com/events/545589118960465/", "description": "Join Kerrytown Concert House as we celebrate the lead-up to the 20th anniversary of our avant-garde jazz festival Edgefest (October 26-29) with a series of free concerts throughout Ann Arbor!\n\nGunwale matches veteran Chicago saxophonist Dave Rempis up with two of the up-and-coming stars from the next generation of Chicago improvisers. Ryan Packard is known mostly for his extensive work as a composer and percussionist within the thriving contemporary classical scene in Chicago, while Albert Wildeman has achieved fame for his meteoric rise from novice instrumentalist to one of the busiest players in town after relocating to Chicago from the Netherlands in 2011 to immerse himself in the city’s broad-shouldered music world. These two contribute noticeably fresh perspectives to this ongoing and ever-evolving local dialogue, a world of which Rempis has been a flagship member for almost two decades. As a trio, their voice carries a unique shape, combining a love for full-on blasts of energy with a sensitivity to the smallest details, resulting in music that can be a freight train one moment, and an insectoid microcosm the next. The band released their first recording, Polynya, on Aerophonic Records in the summer of 2016, and is on tour throughout North America this fall.\n\nThis performance is made possible through the generous sponsorship of The Maxine and Stuart Frankel Foundation in honor of Maurice and Linda Binkow on the occasion of her 80th birthday and their 60th wedding anniversary. Additional support for this performance is provided by Encore Records. \n \nThis concert is a part of the Warming Up The Edge series leading up to Kerrytown Concert House's Edgefest festival of creative music in celebration of the festival's 20th anniversary.", "source": "Facebook", "date": "2016-10-14T20:00:00-04:00", "name": "Dave Rempis's Gunwale at Encore | Warming Up the Edge Series"}, {"url": "https://www.facebook.com/events/1670101496650126/", "description": "Redbud Productions celebrates its 18th year with this Tony- nominated play, named Best Play of the Year by the New York Drama Critics’ Circle, written by the Pulitzer Prize-Winning Playwright of Rabbit Hole.\n\n“A very fine new play ….one of the more subtly surprising treats of this theater season.” -  The New York Times. “A quality rarely seen on Broadway” – Time Out\n\nThere will be three performances at Ann Arbor's Kerrytown Concert House: Thursday, Friday, & Saturday October 13, 14 & 15 at 8:00 pm. This production of Good People is directed by Loretta Grimes.\n\nGeneral Tickets are $20 for adults and $15 for students. There are limited front row cafe table seating for groups of 2 - 3 for $25 a seat.. For reservations, visit kerrytownconcerthouse.com or call Kerrytown Concert House at 734-769-2999.\n\nWith a humorous glow, Good People explores the struggles, shifting loyalties and unshakable hopes that come with having next to nothing in America\n\nWelcome to Southie, the Boston neighborhood where a night on the town means a few rounds of bingo, where this month’s paycheck covers last month’s bills, and where Margie Walsh (Katie Whitney) has just been fired from yet another job.\n\nFacing eviction from her eccentric landlady (Linda Lee Austin) and scrambling to catch a break, Margie, on the advice of her best friend (Emily Rogers), approaches her former boyfriend (Dave Barker), now a wealthy doctor, in hopes that he is her ticket to a fresh new start.\n\nWill this self-made man face his humble beginnings? Margie risks what little she has left to find out. The outstanding cast includes Krystle Dellihue and Chris Krenz.\n\n“Good People maps the fault lines of social class with a rare acuity of perception while also packing a substantial emotional wallop.” – Boston Globe “   A wonderful new play … poignant, brave and almost subversive in its focus on what it really means to be down on your luck” -  The New York Post", "source": "Facebook", "date": "2016-10-14T20:00:00-04:00", "name": "Good People"}, {"url": "https://www.facebook.com/events/197527007266742/", "description": "While Americana folk singer/songwriter Laurie McClain accompanies herself expressively on guitar, ukulele and harmonica, her honey voice soothes and her powerful lyrics heal bruised hearts. Reminiscent of 60s/70s folk, her music is predominantly folk/alternative country with a touch of the blues woven through. She brings passion and humor to the stage, performing original songs as well as unique covers of other excellent songwriters' gems. Her song, \"My Heaven\" is a favorite of listeners of folk radio programs around the world. In 2003 Laurie released The Trumpet Vine: A Tribute To Kate Wolf, a collection of her loving interpretations of the late songstress's works. Her latest CD is Ascend. www.lauriemcclain.com", "source": "Facebook", "date": "2016-10-14T20:00:00-04:00", "name": "Laurie McClain at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/524849711054672/", "description": "Fri. October 14 | 9pm | 18+ | $10 Cover\n\nBroccoli Samurai with Everyday Junior\n\nSince forming in the Rustbelt of Cleveland, OH in 2010, Broccoli Samurai has been taking the club and festival scene by storm. The band's synth-laden, drum and bass influenced, progressive electronica has been thrilling audiences throughout the Midwest, Mid-Atlantic, and Northeast markets, winning them a massive and fiercely loyal fanbase. Eager fans pack dance floors and late-night festival sets with smiles across their faces, waiting to get lost in the band's ambient soundscapes, anticipating every bass drop that will force them to move with reckless abandon. Broccoli Samurai's line-up includes founding members Ryan \"Bruce\" Hodson on keys and synth, and Chris Walker on drums and percussion. Accomplished bassist Zachary Wolfe Nagi-Schehl anchors the rhythm section, while guitarist Michael Vincent weaves in and out, exploring new sonic territory.\n\nThe band has played countless festivals such as The Werk Out, BIG What?!, Domefest, Paradise Music and Art Festival, Rootwire, The Mad Tea Party Jam, The Ville, SummerDance, Disc Jam, Night Lights Fall Music Festival, The Gathering At Chaffee's, Utica Music and Art Festival, and Hyperion Fest. Broccoli Samurai has directly supported and toured with many known bands including Dopapod, Papadosio, Lotus, Conspirator, The Werks, Ozric Tentacles, BoomBOX, Big Gigantic, Rusted Root, O.A.R., Pigeons Playing Ping Pong, Aqueous, and BIG Something. Broccoli Samurai's extensive tour schedule has them playing high profile venues and major cities regularly, and the band will be increasing the number of performances and expanding their reach into the West Coast and Southern markets in 2015. This band is making big moves and the time to take notice is now.", "source": "Facebook", "date": "2016-10-14T21:00:00-04:00", "name": "Broccoli Samurai w/ Everyday Junior 10/14/16 at Blind Pig - Ann Arbor"}]