[{"date": "2016-05-25T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1176167649079840/", "description": "Our May Artists' Meet & Greet topic is \nHow to Submit Your Artwork to a Show or Gallery. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "name": "How to Submit Your Artwork to a Show or Gallery"}, {"date": "2016-05-25T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1758695851043356/", "description": "Literati is pleased to welcome Elizabeth Hinton in support of her book From the War on Poverty to the War on Crime: The Making of Mass Incarceration in America. Elizabeth will be joined in conversation by Heather Ann Thompson, a professor of History and Afroamerican and African Studies at the University of Michigan; Reuben J. Miller, an assistant professor at UM's School of Social Work; and Ronald Simpson-Bey, Alumni Associate for Just Leadership USA.\n\nElizabeth Hinton is Assistant Professor of History and African and African American Studies at Harvard University. Hinton’s research focuses on the persistence of poverty and racial inequality in the 20th century United States. In her new book, From the War on Poverty to the War on Crime: The Making of Mass Incarceration in America (Harvard University Press), Hinton examines the implementation of federal law enforcement programs beginning in the mid-1960s that laid the groundwork for the mass incarceration of American citizens. In revealing the links between the rise of the American carceral state and earlier anti-poverty programs, Hinton presents Ronald Reagan’s War on Drugs not as a sharp policy departure but rather as the full realization of a shift towards surveillance and confinement that began during the Johnson administration. Before joining the Harvard faculty, Hinton spent two years as a Postdoctoral Scholar in the Michigan Society of Fellows and Assistant Professor in the Department of Afroamerican and African Studies at the University of Michigan. A Ford Foundation Fellow, Hinton completed her Ph.D. in United States History from Columbia University in 2012.\n\nEvent date: \nWednesday, May 25, 2016 - 7:00pm", "name": "Elizabeth Hinton"}, {"date": "2016-05-25T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/228993060811676/", "description": "-$2 wells and $1 shooters before 11pm\n--$2 Bud Light bottles\n--$3 Shock Top pints\n--$3 Malibu Black shots and mixed drinks\n--$5 Soft Parade pints\n\n\n\n\nWildoutWednsdays is here for one thing- to help you get thru that midweek slump! Come out and jump on the hump with ya boys from NTE!!! We're at club above on the 2nd and 4th wednsdays of every month, providing-\n\n---Quality Entertainment\n-Bass Music on the 2nd wedndsay\n-Hip-hop Showcase & DJ/s on the 4th\n--$2 Domestics\n--$3 Drafts\n--$3 Malibu & Rum\n-- A relaxed, supportive environment for artists and fans to network and party amongst each other---we're all in this together!!\n\nonly $3 before 11, and $5 after!!!!", "name": "WildOutWednsdays Wsg DJ Cataclysmic King Milo \\Duke Newcomb \\Tru Klassick \\J Classic \\Lucy V \\ROB"}, {"date": "2016-05-26T11:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/158066451258466/", "description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: Strawberries & Cream - Cream soda meets fresh-picked strawberry in this juicy rendition of the infamous Strawberry Blonde. Smooth scents of vanilla flood the nose and taste buds at first sip, followed by the bite of strawberry and a satisfying finish.. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "name": "American Craft Beer Week"}, {"date": "2016-05-26T17:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1800637513497391/", "description": "5:30-6:15 VIP Reception (Emcee remarks at 6:00)\n6:15 Doors open for general admission\n6:30 George Bedard and the Kingpins perform\n7:00 Movie begins \n(be sure to stick around for closing remarks!)\n\nVIP tickets are $50 (includes a reception with hot/cold hors d’oeuvres, a free drink ticket (beer, wine or soda), cash bar, and meet & greet with Jim Toy and Ronni Sanlo. \n\nGeneral admission seats are $15\n\n Letter to Anita is a riveting portrait of the effects of anti-gay discrimination on families and how one woman found her voice and capacity to forgive as a result.  It provides a historical context for the discrimination that today’s LGBTQ older adults have faced in their lifetimes and, in many cases, continue to face and promises to be be an educational and inspirational evening.  We are excited to welcome Dr. Ronni Sanlo and Mr. Jim Toy as well as feature a special appearance by George Bedard and the Kingpins.", "name": "Big Hearts for Seniors presents \"Letter to Anita\""}, {"date": "2016-05-26T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1007688999320601/", "description": "SARAH SALA is a poet and educator with roots in Brooklyn, Michigan. Her poem \"Hydrogen\" was recently featured in the \"Elements\" episode of NPR's hit show Radio Lab in collaboration with Emotive Fruition. The Ghost Assembly Line, a chapbook of her selected poetry, is forthcoming from Finishing Line Press in Spring 2016. Sala’s awards and honors include: an Academy of American Poets Prize, the Marjorie Rapport Award for Poetry, An Avery Hopwood Award for Nonfiction, and a Roy W. Cowden Memorial Fellowship. She earned her MFA in Poetry from New York University, and is a 2016 Home School Fellow. Her poems appear in Poetry Ireland Review, Atlas Review, and Palimpsest. You can visit her at www.sarahsala.com.", "name": "Meet Poet Sarah Sala for a Discussion and Signing of 'The Ghost Assembly Line'"}, {"date": "2016-05-26T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/101503103602334/", "description": "Come out to Club Above for a diverse array of musical artists featuring:\n\nAfter Hours Radio:https://goo.gl/knHfKB\nUnofficial: Matilda: https://goo.gl/PypK0j\nBobbiejak: https://goo.gl/1c8e1r\nIvory Shakedown: https://goo.gl/5bpumL\nJeff Garcia: https://goo.gl/b4uP9q\n\nPoster by Matilda", "name": "Bobbiejak // After Hours Radio // Matilda // Ivory Shake Down // Jeff Garcia"}, {"date": "2016-05-27T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/704680732968092/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe"}, {"date": "2016-05-27T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/281530315518082/", "description": "Come join friends & neighbors alike for a fun, slow, community bike ride through Ann Arbor. For this month's ride, grab your backpacks, latch on your panniers, haul a child carrier & fill up your baskets (we're really excited about this one!) it's Bike-in :: Picnic! \n\nThat's right, come one, come all, by bike, for a friendly little time of picnicking. We'll be enjoying whatever you can bring during our extended mid-ride stop at the Greenview Nature Area (http://www.friendsofgreenview.org/).\n \nBring something for yourself or bring something to share. Better yet, join up with a few others, share around, and you may end up enjoying a whole meal together! If you forgot your food, no problem! Enjoy the time outdoors and friendliness might lend you some grub. If you're bringing more than finger foods and drinks, remember to pack some type of utensils and eating surface (parchment paper, tupperware lids, compostable plates, etc.).\n\nMeet-up time is 7:00 PM at the Ann Arbor Farmers Market, departing at 7:15 PM per usual. The route will be 10 miles or less, within city limits, include the mid-ride \"bike-in\" for picknicing, and end downtown. Check back soon for route & other details to come.\n\n\nWhat's Bike-in?\nSee the community page:\nhttps://www.facebook.com/bikeinannarbor/info?tab=page_info\n\nOR read below\n\nBike-in is: Slow bike rides throughout Ann Arbor for everyone. Post-ride fun with friends, neighbors, and visitors around the community.\n\nEach ride we will begin at the listed location & time, ride casually, then finish the ride by \"biking-in\" to a post-ride time together at a local establishment, green space, or other friendly host setting (i.e. Bike-in :: Movie (outdoor), Creamery (ice cream), Picnic (potluck), Garden (beer garden), etc.).\n\nRides will be open and friendly to all. For gathering information, times, locations, riding routes, weather updates, etc. like/follow the page or visit for updates.\n\nPlease practice safe riding and abide by all legal riding rules at all times, especially while riding with a Bike-in community. Be sure to provide your own helmet, riding lights, and other appropriate accessories.", "name": "Bike-in :: Picnic"}, {"date": "2016-05-27T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1710939282497760/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Aggressively Nice\" starring Jade Fearn, Ryan Stennett, and Adam Hirzel\n\nGroup 2: \"Heather & Erik\" starring Heather Sejnowski and Erik Heilner\n\nGroup 3: \"The League of Pointless Improvisers\" starring Heather Sejnowski, Maggie O'Reilly, Matthew Flickinger, Erik Heilner, and Andy Reid", "name": "Pointless Improv with Aggressively Nice and Heather & Erik"}]