[{"url": "https://www.facebook.com/events/598128680341803/", "description": "Literati is pleased to present a roundtable discussion, in conjunction with the Jean & Samuel Frankel Center for Judaic Studies, to mark the publication of Women's Hebrew Poetry on American Shores: Poems by Anne Kleiman and Annabelle Farmelant.\n\nAlthough Anne (Chana) Kleiman—who died in 2011 at the age of 101—was the first American-born Jewish woman to publish poems in Hebrew, and Annabelle (Chana) Farmelant—who is still living and occasionally publishing—wrote a substantial body of Hebrew verse from the 1940s to the 1960s, their work is virtually unknown today, even to those familiar with Hebrew literature in America. The roundtable will discuss the singular voices of these women, introduce their captivating and wide--ranging poetry and place it in its historical, literary, and cultural contexts. The rountable will feature editor Shachar Pinsker, the translator Adriana Jacobs, Adina Kleiman (the daughter of the poet Anne Kleiman), and faculty from the Frankel Center who are experts on American Jewish Literature.", "source": "Facebook", "date": "2016-04-06T19:00:00-04:00", "name": "Women's Hebrew Poetry on American Shores"}, {"url": "https://www.facebook.com/events/1677432605865426/", "description": "Saadia Faruqi is a Pakistani American writer of fiction and nonfiction. She writes for a number of publications including Huffington Post and The Islamic Monthly about the global contemporary Muslim experience and about interfaith dialogue. She has trained law enforcement on cultural sensitivity issues and offers community college classes on a variety of topics related to Islam and Muslims. She is editor-in-chief of Blue Minaret, a magazine for Muslim art, poetry and prose. Her short stories have been published in several American literary journals and magazines such as Catch & Release,  On the Rusk, In Flight and The Great American Literary Magazine. “Brick Walls: Tales of Hope & Courage from Pakistan” is her debut fiction book. She is currently working on a novel based in Pakistan and the U.S. as well as a children’s book series.\n\n“Faruqi’s evocative collection is like a breath of fresh air as it breaks through all the clutter of violence, terrorism and fear, and offers much hope and faith in humanity despite the odds.” Kitaab book review.\n\n“Faruqi’s stories beautifully capture the similarities (of the human condition); her ambitious, flawed, raw characters are easy to relate to for any reader, regardless of ethnicity.” Brown Girl Magazine book review.\n\n“If you want to learn about the real Pakistan behind the headlines, this is a good place to start.” Bookmuse book review.", "source": "Facebook", "date": "2016-04-06T19:00:00-04:00", "name": "Meet Author Saadia Faruqi for a Discussion & Signing of 'Brick Walls: Tales of Hope & Courage From Pakistan'"}, {"url": "https://www.facebook.com/events/1390173447979498/", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "source": "Facebook", "date": "2016-04-06T19:30:00-04:00", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"url": "https://www.facebook.com/events/166980353679332/", "description": "Wed. April 6 | 9pm | 18+ | $8 adv./ $10 day of\n\nGosh Pith - Gold Chain Tour\nWSG: Passalacqua, Obese Ghost Children & The Landmarks\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/653", "source": "Facebook", "date": "2016-04-06T21:00:00-04:00", "name": "Gosh Pith | Gold Chain Tour 4/6/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/350155628441442/", "description": "There is no reason needed to revel the greatness that is beer, but National Beer Day is definitely a day to cheers a pint with friends!\n \nHistorically in 1933, April 7 brought back beer with an alcoholic strength of 3.2%. National Prohibition was officially repealed when the 21st Amendment to the Constitution was ratified months later on December 5, but in the meantime April 7 opened the door for the American craft beer revolution to take hold and grow to what it is today\n\nWe are celebrating this fine day in history by offering draft specials all day long. Every two hours we will rotate a featured ABC draft on special from open to close! \n\nStay tuned for the featured beer list...", "source": "Facebook", "date": "2016-04-07T11:00:00-04:00", "name": "National Beer Day"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-04-07T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/634535350033463/", "description": "The Argus Museum and Washtenaw County Historical Society are excited to host a photography exhibition of work by Ann Arbor-based French photographer, Marc-Gregor Campredon. Admission is free.\nThe exhibition, simply entitled, “Downtown”, will showcase digital and analog (film-based) images from Ann Arbor. Campredon, who is a graduate of the Paris College of Art, has traveled the world capturing stories and culture revealing the beauty and dignity of people and places.  \n\nThe Argus Museum is located on the second floor of the Argus I Building, 525 West William Street in Ann Arbor. The show will be available for viewing, M-F, 9-5 through May 13th.    For more information contact Cheryl Chidester at cchidester@onealconstruction.com or 734-769-0770.", "source": "Facebook", "date": "2016-04-07T18:30:00-04:00", "name": "Downtown: A Photographic Exposition by Marc-Grégor Campredon"}, {"url": "https://www.facebook.com/events/645879305571374/", "description": "The creative writing subconcentration in the English Department at the University of Michigan selects no more than 14 seniors each year to work with faculty and complete a creative thesis of poetry or fiction. These collections, the same size as many MFA theses, are first attempts to create book length manuscripts, and to prepare the writers for the work in the future. On April 7 hear 4 of this year's group -- poets Stephanie Choi and Meg Rattanni and fiction writers Alex Bernard and Moe Kolton -- read from their work.", "source": "Facebook", "date": "2016-04-07T19:00:00-04:00", "name": "University of Michigan's Creative Writing Graduates"}, {"url": "https://www.facebook.com/events/1736743313279010/", "description": "We're changing things around a bit this year.  Our first chapter meeting of the year will be held at Wolverine Brewing at 7:00 p.m on Thursday, April 7th in the Gulo Room.  The address for Wolverine Brewing is: 2019 W Stadium Blvd, Ann Arbor, MI 48103. Location for future meetings are up in the air but we wanted to patronize Wolverine a bit more because of the incredible support they've given us the last couple of years.  We also want to be sensitive to some of the concerns we've heard about the location of the meeting in the past.  Wolverine gives us a slightly more centralized location to our geographically diverse membership and is very close to the highway.  \n\nAt this meeting we'll be discussing the status of and plans for Waterloo, of course.  We'll also give updates on new events (Brecfest, the Tri Chapter Challenge and Youth Riding Day) as well as talk about the 2016 schedule for all of our traditional events.  If you attend you'll be able to hear the latest about the new IMBA Associate Regional Director for Michigan and how this person will be focusing on advocacy for mountain biking across the state.  And, as usual, we'll give a quick overview of the status of the trails, talk about scheduled trail days and other plans for maintenance this year.\n\nHope to see you there!\n\nThe Poto Chapter Board", "source": "Facebook", "date": "2016-04-07T19:00:00-04:00", "name": "Poto Chapter Meeting"}, {"url": "https://www.facebook.com/events/970118143072822/", "description": "Bryan Burrough is a special correspondent at Vanity Fair magazine and the author of six books, including the No. 1 New York Times Best-Seller Barbarians at the Gate and his latest, Days of Rage. He is also a three-time winner of the prestigious Gerald Loeb Award for Excellence in Financial Journalism.\nBorn in 1961, Bryan was raised in Temple, Texas, and graduated from the University of Missouri School of Journalism in 1983. From 1983 to 1992 he was a reporter for The Wall Street Journal, where he reported from Dallas, Houston, Pittsburgh and, during the late 1980s, covered the busy mergers and acquisitions beat in New York. He has written for Vanity Fair since 1992.\nIn 1990 Bryan and John Helyar co-authored Barbarians, the story of the fight for control of RJR Nabisco. The book, which spent 39 weeks on the New York Times bestseller list, has been hailed as one of the most influential business narratives of all time. Bryan joined Vanity Fair in 1992, where he has reported from locales as diverse as Hollywood, Nepal, Moscow, Tokyo and Jerusalem.\n\nFrom the bestselling author of Public Enemies and The Big Rich, an explosive account of the decade-long battle between the FBI and the homegrown revolutionary terrorists of the 1970s\nThe Weathermen. The Symbionese Liberation Army. The FALN. The Black Liberation Army. The names seem quaint now, when not forgotten altogether. But there was a stretch of time in America, roughly between 1968 and 1975, when there was on average more than one significant terrorist act in this country every week, and the FBI combated these groups and others as nodes in a single revolutionary underground, dedicated to the violent overthrow of the American government.\n\nBenefiting from the extraordinary number of people from the underground and the FBI who speak about their experiences for the first time, Days of Rage is filled with important revelations and fresh details about the major revolutionaries and their connections and about the FBI and its desperate efforts to make the bombings stop. The result is mesmerizing and completely new—a book that takes us into the hearts and minds of homegrown terrorists and federal agents alike and weaves their stories into a spellbinding secret history of the 1970s.", "source": "Facebook", "date": "2016-04-07T19:00:00-04:00", "name": "Meet Author & Journalist Bryan Burrough for a Discussion of 'Days of Rage'"}]