[{"description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2017-02-06T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/195810100885174/", "name": "Wine, Women, and Song XV"}, {"description": "Come watch a Free live streaming of \"Gender Revolution\" as it airs on National Geographic. It's a 2 hour special on gender hosted by Katie Couric.\n\nWe'll have pizza, other light snacks, and drinks downstairs starting at 8:30, and the airing starts upstairs at 9 PM. The special airs from 9-11 PM. If anyone is interested, we'll be sticking around to discuss and debrief afterward until 11:30 PM.\n\nSpace is somewhat limited, so arrive early to secure seating.\n\nThis event is hosted at Jim Toy Community Center, which is a resource center that exists to provide information, education, social events, and advocacy by and for the Queer and Ally community in the Washtenaw County area. JTCC welcomes all who support its mission to participate in its activities.", "date": "2017-02-06T20:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/294043017665724/", "name": "Screening of \"Gender Revolution\" by Nat Geo"}, {"description": "A full sensory experience with 8 wines, cheese, and charcuterie! Enjoy tasting 8 Spanish wines served with hors d'oeuvres in a mix & mingle setting, with a briefing on each wine!\n\nWe are featuring Spanish Wines for this tasting!", "date": "2017-02-07T18:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1740380069610961/", "name": "Sava's Uncorked: Spanish Wines"}, {"description": "This program is free and open to the public. Seating is first-come, first-served.\n\nJoin two incomparable artistic duos— Amy Burton and John Musto, and William Bolcom and Joan Morris—for a cabaret evening of songs and duets by Gershwin, Porter, Coward, Bolcom, Musto and other favorites. Mr. Musto appears courtesy of the 2017 William Bolcom Guest Residency in Composition.\n\nThe SMTD@UMMA performance series is generously supported by the Katherine Tuck Enrichment Fund and the Greg Hodes and Heidi Hertel Hodes—Partners in the Arts Endowment Fund.", "date": "2017-02-07T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1638958979732559/", "name": "Double Date: SMTD at UMMA"}, {"description": "Three course dinner paired with three vintage beers.\n\nCOURSE ONE: Butternut squash soup with roasted squash crostini, spiced creme fraiche and fried sage leaves\nPAIRED WITH: maracaiBo especial 2015 vintage reserve \n\nCOURSE TWO: salad of radicchio, Belgian endive frisee,\npears & golden raisins with maple Bacon vinaigrette \nPAIRED WITH: fuego del otono 2014 vintage reserve\n\nCOURSE THREE: Beer Braised Beef short riBs with creamy polenta, caramelized onions and crispy shiitake mushrooms\nPAIRED WITH: noel de calaBaza 2014 vintage reserve\n\n$30 PER GUEST • RESERVATIONS ARE APPRECIATED,\nBUT WALK-INS WILL BE ACCEPTED", "date": "2017-02-07T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/159464701221308/", "name": "Vintage Biere Dinner"}, {"description": "Give the Gift of Fine Dining\nEnjoy FREE MSV Promo Gift Cards* with your purchase.\n\nPurchase $250 or more in Gift Cards and get a free $25 Promotional Gift Card for every $250 spent.     \n\nPurchase $1,000 or more in Gift Cards, and get $50 free in Promotional Gift Cards for every $250 spent. \n\nMSV Holiday Combo Package \nFor only $75 get $50 in Gift Cards and TWO Distinctive Recipes Cookbooks. \n\nMSV Distinctive Recipes Cookbook\nOur MSV Distinctive Recipes cookbook lets you share in the experience of preparing uniquely styled entrées and award-winning recipes. It’s a great gift for those who love to cook! Offered now for only $19.95* (reg. $35).\n\n*Offered for a limited time only 11/1/2015– 12/31/2015, while supplies last.", "date": "2017-02-07T23:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/945758482163704/", "name": "Give the Gift of Fine Dining!"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "date": "2017-02-08T08:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/324709987912141/", "name": "10% For Good for Community Action Network"}, {"description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "date": "2017-02-08T17:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/731926473638010/", "name": "Sunseed Farm CSA Pickup"}, {"description": "The mission of The Open Organization Of Lockpickers is to advance the general public knowledge about locks and lockpicking. By examining locks, safes, and other such hardware and publicly discussing our findings, we hope to strip away the mystery with which so many of these products are imbued.\n\nAll are welcome.  If you have any locks or tools, feel free to bring\nthem.  If not, there is plenty to go around.  Meetings generally\nconsist of people picking locks while we talk about physical or cyber security, or just about anything else. \n\nhttp://a2-locksport.org/", "date": "2017-02-08T18:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1804153909846774/", "name": "The Open Organization Of Lockpickers (second Wed of the month)"}, {"description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "date": "2017-02-08T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/254338798323472/", "name": "Sing Happy!"}]