[{"source": "Facebook", "name": "10% For Good for Community Action Network", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/324709987912141/", "date": "2017-01-14T08:00:00-05:00"}, {"source": "Facebook", "name": "Intro to Stagecraft Workshops", "description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "url": "https://www.facebook.com/events/1716505231999811/", "date": "2017-01-14T10:00:00-05:00"}, {"source": "Facebook", "name": "Ruff: A Play for the Very Young", "description": "Spinning Dot Theatre Presents: Ruff\nRuff is Spinning Dot Theatre’s new play for the very young – aimed at 0-5 year olds but fun for the whole family!\n​\nA dog and a stranded sailor’s magical adventure with shadow puppets, music and lights! Ruff is a one woman show conceived by and performed by Kelly Joyce Fielder, Spinning Dot Theatre’s Associate Artistic Director. The performance is 15 minutes long with interactive activities for audience members before and after the performance.\n​\nTickets: $10 for adults, $5 for children\n​\nAbout Spinning Dot Theatre:\nSpinning Dot Theatre creates innovative and exciting international plays for kids and their families. For everyone, really.\n​\nGlobal stories make the world feel bigger and smaller at the same time. And our world needs that right now – especially young people. Spinning Dot Theatre launched in August 2014 with the goal to make great global theatre to inspire and connect our audiences with the rest of the world.", "url": "https://www.facebook.com/events/1157056917702191/", "date": "2017-01-14T10:30:00-05:00"}, {"source": "Facebook", "name": "Icebreakers^2", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/1051645534934086/", "date": "2017-01-14T16:00:00-05:00"}, {"source": "Facebook", "name": "Pointless Improv with Human Amusements and Drama Club", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Human Amusements \nGroup 2: Drama Club\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/1627901624179228/", "date": "2017-01-14T20:00:00-05:00"}, {"source": "Facebook", "name": "Bassover Takeover: Blaqout + Brightside w/ L@chjaw & more!", "description": "Magical Mitten Productions Presents: Blaqout, Brightside, DJ Lachjaw, KAZRK, KNGHT, Tek - Mazter and Tetra!!\n\n>>>What is a Bassover Takeover?<<<\nThe Bassover Takeover is night filled with great music, beautiful artwork and friends new and old. We bring together some of the best names in modern bass music and pair that with local artists and vendors to create a truly immersive experience that satisfies all of your senses. \n\nDoors at 8pm \n18+ With Proper ID\n$10/12 Presale $15 Day off \n\n>>>>TICKET LINK<<<<\nhttps://www.eventbrite.com/e/bassover-takeover-blaqout-brightside-w-lchjaw-kngkt-kazrk-more-tickets-30690920369\n\n==MUSIC==\n+++  Tetra +++\nElectronic Live Music - Dance, Jazz, Deep House. Live Guitar and Vocals. Based in Michigan.\n\n+++ Tek - Mazter ++++\nTek-Mazter is in the game for the love of the music and the process of creating it for other people's ears to enjoy. He never sticks to performing or creating just one genre, his mixes and tracks consist of anything from the heaviest Riddim Dubstep to Chill Trap. In his short career he has performed alongside DJ Starscream (Slipknot's DJ), has been local support for Ghastly, Truth, Eptic, YOOKiE, AB The Thief and Toadface, opened for Timeflies & Walk Off The Earth, DJ'd for D12's Bizarre and has played some legendary venues such as The Detroit Masonic Temple, St. Andrews Hall, Necto Nightclub, Elektricity Nightclub and The Works Nightclub.\n\n+++ KNGHT +++\nMy name is Brendan Knight \nI perform and produce Experimental Bass music\nMichigan is my home and I love what I do!\n\n+++ KAZRK +++\nThis Bass Duo has residencies at some of the hottest dance bars and nightclubs throughout the state of Michigan, and have had massive opening sets for headliners such as Nghtmre, Slander, Funtcase, Liquid Stranger, Skism, Trampa, Ghastly, and many more. Now before you think they're just a one-genere style Duo, think again. KAZRK has a broad spectrum for music ranging from all ends of electronic dance music, hip-hop, and rap genres. Farthest from the common mixing styles, no two sets are ever the same. With mixing abilities take you on a journey throughout each genre telling a story unlike any other. As each set progresses, you'll find yourself at the other end of the musical spectrum.\n\n+++ DJ Lachjaw +++\nDJ Lachjaw - A local Detroit DJ that brings the heat to the stage is going on his 5th year mixing music starting out back in 2012. He has built his reputation by standing out and perfecting his craft. If you've seen him perform you know it's far from a mellow disappointment so be ready for a dish of a full force brutal double dropping bass chopping experience. Over the years he has supported many artists opening the stage for Funtcase, Sewer Sessions, Subtronics, Boogie T and many more. \n\n+++  Brightside +++\nFor the 25 year old Queens native producer, Brightside, it's not just about the music, it's about the movement. His vision is to produce auditory art that brings people together and creates a sense of community. Brightside has a predominantly mid-tempo sound, drawing inspiration from all ends of the spectrum. In a conscious effort to reach all audiences, Brightside samples a widely eclectic library of music from all around the world, creating psychedelic sounds with Middle Eastern, Asian, Classic Rock, Hip-Hop and even Reggae flare.\n\n\n+++  Blaqout +++\nWhether you've seen him live, or heard of the barrage of releases that have been coming out, Lance \"Blaqout\" Dean has a firm grip on what he's doing and is not looking to stop anytime soon. This young producer heiling from St. Louis, Missouri has proven what others have told him to be impossible, or improbable. At a mere 16 years of age, UK-based record label Relentik Records signed him to his first deal and it's snowballed from there, to say the least. Shortly afterwards, his hometown radio station caught wind of his perserverence and passion and began playing some of his tracks,\nshortly after an insightful interview took place, which really showed just how much this artist lives, and breathes music.\n\n-----------VENDORS------------\nPhiber Printing\nMI kulture\n\n-----------Live Art---------------\nTBA!", "url": "https://www.facebook.com/events/143362169483025/", "date": "2017-01-14T21:00:00-05:00"}, {"source": "Facebook", "name": "Pointless Improv with Drama Club and Human Amusements", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Drama Club \nGroup 2: Human Amusements\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/1230992306980244/", "date": "2017-01-14T22:00:00-05:00"}, {"source": "Facebook", "name": "Family Art Studio: Making African Masks", "description": "Family Art studio sessions run 11am-1pm and 2–4 pm.\nRegistration is required: email umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11:00 a.m. session or the 2:00 p.m. session and how many adults and children are in your group.\n\nCreate your own art project inspired by UMMA's exhibition Traces: Reconstructing the History of a Chokwe Mask and other masks in UMMA's African art collection. Designed for families with children ages 6 and up to experience art together. Local artist and long-time UMMA docent Susan Clinthorne will lead families on an exploration of the gallery followed by a hands-on workshop. Parents must accompany children.\n\nFamily Art Studio is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.\n\nLead support for the exhibition Traces: Reconstructing the History of a Chokwe Mask is provided by the James and Vivian Curtis Endowment. Additional generous support is provided by the University of Michigan Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund and African Studies Center.", "url": "https://www.facebook.com/events/153728995112495/", "date": "2017-01-14T23:00:00-05:00"}, {"source": "Facebook", "name": "Intro to Stagecraft Workshops", "description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "url": "https://www.facebook.com/events/1716505231999811/", "date": "2017-01-15T10:00:00-05:00"}, {"source": "Facebook", "name": "Ann Arbor Restaurant Week", "description": "Ann Arbor Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price.\n\nVinology Wine Bar and Restaurant is proud to be part of this great event, offered from January 15 - 20.  Enjoy a three course dinner for only $28!", "url": "https://www.facebook.com/events/1844201079197076/", "date": "2017-01-15T10:00:00-05:00"}]