[{"date": "2017-03-18T09:30:00-04:00", "source": "Facebook", "description": "Zingerman’s Roadhouse has put together 205 special dinners, and we are excited to provide our first special brunch on March 18, 2017. Chef Alex and our talented Catering Manager, Caitlin Doyle, will create an unforgettable experience that highlights the best of really good Irish cuisine. Look forward to Boxty with Smoked Salmon, Dublin Coddler, Irish Oats, and more.", "name": "The First Roadhouse Special Brunch: A Taste of Ireland", "url": "https://www.facebook.com/events/238729963252164/"}, {"date": "2017-03-18T10:00:00-04:00", "source": "Facebook", "description": "Join Epic Races for the 2017 Waterloo G & G, presented by the Wolverine State Brewing Company. This cycling event features 50K and 100K competitive distances as well as a 10-mile fun ride. Fat-bike and single-speed competitive categories! For full details and to register, visit our web site at http://www.epicraces.com/event/g-and-g/", "name": "Waterloo G&G Gravel Road Race (formerly Waterloo Grit & Gravel)", "url": "https://www.facebook.com/events/355184074850425/"}, {"date": "2017-03-18T11:15:00-04:00", "source": "Facebook", "description": "Children ages four to seven are invited to hear a story in the galleries. On March 18 we will meet in the Chinese gallery and hear a story about the Queen Mother of the West and the dragon’s pearl. After the story, children will make a rubbing to remind them of their visit, to take home with them. Parents must accompany children. Siblings are welcome to join the group. Meet in front of the UMMA Store.\n\nStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "name": "Storytime at the Museum", "url": "https://www.facebook.com/events/157263878114353/"}, {"date": "2017-03-18T12:00:00-04:00", "source": "Facebook", "description": "The U-M History of Art Department celebrates the Bicentennial with this symposium featuring renowned artist and U-M alumna Michele Oka Doner, and History of Art faculty Alex Potts, and Rebecca Zurier.\n\nThis symposium explores the art historical and cultural significance of two pioneering exhibitions of Pop Art, held at the University of Michigan Museum of Art in 1963. In those years the concept of Pop was under construction. Subjects addressed in the art— consumer culture, food and other appetites, technology and the mass media, the Cold War, women’s roles—were live issues at the University. By showcasing artists whose work was too raw or unusual to become part of the later canon, this event helps revise historical understanding of the early 1960s and opens a window into creative life at the University. The symposium will include presentations by noted art historians, followed by a discussion with alumni whose minds were blown as art students at time of the exhibitions.\n\nThis LSA Bicentennial Theme Semester event is presented with support from the U-M College of Literature, Science, and the Arts, the University of Michigan Bicentennial Office, and the U-M History of Art Department. Additional support provided by the Department of History, the Eisenberg Institute for Historical Studies, and the University of Michigan Museum of Art.", "name": "Pop Art Comes to Michigan, 1963", "url": "https://www.facebook.com/events/580199198838102/"}, {"date": "2017-03-18T12:00:00-04:00", "source": "Facebook", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration", "url": "https://www.facebook.com/events/1724899501156129/"}, {"date": "2017-03-18T14:00:00-04:00", "source": "Facebook", "description": "FREE\n\nJoin dancers from Kidd Pivot  for an exploration of the company’s movement style.\n\nNo dance training or experience necessary, and all levels, ages 13 and up, are welcome. Free, but first come, first served until studio reaches capacity. \n\nSign-Up begins at 1:15 pm at the Y Welcome Desk.", "name": "You Can Dance: Kidd Pivot", "url": "https://www.facebook.com/events/909395659196445/"}, {"date": "2017-03-18T18:00:00-04:00", "source": "Facebook", "description": "Become a herpetologist when you study reptiles and amphibians in this hands-on program. Investigate the similarities and differences between these incredible cold blooded animals, use your new skills to practice identifying different herps you might find in your own back yard, and meet some scaly and slimy creatures up close. \nAges: 5-12 years and their families\n$9 per person or $34 per family ($8 per member or $30 per member family)", "name": "Hooray for Herps", "url": "https://www.facebook.com/events/320518125017069/"}, {"date": "2017-03-18T20:00:00-04:00", "source": "Facebook", "description": "The Guardian in London asserts, “There’s just a handful of living composers who can legitimately claim to have altered the direction of musical history, and Steve Reich is one of them.”\n\nReich, who has been called “our greatest living composer” (New York Times), celebrates his 80th birthday in 2016, and the year also marks the 40th anniversary of the premiere of Music for 18 Musicians, considered by many to be his greatest composition. Two of Chicago’s world-class ensembles, Eighth Blackbird and Third Coast Percussion, team up to perform this seminal composition.\n\nMore info: http://ums.org/performance/steve-reich-80/", "name": "Steve Reich at 80", "url": "https://www.facebook.com/events/1701619326773112/"}, {"date": "2017-03-18T20:00:00-04:00", "source": "Facebook", "description": "Some questions are impossible to answer and some experiences too personal to express.\n\nCrystal Pite, the choreographer who brought The Tempest Replica to Ann Arbor four seasons ago, is back with her 2015 work for Kidd Pivot and Electric Company Theatre: Betroffenheit, which means a sort of shock, speechlessness, and bewilderment. This searing work has its roots in a deeply personal tragedy, the deaths of writer Jonathon Young’s teenage daughter and two cousins in a fire. With unflinching honesty, it achieves broad resonance as it touches on themes of loss, trauma, addiction, and recovery through a boundary-stretching hybrid of theater and dance. “A stunning testament to what can happen when life turns into art.” (The Globe and Mail)\n\nMore info: http://ums.org/performance/betroffenheit/", "name": "Betroffenheit: Kidd Pivot and Electric Company Theatre", "url": "https://www.facebook.com/events/240524153002004/"}, {"date": "2017-03-18T21:00:00-04:00", "source": "Facebook", "description": "///VulfPunk Night///\nAn evening of Vulfpeck and Daft Punk covers/mashups at The Blind Pig in Ann Arbor. Four Michigan bands will be teaming up to combine the funkier-than-blue cheese pleasures of Vulfpeck with the sleek sexiness of Daft Punk. Maybe this will help to hold you over until Vulf comes speedwalkin' into town May 12th? Inmuso, LLC will be lighting things up for the night! Get to know the bands below\n\n$8, Doors @ 9, 18+\n\nTickets available here:\n://www.ticketweb.com/t3/sale/SaleEventDetail?eventId=7228015&pl=blindpig&dispatch\n\nSet times:\nPaddlebots: 9:30-10:20pm\nAct Casual: 10:35-11:25pm\nChirp: 11:40-12:30am\nStormy Chromer:  12:45am\n\n\nChirp (Ypsilanti)\nRock/Funk/Fusion\nhttps://chirp.bandcamp.com/\nhttps://www.youtube.com/watch?v=qwMrAaFNIJg\n\nStormy Chromer (Ypsilanti)\nRock/Improg\nhttp://www.stormychromer.com/\nstormychromer.bandcamp.com\n\nAct Casual (Detroit)\n2 parts crunch, 1 part groove and a dash o' funk\nhttps://soundcloud.com/actcasualmusic\n\nPaddlebots (MI)\nProgressive Soul-Pop\nhttp://paddlebotsmusic.com/\nyoutube.com/Paddlebotsmusicofficial", "name": "VulfPunk Night w/ Chirp, Stormy Chromer, Act Casual, Paddlebots", "url": "https://www.facebook.com/events/1803925543158487/"}]