[{"date": "2016-07-02T17:00:00-04:00", "source": "Facebook", "description": "Ann Arbor’s Madelyn Grant is a young R&B singer who grew up listening Aretha Franklin, Marvin Gaye, Lauryn Hill, D’Angelo, Erykah Badu, Little Dragon, and Lianne La Havas. Her original lyrics are emotionally driven and empowering, and her sultry voice and smooth tone hypnotize listeners. Though Grant has just started playing clubs and festivals, she has written music and collaborated with ODESZA, FKJ, and Emancipator, with more collaborations and a solo EP in the works. The single “Waiting” from French producer FKJ features her vocals and has over a million plays on SoundCloud. Expect big things from this talented artist.\nWebsite: http://madelynmgrant.wix.com/madelyngrantmusic", "url": "https://www.facebook.com/events/1722814468006192/", "name": "Madelyn Grant"}, {"date": "2016-07-02T17:00:00-04:00", "source": "Facebook", "description": "A series of mind-body sessions at Top of the Park, this alternative happy hour lets you enjoy a relaxing late afternoon workout with classes in Yoga, Tai Chi, Aikido, World Dance, Capoeira, and Hula Hooping.\n\nLed by experienced practitioners, all sessions are free, and take place from 5 to 6 pm every Tuesday through Sunday on the Power Center Lawn.\n\nLearn foundational moves and hoop your way into fantastic shape! Hooping tones your entire body while strengthening and opening your upper back and chest. Hooping also helps increase your balance and get great a cardio workout while having fun!\nDiva Hoops Website: http://www.divahoops.com", "url": "https://www.facebook.com/events/1109573199082114/", "name": "Retreat: Hula Hoop Fitness"}, {"date": "2016-07-02T17:00:00-04:00", "source": "Facebook", "description": "Join Caitlin for 30 minutes of sheer yoga fun!  Kids will get to connect with their surroundings through animal and nature poses, work with a new friend to master a partner pose, and play yoga games.\nAn interactive area for our youngest festival-goers, the KidZone tent provides a fun and safe area for children and their parents to discover and explore a wide variety of hands-on activities with different community partners. From learning karate, creating homemade instruments, or meeting prehistoric critters, KidZone offers different nightly activities for families at Top of the Park.\nLed by community partners, all sessions are free, and take place from 5 to 8 pm every Tuesday through Sunday at the KidZone tent at Top of the Park.\nAnn Arbor YMCA's Website: www.annarborymca.org", "url": "https://www.facebook.com/events/175989329469169/", "name": "KidZone: Ann Arbor YMCA"}, {"date": "2016-07-02T18:00:00-04:00", "source": "Facebook", "description": "A long celebrated Ann Arbor acoustic blues duo, Shari Kane & Dave Steele throw a four handed guitar party of original and time-honored blues, gospel, swing, and ragtime. Steeped in Steele’s smoky vocals, percussive rhythm, and innovative lead lines, and Kane’s crisp picking style, rootsy leads, and stinging slidework, their music has been described as “street swing and stomp blues\"—like a testament to sounds once heard on the streets of Harlem, the juke joints of Mississippi, or from the jug bands of Memphis. Their latest album, Feels Like Home, was recorded at their house and was nominated by the WYCE Jammies for Best Blues CD, Song of the Year, Best Production in 2016.\n\nWebsite: http://sharianddaveblues.com/", "url": "https://www.facebook.com/events/885531884909763/", "name": "Shari Kane and Dave Steel"}, {"date": "2016-07-02T19:00:00-04:00", "source": "Facebook", "description": "Trumpeter Ingrid Racine returns to Top of the Park to lead her jazz quartet in original compositions that reflect her R&B, hip-hop, rock, and modern jazz influences. Born and raised in Ann Arbor, this powerful improviser toured internationally and nationally with the band NOMO and has mentored many local young musicians as part of the leadership of the Neutral Zone. These days she can be found playing weekly at the Gandy Dancer and The Raven’s Club, and moving between her quartet, The Heather Black Project, and The Gin Dandies. This year she released the album Concentric Circles.\nWebsite: http://www.ingridracine.com/#!about/c2414", "url": "https://www.facebook.com/events/1180583908638801/", "name": "Ingrid Racine Quartet"}, {"date": "2016-07-02T20:15:00-04:00", "source": "Facebook", "description": "Land of the free, home of the brave. What’s more American than a party marching band? Celebrate Fourth of July amidst Environmental Encroachment’s freedom of expression: wild and colorful self-styled outfits, flying hula hoops, and tons of booming brass. This massive ensemble will have everyone smiling and dancing as they lead an unforgettable parade through Top of the Park and up onto Rackham Stage. If you went crazy for spectacles like last year’s MarchFourth!, you will love this outrageous and energetic band of misfits.\nWebsite: http://www.encroach.net/", "url": "https://www.facebook.com/events/183160302079783/", "name": "Environmental Encroachment"}, {"date": "2016-07-02T22:15:00-04:00", "source": "Facebook", "description": "With lively shows that echo the Stax-Volt legacy, Lady Sunshine and the X-Band is a true product of the Motor City and is a reflection of the very essence of Detroit—emotion, fire, pride, and soul. In 2013, Lady Sunshine & the X Band were International Blues Challenge semifinalists and, in 2014, released their latest album, Big and Sexee! Put on your dancing shoes and welcome back this blues and soul powerhouse for another smokin’ hot set at Top of the Park!\nWebsite: http://www.ladysunshine.net/fr_home.cfm", "url": "https://www.facebook.com/events/518700224983601/", "name": "Lady Sunshine and The X-Band"}, {"date": "2016-07-03T11:00:00-04:00", "source": "Facebook", "description": "We don't know who came up with the idea of chicken and waffles, but let's go ahead and call them a genius. We're going a step further and making it a sandwich. Oh, and we decided it needed some bacon, too :)  $5, and we'll have 'em until we run out!", "url": "https://www.facebook.com/events/815625868573753/", "name": "Chicken and Waffles!"}, {"date": "2016-07-03T16:00:00-04:00", "source": "Facebook", "description": "The Mighty Oak will host Detroit City FC at Pioneer High School’s Hollway Field on July 3rd for the first time in club history.  The match time, originally scheduled for 1pm, has been pushed back to 6pm. \n\nRIDE THE BUS!!! Meet up with AFC Ann Arbor fans at Arbor Brewing Company for the official AFCAA Tailgate event at 4pm!  Enjoy pre-game drinks and ride our FREE shuttle to and from the game.  \n\nShuttles start 1 hour prior to match time.\n\nTickets for the match can be purchased in advance online for $8 ($10 at the gate).", "url": "https://www.facebook.com/events/1816189055279731/", "name": "AFC Ann Arbor Tailgate Bus"}, {"date": "2016-07-03T17:00:00-04:00", "source": "Facebook", "description": "A series of mind-body sessions at Top of the Park, this alternative happy hour lets you enjoy a relaxing late afternoon workout with classes in Yoga, Tai Chi, Aikido, World Dance, Capoeira, and Hula Hooping.\n\nLed by experienced practitioners, all sessions are free, and take place from 5 to 6 pm every Tuesday through Sunday on the Power Center Lawn.\n\nCome stretch, strengthen and flow with this fun, creatively sequenced Vinyasa Flow class!\nSharpen your intuition and connect body and mind. Experience yoga as a work-out and also as a \"work-in\". Strengthen yourself externally AND internally. Take this awareness off the mat and into your life. Class taught by Marty Betts, Certified Yoga Alliance Instructor and NASM Certified Personal Trainer. All levels are welcome! Please bring a mat or beach towel.\nWebsite: http://www.yogaflexmartina.com/", "url": "https://www.facebook.com/events/606930009483900/", "name": "Retreat: Vinyasa Core Flow with Mary Betts"}]