[{"source": "Facebook", "url": "https://www.facebook.com/events/1008319905968712/", "description": "March 11–August 20, 2017\nPhotography Gallery\n\nIn 2013, artist Ernestine Ruben (BSDEs ’53) photographed the once-famed industrial complex Willow Run in Washtenaw County, Michigan. Designed by her grandfather, Detroit architect Albert Kahn, for the Ford Motor Company, Willow Run was an exemplar of American defense manufacturing because of its efficient mass-production of B-24 Liberators during World War II.\nFor this exhibition, Ruben overlaid interior views of the now-dormant factory with imagined glimpses into her body’s interior landscape. The resulting compositions seem to breathe energy and light into the stagnant and cavernous spaces of Willow Run and suggest a longing for a productive existence undeterred by mortality for both Willow Run and the artist. Her grandfather’s role in the history of the site underscores Ruben’s personal connection.\nThe exhibition presents Ruben’s photographs of Willow Run in UMMA’s Photography Gallery and an original film—co-created by Ruben and video artist Seth Bernstein and featuring an original score by award-winning composer Stephen Hartke—in the Museum’s Forum.\n\nLead support for Ernestine Ruben at Willow Run: Mobilizing Memory is provided by the University of Michigan Office of the Provost and the Herbert W. and Susan L. Johe Endowment.", "date": "2017-03-12T12:00:00-04:00", "name": "Ernestine Ruben at Willow Run: Mobilizing Memory"}, {"source": "Facebook", "url": "https://www.facebook.com/events/382773282083559/", "description": "This program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.\n\nAfter a 2013 visit to the once-famed industrial complex Willow Run in Washtenaw County, Michigan, Ernestine Ruben photographed the now-dormant mechanical ruins that were designed and built during World War II by her grandfather, renowned Detroit architect Albert Kahn. Join Ms. Ruben and Assistant Curator of Photography, Jennifer Friess, for a discussion of the exhibition and a screening of Ruben’s new short film, Willow Run—with an original score by Grammy Award-winning composer Stephen Hartke and created in collaboration with video artist Seth Bernstein.\n\nLead support for Ernestine Ruben at Willow Run: Mobilizing Memory is provided by the University of Michigan Office of the Provost and the Herbert W. and Susan L. Johe Endowment.", "date": "2017-03-12T15:00:00-04:00", "name": "In Conversation: Mobilizing Memory at Willow Run"}, {"source": "Facebook", "url": "https://www.facebook.com/events/180886465738171/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "date": "2017-03-12T16:00:00-04:00", "name": "Beer and Board Games"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1263507683742565/", "description": "Come to Pointless to play in a long form jam! Sign up for a spot when you get here, and each group gets ... you guessed it ... eight Pointless minutes. All experience levels welcome. Come to watch or to play.\n \nIt's free for participants, pay-what-you-can for spectators.", "date": "2017-03-12T19:00:00-04:00", "name": "8 Pointless Minutes - A Long Form Improv Jam"}, {"source": "Facebook", "url": "https://www.facebook.com/events/340989426297521/", "description": "Alley Bar is once again partnering with A2CT for their Give Back Thursdays program!  Here's how it works: Alley Bar donates 10% of their sales each Thursday in March to A2CT.  So come on out., hang out with friends, support a great local bar AND your favorite theatre! Hope to see you there.", "date": "2017-03-12T20:00:00-04:00", "name": "Give Back Thursdays"}, {"source": "Facebook", "url": "https://www.facebook.com/events/614995318650187/", "description": "VIDEO PREVIEW: https://www.youtube.com/watch?v=H4PpvXNZK3I\n\nMORE INFO: http://ums.org/performance/the-beauty-queen-of-leenane/\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.", "date": "2017-03-12T20:30:00-04:00", "name": "The Beauty Queen of Leenane: Druid"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1877727032438874/", "description": "Ann Arbor Civic Theatre presents Almost, Maine by John Cariani, directed by Kat Walsh, March 9-12, 2017, at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, and $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org. \n \nAlmost, Maine is a town so far north, it’s almost in Canada, almost not in the United States, it’s just … Almost. On a cold, clear night in this remotest of towns, witness nine stories of residents falling in and out of love in the strangest of ways. Set against the hovering northern lights, hearts get broken, knees get bruised, and love is lost, found, and confounded. It’s love. But not quite.\n \nThe subject of this critically acclaimed play is something that veteran director Kat Walsh sees as universal to audiences, and her direction aims to make that connection. “Meaningful relationships require vulnerability --- it means allowing yourself to be fully seen and heard by another person and risking rejection. John Cariani brilliantly captures these inspiring, and yes frightening, moments in his play, Almost, Maine,\" shared director Walsh. \"Our actors and production staff have the heroic task of portraying these acts of courage on stage for an audience. We want to tell these stories simply and honestly.”\n \nThe talented cast of Almost, Maine includes Andrew Benson, Elizabeth Docel, Matthew Flickinger, Chris Grimm, Lawrence Havelka, Chris Joseph, Rachael Kohl, Stephanie Laurinec, Joe Lopez, Matthew Miller, Scott Mooney, Sara Rose, Codi Sharp, Megan Shiplett, and Michelle Weiss.", "date": "2017-03-12T20:30:00-04:00", "name": "Almost, Maine"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1006014226188234/", "description": "Can't make it to Ann Arbor on March 26? You can still participate in the Probility Ann Arbor Marathon by registering for our Virtual Half Marathon! Virtual participants run or walk 13. 1 miles at a location of their choosing: at a park, on a trail, on a treadmill, even in a different part of Ann Arbor! All Virtual Half Marathons must be completed between February 1 and March 26. When you've completed your Virtual Half Marathon, tell us about it! Post your stats, photos, and story here on the Probility Ann Arbor Marathon Virtual Half Facebook event page; if you post on Twitter, be sure to tag @epicraces and @a2marathon. Best of all, you get the same race shirt and medal as those who join us in downtown Ann Arbor for the actual event!\n\nPlease note: Epic Races does not ship swag to Canada or internationally. If you are a resident of Canada or another country and wish to participate in an Epic Races virtual event, please provide us with a U.S. shipping address.", "date": "2017-03-13T00:00:00-04:00", "name": "2017 Probility Ann Arbor Marathon Virtual Half Marathon"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1860126057346312/", "description": "“Assembled Works” Multi-Media Workshop\nAlice Vander Vennen\nIn this workshop participants will work with a variety of textiles, including remnants of their own stitched, embroidered and/or embellished work, quilts, knitting, beads, unfinished projects, antique handwork, new fabrics, and found pieces of textiles – anything that “catches the eye”—and combine them with natural materials. Allowing the rich textures, brilliant colors and nuanced lines of stitched textiles to interact with the mysterious beauty of the imprinted stone, a gentle branch or a fragile leaf, students will create a framed (20” x 20”) stitched, three-dimensional textile assemblage. Instruction will be given for the steps used to create a fiber work composition, the techniques used to incorporate natural materials, and for finishing, mounting and framing the finished art work. Website: http://www.alicevandervennen.ca/   To register go to the Ann Arbor Fiberarts Guild website: www.annarborfiberarts.org", "date": "2017-03-13T10:00:00-04:00", "name": "“Assembled Works” Workshop"}, {"source": "Facebook", "url": "https://www.facebook.com/events/348084575586028/", "description": "NOTE: Orchid Festival dates are Sat. & Sun., March 18 & 19, 2017\n\nA two-day orchid extravaganza with orchid displays, orchids in bloom, and regional commercial vendors. Tropical and hardy orchids and orchid-growing supplies and related items for sale. Free informational talks and demos. Presented by Ann Arbor Orchid Society. Free. For hours, photos, and info follow this link: mbgna.blogspot.com/2017/02/2017-ann-arbor-orchid-festival-at.html", "date": "2017-03-13T15:00:00-04:00", "name": "Ann Arbor Orchid Festival"}]