[{"source": "Facebook", "url": "https://www.facebook.com/events/324709987912141/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "date": "2016-11-30T08:00:00-05:00", "name": "10% For Good for Community Action Network"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1516681205025263/", "description": "The works in Europe on Paper: The Ernst Pulgram and Frances McSparran Collection capture artistic compulsions and creative responses to the physical and spiritual world, from tangled, emotionally embroiled nudes to meticulous landscapes and architectural vistas. This exemplary gift from late U-M professor emeritus Ernst Pulgram and his wife, associate professor emerita and chief editor of the Middle English Compendium, Frances McSparran, offers a glimpse into the visually stunning and thought-provoking history of European graphic art. Join UMMA docents as they discuss the myriad artists in this exhibition including Austrian and German expressionists as well as the inventive Italian Giovanni Battista Piranesi.", "date": "2016-11-30T14:00:00-05:00", "name": "Guided Tour: Europe on Paper"}, {"source": "Facebook", "url": "https://www.facebook.com/events/915043408639445/", "description": "Our November Artists Meet & Greet topic is How To Create - an inexpensive - Artist Website. Join speaker Sean Hickey, COO of PWB for this free event, where you will learn resources and tips on how to create an effective website.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "date": "2016-11-30T18:00:00-05:00", "name": "How To Create An Artist Website"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1130960096991899/", "description": "Rise Again Community Sing-Along with Jeanne Mackey • Nov. 30; 7 p.m. in the Crazy Wisdom Community Room • Join song leader Jeanne Mackey for a community sing-along from the recently released Rise Again Songbook, a guide with lyrics to over 1200 songs, from Beatles to ballads, Dylan to Broadway. Purchase the songbook at Crazy Wisdom or use the store copy. Shower singers welcome! Suggested donation $5. Call 665-2757 or email rachel@crazywisdom.net.", "date": "2016-11-30T19:00:00-05:00", "name": "Rise Again Community Sing-Along with Jeanne Mackey"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1681957728800606/", "description": "Children of the New World introduces readers to a near-future world of social media implants, memory manufacturers, dangerously immersive virtual reality games, and alarmingly intuitive robots. Many of these characters live in a utopian future of instant connection and technological gratification that belies an unbridgeable human distance, while others inhabit a post-collapse landscape made primitive by disaster, which they must work to rebuild as we once did millennia ago.\n\nAlexander Weinstein is the Director of The Martha’s Vineyard Institute of Creative Writing and the author of the short story collection Children of the New World (Picador 2016). His fiction and translations have appeared in Cream City Review, Hayden's Ferry Review, Notre-Dame Review, Pleiades, PRISM International, World Literature Today, and other journals. He is the recipient of a Sustainable Arts Foundation Award, and his fiction has been awarded the Lamar York, Gail Crump, Hamlin Garland, and New Millennium Prize. His stories have been nominated for Pushcart Prizes, and appear in the anthologies 2013 New Stories from the Midwest, and the 2014 & 2015 Lascaux Prize Stories. He is currently teaching at the University of Michigan Residential College.", "date": "2016-11-30T19:00:00-05:00", "name": "Meet Alexander Weinstein for Discussion & Signing"}, {"source": "Facebook", "url": "https://www.facebook.com/events/144098819397112/", "description": "All week, all Garden of Life products are 35% off! That includes plant-based protein supplements, vitamins, and even special products just for kids. Stop in to chat with our friendly and knowledgable Natural Living team, and stock up on wellness!", "date": "2016-12-01T08:00:00-05:00", "name": "35% Off Garden of Life"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1855141028106007/", "description": "Every year, we ask members of the community to join us for an end-of-year potluck at the Jim Toy Community Center. This is an opportunity to meet and network with members of our board and reflect/celebrate the year.\n\nIt is also an opportunity to volunteer to help the Center thrive. In addition to enjoying good food and one another's company, we ask that attendees please help us prepare our end-of-year mailing. In past years, we've had such incredible turnout that this portion of the evening has been relatively quick.\n\nPlease sign up for the potluck at the form below:\nhttps://docs.google.com/spreadsheets/d/1_Y5Qz-s_YBVdzDtFn2K-gatv0Pz08XQw5Vqs1IdI0rM/edit#gid=0", "date": "2016-12-01T18:00:00-05:00", "name": "End-of-Year Potluck & Envelope Stuffing Party"}, {"source": "Facebook", "url": "https://www.facebook.com/events/649877431853670/", "description": "James Boggs (1919-1993) and Grace Lee Boggs (1915-2015) were two largely unsung but critically important figures in the black freedom struggle. Born and raised in Alabama, James Boggs came to Detroit during the Great Migration, becoming an automobile worker and a union activist. Grace Lee was a Chinese American scholar who studied Hegel, worked with Caribbean political theorist C. L. R. James, and moved to Detroit to work toward a new American revolution. As husband and wife, the couple was influential in the early stages of what would become the Black Power movement, laying the intellectual foundation for racial and urban struggles during one of the most active social movement periods in recent U.S. history. \n\nStephen Ward details both the personal and the political dimensions of the Boggses' lives, highlighting the vital contributions these two figures made to black activist thinking. At once a dual biography of two crucial figures and a vivid portrait of Detroit as a center of activism, Ward's book restores the Boggses, and the intellectual strain of black radicalism they shaped, to their rightful place in postwar American history.\n\nStephen Ward, Associate Professor at the University of Michigan Residential College, is a historian in the Social Theory and Practice program and is jointly appointed in the Department of Afroamerican and African Studies. He was the founding coordinator of the Urban Studies minor and serves as the faculty director of the Semester in Detroit program. He teaches courses in African American history, urban and community studies, and Detroit history. He is the author of In Love and Struggle: The Revolutionary Lives of James and Grace Lee Boggs (2016) and the editor of Pages From a Black Radical's Notebook: A James Boggs Reader (2011). He is a board member of the James and Grace Lee Boggs Center to Nurture Community Leadership in Detroit.", "date": "2016-12-01T19:00:00-05:00", "name": "Meet U of M RC Prof & Author Stephen Ward"}, {"source": "Facebook", "url": "https://www.facebook.com/events/978748282251935/", "description": "Come out of the cold and see some of your favorite Burlesque performers! Also, an amazing live band! Doors at 9:30p, show at  10:30p\n\nFeaturing:\nGala Delicious\nBethany Cinna Moan\nKitt Y. Bourree \nSadie Sparkles \nThe hostest with the mostest: Bunny Valentine\n\nLive band Krillin!\n\nGogo from Kitty Hawkk and Sophia LeStardust!", "date": "2016-12-01T22:30:00-05:00", "name": "Snow Queens of Cups"}, {"source": "Facebook", "url": "https://www.facebook.com/events/723312037871156/", "description": "Don't miss our holiday display Avant Garden: Weaving Fashion & Nature Together. The exhibit explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs Saturday, November 26, 2016-Sunday, January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "date": "2016-12-02T10:00:00-05:00", "name": "Holiday Exhibit - Avant Garden"}]