[{"source": "Facebook", "date": "2016-03-27T09:00:00-04:00", "name": "Easter at Savas", "description": "Bring the whole family and enjoy Easter Brunch at Savas!\n\nWe will be adding on to our already fabulous brunch buffet to bring you an extraordinary dining experience!\n\nOur chef will be providing extra special and festive Easter treats as well as extending our hours! \n\nMake your reservation today by clicking the \"Ticket URL\" above.", "url": "https://www.facebook.com/events/202908986742891/"}, {"source": "Facebook", "date": "2016-03-27T10:00:00-04:00", "name": "Easter Brunch Buffet", "description": "Looking for an exciting way to celebrate Easter? For the first time EVER, Aventura will be offering a decadent brunch buffet and bloody mary bar!! \n\nMake your reservation today by clicking the \"Ticket URL\" above.\n\nEASTER BRUNCH BUFFET MENU 2016\n\nPastry & Sweets:\n\nAlmond Custard with Candied Walnuts \nCrema de Jerez; a chocolate sherry chiffon pudding\nHoney & Lemon Torrija\nCinnamon & Sugar Rolls\n\n\nSnacks & Salads:\n\nFresh Fruit Salad\nAsparagus and Manchego Salad\nEnsalada Rusa\nChampinones Rellenos; pork stuffed mushrooms\nGambas Al Ajillo; rock shrimp & green garlic\nHuevos Rellenos de Salmon; cured salmon & deviled egg\nAvocado Pintxo\nWhite Bean Pintxo\nAperitivo Selection of olives, cornichons, hummus, baba ghanoush, and pita chips\n\nHot Foods:\n\nBrown Sugar & Molasses Country Ham\nBraised Beef Empanadas\nTortillas de Patatas \nCreamy Polenta\nPatatas Bravas\nSmoked Bacon\nHerb & Chicken Sausage", "url": "https://www.facebook.com/events/203583416672360/"}, {"source": "Facebook", "date": "2016-03-27T10:00:00-04:00", "name": "Carson's Easter Brunch", "description": "Open 10am – 3pm \nEaster Sunday, March 27th\n\nFeaturing Easter Sunday Brunch!\nChef Alex Wannemacher’s Sunday Brunch menu is sure to delight your appetite!\n\nMenu: \nCarved Ham with Cranberry Glaze \nPrime Rib with Horsey Sauce\nBaked Whole Salmon with Lemon-Thyme Glaze\nTraditional and Blueberry Pancakes\nWaffles with your choice of Bacon Gravy or Strawberries\nScrambled Eggs\nHuevos Rancheros \nCorned Beef Hash \nThick Cut Bacon\nHash Browns\nSeasonal Vegetables\nFresh Fruit \nAssorted Salads\nVariety of Pastries Muffins, Breads, and English Muffins\n\nMake your Easter Sunday reservations at\n(888) 456-3463 (DINE) \nReservations Recommended \n\n$23.95 per person, tax and gratuity not included.\nJuice, Milk, Coffee, Tea, and Soda included.\nRegular menu available from 3pm-9pm.\n$9.95 per person for kids under 12 years old\nKids under 4 years old eat for free", "url": "https://www.facebook.com/events/236060406739159/"}, {"source": "Facebook", "date": "2016-03-27T19:00:00-04:00", "name": "Aventura March Madness", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/"}, {"source": "Facebook", "date": "2016-03-27T19:00:00-04:00", "name": "Open Stage", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/218509918499828/"}, {"source": "Facebook", "date": "2016-03-27T21:00:00-04:00", "name": "Young Fathers w/ HXLT & Captwolf 3/27/16 @ Blind Pig - Ann Arbor", "description": "Sunday, March 27 | 18+  |  Doors 9:00pm  |  $12 adv./ $15 day of \n\nYoung Fathers are DEAD.\nwsg: HXLT & CAPTWOLF\n\nOr, rather, DEAD is Young Fathers. Their first full-length album, released in February, 2014, on Anticon and Big Dada has been given the kind of critical appraisal normally held hidden in the filing cabinets of dusty music journos and only brought out, along with the bottle of fine blended whisky for those special occasions, those special rock occasions. You know the kind, when a credible bunch of guitar, bass and drum twenty-somethings from some northern town in the UK or from Indianapolis USA put something together in the studio that reaches out and reminds everyone that modern life isn’t rubbish. Which is a weird reaction for a group who sit in some non-categorisable space between genres ancient and modern, who take hiphop and pop and dip it in a tie-dye mix of Ronnettes and krautrock and ragga and dub and post-punk and afropsych… and make something, something, something.\n\nMany years before dropping DEAD the three individuals who became Young Fathers were apprentice young men. 14 years old, meeting in a sweaty dancing circle in the infamous original Bongo Club in Edinburgh, Scotland, UK. Moving to the in-your-face beats of early noughties hiphop, R&B and Dancehall and then at the end of the night, agreeing to meet at solemn faced would-be producer G’s house, to ‘make records’ on an ancient karaoke machine. The three of them, already looking like their future selves: Alloysious, city street holy man, sad eyes to the stars, past of the Liberian war atrocities buried in childhood scar tissue; Kayus, face exploding from frowns to huge laughter, pure naija boy on the outside but reflective and always feeling far away from his Nigerian home on the inside; and G, quietly watching and waiting for good things to come, practising the serious don’t fuck street face for the neds where he grew up, but nurturing a heart of soul.\n\nFrom the bedroom to the basement. It took them a few years before they found the small underground studio in Leith where they could perfect the uniqueness already nascent in the early days. Here they developed what they call, like the Sicilian mafia, ‘our thing’. Recording processes that involve ritual, musical techniques more usually found in bebop jazz, playing with ways to write lyrics and tunes, scouring the further reaches and always recoiling from cliché. But always, always staying true to the Rules of Pop which demand hooks, energy, sparkle, accessibility, passion and beats that vibrate below the waist. From this point came their first release, what was originally conceived as a mixtape, literally only available on individually recorded cassettes with hand printed sleeves: TAPE ONE was the moment, recorded in a week, ready to release in two.\n\nShortly thereafter, TAPE TWO was recorded and a deal with far-out Los Angeles hiphopping label, Anticon inked. TAPE TWO took the dirty mounds of its predecessor and moulded beautiful sand sculptures, sealed by the sea, with the same processes, the same inspiration, gone deeper, gone darker. A year after its release TAPE TWO wins the Scottish Album Of The Year Award (2014), an indication, perhaps, that people are really starting to get it. YFs are just happy more people are listening, even if that 20 grand prize money does come in handy for debts and mashed up gear. And a final, critical tick from the music business comes at the end of summer when the album is nominated for a Mercury award.\n\nDid I mention the live show? I don’t believe so… on an insane tour of the USA, UK and Europe, heading over to Australia, Japan, Russia and then back to Europe. A huge 27-date UK & European tour preceded standout performances at SXSW, with a 33-date US tour supporting Anticon’s Baths before playing a homecoming show at the Park Stage at Glastonbury. By the end of this year, YFs will have driven around the world one and a half times and flown it several times more. What happens? Each time they appear as a support, the headliner regrets and celebrates, because, if the headliner can’t hope to make the desired impact after the explosion of uber-watt energy that is a Young Fathers show, they can at least reflect and bask in the knowledge that they were partly responsible for something special happening.\n\nWhen they headline, they squeeze hours into 45 minutes and leave the audience exhausted from spectacle and bass, necks aching from craning, ears ringing and a delayed smile forming as they leave after pointless demands for more. (Of course, YFs never give more, because they have given all they have).\n\nSounds like hyperbole? Read the reviews… The Guardian were particularly kind about DEAD, Alexis Petridis wrote: “Young Fathers have quietly constructed a strange and intoxicating musical universe that feels entirely their own” – Guardian 4/5 (Lead Review). I know the group intimately and yet they still shock me on a regular basis. Not with anything as base as the kind of look-at-me desperation of a shocking rocking Rocky Horror spit show, nor with pyro and cannons and strippers or any of the other circus tricks. Just with presence and passion and looking like that beamed in from another world lost aliens with a message of love type of group. With intense engagement… intense… the Johnny Rotten, Ian Curtis, James Brown kind. Taking that brief blast of special that is normally only allowed to boys from terraced houses for a couple of years before imp or exp-losion but YFs just, keep it going, impossibly, like an Ethiopian marathon racer. Which should be an indication, dear star watchers, that something special is happening.\n\nOK, 850 odd words and still so much info to impart. How about… America, it’s like jumping into a deep fat fryer, so many delicious possibilities, like: Jimmy Kimmel, set to take the crown of late night TV chat show hosts, who hosted Young Fathers in June, watched by the entire Anticon roster, performing with blood shot intensity after 24 hours of partying (yes, they party, seriously of course, as you ask) in Los Angeles. More America: the entire staff of KEXP in Seattle, cramming into the control booth and watching in awe during YFs’ radio session there. If you know how many artists go through those doors you’ll know what an accolade that is.\n\nWhat about the BBC? How about all the love from Zane Lowe for the singles, not to mention the weekly shows they made for 1Xtra through October last year (2013) ? Episodes of some outer space Dada drama slotted in amongst all the herbal urban clichés. How about being banned by the beeb? Queen Is Dead, from TAPE TWO, officially banned just in case the Queen of Britain pops her clogs at the moment of spinning.\n\nTime to round it up and leave all the untold good stuff for another time. Now signed with Big Dada, Young Fathers are already recording the next album, printing more of their iconic T-shirts (have you got one yet? You’ll probably have to wait), making more videos, sweating their way through the summer festivals, ignoring stupid borders and other constraints in order to bring it, whatever it is, to you. ENDS", "url": "https://www.facebook.com/events/1551492585165998/"}, {"source": "Facebook", "date": "2016-03-27T21:30:00-04:00", "name": "The UNclub at The Yellow Barn (3/27/16)", "description": "We need performers for Easter Sunday.  Sign up by clicking \"Going\" on this event page.  If you are available for the 8:00 show, a door split show, please private message Mark Sweetman and let him know you are available.\n\nA $5 suggested donation at the door to cover theater overhead. Comics get in free, of course, but we will take your donation.\n\nComics and performers, please follow these procedures for stage time:\n\n- Click \"Going\" on this Facebook Event. Even if you are thinking about it, you can click \"Interested\" so you can get updates on this page. Do this by 5:00pm, the day of the show. This does not guarantee you a spot, but not doing it puts you at the bottom of the list.\n\n- THERE ARE NO GUARANTEED SPOTS FOR THIS SHOW, but there is a pecking order.  It is as follows:\n\n1. Current and past members of Chili Challis's Comedy Dojo or any of his workshops.\n2. Invited guests\n3. Acts who have indicted they will attend (Clicking on this Facebook event counts as an RSVP)\n\nAll other spots are given at the show-runner's discretion.\n\n- After 5:00pm Sunday, \"show ups\" can \"go up\" only if spots are available.\n- The line-up will be created after the 8:00 Stage Time show presented by the Emergent Arts Theater at The Yellow Barn.\n- Those arriving after the line-up is finalized will be given spots as time permits.\n- Length of stage time will depend largely on the turn out, performer's experience, and the show-runner's discretion.\n- As always, if you show up and do not get a spot, you will be put at the top of the list for the next show.\n\n--- Want to increase your odds of getting a spot? Here's some DO's and DON'T's\nDO . . . . Share this event page with your fans on your fan page, your facebook page, your website, or your tweets, or any other social media.\nDO . . . . Volunteer for less time. If you are willing to do 3 rather than 5, or 4 rather than 7, then you are more likely to get a spot.\nDO . . . . Come to the paid shows.\nDO . . . . Stay for \"meet and greet\" after shows.\nDO . . . . Answer poll questions whenever they appear on the event page.\nDO . . . . Bring people. This is not, I repeat NOT, a \"bringer.\" But if somebody has come to see you, it will be very hard to deny you a spot. In the past, we've had shows where we've added a minute of time for every person the comic brought as a non-performing audience member. Bring three people and a five minute spot becomes an eight minute spot.\n\nContact Mark at: www.facebook.com/marksweetman", "url": "https://www.facebook.com/events/240944342917410/"}, {"source": "Facebook", "date": "2016-03-28T19:00:00-04:00", "name": "Scott Ellsworth", "description": "Literati is pleased to welcome Scott Ellsworth in support of The Secret Game: A Wartime Story of Courage, Change, and Basketball's Lost Triumph.\n\nThe Secret Game is the true story of the game that never should have happened--and of a nation on the brink of monumental change. In the fall of 1943, at the little-known North Carolina College for Negroes, Coach John McLendon was on the verge of changing basketball forever. A protégé of James Naismith, the game's inventor, McLendon taught his team to play the full-court press and run a fast break that no one could catch. His Eagles would become the highest-scoring college team in America--a basketball juggernaut that shattered its opponents by as many as sixty points per game. Yet his players faced danger whenever they traveled backcountry roads.\n\nAcross town, at Duke University, the best basketball squad on campus wasn't the Blue Devils, but an all-white military team from the Duke medical school. Composed of former college stars from across the country, the team dismantled everyone they faced, including the Duke varsity. They were prepared to take on anyone--until an audacious invitation arrived, one that was years ahead of anything the South had ever seen before. What happened next wasn't on anyone's schedule. \n\nBased on years of research, The Secret Game is a story of courage and determination, and of an incredible, long-buried moment in the nation's sporting past. The riveting, true account of a remarkable season, it is the story of how a group of forgotten college basketball players, aided by a pair of refugees from Nazi Germany and a group of daring student activists, not only blazed a trail for a new kind of America, but helped create one of the most meaningful moments in basketball history.\n\nScott Ellsworth has written about American history for the New York Times, the Washington Post, and the Los Angeles Times. Formerly a historian at the Smithsonian Institution, he is the author of Death in a Promised Land, a groundbreaking account of the 1921 Tulsa race riot. He lives with his wife and twin sons in Ann Arbor, where he teaches at the University of Michigan.", "url": "https://www.facebook.com/events/1575967599393425/"}, {"source": "Facebook", "date": "2016-03-29T10:00:00-04:00", "name": "TheRide’s ServiceFest", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "url": "https://www.facebook.com/events/181952312183242/"}, {"source": "Facebook", "date": "2016-03-29T19:00:00-04:00", "name": "Acoustic Tuesdays: Dave Menzo", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-      March 29 - Dave Menzo\nhttp://www.davemenzo.com/\nDave Menzo is a solo artist who has the pleasure of playing with a few bands and many talented musicians.\n\nAPRIL\n\n-          April 5 - Bob Skon \nhttp://bobskon.com/\n\"Bob is a musician best described in the singer / songwriter style, blended with a healthy dose of folk-rock, and a touch of jazz.... He has a wonderful ability to use intelligent wordplay for capturing those moments in life we can all identify with. In this Bob could be a peer of the legendary Ray Davies.\" - The Bodhisattva Beat\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/907377109378989/"}]