[{"date": "2016-03-25T19:00:00-04:00", "source": "Facebook", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/", "name": "Aventura March Madness"}, {"date": "2016-03-25T19:00:00-04:00", "source": "Facebook", "description": "All About Eve (Katie Geddes and Deb Wood) and Michael Krieger present the story of Good Friday, told through the music of Indigo Girls, Natalie Merchant, and Andrew Lloyd Webber, along with scripture and prayer.\n \n                               30 minute service\n                    repeats at 7:30pm and 8:00pm\n            Enter at any time; stay as long as you like\n              (worship service; no admission charge)", "url": "https://www.facebook.com/events/1577492092573060/", "name": "Good Friday Evening Vigil featuring All About Eve and Michael Krieger"}, {"date": "2016-03-25T20:00:00-04:00", "source": "Facebook", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"The Real Thing\" starring Nathan Corliss and Mat De Lisle\n\nGroup 2: \"Doom and Doomer\" starring Jeremy Conn and Jenny Bloomer\n\nGroup 3: \"The League of Pointless Improvisers\" starring Andy Reid, Jason Valentini, Matt Swartz, Matthew Flickinger, Mitch Socia, and Moni Jones", "url": "https://www.facebook.com/events/487821191409092/", "name": "Pointless Improv with The Real Thing and Doom and Doomer"}, {"date": "2016-03-25T20:00:00-04:00", "source": "Facebook", "description": "BOARD+BREW: Number 25 !!!! \nwhere: Ground Floor @ 327 Braun Court Kerrytown \nwhen: Friday March 25th · 8pm-11pm\nadmission: nothing \ndonation: zero \nbring: everyone!\n\nWe're once again having our pub game night, this time at the awesome new location -- Ground Floor space at Bar Braun Court. It goes from 7:30pm-11pm and we bring a large variety of games new and old. It is a very relaxed friendly crowd! Newcomers are welcome and encouraged. We've been doing this since November '13 and average a 25+ person turnout. xoxo\n\n*New Library Games*\n- Alien Frontiers - Thunder Alley\n- Agricola: All Creatures - Mogul\n- Pandemic: The Cure - Arboretum\n- Masters Gallery - Airlines Europe", "url": "https://www.facebook.com/events/1149721411719144/", "name": "BOARD+BREW at Bar Braun Court"}, {"date": "2016-03-25T21:00:00-04:00", "source": "Facebook", "description": "Friday, March 25 | 9pm | 18+ | $16 Adv. / $18 Day of\n\nThe Lone Bellow with David Ramirez\n\nThen Came the Morning, the second album by the Southern-born, Brooklyn-based indie-folk trio the The Lone Bellow, opens with a crest of churchly piano, a patter of drums, and a fanfare of voices harmonizing like a sunrise. It’s a powerful introduction, enormous and overwhelming, as Zach Williams, Brian Elmquist, and Kanene Pipkin testify mightily to life’s great struggles and joys, heralding the morning that dispels the dark night: “Then came the morning! It was bright, like the light that you kept from your smile!” Working with producer Aaron Dessner of the National, the Lone Bellow has created a sound that mixes folk sincerity, gospel fervor, even heavy metal thunder, but the heart of the band is harmony: three voices united in a lone bellow.\n\n\"The feeling I get singing with Zach and Brian is completely natural and wholly electrifying,” says Kanene. “Our voices feel like they were made to sing together.\"\n\nLong before they combined their voices, the three members of the Lone Bellow were singing on their own. Brian had been writing and recording as a solo artist for more than a decade, with three albums under his own name. Kanene and her husband Jason were living in Beijing, China, hosting open mic nights, playing at local clubs and teaching music lessons. Zach began writing songs in the wake of a family tragedy: After his wife was thrown from a horse, he spent days in the hospital at her bedside, bracing for the worst news. The journal he kept during this period would eventually become his first batch of songs as a solo artist. Happily, his wife made a full recovery.\n\nWhen Kanene’s brother asked her and Zach to sing “O Happy Day” together at his wedding, they discovered their voices fit together beautifully, but starting a band together seemed impossible when they lived on opposite sides of the world. Brian soon relocated to New York and Kanene moved there to attend culinary school a couple years later. The three got together in their new hometown to work on a few songs of Zach’s, he’d been chipping away at the scene as a solo artist for awhile by then. After hitting those first harmonies did they decide to abandon all other pursuits. Soon the trio was playing all over the city, although they considered Rockwood Music Hall on the Lower East Side to be their home. They opened for the Civil Wars, Dwight Yokam, Brandi Carlile and the Avett Brothers, and their self-titled debut, produced by Nashville’s Charlie Peacock (the Civil Wars, Holly Williams) and released in January 2013, established them as one of the boldest new acts in the Americana movement.\n\nAfter two hard years of constant touring, the band was exhausted but excited. By 2014, they had written nearly 40 songs on the road and were eager to get them down on tape. After putting together a list of dream producers, they reached out to their first choice, the National guitarist Aaron Dessner, who has helmed albums by the L.A. indie-rock group Local Natives and New York singer-songwriter Sharon Van Etten.\n\n“It occurred to me that it would be fun to get together and make music with them,” says Aaron. “My main interest in producing records is community and friendship more than making money. I already do a lot of traveling and working with the National, so when I have to time to work with other artists, it should be fun and meaningful.”\n\n“Aaron is just so kind,” Zach says. “And he has surrounded himself with all these incredibly talented people, like Jonathan Low, the engineer. His brother Bryce [Dessner, also a guitarist for the National] wrote these amazing brass and string arrangements, and he got some of his friends to play with us.”\n\nDessner and the Lone Bellow spent two weeks recording at Dreamland in upstate New York, a nineteenth-century church that had been converted into a homey studio. The singers found the space to inspire the emotional gravity necessary for the material and the acoustics they were looking for. (For Kanene, Dreamland had one other bonus: “I’m a big Muppets fan, and it looks exactly like the church where Dr. Teeth and the Electric Mayhem lived.”)\n\nAaron set them up in a circle in what had once been the sanctuary, with microphones hanging in the rafters to capture the sound of their voices bleeding together. Most of the vocals were recorded in single takes, a tactic that adds urgency to songs like “Heaven Don’t Call Me Home” and “If You Don’t Love Me.” “There were a couple of times when somebody sang the wrong word or hit a bad note, and we just had to keep going,” says Zach, who says that recording “Marietta” in particular was daunting—especially the moment near the end when he hits an anguished high note, bends it even higher, and holds it for an impossibly long time. It’s a startling display of vocal range, but it’s also almost unbearably raw in its emotional honesty.\n\n“‘Marietta’ is probably the darkest song on the whole record,” Zach explains, “and it’s based on something that happened between my wife and me. The band was getting ready to record that song when all of a sudden my wife showed up with our youngest baby. It was a great surprise, a beautiful moment. So I was able to go out and sing that song, knowing she was there to help me carry the moment.”\n\n“These are true stories,” says Brian. “These aren’t things we made up. We tried to write some songs that had nothing to do with our personal stories, but we just didn’t respond to them. But we’re best buds, so we know each others’ personal stuff and trust each other to figure out what needs to be said and how to say it.” Case in point: Brian wrote “Call to War” about his own struggles during his twenties, but gave the song to Kanene to sing. “The content is painful and brutal,” she says, “but the imagery, the vocals, they build something delicate and ethereal. That kind of contrast illuminates the true beauty and power of a song.”\n\nSays Brian, “We do this one thing together, and we carry each other. Hopefully that makes the listener want to be a part of it. It becomes a communal thing, which means that there’s never a sad song to sing. It’s more a celebration of the light and the dark.”", "url": "https://www.facebook.com/events/1550469435268350/", "name": "The Lone Bellow w/ David Ramirez 3/25/16 at Blind Pig - Ann Arbor"}, {"date": "2016-03-25T22:00:00-04:00", "source": "Facebook", "description": "On Friday March 25th, join Kevin Michael for the second installment of Festival Fridays.\n\nFirst 100 guests will receive a FREE can of Red Bull Yellow \n\nHouse | EDM | Trap | Twerk | Electro\nmusic by KEVIN MICHAEL\n\nVisit the Red Bull photo booth that night and create your own GIF! \n\nKevin Michael, aka Kevin Kerber aka The Dangling Participle has been started from the bottom and now he’s here. From rocking stages to rocking chairs, Kevin Michael has always been a bastion of excellence in music, arts, culture, and oxford commas. His frenetic, open-format style of mixing has been described as, “pop-meets-electro-meets-slow-cooker.” This Ann Arbor based DJ is in it to win it. On his off time, Kevin Michael can be found lifting weights, eating mammies, not reading directions, and sardonically pontificating on miscellaneous etcetera. If you’re looking for the same old DJ, swipe left.", "url": "https://www.facebook.com/events/193431837697114/", "name": "Festival Friday"}, {"date": "2016-03-25T22:00:00-04:00", "source": "Facebook", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring: Andy Reid, Jason Valentini, Matt Swartz, Matthew Flickinger, Mitch Socia, and Moni Jones", "url": "https://www.facebook.com/events/184767285232450/", "name": "A Pointless Display of Improvised Feats"}, {"date": "2016-03-26T10:30:00-04:00", "source": "Facebook", "description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "url": "https://www.facebook.com/events/189662964737024/", "name": "Little Peeps PlayGround - \"Animals\""}, {"date": "2016-03-26T11:00:00-04:00", "source": "Facebook", "description": "We're holding a special Easter Egg Hunt in the store, but shhh- don't tell the kids! Throughout the store, we'll have special grown-up prizes hiding, like our delicious pizzas, some great products from our Natural Living department, gift cards, and more! You just have to find them to claim them as your own... And no, silly, that pizza won't be hiding on a shelf- come on in to find out how we've hidden our prizes!", "url": "https://www.facebook.com/events/510654169142215/", "name": "Adult Easter Egg Hunt"}, {"date": "2016-03-26T13:00:00-04:00", "source": "Facebook", "description": "Last week, you choose between 16 beers, and now we're down to the next 8. Who will win? Who are you rooting for? Come down for our tasting to make your voice heard!", "url": "https://www.facebook.com/events/982577371827591/", "name": "Sweet 16 Beers"}]