[{"source": "Facebook", "date": "2016-06-19T10:00:00-04:00", "name": "Father's Day Brunch", "description": "FATHER\"S DAY BRUNCH BUFFET\n\nStart Father's Day off right and treat dad to our Sunday, Bunch Buffet, on June 19!\n\nDad can enjoy unlimited trips to the buffet paired with a mimosa or bloody mary, for only $20 per person.\n\n Also, featuring $5 Boiler Makers on special all day!\n\nMake your reservation with the link above.", "url": "https://www.facebook.com/events/627362264100338/"}, {"source": "Facebook", "date": "2016-06-19T14:00:00-04:00", "name": "Guided Tour - Catherine Opie: 700 Nimes Road", "description": "Beginning in 2010, Los Angeles-based artist Catherine Opie spent six months taking photographs at the residence of Elizabeth Taylor (1932–2011), capturing the essence of the Hollywood legend through her personal objects and mementos. She portrays Taylor’s life experience and eccentricity as an illusory subject, one that cannot be specifically designated or precisely described. UMMA docents will explore Taylor’s celebrity and humanity through these images.\nPublic exhibition tours are generously supported by the Richard and Rosann Noel Fund for Museum Education.", "url": "https://www.facebook.com/events/1022894781091820/"}, {"source": "Facebook", "date": "2016-06-19T15:00:00-04:00", "name": "In Conversation: Álvarez Bravo's Visual Poetry", "description": "Manuel Álvarez Bravo's photographs provide a unique insight into his native Mexico, imbuing matter-of-fact imagery with an almost mystical life. Join exhibition curator Carole McNamara to explore the visual language of Álvarez Bravo's photographs.\n\nThe exhibition Manuel Álvarez Bravo: Mexico's Poet of Light is supported by the University of Michigan Office of the Provost, the Richard and Rosann Noel Endowment Fund, and other generous donors.", "url": "https://www.facebook.com/events/265387660480293/"}, {"source": "Facebook", "date": "2016-06-19T18:30:00-04:00", "name": "Shakespeare in the Arb 2016 Love's Labour's Lost Week 2", "description": "Thursdays through Sundays through June 26. Check out Tickets Available link for arb member advance ticket info plus note Summer 2016 construction impacting arboretum area parking & traffic. Arrive early for tickets and time to walk to location of the first scene.", "url": "https://www.facebook.com/events/799178996885556/"}, {"source": "Facebook", "date": "2016-06-19T18:30:00-04:00", "name": "Ann Arbor Poetry Prompt Slam featuring Deonte Osayende", "description": "Come with pens in hand--this year's Prompt Slam. Traditional four minute per poet open mic begins the night, followed by a feature by the fantastic, Detroit native poet/performer/educator Deonte Osayende! The Prompt Slam means all poets will be given the same prompt at the Slam, with ten-to-twelve minutes, to write the poem you will slam for round one. Top six poets advance to round two, where a second prompt and session will give way to another incredible round of never-before-shared original poems. It's hype. It's lit. It's live. See you Sunday night! \n\nAll proceeds go to support The Michigan Metaphorical Melee, a bi-annual festival deticated to the literary and performing arts in Michigan. See:  https://www.patronicity.com/project/the_michigan_metaphorical_melee#\n\nDeonte Osayande is a former sprinter turned writer from Detroit. Writing nonfiction essays and poetry, he has been nominated for the Best of the Net Anthology, a Pushcart Prize, and published in numerous publications. He has represented Detroit at the National Poetry Slam. He is currently a professor of English at Wayne County Community College in addition to teaching youth through the Inside Out Detroit Literary Arts Program. His first full poetry collection, Class, is set to be released on Urban Farmhouse Press in 2017.", "url": "https://www.facebook.com/events/1757446537846578/"}, {"source": "Facebook", "date": "2016-06-19T19:00:00-04:00", "name": "The Canterbury Tales", "description": "Join us for this hilarious retelling of Geoffrey Chaucer's classic tale, in which every character plays numerous parts, to fantastic effect. This recent adaptation maintains Chaucer's biting humor while keeping the bawdiness to a minimum, so all can enjoy the show in Ann Arbor's West Park! The show runs June 16, 17, 18, 23, 24, 25, 30, July 1, and 2.  Curtain at 7pm each night.  Tickets are just $10 for adults, $7 for kids 12 and under.", "url": "https://www.facebook.com/events/1689877964609383/"}, {"source": "Facebook", "date": "2016-06-20T19:00:00-04:00", "name": "Andrew J. Hoffman: Finding Purpose", "description": "Literati is pleased to welcome Andrew J. Hoffman in support of his most recent title, Finding Purpose: Environmental Stewardship as a Personal Calling.\n\nBoth thoughtful and thought-provoking, Finding Purpose aims to challenge our understanding of how humanity interacts with planet Earth, and our role within this. This book is an invitation: would you like to participate in one of the most important projects of imagination, perhaps the greatest ever, in human history? Distilling and refining over 20 pieces from a lifetime of work in academia and trade, across speeches, blogs, editorials and essays, Hoffman invites us to look beyond material growth and explore the role of the individual and business in discovering a wider purpose to bring about a balanced and sustainable society.\n\nThe reader is encouraged to consider humanity’s relationship with the environment through different lenses: business, academia, faith-based and cultural. By bringing them together, Hoffman encourages us to understand our relationship with the planet in a far more holistic sense.\n\nDrawing on ideas from philosophy, literature, natural sciences and politics, Hoffman ensures that the ideas he explores are wholly accessible and applicable. Fully substantiated through various research and examples, the issues described are consistently made relevant to the reader.\n\nFinding Purpose is the perfect book for anyone - from student to CEO - thinking about their place in the world, and how making changes in our own lives and societies can impact on the world around us.\n\nAndrew J. Hoffman is the Holcim Professor of Sustainable Enterprise at the University of Michigan's The Ross School of Business. His research focuses on institutional theory; institutional and cultural change; organization theory; and corporate environmental strategies. He has published over a dozen books, which have been translated into five languages. Among his list of honors, he has been awarded the Maggie Award (2013), JMIBreaking the Frame Award (2012), Connecticut Book Award (2011), the Aldo Leopold Fellowship (2011), the Aspen Environmental Fellowship (2011 and 2009), the Manos Page Prize (2009), the Faculty Pioneer Award (2003), the Rachel Carson Book Prize (2001) and the Klegerman Award (1995).  His work has been covered in numerous media outlets, including the New York Times, Scientific American, Time, The Wall Street Journal and National Public Radio.", "url": "https://www.facebook.com/events/966863796764150/"}, {"source": "Facebook", "date": "2016-06-20T21:00:00-04:00", "name": "James McCartney w/ Isla 6/20/16 at Blind Pig - Ann Arbor", "description": "Monday, June 20 | 9pm | 18+ | $15 adv./ $20 day of\n\nCritically acclaimed singer-songwriter James McCartney has remained fiercely dedicated to his musical vision of melding smart hooks and feral alt-rock with the grandeur and spiritually centeredness of psychedelic music. Now, he issues the sharpest entry of his vision, the majestic The Blackberry Train engineered by Steve Albini (Nirvana, The Pixies and PJ Harvey).\n\n“It’s all been an evolution,” James says. “This set of songs definitely has a harder edge, but it’s a continuation of the last album. The main thing for me is to not conform or compromise.”\n\nJames’ panoramic artistry is inspired by such diverse musicians as Kurt Cobain, The Smiths, Radiohead, PJ Harvey, The Cure, The Beatles, Neil Young, Jimi Hendrix, and Hank Williams. His fingerprint aesthetic has earned him plaudits from Rolling Stone, The Boston Globe, The New York Times, and The Daily News. He’s earned a strong following the old fashioned way, through tirelessly touring the US, Europe and the UK, and playing bigger and bigger shows with each go around.\n\nThe Blackberry Train is an epiphanic co-mingling of aesthetics. James sought out the distinct audio stylings of Steve Albini to conjure a grungier sensibility. He welcomed the engineer’s gifts for capturing music with a raw clarity, and Steve Albini’s reputation for not impinging on an artist’s vision. The results make for an eclectic album with fastidiously crafted songs documented in the studio with glorious purity.\n\n“I like the music to have elements of the avant garde, psychedelic, and be just a little against the grain,” James reveals. “But in the end, it’s about having as much emotion as possible for me, musically and lyrically. It’s all about the music being cathartic, heartfelt and true.”\n\nThe Blackberry Train manages to be both diverse and cohesive. The album opens invigoratingly with the jangling rocker, “Too Hard” and closes with the stately and aptly named folk song “Peace and Stillness.” Between these bookends, highlights include the rough-edged and urgently melodic “Unicorn,” the anthemic “Peyote Coyote,” and the soulful ballad “Prayer.” One very personal song is the winsome and reflective “Waterfall” which was inspired by memories of his mother.\n\nThis summer and fall James will embark on extensive tour dates in the U.S. Thinking ahead, James says: “I just want to keep on going, keep working, and improving as a songwriter. I’d love to feel that I realized my full potential both as a person, and as a songwriter. That feels like a great, fulfilling goal to shoot for. Making a lot of music, and striving for more depth artistically–those are my goals.”", "url": "https://www.facebook.com/events/1689584001315124/"}, {"source": "Facebook", "date": "2016-06-21T19:00:00-04:00", "name": "Acoustic Tuesdays: Joel Parkkila", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-June 21 Joel Parkkila\n\nJoel Parkkila, from the Ann Arbor punk rock and roll band Human Skull, will play acoustic folk and rock.\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/1073002982766327/"}, {"source": "Facebook", "date": "2016-06-21T19:00:00-04:00", "name": "Skazat! Poetry Series featuring Josh Davis", "description": "Summer is here; come celebrate the longest day of the year with us! Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Reader\n\nThis month's feature: JOSH DAVIS!\n\nJoshua Davis holds MFAs from the University of Southern Maine and the University of Mississippi. He has recent or forthcoming poems in The Midwest Quarterly, The Rotary Dial, Monster Verse: Poems Human and Inhuman (Everyman's Library, 2015), and The Cabildo Quarterly. He lives and writes in Athens, Ohio, where he's a Ph.D. candidate in American Literature. \n\n\nNext month's feature: ANN ARBOR YOUTH POETRY SLAM TEAM!", "url": "https://www.facebook.com/events/257922431241963/"}]