[{"date": "2016-04-26T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/103567850045837/", "description": "We're celebrating spring with two great things: food and beer! Join us on Tuesday, April 26th for four spring-themed courses plus a dessert course, each paired with a Wolverine State brew. Brewmaster Oliver Roberts and Chef Mark Grasso will be on hand to present and discuss the pairings. Ticket cost is $45 per person, and seating is limited, so don't delay! Tickets are available using the Eventbrite link above or in the Tap Room. The event is for ticket holders only and will take place in the Gulo Room. Seating and welcome beer at 6:30, and we roll from there. Call 734-369-2990 with questions, or email mackenzie@wolverinebeer.com.", "name": "Spring Beer Dinner"}, {"date": "2016-04-26T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1535746816722754/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "name": "Acoustic Tuesdays: Heather Schwartz"}, {"date": "2016-04-26T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1730384527194484/", "description": "$5 cover, merch available, come have some fun. \n\nSing along: \n\nHour 24 (Toledo)\nWebsite: http://www.hour24band.com\nPre-Order the EP: https://itunes.apple.com/album/emergence-ep/id1091673720\n\nStankface (Ann Arbor) \nhttps://www.facebook.com/stankfacemusic/?fref=nf\n\nArson Party (Ann Arbor)\nhttps://itunes.apple.com/us/album/fall-of-the-rising-ii/id881628750?uo=4\n\nKid Grizzly (Detroit/Toledo)\nhttps://kidgriz.bandcamp.com/releases", "name": "Club Above Presents: Hour 24 CD Release Tour/Stankface/Arson Party/Kid Grizzly"}, {"date": "2016-04-27T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1668025760140932/", "description": "Our April Artists' Meet & Greet topic is How to Photograph Your Artwork. Join us for this free event, connect with other artists and the Art Center staff.\n\nSpeaker: Nick Azzaro\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet events: http://www.annarborartcenter.org/artists-meet-greet/", "name": "How to Photograph Your Artwork"}, {"date": "2016-04-27T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/991272244292924/", "description": "Wed. April 27 | 7:30pm | 18+ | $28 Cover\n\nReverend Horton Heat with: Unknown Hinson, Nashville Pussy & Lucky Tubb & the Modern Day Troubadours Live in Concert!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/612", "name": "Rev. Horton Heat & Company 4/27/16 @ Blind Pig - Ann Arbor"}, {"date": "2016-04-27T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1740012382900420/", "description": "Nini D. And other mc's will be showing you what Michigan music is about.", "name": "Northern Threat Entertainment Presents Wild and Out Wednesdays Ft. Nini D."}, {"date": "2016-04-28T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/989287977824682/", "description": "Literati is pleased to partner with One Pause Poetry in showcasing the work of Rickey Laurentiis, Gretchen Marquette, Airea Matthews, and Ladan Osman.\n\nRickey Laurentiis is the author of Boy with Thorn, selected by Terrance Hayes for the2014 Cave Canem Poetry Prize and named one of the Top 16 Best Poetry Books by Buzzfeed. The recipient of a 2013 Creative Writing Fellowship from the National Endowment for the Arts and a 2012 Ruth Lilly Fellowship from the Poetry Foundation, his other honors include fellowships from the Atlantic Center for the Arts, the Bread Loaf Writers’ Conference, the Cave Canem Foundation, and the Civitella Ranieri Foundation in Italy.\n\nGretchen Marquette is the author of May Day, and has published poems in Harper’s, the Paris Review, and Tin House. She lives and teaches in Minneapolis, Minnesota.\n\nAirea D. Matthews is a 2015 Kresge Literary Arts Fellow and the executive editor of The Offing. She is currently the Assistant Director of the Helen Zell Writers’ Program at University of Michigan, Ann Arbor, where she earned her MFA. Her poems have appeared or are forthcoming in Best American Poetry 2015, American Poet,The Missouri Review, The Baffler, Callaloo, Indiana Review, WSQ and elsewhere. Her performance work has been featured at the Cannes Lions Festival, PBS’ RoadTrip Nation and NPR.\n\nLadan Osman is the author of The Kitchen-Dweller's Testimony. Her work has appeared in American Life in Poetry, Artful Dodge,Narrative Magazine, Prairie Schooner, RHINO, and Vinyl Poetry. Her chapbook, Ordinary Heaven, appears in Seven New Generation African Poets: A Chapbook boxed set. She lives in Chicago.", "name": "One Pause Poetry: Rickey Laurentiis, Gretchen Marquette, Airea D Matthews & Ladan Osman"}, {"date": "2016-04-28T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1806589649563182/", "description": "Learn to identify and record summer breeding frogs & toads by sight and sound in this second kick-off training. Surveys are fun, family-friendly, and require no previous experience. This event is optional for frog surveyers who attended the previous kickoff in March. Please register by April 26. For more information or to register, please call NAP at 734.794.6627, or send us an email at NAP@a2gov.org .", "name": "Frog & Toad Survey Halftime Kickoff"}, {"date": "2016-04-28T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1079340418752835/", "description": "Diana Wege is an artist. She has painted in all fifty states and in 2000 she published Land America Leaves Wild, a book of her paintings of 23 of those states. This is her first children’s book.  Diane also grew up in Grand Rapids and Ann Arbor and is a graduate of Greenhills School.\n\nHarbour Island, only three miles long and half a mile wide, is one of the oldest settlements in the Bahamas and is best known for its broad pink-sand beaches and for bonefishing, a compelling catch-and-release enterprise that pits a determined angler against an inedible, surprisingly powerful, and elusive quarry.\n\nYoung and fearless Flossie lives on Harbour Island and has a persistent dream is to go fishing with the legendary guide Bonefish Joe, a beloved island institution who picks up his wealthy clients at the dock and returns with them hours later, fishless but satisfied. One Sunday, after church, Flossie’s wish is surprisingly granted and she discovers the allure, the challenge, and the delights of hooking (and releasing) one of angling’s greatest prizes.\n\nDiana Wege’s illustrations of the island, its inhabitants, its customs, and its architecture,bring this story alive, perfectly catching the characters, culture and charm of Harbour Island.", "name": "Meet Illustrator/Artist Diane Wege for a discussion & Signing of 'A Day with Bonefish Joe' her First Children's Picture Book"}, {"date": "2016-04-28T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1318721681600135/", "description": "Thursday, April 28 | 9pm | 18+ | $15 Cover\n\nIt’s rare for an artist to bridge the divide between critical acclaim and dedicated fan engagement. Chris Pureka is a Portland-based singer-songwriter whose body of work has resonated deeply with these seemingly disparate milieus. Her bold vulnerability in processing the intimacies of her life in song has long appealed to those listeners who crave authenticity. Now, five years coming, she shares with us another powerful entry in her life’s work, her sixth release, the aptly titled, Backin the Ring. Chris’s elegant emotionality as a vocalist, and her flair and immediacy as a lyricist have garnered her favorable comparisons to Gillian Welch, Ryan Adams, Bruce Springsteen, and Patty Griffin. She’s earned accolades from such distinguished taste-making outlets as The New York Times, Paste, Magnet,Billboard.com, and The AllMusic Guide. She’s shared the stage with such diverse and esteemed artists as Dar Williams, TheLumineers, The Cowboy Junkies, Gregory Alan Isakov, Martin Sexton, and Ani DiFranco. Along the way, Chris has remained fiercely independent, selling nearly 50,000 albums through her own label, Sad Rabbit Records. Chris’s journey in music mirrors her path toward self-discovery. At 16, writing songs became a way of journaling. “I was shy and introverted, and songwriting was a very personal process. I never had any intention of performing,” she shares. Post high school, she went on to complete a biology degree at Wesleyan University, and afterwards, worked in a microbiology research lab at Smith College. Meanwhile, she established a music career parallel to her biology work through touring and issuing a clutch of well-received indie releases.In 2006, when Chris found herself turning down too many opportunities as a musician, she shifted her priorities to become a full-time artist. Her latest album, Backin the Ring, is Chris’s first studio full length since 2010’s critically acclaimedHow I Learned to See in the Dark. “I’m not interested in releasing songs I can’t get behind or records I don’t love,” she says of the five-year span between albums. The title of her latest playfully suggests something of an artistic comeback, but it also references the album’s themes of relationship conflict and making the decision to fight back against dark inner demons. “My music is the outward expression of the work I’m doing internally. What I do comes from my experiences, and I strive to express these experiences authentically. Speaking my truth, and being myself, is the way that I connect with people,” Chris confides. Her rise as an esteemed artist with captivating emotional integrity has been organic and always on her own terms.For someone who never had an intention of being a professional musician, it’s been a life of far-reaching changes and unexpected rewards. \n\nWSG: Anna Vogelzang\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/595", "name": "Chris Pureka w/ Anna Vogelzang 4/28/16 @ Blind Pig - Ann Arbor"}]