[{"source": "Facebook", "date": "2017-01-22T10:00:00-05:00", "name": "Exhibit: Avant Garden-Fashion & Plants Together!", "url": "https://www.facebook.com/events/230775294023258/", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp"}, {"source": "Facebook", "date": "2017-01-22T14:00:00-05:00", "name": "Traces: Reconstructing the History of a Chokwe Mask", "url": "https://www.facebook.com/events/621083881410822/", "description": "The exhibition Traces focuses on one artwork from UMMA’s African holdings: a Chokwe mask that was collected in 1905 near the Angolan city of Dundo by the German explorer Leo Frobenius. Its presence at UMMA today—almost 7,500 miles away from the context in which it was originally created, used, and valued—is the result of a long and tumultuous journey, spanning a hundred years, three continents, and numerous people whose lives are forever connected to the artifact that passed through their hands. UMMA docents will elaborate on some of the stories of these individuals and, with pieces from the UMMA collection and national loans, reconstruct the “biography” of the mask."}, {"source": "Facebook", "date": "2017-01-22T16:00:00-05:00", "name": "Ann Arbor Derby Dimes 2016 season", "url": "https://www.facebook.com/events/192972824428594/", "description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nRSVP on FB: http://bit.ly/29dSJv0\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule\n\n______________________________________________\n\n\nPreviously this season:\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nRSVP on FB: http://bit.ly/29dSikp\nBUY JUNE 11 TICKETS: http://bpt.me/2538000"}, {"source": "Facebook", "date": "2017-01-22T16:00:00-05:00", "name": "Beer and Board Games", "url": "https://www.facebook.com/events/1173910136024354/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor."}, {"source": "Facebook", "date": "2017-01-22T19:00:00-05:00", "name": "SMTD Presents: The Star-Spangled Banner", "url": "https://www.facebook.com/events/161423927673638/", "description": "Francis Scott Key’s anthem has traversed a 200-year journey from broadside to victory ballad, protest song to anthem and back again. SMTD Professor Mark Clague, author of an upcoming book on this topic, will explore how these processes of translation and transformation comprise a portrait of the nation, past and present in this lecture-recital- discussion featuring tales from the song’s history, interspersed with live performance. UMMA's exhibition Traces: Reconstructing the History of a Chokwe Mask similarly recovers the stories of a Chokwe mask that was collected in 1905 in Angola and looks at how its meaning and value have changed over the course of its journey through many hands to UMMA’s African collection. Prior to the concert, remarks from Traces curator Laura De Becker, will invite us to consider the relationship we have with objects—whether they be songs or masks—in ways both real and symbolic.\n\nThe SMTD@UMMA performance series is generously supported by the Katherine Tuck Enrichment Fund and the Greg Hodes and Heidi Hertel Hodes—Partners in the Arts Endowment Fund.\n\nLead support for the exhibition Traces: Reconstructing the History of a Chokwe Mask is provided by the James and Vivian Curtis Endowment. Additional generous support is provided by the University of Michigan Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund and African Studies Center."}, {"source": "Facebook", "date": "2017-01-22T19:00:00-05:00", "name": "Open Stage", "url": "https://www.facebook.com/events/1192811347423838/", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators."}, {"source": "Facebook", "date": "2017-01-22T19:30:00-05:00", "name": "In the Next Room or the Vibrator Play", "url": "https://www.facebook.com/events/344427089276306/", "description": "Ann Arbor Civic Theatre presents In the Next Room or the vibrator play by Sarah Ruhl, directed by Melissa Freilich, January 19-22, 2017, at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, and $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org. \n \nAt a time when electricity was beginning to light up the dark corners of the polite Victorian home, In the Next Room introduces us to characters wondering what they want and how they are supposed to love.  Dr. Givings treats women for hysteria, and now, thanks to the invention of electricity, he has a new vibrating instrument which is getting amazing results.  On just the other side of the door in the living room, his wife Catherine struggles with her role as a wife and mother.  Each of them is beginning to wonder, and worry, about exactly what is happening in the next room.  Loosen your corset and join Ann Arbor Civic Theatre for a play full of both poetry and farce that asks whether we are so different today.\n \nDirector Melissa Freilich is working with a talented ensemble of actors and designers to develop the world of the doctor’s home.  Describing the emotional impact of the show, she says, “This play brings us into the character's lives.  We don't see what we expect from a Victorian stereotype.  Instead, we recognize real people who are struggling with their own feelings, in a way that's both beautiful and often really funny.”\n \nThe artistic staff of In the Next Room, or the vibrator play includes set designer Leo Babcock, set dressing designer Beth Duey, props designer Aaron Wade, lighting designer Brad Pritts, costume designers Jamee Zielke and Abby Zielke, undergarments designer Molly Borneman, and sound designer Matt Steward.  The talented cast includes Greg Kovas as Dr. Givings, Liana Abela as Mrs. Givings, Amanda Photenhauer as Mrs. Daldry, Ellen Blanchard as Annie, Joseph McDonald as Leo, Maegan Murphy as Elizabeth and Rob Roy as Mr. Daldry.  Stage managed by Alexa Ducsay and produced by Lindsay Harkins."}, {"source": "Facebook", "date": "2017-01-23T18:00:00-05:00", "name": "T-Time", "url": "https://www.facebook.com/events/207251706412069/", "description": "Are you looking for a place to meet other trans folks in and around the Ann Arbor-Ypsilanti area? T-Time is a social gathering and safe space by trans people for trans people of all ages.\n\nStarting the 4th Monday in January 2017, we'll be at Cultivate every month on the 4th Monday from 6-8 PM. The table will be reserved with a sign that reads \"T-Time.\"\n\nAll trans, genderqueer, and questioning people are welcome in this space. FTM, MTF, agender, genderqueer, and any other trans identities are welcome! Minors are welcome to attend with or without a parent/guardian. Parents/guardians are welcome to stay with their child if needed. \n\nWe'll be drinking coffee, tea, and beer (for those 21+). The space can be used however you want - board games, networking, or simply just hanging out. Cultivate offers some board games. They even welcome outside food!\n\nAt least one FTM A2 Ypsi representative will be in attendance at every T-Time. If you need resources, have questions to ask, or need someone to talk to, please do so with one of the representatives and not a participant unless they say otherwise. Trans people are often forced to educate others, even when they don't feel comfortable, so we don't want anyone to be placed in that kind of position."}, {"source": "Facebook", "date": "2017-01-23T18:00:00-05:00", "name": "Art Off The Wall Holiday Exhibition & Shopping Event", "url": "https://www.facebook.com/events/1807900772828520/", "description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC"}, {"source": "Facebook", "date": "2017-01-24T10:00:00-05:00", "name": "Intro to Stagecraft Workshops", "url": "https://www.facebook.com/events/1716505231999811/", "description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5."}]