[{"description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "date": "2016-10-12T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "source": "Facebook", "url": "https://www.facebook.com/events/1090878344334512/"}, {"description": "Learn how to get the most out of your social strategy with Nikki Sunstrum, Director of Social Media for the University of Michigan. What a great topic to kick off the new season of LA2M.", "date": "2016-10-12T11:45:00-04:00", "name": "Get The Most Out Of Your Social Strategy with Nikki Sunstrum", "source": "Facebook", "url": "https://www.facebook.com/events/1327093913998059/"}, {"description": "Literati is thrilled to welcome Bonnie Jo Campbell and Andy Mozina to read from their most recent work. \n\nBonnie Jo Campbell teaches in the low-residency MFA program at Pacific University and lives in Kalamazoo, Michigan. She is the author of Once Upon a River, American Salvage (a finalist for the National Book Award and National Book Critics Circle Award), Q Road, Women and Other Animals, and, most recently, Mothers, Tell Your Daughters.\n\nAndy Mozina is a professor of English at Kalamazoo College and the author of the novel Contrary Motion, short story collections The Women Were Leaving the Men, which won the Great Lakes Colleges Association New Writers Award, and Quality Snacks, which was a finalist for the Flannery O’Connor Prize. His fiction has also appeared in numerous magazines, including Tin House and McSweeney’s. \n\nEvent date: \nWednesday, October 12, 2016 - 7:00pm", "date": "2016-10-12T19:00:00-04:00", "name": "Bonnie Jo Campbell & Andy Mozina", "source": "Facebook", "url": "https://www.facebook.com/events/1482591518434511/"}, {"description": "Three great acts at the Yellow Barn! More info at: http://www.ouryellowbarn.com/event/jennifer-hall-2/?instance_id=22563", "date": "2016-10-12T19:00:00-04:00", "name": "Nadim Azzam, Jennifer Hall, and Mike Gentry", "source": "Facebook", "url": "https://www.facebook.com/events/774104016063508/"}, {"description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "date": "2016-10-13T09:00:00-04:00", "name": "Maker Space Operations Bootcamp", "source": "Facebook", "url": "https://www.facebook.com/events/1676692335988216/"}, {"description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "date": "2016-10-13T12:00:00-04:00", "name": "POP-X", "source": "Facebook", "url": "https://www.facebook.com/events/585713071616738/"}, {"description": "Free and open to the public. Seating is first come, first serve.\nC. Dale Young practices medicine full-time and teaches in the Warren Wilson College MFA Program for Writers. He is the author of The Day Underneath the Day (TriQuarterlyBooks, 2001), The Second Person (Four Way Books, 2007), Torn (Four Way Books, 2011) and The Halo (Four Way Books, 2016). He is a previous winner of the Grolier Prize, both the Stanley P. Young Fellowship, and Amanda Davis Fellowship from the Bread Loaf Writers' Conference, and has received fellowships from the National Endowment for the Arts, the John Simon Guggenheim Memorial Foundation, and the Rockefeller Foundation. He lives in San Francisco with the biologist and composer, Jacob Bertrand, his spouse.", "date": "2016-10-13T17:30:00-04:00", "name": "Zell Visiting Writers Series: C. Dale Young Poetry Reading", "source": "Facebook", "url": "https://www.facebook.com/events/682992351874453/"}, {"description": "Thursday, October 13, 5:30–6:30 p.m.\n\rHelmut Stern Auditorium\n\nC. Dale Young practices medicine full-time and teaches in the Warren Wilson College MFA Program for Writers. He is the author of The Day Underneath the Day (TriQuarterlyBooks, 2001), The Second Person (Four Way Books, 2007), Torn (Four Way Books, 2011)\rand The Halo(Four Way Books, 2016). He is a previous winner of the Grolier Prize, both the Stanley P. Young Fellowship, and Amanda Davis Fellowship from the Bread Loaf Writers' Conference, and has received fellowships from the National Endowment for the Arts, the John Simon Guggenheim Memorial Foundation, and the Rockefeller Foundation. He lives in San Francisco with the biologist and composer, Jacob Bertrand, his spouse.\rUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. \n\nThe Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please\rsee lsa.umich.edu/writers/readingsevents/zellvisitingwritersseries.", "date": "2016-10-13T17:30:00-04:00", "name": "Zell Visiting Writers Series: C. Dale Young Poetry", "source": "Facebook", "url": "https://www.facebook.com/events/307711412942024/"}, {"description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "date": "2016-10-13T19:00:00-04:00", "name": "Xanadu", "source": "Facebook", "url": "https://www.facebook.com/events/986732351446617/"}, {"description": "Just in time to throw some shade at the 2016 presidential election, join America's favorite Dragapella® Beautyshop Quartet, The Kinsey Sicks, as Rachel, Trampolina, Trixie and Winnie campaign to be elected President of the United States on the Republican ticket.\n\nWatch as the gals take (a)back America by out-pandering, out-conspiracy theorizing, and out-outlandishing even the most cynical of the current crop of Presidential candidates through sharp-witted original songs and biting parodies that are delivered in glorious four-part harmony. \n\nAll door profits will go to Jim Toy Community Center & other local LGBTQ groups in Washtenaw County. \n\nCheck out the Kinsey Sicks as seen on CNN http://cnn.it/213rP90\n\nDoors at 7pm\nShow at 8pm\nAfter Party at 9:30pm\n\nTickets range from $10-$40 per ticket for the show. After Party $5\n\nhttp://www.kinseysicks.com\nhttps://www.necto.com\njim toy community center", "date": "2016-10-13T19:00:00-04:00", "name": "The Kinsey Sicks : Electile Dysfunction Benefit", "source": "Facebook", "url": "https://www.facebook.com/events/176492989455246/"}]