[{"url": "https://www.facebook.com/events/1060585290673795/", "source": "Facebook", "date": "2016-05-06T07:00:00-04:00", "description": "Pucker up! All cosmetics and facial care are 25% off Friday through Sunday, so stock up for yourself or someone you love <3", "name": "25% Off Cosmetics and Facial Care"}, {"url": "https://www.facebook.com/events/1739721849644306/", "source": "Facebook", "date": "2016-05-06T14:00:00-04:00", "description": "http://cafegive.com/make_the_match/boaa-volunteermatch\nWe believe everyone should have the chance to make a difference. That's why United Way of Washtenaw County's Volunteer Center makes it easy for good people and good causes to connect. The Bank of Ann Arbor is a proud sponsor and matching all donations up to $3,000 for a grand total of $3,000 for this amazing volunteer program. www.volunteerwashtenaw.org\n\nPlease share this on your social media to help us hit our goal!!", "name": "Bank of Ann Arbor is matching donation up to a total of $3,000 for United Way's Volunteer program"}, {"url": "https://www.facebook.com/events/1704282199819271/", "source": "Facebook", "date": "2016-05-06T18:00:00-04:00", "description": "First Fridays Ypsilanti is back and we are ready to celebrate this monthly art & culture walk right here in Ypsi.\n\nCultivate, in partnership with the bank of ann arbor bring to you two local musicians that we love, Nicole P'Simer and Spencer Michaud.  \n\n7 PM Nicole P'Simer is local acoustic guitarist, singer, songwriter & self-proclaimed maker of utter silliness. \n\n8-10 PM  Spencer Michaud is a narrative singer-songwriter that uses an elastic tenor voice to cover an incredible range of genres and emotions.  \n\nMatthew Altruda, host of Tree Town Sound and curator of Bank of Ann Arbor's Sonic Lunch will be bartending and donating his tips for the night as well. \n\nThe full list of events around town can be found at First Fridays Ypsi: MAY 2016.", "name": "First Fridays Featuring Spencer Michaud wsg/ Nicole P'Simer"}, {"url": "https://www.facebook.com/events/462393273957118/", "source": "Facebook", "date": "2016-05-06T19:00:00-04:00", "description": "Literati is pleased to welcome poet Maggie Smith in support of her most recent collection, The Well Speaks of Its Own Poison.\n\nDelving into the depths of fairy tales to transform the daily into encounters with the marvelous but dangerous, Maggie Smith’s poems question whether the realms of imagination and story can possibly be safe. Even as her compressed stories are unfolding on a suburban cul de sac, they are deep in the mythical woods, “where children, despite their commonness, / are a delicacy.”\n\n“Maggie Smith’s collection is magical and troubling.… Time alternates between the forest where there are refrigerator magnets and safety belts, and The Forest where you, a now-human you, once preened ‘your blue-black wings.’… Time stops for violence and passion. Be intrigued. Find yourself welcome.” — Kimiko Hahn\n\n“Some kind of primary mythic world lies behind and throughout these adult tales of ultimate matters.… as much about the terrible and beautiful dreams of children as it is about waking up as a parent. This is a rare book of poems.” — Stanley Plumly\n\n“Enchantment: that rarest of all poetic gifts. As when the neurons, in the kaleidoscopic movie they call a “functional MRI,” speak to us in colors on a screen from the deepest recesses of what we already know. Maggie Smith’s are poems of transformation: haunting, gorgeous, intimately unsettling. I cannot remember when I last read a book to match her powers of delight.” — Linda Gregerson\n\n“Folk tales and their eerie, animistic wisdom are a wellspring for these powerful lyrics. The poems are ethereal and dark, brimming with dread, beauty, and rapture. The Bloody Chamber, Angela Carter’s arresting prose engagement with fairy tales, comes to mind. Smith updates motifs of the pacts children make with nature, the power of luck and curses, loss of innocence, the vulnerable and the sinister, primal fears of being eaten, and much more. The images are so fresh and inventive they shimmer. Original, cautionary, rich, delicious, The Well Speaks…is a spellbinding collection.” — Amy Gerstler\n\nMaggie Smith holds a BA from Ohio Wesleyan University and an MFA from The Ohio State University. Her previous books are Lamp of the Body (Red Hen Press, 2005) and three prizewinning chapbooks, Disasterology (Dream Horse Press, forthcoming), The List of Dangers (Kent State/Wick Poetry Series, 2010), and Nesting Dolls (Pudding House, 2005). She lives with her husband and two children in Bexley, Ohio, where she works as a freelance writer and editor.\n\nEvent date: \nFriday, May 6, 2016 - 7:00pm", "name": "Poetry at Literati: Maggie Smith"}, {"url": "https://www.facebook.com/events/919947144747827/", "source": "Facebook", "date": "2016-05-06T20:00:00-04:00", "description": "Vocalist and composer Carla Cooke is the youngest daughter of the legendary Sam Cooke, whose musical life encompassed religion, romance, and history. Carla’s career mirrors that of her father, in that she crafted her sound in the church. Carla sought not to use her father’s name, but to build her own reputation. Now the younger Cooke knows that her roots are firmly entwined in her father's as she connects with them through his music.\n\nCarla Cooke’s style is diverse in gospel, Christian, R&B, soul, and pop styles. With a strong vocal range and warm personality, Carla shows that the apple doesn't fall far from the tree, as she channels the raw talent, emotion, beauty, and charisma of the Cooke family persona. www.carlacooke.com", "name": "An Evening of Sam Cooke by Daughter Carla Cooke"}, {"url": "https://www.facebook.com/events/1060585290673795/", "source": "Facebook", "date": "2016-05-07T07:00:00-04:00", "description": "Pucker up! All cosmetics and facial care are 25% off Friday through Sunday, so stock up for yourself or someone you love <3", "name": "25% Off Cosmetics and Facial Care"}, {"url": "https://www.facebook.com/events/1699521606955785/", "source": "Facebook", "date": "2016-05-07T09:00:00-04:00", "description": "Garlic Mustard Weed-Out Day is an annual tradition! On one day, volunteers hand-pull invasive garlic mustard in natural areas all around Ann Arbor! Garlic mustard is an aggressive invasive plant which can quickly crowd out native plant species and decrease natural diversity in the woods. Identifying and pulling garlic mustard is fun and easy for all ages, making this is a great volunteer opportunity for families. \nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free. \nParticipating parks:\n•\tArgo - Meet at the north end of the Argo Canoe Livery parking lot near the entrance to the woods, 1055 Longshore Drive.\n•\tCedar Bend  - Meet us at the Island Park parking lot, at the end of Island Drive\n•\tHannah - Meet at the west end of Bath Street, off 7th, just north of Huron.\n•\tMarshall - Meet in the parking lot off Dixboro Road, north of Plymouth Road\n•\tMiller - Meet at the Arborview Boulevard entrance, just east of Wildwood Avenue.\n•\tWhite Oak - Meet at the park entrance on White Oak Drive.", "name": "Garlic Mustard Weed-Out Day!"}, {"url": "https://www.facebook.com/events/976597525749572/", "source": "Facebook", "date": "2016-05-07T10:00:00-04:00", "description": "Every year, on the first Saturday in May, Vault of Midnight takes part in Free Comic Book Day. This is a nationwide event in which free comic books rain down from the heavens into the hands of THOUSANDS of eagerly awaiting fans and unsuspecting bystanders alike. The goal of the event is to spread the word about comic books and to share with the curious (but uninitiated) an approachable, inexpensive way to get introduced to what the medium has to offer. \n\nAnn Arbor loves Free Comic Book Day. Every year comic book fans from all over South Eastern Michigan travel to Ann Arbor on a sacred yearly pilgrimage of nerdy enlightenment. This year travelers can expect even more amazing cosplay, trivia, high-fives, and FREE comics than ever before. The Vault staff will be opening the doors to the ever sought-after Sales Grotto with it's treasures aplenty, and will be constructing a Great Wall of Comics filled with their favorite trade paperbacks. Some killer local businesses wanted to get in on the mix and will be offering deals to anyone who visits them with a Free Comic Book Day bag. Participants include:\n\nBeer Grotto\nCherry Republic\nConor O'Neill's\nEspresso Bar\nLiterati Bookstore\nMichigan Theater & State Theatre\nMoosejaw\nOld Town\nShinola\nSpencer\nFjallraven", "name": "Free Comic Book Day"}, {"url": "https://www.facebook.com/events/244448292574244/", "source": "Facebook", "date": "2016-05-07T10:00:00-04:00", "description": "Is your medicine cabinet full of expired drugs or medications you no longer use? Keep prescription drugs out of the wrong hands by bringing them to our next event.\n\nThe Division of Pain Research (Dept of Anesthesiology, University of Michigan) and Ann Arbor Police Department are partnering together on Saturday, May 7 from 10-2PM to collect unwanted, expired, or unused pain medicines. Dispose of your pain medications safely at this free event!\n\nhttps://medicine.umich.edu/dept/pain-research/events/201605/may-7-2016-pain-medication-take-back-event", "name": "Pain Medication Take-Back Event UM/Ann Arbor Police Department"}, {"url": "https://www.facebook.com/events/1566275347035929/", "source": "Facebook", "date": "2016-05-07T11:00:00-04:00", "description": "Literati is delighted to welcome Wendy BooydeGraff, author of Salad Pie, to a very special story time. Kids of many ages are welcome to attend. Free and open to the public.\n\nAbout the book: There is nothing sweeter than arriving at the playground, seeing it empty, and knowing you have it all to yourself--the silent comfort of playing alone. Maggie is overjoyed to have that solitude to make her Salad Pie. But then Herbert saunters over and wants to play too. \"I'm making salad. Salad Pie. And don't you touch it!\" Herbert just wants to help, even though Maggie makes it clear she won't let him. Then her imaginary pie takes a spill, and she realizes Herbert's intentions are not so bad after all.\n\nWendy BooydeGraaff grew up making mud pies on a fruit farm in Ontario, Canada. She now lives in Michigan with her family, where she whips up all kinds of salads and all kinds of pies.\n\nEvent date: \nSaturday, May 7, 2016 - 11:00am", "name": "Story Time with Wendy Booydegraff"}]