[{"url": "https://www.facebook.com/events/946362432150961/", "description": "The City is hosting a third and final Open House for all sump pump owners on sump pump operations and maintenance on Wednesday, May 11 in the cafeteria at Lawton Elementary School, located at 2250 S Seventh St in Ann Arbor, 6:30 to 8:30 p.m. \n\nAttendees will learn about sump pump operations, maintenance, tips to keep their basements dry and have an opportunity to ask questions. There is no formal presentation; residents can stop by anytime between 6:30 and 8:30 p.m. This workshop is a repeat of previous sump pump workshops. \n \nTo learn more about sump pumps and how to properly maintain them, watch a few short videos. The videos and other materials on the website explain the purpose of a sump pump, as well as the components of a footing drain disconnection and sump pump installation. More information is available at a2gov.org/sumppumps.", "source": "Facebook", "date": "2016-05-11T18:30:00-04:00", "name": "Sump Pump Workshop"}, {"url": "https://www.facebook.com/events/606755719498706/", "description": "Literati is thrilled to welcome Emily St. John Mandel, author of Station Eleven, which was chosen as the 2015-16 Great Michigan Read! This event is sponsored by the Michigan Humanities Council and is free and open to the public.\n\nStation Eleven is an audacious, darkly glittering novel about art, fame, and ambition set in the eerie days of civilization's collapse. One snowy night a famous Hollywood actor slumps over and dies onstage during a production of King Lear. Hours later, the world as we know it begins to dissolve. Moving back and forth in time—from the actor's early days as a film star to fifteen years in the future, when a theater troupe known as The Travelling Symphony roams the wasteland of what remains—this suspenseful, elegiac, spellbinding novel charts the strange twists of fate that connect five people: the actor, the man who tried to save him, the actor's first wife, his oldest friend, and a young actress with the Traveling Symphony, caught in the crosshairs of a dangerous self-proclaimed prophet. Sometimes terrifying, sometimes tender, Station Eleven tells a story about the relationships that sustain us, the ephemeral nature of fame, and the beauty of the world as we know it.\n\nEmily St. John Mandel is the author of four novels, most recently Station Eleven, which was a finalist for a National Book Award and the PEN/Faulkner Award, and won the 2015 Arthur C. Clarke Award. A previous novel, The Singer's Gun, was the 2014 winner of the Prix Mystere de la Critique in France. Her short fiction and essays have been anthologized in numerous collections, including Best American Mystery Stories 2013. She is a staff writer for The Millions. She lives in New York City with her husband and daughter.", "source": "Facebook", "date": "2016-05-11T19:00:00-04:00", "name": "Emily St. John Mandel"}, {"url": "https://www.facebook.com/events/834448559998831/", "description": "Curse from Baltimore, Maryland are coming back to the 3rd Death Star sandwiched between Scissor Now! and Dear Darkness\n\nhttps://scissornow.bandcamp.com/\nhttps://cursebaltimore.bandcamp.com/\nhttps://deardarkness1.bandcamp.com/", "source": "Facebook", "date": "2016-05-11T19:00:00-04:00", "name": "Scissor Now!, Curse, Dear Darkness"}, {"url": "https://www.facebook.com/events/879543862156644/", "description": "Viola Shipman is a pen name for Wade Rouse, a popular, award-winning memoirist. Rouse chose his grandmother’s name, Viola Shipman, to honor the woman whose charm bracelet and family stories inspired him to write his debut novel, which is a tribute to all of our elders. Rouse lives in Michigan and writes regularly forPeopleand Coastal Living, among other places, and is a contributor to All Things Considered. To date, The Charm Bracelethas been translated into nine languages. He is at work on his second “heirloom novel,” which will be published in 2017.\n\nThrough an heirloom charm bracelet three women will rediscover the importance of family and a passion for living as each charm changes their lives.\n\nFor every birthday Lolly’s mother gave her a charm with the advice that there is nothing more important than keeping family memories alive and Lolly’s charm bracelet would be a constant reminder of that love.\n\nNow seventy and starting to forget things, Lolly knows time is running out to reconnect with a daughter and granddaughter whose lives have become too busy for Lolly or her family stories.\n\nWhen Arden, Lolly’s daughter, receives an unexpected phone call about her mother she and granddaughter Lauren rush home.  Over the course of their visit Lolly reveals the story behind each charm on her bracelet and one by one the family stories help Lolly, Arden and Lauren reconnect in a way that brings each woman closer to finding joy, love and faith.\n\nA compelling story of three women and a beautiful reminder of the preciousness of family The Charm Bracelet is a keepsake you’ll cherish long after the final page.", "source": "Facebook", "date": "2016-05-11T19:00:00-04:00", "name": "Meet Author Viola Shipman (aka Wade Rouse) for a Discussion & Signing of His Debut Novel 'the charm bracelet'"}, {"url": "https://www.facebook.com/events/222011124804458/", "description": "Wed. May 11 | 9pm | 18+ | $20 Cover\n\nHailing from Oakland, California, Del the Funky Homosapien and his crew, the Hieroglyphics came out as a markedly non-gangster response to a burgeoning West Coast scene. After being put on at the tender age of 17 by his cousin Ice Cube, Del released two records on Elektra, I Wish My Brother George Was Here (1991) and No Need For Alarm (1993). Despite record sales in the hundreds of thousands, he recorded a third album, Future Development, which was never commercially released. Del parted with Elektra and started work on the Hieroglyphics..family album, 3rd Eye Vision (Hiero Imperium, 1998). Hiero went on the road and toured incessantly in support of the album for much of 1998. Del also spent a good portion of his time drawing, practicing Japanese, and playing mass amounts of video games. Finally ready to unleash a new record on the world, Del comes with BOTH SIDES OF THE BRAIN. Seventeen tracks of pure Del. He says of his work on this album: ..\"I've had complete control\". At times, Del has felt restrained by the formulas in hip hop and the expectations fans place upon emcees who have had hits. I wish that I had the same freedom that someone like Bjork has when she puts out an album..Apart from collaborations with PrincePaul, El-P (Company Flow), and help from a few of his Hiero cohorts (A-plus, Casual, Domino) Del handled the majority of production on this album. By staying true to himself, Del has earned legions of adoring fans. He may have said it best in his classic, Mistadobalina when he declared all in the mind and the heart. WSG: Sean Anonymous", "source": "Facebook", "date": "2016-05-11T21:00:00-04:00", "name": "Del The Funky Homosapien wsg DJ Shiftee & Sean Anonymous 5/11/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1725605471016948/", "description": "Literati is happy to welcome Garrard Conley in support of his memoir, Boy Erased. \n\nBoy Erased is a beautiful, raw and compassionate memoir about identity, love and understanding. The son of a Baptist pastor and deeply embedded in church life in small town Arkansas, as a young man Garrard Conley was terrified and conflicted about his sexuality. When Garrard was a nineteen-year-old college student, he was outed to his parents, and was forced to make a life-changing decision: either agree to attend a church-supported conversion therapy program that promised to “cure” him of homosexuality; or risk losing family, friends, and the God he had prayed to every day of his life. Through an institutionalized Twelve-Step Program heavy on Bible study, he was supposed to emerge heterosexual, ex-gay, cleansed of impure urges and stronger in his faith in God for his brush with sin. Instead, even when faced with a harrowing and brutal journey, Garrard found the strength and understanding to break out in search of his true self and forgiveness. By confronting his buried past and the burden of a life lived in shadow, Garrard traces the complex relationships among family, faith, and community. At times heart-breaking, at times triumphant, this memoir is a testament to love that survives despite all odds.\n\n“Boy Erased is an essential document of the early 21st Century. Conley bears witness to something history will eventually condemn as too horrible to have happened, but he also takes the pain of ‘ex-gay therapy’ and makes of it not just a record but a wonder.”—Alexander Chee, author of The Queen of the Night\n\n“This brave and bracing memoir is an urgent reminder that America remains a place where queer people have to fight for their lives. It’s also a generous portrait of a family in which the myths of prejudice give way before the reality of love. Equal parts sympathy and rage, Boy Erased is a necessary, beautiful book.” —Garth Greenwell, author of What Belongs to You\n\n“Garrard Conley's memoir about the author’s time in the ex-gay movement is actually about surviving an attempt at soul-murder. The author has given us a clear and beautifully written account of what he went through. This is a book that had to be written, and it deserves a wide audience.”—Charles Baxter, author of The Feast of Love\n\n“In 1982, Edmund White broke literary ground with his memoir A Boy’s Own Story. Now it’s Garrard Conley’s turn to bring his own story to readers. Conley is brave and honest in his depiction of growing up gay in conservative Christian America. As White was three decades ago for his generation, Conley is an important and necessary contemporary voice.”—Ann Hood, author of The Knitting Circle and Comfort\n\n“A brave account of a young many coming to terms with his sexuality in an environment that reviles him for it. A triumphant, heart-felt story.” —Julia Scheeres, author of Jesus Land\n\nGarrard Conley’s fiction and nonfiction can be found in The Common, The Madison Review, Spork, and elsewhere. He was a finalist for Narrative Magazine’s Winter 2013 story contest. Conley currently teaches English literature and promotes LGBTQ equality in Sofia, Bulgaria.", "source": "Facebook", "date": "2016-05-12T19:00:00-04:00", "name": "Garrard Conley: Boy Erased"}, {"url": "https://www.facebook.com/events/1593955534251439/", "description": "This month we will host an hour of Open Mic session when area poets can read their own work or share a favorite poem by another author in a welcoming atmosphere.  This is a monthly poetry series held on the second Thursday of most months at 7 pm.\n\nFor the first time, we have a theme - Purple Power - Passion & Peace... More details to come...", "source": "Facebook", "date": "2016-05-12T19:00:00-04:00", "name": "Open Mic & Share Poetry Series"}, {"url": "https://www.facebook.com/events/792788607487695/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "source": "Facebook", "date": "2016-05-13T15:00:00-04:00", "name": "Drink & Draw / Imbibe & Inscribe"}, {"url": "https://www.facebook.com/events/227197617636126/", "description": "Join the fun in Downtown Ann Arbor on Friday, May 13th at this Main Street Area Association hosted event!\n\nABC is offering a specials on our Ladies Night cocktail list:\n\nPass that Dutch - Strawberry Blonde & Lemonade.\n\nGet Ur Freak On - Muddled raspberries, blueberries, and mint. Shaken with tequila and sour mix. Served over ice, and topped with ginger beer.\n\nLose Control (BeerRita) - Cuervo, Euchre Pilsner, Simple Syrup, and Fresh lime juice. \n\nSock it to me - Fresh Mint muddled with Bacardi. Topped with hard cider, and Pama Liquor\n\nFrom 5-9pm retailers roll out the red carpet with special offers, discounts, snacks, goody bags, raffles and more! Participate in our ‘passport’ program during this time and be entered into a drawing to win fabulous prizes!\n\nPick up a Ladies Night Passport at any of the participating retailers listed on the MSAA website, and receive a stamp for each one you visit. Collect 15 stamps, turn in your passport at any of the participating shops, and be entered to WIN!\n\nhttp://mainstreetannarbor.org/2016/03/ladies-night-friday-may-13/", "source": "Facebook", "date": "2016-05-13T17:00:00-04:00", "name": "MSAA Ladies Night"}, {"url": "https://www.facebook.com/events/253770371623807/", "description": "Join the fun in Downtown Ann Arbor on Friday, May 13th!\n\nSales will be offered throughout the day, but from 5-9pm the retailers roll out the red carpet with special offers, discounts, snacks, goody bags, raffles and more! Participate in our ‘passport’ program during this time and be entered into a drawing to win fabulous prizes!\n\nPick up a Ladies Night Passport at any of the participating retailers listed below, and receive a stamp for each one you visit. Collect 15 stamps, turn in your passport at any of the participating shops, and be entered to WIN!\n\nFor a complete list of participating retailers and their Ladies Night specials, please visit www.mainstreetannarbor.org", "source": "Facebook", "date": "2016-05-13T17:00:00-04:00", "name": "Ladies Night 2016"}]