[{"source": "Facebook", "url": "https://www.facebook.com/events/304390803296325/", "description": "Some like it cold!\n\nFebruary temperatures means it’s time for the annual University of Michigan Ice Carving Extravaganza in the Main Street area. Watch members of the U of M Ice Carving Team as they carve sculptures on the sidewalks of Main, Liberty, Washington, and Fourth with chainsaws, blowtorches and power tools. Come downtown and see the amazing work created by these talented students!\n\nSculpting Hours:\nFriday, February 3 from 3-7pm\nSaturday, February 4 from 10am-5pm\nSunday, February 5 from 10am-2pm\n\nSculptures will remain on display for as long as they last!", "date": "2017-02-03T15:00:00-05:00", "name": "Annual Ice Carving Extravaganza"}, {"source": "Facebook", "url": "https://www.facebook.com/events/731926473638010/", "description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "date": "2017-02-03T17:00:00-05:00", "name": "Sunseed Farm CSA Pickup"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1857023781249128/", "description": "Please join us for the opening reception of ART NOW: PRINTMAKING on Friday, February 3, from 6 to 9 pm. \n\nThe exhibition is free and open to the public daily from February 3 to March 4\n\nJuror: Tyanna J. Buie, Assistant Professor/ Section Chair of Printmaking at the College for Creative Studies.\n\nART NOW: PRINTMAKING is the third annual exhibition in the Ann Arbor Art Center’s Art Now Series.  Each year, on a rotating basis, the Ann Arbor Art Center presents a media-focused exhibition as part of the series. We are pleased to present this year's exhibit which features innovative work in printmaking.\n\n“We deal with printed images every day. Anything that is made in a reproducible format is a print.”  - A Complete Guide to Materials & Processes by Beth Grabowski & Bill Fick\n\nThe field of printmaking is an ever-evolving medium that is deeply engaged in the act of social practice. Printmakers are artists who employ the rich history of printmaking as a basis for the works they create, and are also known to share their methods, facilitate workshops, and create environments where collaboration is welcomed. Although printmaking is considered to be a niche field of study, it is universally known through its traditional and historical processes such as Lithography, Intaglio, Relief, and Screen-printing. Printmaking has paved the way for technology and many digital advances, changing the landscape of the art world, politics and education. Walter Benjamin’s 1936 essay “The Work of Art in the age of Mechanical Reproduction” suggests that a series or an edition is equal to an “original” work, which holds an historical perception of uniqueness and authenticity.\n\nWhile some artists are heavily based in traditional modalities of printmaking, other artists will test the limits of what defines a “print” and push beyond the conventional boundaries, thus allowing for hybrid processes to be employed and combined. The use of such advances include, digital photo-based imaging, sculpture, performance, video, installation, painting and drawing.\n\nThis exhibition will highlight artists that employ traditional printmaking processes, as well as artists who move across disciplines, using “print” as their foundation, with an emphasis on investigative and exploratory ways of working with the printed image.\n\n-----------\n\nThe 117 Gallery 2016/2017 season is supported by Vintage Financial Services LLC\n\nArt Now: Printmaking is sponsored by Underground Printing", "date": "2017-02-03T18:00:00-05:00", "name": "Art Now: Printmaking"}, {"source": "Facebook", "url": "https://www.facebook.com/events/254338798323472/", "description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "date": "2017-02-03T19:30:00-05:00", "name": "Sing Happy!"}, {"source": "Facebook", "url": "https://www.facebook.com/events/102986336775427/", "description": "When the Estonian Philharmonic Chamber Choir landed in New York for its first North American tour in 1995 (including a stop in Ann Arbor for UMS’s very first concert at St. Francis), they were known only as the performers on the best-selling CD of fellow-Estonian Arvo Pärt’s austere Te Deum.\n\nThe concerts showed much more — a virtuosic ensemble that could dazzle in everything from Bach to folk songs. Now they return with newly-named artistic director Kaspars Putniņš with music by Pärt, Schnittke, Ligeti, Brahms, and Tormis. “So wondrously talented…the selections and performances were so fine that they left you feeling like an ingrate, greedily hungry for more.” (New York Times)\n\nMore info: http://ums.org/performance/estonian-philharmonic-chamber-choir/", "date": "2017-02-03T20:00:00-05:00", "name": "Estonian Philharmonic Chamber Choir"}, {"source": "Facebook", "url": "https://www.facebook.com/events/213295682447028/", "description": "For over twenty years, Robert Jones and Matt Watroba have been musical partners.  Their relationship started when they each hosted a radio show on Detroit's WDET-FM.  They started performing together and discovered a friendship based on mutual respect and a love for traditional American music.  Now, Matt and Robert travel the nation extolling the virtues of “Music That Matters”.\nFor Matt and Robert, American roots music (folk, blues, spirituals, work songs, chants) is, indeed, music that matters.  This is the music that America and the world have in common.  It is music that reflects history; social change; migration; hopes and dreams.  It is music that is rich and diverse, direct and powerful.  As talented as they are individually, Matt and Robert together form a stage presence that is greater than the sum of its parts. You might even get to sing along! \nwww.mattwatroba.net\nwww.revrobertjones.com", "date": "2017-02-03T20:00:00-05:00", "name": "Matt Watroba & Rev Robert Jones at Green Wood Coffee House"}, {"source": "Facebook", "url": "https://www.facebook.com/events/170550763418928/", "description": "Fri. February 3 | 9pm | 18+ | $15 Cover\n\nThat 1 Guy\nWith an extensive and amazing track record of unique and imaginative performances featuring his curious instrument and copious amounts of originality, Mike Silverman, a/k/a That1Guy, has set himself apart as a true one-of-a-kind talent that rivals any other artist currently in the entertainment industry. Averaging 150-200 shows a year all over North America and Canada, he has been a consistent favorite at such festivals as: Wakarusa, Electric Forest, Big Day out, All Good Music Festival, Bella, High Sierra Music Festival, Summer Meltdown, Montreal Jazz Festival, and many more. He was also the ‘Tap Water Award’ winner at the Edinburgh Fringe Festival for best musical act. His legendary collaboration and multiple tours with Buckethead performing as The Frankenstein Brothers has further cemented his virtuoso story as a creative visionary.", "date": "2017-02-03T21:00:00-05:00", "name": "That 1 Guy 2/3/17 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "url": "https://www.facebook.com/events/169321516879125/", "description": "Join us at Aventura for a 50-minute, strengthening barre class led by The Barre Code’s very own Adrianne Madias! Work through dynamic, full-range movements to the top 40 pop & hip-hop hits at Ann Arbor's Hottest Restaurant.\u0003\u0003The class will be followed by a light and healthy, authentic Spanish brunch and a build your own mimosa bar!", "date": "2017-02-04T09:00:00-05:00", "name": "Barre, Bubbles, & Brunch"}, {"source": "Facebook", "url": "https://www.facebook.com/events/735590043264320/", "description": "Hot cacao has been a happening drink for thousands of years. Mayan people drank it 1,500 years ago, and the Aztecs sipped it as a spicy bitter drink in the 1400s. What we call “hot cocoa’ didn’t become popular until the 1700s—and we’re still drinking it today! Please join us on Saturday February 4th to make hot cocoa, play games, and taste chocolate. Plus you'll learn all about how to enjoy this delicious food while protecting some of Earth's most endangered ecosystems. \n\n\nThe event will take place in two sessions. The times are as follows:\n\nSession 1: 9:30-11:00 am\nSession 2: 12:00-1:30 pm \n\nPlease register your child for the event using the following link. Children who are not registered will not be guaranteed a spot at this event. See you there!\n\nhttp://mbgna-peony.miserver.it.umich.edu/shop/youth-programs", "date": "2017-02-04T09:30:00-05:00", "name": "Hot Chocolate at Matthaei Botanical Gardens"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1716505231999811/", "description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "date": "2017-02-04T10:00:00-05:00", "name": "Intro to Stagecraft Workshops"}]