[{"url": "https://www.facebook.com/events/325821474423026/", "source": "Facebook", "date": "2016-09-27T19:00:00-04:00", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nTike Anderson Music\nTike Anderson’s songs are genuine testaments to life on the road, life at home, life in the center of the fire and life in the Motor City. He is an accomplished guitar player with a voice that sounds trained but feels honest. Tike’s songwriting blends road worn soul with the roots rock grit of the motor city and a hint of the easy intellectual earth tones of Ann Arbor.\n\nNever a cover\nAlways a good time", "name": "Acoustic Tuesdays: Tike Anderson"}, {"url": "https://www.facebook.com/events/1190479254318296/", "source": "Facebook", "date": "2016-09-27T20:00:00-04:00", "description": "Tue. September 27 | 8pm | 18+ | $15 adv./ $17 day of\n\nann arbor's 107one presents: Anderson East\n\nAnderson East learned to sing and play guitar at 11 years old. He is the grandson of a southern Baptist preacher, while his mother played piano in the church. After spending much of his time touring and engineering records, he was discovered by Dave Cobb at Nashville's Bluebird Café.\n\nHis debut album on Low Country Sound / Elektra, entitled 'Delilah,' was released on July 10th, 2015. Before the release East started touring nationally in January 2015 as direct support for Sturgill Simpson. In addition to his own sold-out headline shows, he has toured with Brandi Carlile, The Lone Bellow, Jason Isbell, and John Butler Trio. \"Satisfy Me\" was the first single released off the record. It instantly went top 10 viral on Spotify and received regular radio airplay. NPR music called 'Delilah' an \"eclectic, fully formed debut album.\" Daytrotter wrote, \"It's one of those 10-song records that's damned near perfect, traveling through the old, smoky bars of older days and down the twisted back roads of love.\" On July 15th, 2015 East made his television debut on \"Late Night with Seth Meyers,\" and also appeared on \"CBS This Morning Saturday\" in support of his album.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/724", "name": "Anderson East - Devil in Me Tour 9/27/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/183136952114468/", "source": "Facebook", "date": "2016-09-27T20:00:00-04:00", "description": "Hailed by the Boston Globe as “elegant and exacting,” Hub New Music is a mixed quartet crafting new experiences in 21st century sound. With a unique instrumentation of two winds and two strings, Hub explores a richly diverse palate of newly commissioned and rarely performed works for its non-standard combination. \n\nMichael Avitable, flute\nDavid Dziardziel, clarinet\nOrin Laursen, violin\nAllison Drenkow, cello\n\nProgram:\nJudd Greenstein, \"at the end of a really great day\"\nNico Muhly, \"I know where everything is\"\nKirsten Volness, New Work for Hub New Music\nDaniel Wohl, \"Microfluctuations in Plainchant\"\nMason Bates, \"The Life of Birds\"\n\nThis performance is presented in partnership with ÆPEX Contemporary Performance. Visit aepexcontemporary.org, or follow ÆPEX on Twitter @aepexcp, to learn more about ÆPEX Contemporary Performance's debut season and plans for the future.\n\nTickets:\n$25 Assigned Seats in Rows 1-2\n$15 Assigned Seats in Rows 3-5\n$10 General Admission\n$5 Student General Admission", "name": "Hub New Music: Pushing Boundaries"}, {"url": "https://www.facebook.com/events/585713071616738/", "source": "Facebook", "date": "2016-09-28T12:00:00-04:00", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "name": "POP-X"}, {"url": "https://www.facebook.com/events/179229159178583/", "source": "Facebook", "date": "2016-09-28T19:00:00-04:00", "description": "Literati is pleased to welcome Chuck Collins in support of Born on Third Base: A One Percenter Makes the Case for Tackling Inequality, Bringing Wealth Home, and Committing to the Common Good.\n\nAs inequality grabs headlines, steals the show in presidential debates, and drives deep divides between the haves and have nots in America, class war brews. On one side, the wealthy wield power and advantage, wittingly or not, to keep the system operating in their favor—all while retreating into enclaves that separate them further and further from the poor and working class. On the other side, those who find it increasingly difficult to keep up or get ahead lash out—waging a rhetorical war against the rich and letting anger and resentment, however justifiable, keep us from seeing new potential solutions.\n\nBut can we suspend both class wars long enough to consider a new way forward? Is it really good for anyone that most of society’s wealth is pooling at the very top of the wealth ladder? Does anyone, including the one percent, really want to live in a society plagued by economic apartheid? It is time to think differently, says longtime inequality expert and activist Chuck Collins. Born into the one percent, Collins gave away his inheritance at 26 and spent the next three decades mobilizing against inequality. He uses his perspective from both sides of the divide to deliver a new narrative. Collins calls for a ceasefire and invites the wealthy to come back home, investing themselves and their wealth in struggling communities.  And he asks the non-wealthy to build alliances with the one percent and others at the top of the wealth ladder.\n\nStories told along the way explore the roots of advantage, show how taxpayers subsidize the wealthy, and reveal how charity, used incorrectly, can actually reinforce extreme inequality. Readers meet pioneers who are crossing the divide to work together in new ways, including residents in the author’s own Boston-area neighborhood who have launched some of the most interesting community transition efforts in the nation. In the end, Collins’s national and local solutions not only challenge inequality but also respond to climate change and offer an unexpected, fresh take on one of our most intransigent problems.\n\n“I have never read a story remotely like the one Chuck Collins has to tell. Born to the one percent, in circumstances few of us can imagine, he grew an outsized conscience and gave up his inherited wealth for a life of fighting the vicious inequality that is destroying our country. Somewhere along the way, he came to understand that the rich can be part of the solution instead of the problem and started organizing them to join in the struggle for a fair economy. The result is an electrifying challenge to the affluent as well as the one percent. ‘Come out of your gated communities and gated hearts,’ he writes, because outside lies the warmth of human solidarity.”--Barbara Ehrenreich, author of Nickel and Dimed\n\nChuck Collins is a researcher, campaigner, storyteller, and writer based at the Institute for Policy Studies where he co-edits Inequality.org. He has written extensively on wealth inequality in previous books like 99 to 1, Wealth and Our Commonwealth (with Bill Gates Sr.), and Economic Apartheid in America as well as in The Nation, The American Prospect, and numerous other magazines and news outlets. Collins grew up in the 1 percent as the great grandson of meatpacker Oscar Mayer, but at age 26 he gave away his inheritance. He has been working to reduce inequality and strengthen communities since 1982 and in the process has cofounded numerous initiatives, including Wealth for the Common Good (now merged with the Patriotic Millionaires), United for a Fair Economy, and Divest-Invest. He is also a leader in the transition movement, and a co-founder of the Jamaica Plain New Economy Transition and the Jamaica Plain Forum, both in the Boston-area community in which he lives.", "name": "Chuck Collins"}, {"url": "https://www.facebook.com/events/1731098520471774/", "source": "Facebook", "date": "2016-09-28T21:00:00-04:00", "description": "We're bringing the Painting With Dreams tour to Necto Nightclub in Ann Arbor!\n\nNew album, a brand new stage production, and most important, all of our Tritonians of Michigan under one roof!!!!\n\nMore info and tickets - http://paintingwithdreams.com/\n\nSee you this fall!", "name": "Tritonal: Painting With Dreams - Ann Arbor"}, {"url": "https://www.facebook.com/events/671611199664649/", "source": "Facebook", "date": "2016-09-29T08:00:00-04:00", "description": "Girls on the Run of Southeastern Michigan provides a 10 week after-school program for girls in 3rd-5th grade, teaching inspiration through physical, emotional, social and mental development. 10% of our sales on this day will go to support girls in Ann Arbor and Ypsilanti", "name": "Impact Day benefiting Girls on the Run"}, {"url": "https://www.facebook.com/events/1004381566339871/", "source": "Facebook", "date": "2016-09-29T18:00:00-04:00", "description": "Our taps will be flowing with our new favorite seasonals, we'll have our made in-house sausages, and we heard a rumor Kevin's going to be in lederhosen. Join us!", "name": "Oktoberfest Tap Takeover"}, {"url": "https://www.facebook.com/events/298029700570409/", "source": "Facebook", "date": "2016-09-29T19:00:00-04:00", "description": "Are you a young NPR nerd? Do you keep that love a secret...\nLest your friends say \"oh, yeah, my Mom loves NPR?\"\nCome, meet your kind, at the Arbor Brewing Company in Ann Arbor.  \n\nWe'll pre-game Arbor Brewing Company's trivia night with our on-air hosts.\n\nThursday night - September 29th - starting at 7. Five bucks gets you  Michigan Radio Pint glass. And your first beer is on us. Trivia starts at 8!\n\nLearn more on our events page: http://michiganradio.org/community-calendar/event/58145", "name": "Trivia Night Pre-Game"}, {"url": "https://www.facebook.com/events/117748215350733/", "source": "Facebook", "date": "2016-09-29T19:00:00-04:00", "description": "Literati is pleased to welcome photographer Jan Banning in support of Bureaucratics and Law & Order, and in conjunction with an exhibition at the University of Michigan Institute for the Humanities Gallery.\n\nBureaucratics is a project consisting of a book and a traveling exhibition that has so far been shown in museums and galleries in some twenty countries on five continents. The book and the exhibition contain 50 photographs and are the product of an anarchist’s heart, a historian’s mind and an artist’s eye. Bureaucratics is a comparative photographic study of the culture, rituals and symbols of state civil administrations and its servants in eight countries on five continents, selected on the basis of political, historical and cultural considerations: Bolivia, China, France, India, Liberia, Russia, the United States, and Yemen. In each country, Jan visited up to hundreds of offices of members of the executive in different services and at different levels. The visits were unannounced and the accompanying writer, Will Tinnemans, by interviewing kept the employees from tidying up or clearing the office. That way, the photos show what a local citizen would be confronted with when entering.\n\nThe photography has a conceptual, typological approach reminding of August Sander’s ‘Menschen des 20 Jahrhunderts’ (‘People of the Twentieth Century’). Each subject is posed behind his or her desk. The photos all have a square format (fitting the subject), are shot from the same height (that of the client), with the desk – its front or side photographed parallel to the horizontal edges of the frame – serving as a bulwark protecting the representative of rule and regulation against the individual citizen, the warm-blooded exception. They are full of telling details that sometimes reveal the way the state proclaims its power or the bureaucrat’s rank and function, sometimes of a more private character and are accompanied by information such as name, age, function and salary. Though there is a high degree of humour and absurdity in these photos, they also show compassion with the inhabitants of the state’s paper labyrinth.\n\nThe project Bureaucratics has been made possible with financial support from the Foundation for Democracy and Media, Stichting Fonds Anna Cornelis, NCDO and SBKU Utrecht (Committee for the Promotion of Visual Arts).\n\n*\n\nLaw & Order is a photo project that compares the criminal justice system in four different countries on four continents: Colombia (South-America), France (Europe), Uganda (Africa) and the United States (North-America). It combines an artistic view with a documentary approach and sheds light on the key institutions within the criminal justice system: the police, the courts and prisons. Thanks to the avoidance of visual clichés – hands gripping prison bars, humbly bowed, seated prisoners and the like – that do little other than confirm the existing image, it can contribute to the international debate on criminal law. It raises questions such as: how do we deal with criminals? What is the relationship between punishment and crime? Is confinement, besides being an instrument of punishment, also effective as a means of correction?\n\nThe choice of the four countries was made in consultation with the Max Planck Institute for Foreign and International Criminal Law (MPI) in Freiburg, Germany, a scientific institute respected worldwide. Criteria were – besides being able to gain access – the diversity of legal systems (civil law and common law), the murder rate and a division between developed and developing countries.\n\nThe police and the judiciary come up frequently in the public debate and are a favorite subject for populist politics. There is rarely sympathy for criminals and politicians’ arguments for harsher penalties “because this cannot continue” find a receptive ear with large parts of the population in many countries. However, statistics show that developments in the field of serious crime are not necessarily unfavorable: murder and violent crimes in large parts of Europe are declining steadily over the past decade or two – and even longer in the US.\n\nLaw & Order is presented in the form of a book and an international traveling exhibition. In addition to the photographs, both contain relevant information and infographics (source: Max Planck Institute); the book also contains an introduction by Dutchman Michiel Scholtes about his experiences as a convict in a French prison.\n\n*\n\nJan Banning is a Dutch autonomous artist/photographer, based in Utrecht, the Netherlands. He was born in Almelo (Netherlands) on May 4, 1954, from Dutch East Indies parents, and he studied social and economic history at the Radbout University of Nijmegen. Banning’s art work has been acquired by museums such as the High Museum of Art, Atlanta, GA; the Museum of Fine Arts, Houston, TX; and the Rijksmuseum, Amsterdam. His photo series have been published in print media such as Days Japan, GEO (France, Germany, and International), l’Espresso, Newsweek (US and Japan), One World, Sunday Times Magazine, The New Yorker, The Guardian Weekend, Time, Vrij Nederland and many others.", "name": "Jan Banning"}]