[{"date": "2016-09-09T09:00:00-04:00", "url": "https://www.facebook.com/events/1090878344334512/", "source": "Facebook", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "name": "Sweetwaters Westgate Grand Opening!"}, {"date": "2016-09-09T16:30:00-04:00", "url": "https://www.facebook.com/events/631172927032422/", "source": "Facebook", "description": "The second Great Lakes Herb Faire will be happening this September 9-11th, 2016 in Chelsea, MI. Register now for an herbal educational extravaganza! We will offer dozens of classes on Herbal Medicine from well seasoned herbalists such as Matt Wood, Jim McDonald, Dr. Jody Noe, Lisa Rose and many more! Some class titles include \"Wisdom of Nature: What we Gain as Herbalists in Service of Nature\", \"Medical Herbal Strategies for Integrative Cancer Therapies\", \"Blessed Bitters\" and \"Introduction to West African Herbalism\". There will be kids classes such as\"Let’s Meddle with Nettles!\" and \"Wisdom of the Elders\".  There will be delicious and nutritious food available for those who sign up and music, entertainment and additional classes in the evenings for all. The Tree of Life Drummers and Dancers will get the Faire going at opening ceremony and Saturday night \"Eyes Unclouded\", an amazing local band will play. We will also have an open mic of sorts on Friday evening so bring your talents!\n\nDon't miss out on this amazing an unique opportunity! There will be much to be learned by both beginning and experienced herbalists, many connections will be made with other regional herbalists as well as with the beautiful lands of the Waterloo Recreation area.\n\nPlease see our website for more details!\nhttp://www.greatlakesherbfaire.org\n\nSee you at the Faire!\n-The Great Lakes Herb Faire organizers", "name": "The Second Great Lakes Herb Faire"}, {"date": "2016-09-09T17:00:00-04:00", "url": "https://www.facebook.com/events/1761402564145210/", "source": "Facebook", "description": "Come get scholarly about some of our favorite beers!", "name": "Back to School Beer Tasting"}, {"date": "2016-09-09T17:00:00-04:00", "url": "https://www.facebook.com/events/322134998120508/", "source": "Facebook", "description": "The kids are back in school, now it's wine time! We're pouring some of our favorites to help you celebrate.", "name": "Back to School Wine Tasting"}, {"date": "2016-09-09T17:30:00-04:00", "url": "https://www.facebook.com/events/988178937957475/", "source": "Facebook", "description": "• Opening Reception: Sept 9, 5.30 - 7.30 pm \n• Exhibit Dates: Sept 9 - Oct 1, 2016\n• Gallery hours: Thurs - Sat 3 - 8 pm & Sun 1.30 - 4 pm\n• Riverside Arts Center Gallery, 76 N. Huron St, (between               Michigan Ave and Cross St), Ypsilanti\n• RiverSide Arts Center Gallery", "name": "Riverside Arts Center"}, {"date": "2016-09-09T18:00:00-04:00", "url": "https://www.facebook.com/events/524758664380525/", "source": "Facebook", "description": "Gallery Project presents Re: Formation, a contemporary art exhibit in which over 50 local, regional and national artists address the push back that is occurring in communities nationwide around issues such as water access and safety, marginalization of the poor, the murder and incarceration of African American youth, and decay of urban infrastructure. The exhibit also highlights, as a form of push back, people’s shifting views and interactions with Nature, technology, and each other. Re: Formation is Gallery Project’s 4th annual dual-site, multi-media exhibition.\n\nThis event is FREE and open to the public.\n\nEXHIBITING ARTISTS INCLUDE:\nHeather Accurso, Hiba Ali, John James Anderson, Michael Arrigo, Siobhan Arnold, Nick Azzaro, Darryl Baird, Barchael (Barry Whittaker and Mike Bernhardt), Morgan Barrie, Carolyn Barritt, Beehive Design Collective (Meg Lemieur), Mark Bleshenski, Jada Bowden, Seder Burns, Ruth Crowe, Dana DePew, Rocco DePietro, James Dickerson, Desiree Duell, Elton Monroy Duran, Dianne Farris, Anthony Fontana, Mark Hereld, Dan Hernandez, Stephanie Howells, Doug Kampfer, Tohru Kanayama,  Yusuf Lateef, K.A. Letts, Kate Levy, Julianne Lindsey, Jeremy Link, Melanie Manos, Shanna Merola, Ken Milito, Michael Nagara, Jefferson Nelson, Endi Poskovic, Gloria Pritschet, Sharon Que, Raizup Collective (Antonio Cosme), Boris Rasin, Roger Rayle, Jesse Richard, Arturo Rodriguez, Gary Setzer, Meagan Shein, Anna van Schaap, Sheida Soleimani, Brian Spolans, Jessica Tenbusch, Alex Tsocanos, Ellen Wilt, Robin Wilt, and Viktor Witkowski.\n\nImage Credit: Nick Azzaro, \"Progress at the Old Smith Furniture Building\"\n\n\nREVIEWS:\n\nDetroit Art Review: http://goo.gl/yr8MGa\n\nK. A. Letts: https://goo.gl/koLXtJ\n\nToledo City Paper: http://goo.gl/TTDywo\n\n-----------\nFor more information about Re: Formation, go here: http://goo.gl/YAxfvd\n-----------\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC.\n\nCatering generously provided by Laura's Catering (http://laurascatering.com/)", "name": "Re: Formation Opening Reception"}, {"date": "2016-09-09T19:00:00-04:00", "url": "https://www.facebook.com/events/1607470706217717/", "source": "Facebook", "description": "Drop in during this free community event to browse the galleries and enjoy new special exhibitions including: new and recent work by Los Angeles-based contemporary photographer Catherine Opie; Whistler prints and South Asian folk art donated to UMMA from the private collection of Nesta and Walter Spink; new photography and a site-specific sculptural installation by artist and architect Catie Newell; 23 fantastical photographs from UMMA’s collection in Manuel Álvarez Bravo: Mexico’s Poet of Light; conceptual drawings by architect Mira Henry; and Mark Bradford: Spiderman. Enjoy live music performed by The Heather Black Project (HBP). Led by vocalist Heather Schwartz (aka Heather Black), this versatile ensemble puts an original spin on vintage jazz and incorporates modern elements of R&B, soul, and hip-hop. Curators’ conversations and light refreshments round out the event.\nUMMA After Hours is generously sponsored by Fidelity Investments. The media sponsor for UMMA After Hours is the Ann Arbor Observer.", "name": "UMMA After Hours"}, {"date": "2016-09-09T19:00:00-04:00", "url": "https://www.facebook.com/events/516806575181956/", "source": "Facebook", "description": "Literati is pleased to welcome Ken Foster in support of the his New York Times-bestselling memoir, The Dogs Who Found Me.\n\nIn concert with Ken's visit, we'll be holding a fundraiser for the Humane Society of Huron Valley's wonderful Bountiful Bowls program, which helps people keep pets instead of surrendering them to a shelter. HSHV accepts and distributes 40,000 pounds of pet food each year, and we're grateful for the work they do as well as their participation in this event. Food donations, as well as donations by cash or check, will be accepted at the event, or you can donate online. \n\nNow regarded as a classic in dog literature, Ken Foster's memoir chronicles his journey from first-time dog owner to rescuer—and all the lessons and mistakes he made along the way. Bookended by the tragedies of 9/11 and Katrina, Foster finds that dogs open his eyes to the benefits of compassion, selflessness, and the chaotic beauty of living each day in the moment. \n\nBut more than Foster's own story, readers remember the dogs. Among them are Duque, a Costa Rican stray; Brando, Foster's first adopted dog and a supposed pit bull mix who outgrew his Manhattan studio apartment; Rocco, a clownish red pit bull whose owner mistakenly gives him away to the wrong person; Zephyr, a cheerful Rottweiler mix who awakens Foster by sitting on his chest when his heart stops working; and Sula, the tiny lost pit bull who showed up at Foster's door one day and stayed. \n\nWhether bearing witness to national tragedy, grieving the death of a friend, or dealing with his own mortality, Foster finds strength in his dogs, and in the reciprocal nature of rescue. \n\n\"Generosity and gratitude power this compelling account of the reciprocal nature of rescue. Ken Foster illuminates a profound lesson about saving a life: Doing it makes you able to do it.\"–Amy Hempel, author of The Dog of the Marriage and Reasons to Live\n\nKen Foster is the editor of two anthologies, including Dog Culture, and the author of Dogs I Have Met and I’m a Good Dog. His collection of short stories, The Kind I'm Likely to Get, was a New York Times Notable Book. His work has appeared in The New York Times Book Review, The San Francisco Chronicle, McSweeney's, and The Believer. He has taught at The New School, Florida State University, and the University of Southern Mississippi. In 2008, he founded The Sula Foundation, which promotes responsible dog ownership among the pit bull population and sponsors education and outreach in the New Orleans area. He lives in New Orleans, with at least three dogs.", "name": "Ken Foster"}, {"date": "2016-09-09T19:30:00-04:00", "url": "https://www.facebook.com/events/1364500856898234/", "source": "Facebook", "description": "Ann Arbor Civic Theatre opens their 2016-2017 season with the musical comedy The 25th Annual Putnam County Spelling Bee, directed by Wendy Sielaff, September 8-11, 2016, at UM’s Lydia Mendelssohn Theatre, 911 N. University, Ann Arbor, 48109.  Performances are Thursday at 7:30 pm, Friday and Saturday at 8pm, with a 2pm matinee on Sunday.  Friday, Saturday and Sunday tickets are $26, with tickets at $23 for seniors and $14 for students. On Thursday only, all seats are $20, with $14 tickets for students. Tickets and information are available online at www.a2ct.org, through the A2CT office at 734-971-2228, or at the door of the theater before each performance.\n\nWinner of a Tony and a Drama Desk Award for Best Book, The 25th Annual Putnam County Spelling Bee sees six contestants in a high school gym vie for the title of Spelling Bee Champion. It’s a fast-paced, uproariously funny and wild ride, complete with audience participation.  Says director, Wendy Sielaff, “Don't be fooled by the age of our spellers - each of them comes with their own quirks. In a very funny score, creative dancing, and of course some spelling we see each speller truly trying to win the trophy.” With its terrific book and score and impressive cast, Spelling Bee is a witty and touching production that is sure to spell F-U-N. \n\nThe show does contain some mature content, and is recommended for those 16 and up.\n\nMusic direction for The 25th Annual Putnam County Spelling Bee is by Debra Nichols, with choreography by Reilly Conlon. The talented cast includes Allison Ackerman as Rona Lisa Peretti, Brandon Cave as Douglas Panch, Emily Fishman as Olive Ostrovsky, Hallie Fox as Marcy Park,Nick Rapson as Mitch Mahoney, Nathan King as Leaf Coneybear, Keshia Oliver as Logainne Schwartzandgrubenierre,Bob Cox as Chip Tolentino, and Connor Rhoades as William Barfee.", "name": "The 25th Annual Putnam County Spelling Bee"}, {"date": "2016-09-09T20:00:00-04:00", "url": "https://www.facebook.com/events/1675656812706888/", "source": "Facebook", "description": "There are songs that transport you to good times remembered. Songs like, “I’d Really Love To See You Tonight,” “Nights Are Forever Without You,” and, “Love Is The Answer” have that effect on many of us. These songs and numerous others have made John Ford Coley a singing legend.\nJohn is most revered as half of the duo England Dan and John Ford Coley. The classically-trained pianist and talented guitarist continues performing the gold and platinum record hits for audiences around the world. Some of Coley’s other hits are, “Gone Too Far,” “We’ll Never Have To Say Goodbye Again,” and, “Sad To Belong.\"\nJohn’s experiences comprise a broad background. Although he performed throughout high school and college as a classical and rock pianist, he chose to major in English Literature in college, and is an avid student of history. In the mid-1980’s, John began acting in television and in feature films. He recently penned a book, \"Backstage Pass,\" about his years in the music industry.\nwww.johnfordcoley.com", "name": "John Ford Coley at Green Wood Coffee House"}]