[{"source": "Facebook", "url": "https://www.facebook.com/events/318351918517122/", "description": "We're firing up the grill early to start our first tailgating weekend! Our butchers make special footlong sausages for our team to grill up, and we'll have special sides from the deli, all just $5 a plate.", "date": "2016-09-03T08:00:00-04:00", "name": "Tailgating $5 Footlong Sausages"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1770837316505091/", "description": "Nights at the Museum, UMMA’s first-ever exterior media art initiative, is open to the public, and will run from September 2-9 from 8:30 p.m. to dawn along its State Street-side facade.\n\nNights at the Museum begins Friday, Sept. 2, during Artscapade!, a Welcome Week event for new U-M students, and concludes on Friday, Sept. 9 at UMMA’s twice-annual After Hours community celebration.\n\nOn Friday, Saturday, and Sunday, from dusk to dawn, UMMA will showcase a digital art installation by Quayola called Pleasant Places. Inspired by the work of Vincent Van Gogh, Quayola has returned to the same countryside of Provence 125 years later to create of a series of digital paintings exploring the boundary between representation and abstraction. Pleasant Places will also be projected overnight throughout the remainder of the week. \n\nFor the Full Schedule Check Here: http://www.umma.umich.edu/news/2016/umma-to-light-up-campus-with-nights-at-the-museum", "date": "2016-09-03T20:30:00-04:00", "name": "Nights at the Museum"}, {"source": "Facebook", "url": "https://www.facebook.com/events/817917348344519/", "description": "We're having a huge UV Paint Party to kick off the season! We'll have paint cannons splashing you with water-based, kid-safe, and washable paint + black lights all over to make the colors stand out. Wear white to really make it pop! \n\nDon't want to? No problem. Watch from the mezzanine and party in the other paint-free places.\n\n• DRINK SPECIALS. Happy Hour is from 9pm - 11pm with\n50% off all drinks, shots & bottled beers. $2 Miller Lite bottles & $2 Vodka Drinks all night.\n\n• MUSIC. DJ Hardy spins the best Top 40, Dance & House with host MC Yoda.\n\n• FREE PICTURES with your friends by a professional photographer.\n\n• COVER. $5 for 21+ & $10 for 18 to 20.\n\nCome play in the paint.", "date": "2016-09-03T21:00:00-04:00", "name": "Ultraviolet: Paint Party at Necto"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1164965650208613/", "description": "Max Ellington \nSanford\nJeff Garcia\nPat in the hat", "date": "2016-09-03T21:00:00-04:00", "name": "Status quo"}, {"source": "Facebook", "url": "https://www.facebook.com/events/660184664155555/", "description": "Our in-house Oktoberfest release is one of our favorite days of the year! Come say \"o'zapft is\" with us -- we'll have German food specials running all weekend and 11x17 prints of our Oktoberfest poster wil be available for purchase. Prost!", "date": "2016-09-04T16:00:00-04:00", "name": "Oktoberfest Release"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1288504411189429/", "description": "Ann Arbor Poetry Slam is back this Sunday with another all ages open community free-speech event! To read or perform, sign up between 6:30 & 7:00. The show starts at 7. There is a five dollar suggested donation at the door. All proceeds go to send winning poets to National and International poetry tournaments. DIY. Grass-roots. Since 1987. Come early. Stay late. Bring the world. Bring your words. Your host this week is Luis Anderson!", "date": "2016-09-04T18:30:00-04:00", "name": "Ann Arbor Poetry Slam"}, {"source": "Facebook", "url": "https://www.facebook.com/events/241524469579758/", "description": "The Not-So-Labor-Day is the official all-night-pre-game  to this year's Labor Day! We've all been going hard in the paint, working our asses off, so it's time to cut loose and get a jump on our day off on Monday!!! It's the dance party of the YEAR. \n\nFeaturing:\n\nU X L (Brian Roberts) - A newcomer to the EDM scene with plenty of totally VIRAL beats to kick off the night!\n\nVest And Tyler - Hnnggngngggwwhhwwnnnggg\n\nKatzMeow - The QUEEN of Bass descends from her throne to grace the peasants and work some hard beats into your souls!\n\nDrop Texture - Making sure you all hit Labor Day RAVING, Drop Texture is ending the night with some deep bass and hitting your chest with some dirty dub!", "date": "2016-09-04T20:30:00-04:00", "name": "Not-So-Labor Day"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1770837316505091/", "description": "Nights at the Museum, UMMA’s first-ever exterior media art initiative, is open to the public, and will run from September 2-9 from 8:30 p.m. to dawn along its State Street-side facade.\n\nNights at the Museum begins Friday, Sept. 2, during Artscapade!, a Welcome Week event for new U-M students, and concludes on Friday, Sept. 9 at UMMA’s twice-annual After Hours community celebration.\n\nOn Friday, Saturday, and Sunday, from dusk to dawn, UMMA will showcase a digital art installation by Quayola called Pleasant Places. Inspired by the work of Vincent Van Gogh, Quayola has returned to the same countryside of Provence 125 years later to create of a series of digital paintings exploring the boundary between representation and abstraction. Pleasant Places will also be projected overnight throughout the remainder of the week. \n\nFor the Full Schedule Check Here: http://www.umma.umich.edu/news/2016/umma-to-light-up-campus-with-nights-at-the-museum", "date": "2016-09-05T20:30:00-04:00", "name": "Nights at the Museum"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1090878344334512/", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, allllll day long (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "date": "2016-09-06T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!"}, {"source": "Facebook", "url": "https://www.facebook.com/events/508029376065329/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nAndrew Langdon Brown, Guitar player and songwriter from Appleseed Collective was born the son of a Motown session musician. After a brief trip to New Orleans as a teenager he became obsessed with fusing an eclectic blend of pre-World-War II american roots music, bluegrass and jazz with modern and genre bending, and poetic songwriting. \n\nNew a cover\nAlways a good time", "date": "2016-09-06T19:00:00-04:00", "name": "Acoustic Tuesdays: Andrew Langdon Brown"}]