[{"date": "2017-02-28T11:00:00-05:00", "source": "Facebook", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "url": "https://www.facebook.com/events/1724899501156129/", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration"}, {"date": "2017-02-28T19:00:00-05:00", "source": "Facebook", "description": "Celebrate Mardi Gras with Zingerman's Roadhouse as we pay tribute to Galatoire's, the infamous restaurant on Bourbon Street that has impacted New Orlean's with it's festive charm and Creole dishes since 1905. Chef Alex Young has put together a menu this year that will combine the zest of New Orlean's flavor with classic French cuisine. Look forward to unforgettable dishes like Filet Mignon March de Vin, Seafood Okra Gumbo, and King Cake Bread Pudding!", "url": "https://www.facebook.com/events/343837269331327/", "name": "Mardi Gras Special Dinner #205: A Tribute to Galatoire’s"}, {"date": "2017-02-28T19:00:00-05:00", "source": "Facebook", "description": "February means love and love means poetry (well, to us, anyway). And we'd love for you to join us on our new FOURTH Tuesday at Sweetwaters Coffee & Tea for some. Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\nSign up! 7:00 p.m.\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Readers\nThis month's feature: MONICA RICO!\n\nMonica Rico grew up in Saginaw, Michigan alongside General Motors and the legend of Theodore Roethke. She has a BA in Women’s Studies and Creative Writing from Western Michigan University and a MA in Creative Writing from The City College of New York. She is an avid fan of space exploration, home cooking, and beautifully tall glasses of champagne. She currently lives in Michigan and works for the Bear River Writers’ Conference.\n\nNext month: CODY WALKER!", "url": "https://www.facebook.com/events/387891208259229/", "name": "Skazat! Poetry Series featuring Monica Rico"}, {"date": "2017-02-28T19:00:00-05:00", "source": "Facebook", "description": "This month's Skazat! Poetry Reading will feature Monica Rico. \n\nSkazat! Poetry Series at Sweetwaters", "url": "https://www.facebook.com/events/1776995865952490/", "name": "Skazat! Poetry Reading"}, {"date": "2017-03-01T17:00:00-05:00", "source": "Facebook", "description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "url": "https://www.facebook.com/events/731926473638010/", "name": "Sunseed Farm CSA Pickup"}, {"date": "2017-03-01T19:00:00-05:00", "source": "Facebook", "description": "We're featuring a robust list of 15+ different IPAs within six different catagories from both guest breweries and our own stash. We are aquiring more beers to taste, keep an eye on this list for updates. We will also have strolling appetizers to pair with each category. \n\nAmerican IPA\n- Buzzsaw, Arbor Brewing Company\n- Michigan IPA (featuring all Michigan hops), Arbor Brewing Company\n- TBD\n\nEnglish Style IPA\n- Sacred Cow, Arbor Brewing Company\n- Arcadia IPA, Arcadia Ales\n- TBD\n\nSession IPA\n- All Day IPA, Founders Brewing Company\n- Go To IPA, Stone Brewing\n- TBD\n\nBlack IPA\n- India Porter, Arbor Brewing Company\n- B-Craft, Arcadia Ales\n- TBD\n\nDouble/Imperial IPA\n- HXL, Arbor Brewing Company\n- Mr. Delicious, Arbor Brewing Company\n- Hoptronics, New Holland Brewing Company\n\nWood Aged IPA\n- Unearthly, Southern Tier\n- Rum Barrel Aged Piraat, Brouwerij Van Steenberg N.V. \n-TBD", "url": "https://www.facebook.com/events/1840510362829589/", "name": "Hop Focused Beer Tasting"}, {"date": "2017-03-01T19:00:00-05:00", "source": "Facebook", "description": "For folks who want to get started with CNC as well as veterans to share information. Focus of the group is anything CNC-related: projects, additive machines like the Makerbot or subtractive mills, CAD, CAM, and the holy war of issues like Servos vs. Steppers, NURBS vs. Meshes, and EMC2 vs. Mach3.\n\nMeetings are normally on the first Wednesday of the month (except when they land on a holiday and Maker Works is closed), free and open to everyone and you don't have to be a member of Maker Works to attend.\n\nWith the approach of winter, if the weather is too inclement for safe travel, the meeting may be cancelled if conditions warrant it.\n\nAny CNC-related topic is game and if you have something to show off, please bring it.\n\nFor more info, visit: https://groups.yahoo.com/neo/groups/semicnc/info", "url": "https://www.facebook.com/events/176202762865951/", "name": "SE Michigan CNC Enthusiast Group (first Wednesday of the month)"}, {"date": "2017-03-02T19:00:00-05:00", "source": "Facebook", "description": "Literati is pleased to welcome Ypsilanti's own Amy Shrodes, co-author of Lost and Found Cat: The True Story of Kunkush's Incredible Journey, for an all-ages event.\n\nThe true story about one cat’s journey to be reunited with his war-torn family has been seen by millions of people and is now a heartwarming picture book. When an Iraqi family is forced to flee their home, they can’t bear to leave their beloved cat, Kunkush, behind. So they carry him with them from Iraq to Greece, keeping their secret passenger hidden away. But during the crowded boat crossing to Greece, his carrier breaks and the frightened cat runs from the chaos. In one moment, he is gone. After an unsuccessful search, his family has to continue their journey, leaving brokenhearted.\n \nA few days later, aid workers in Greece--Amy among them--find the lost cat. Knowing how much his family has sacrificed already, they are desperate to reunite them with the cat they love so much. A worldwide community comes together to spread the word on the Internet and in the news media, and after several months the impossible happens—Kunkush’s family is found, and they finally get their happy ending in their new home. This remarkable true story is told by the real people involved, with the full cooperation of Kunkush’s family.\n\nAmy Shrodes and co-author Doug Kuntz felt compelled to travel to Greece to help with the refugee crisis, each in their own unique way—Amy as a volunteer helping the arriving refugees and raising awareness back at home through a podcast, and Doug as a photojournalist, who spent time in Greece, Turkey, France, Germany, and finally Norway, bringing the plight of the refugees to people around the globe. When they met Kunkush, they knew he was very special to someone and they wanted to do everything they could to reunite him with his family.", "url": "https://www.facebook.com/events/344285915971490/", "name": "Amy Shrodes: Lost and Found Cat"}, {"date": "2017-03-02T19:30:00-05:00", "source": "Facebook", "description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "url": "https://www.facebook.com/events/254338798323472/", "name": "Sing Happy!"}, {"date": "2017-03-02T20:00:00-05:00", "source": "Facebook", "description": "Thursday: March 2 | 8pm | 18+ | $5 (8 for under 21)\n\nOak Valley Drive is a local Ann Arbor rock band that combines the sex appeal of meatloaf with the pop-rock sensibilities of Meatloaf. OVD consists of three faces, 29 toes, and one goal: to not be a disappointment to those we love --thankfully their music isn’t half-bad. If you’re a fan of happy indie rock with depressing yet inspiring lyrics, catchy hooks, and a voice you can’t quite tell if you love or hate (hint, it’s love and he loves you too).\n\nOak Valley Drive Social Media: https://www.facebook.com/OakValleyDriveBand/\nhttps://oakvalleydrive.bandcamp.com/releases\n\nNorthern Poetic Social Media\nhttps://www.facebook.com/thenorthernpoetic/\nhttps://soundcloud.com/thenorthernpoetic/time-traveler-demo", "url": "https://www.facebook.com/events/215059972302859/", "name": "Oak Valley Drive w/ Northern Poetic 3/2/17 at the Blind Pig"}]