[{"description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/558399577690989/", "source": "Facebook", "name": "Drink & Draw / Imbibe & Inscribe", "date": "2016-12-16T15:00:00-05:00"}, {"description": "Bring your well-worn items that could use a tune up, and we'll take a look at them! \n\nOr, make someone else's day by volunteering at Fix-It Friday and repairing their items.\n\nFix-It Friday:\nThink of this as the last chance before you get rid of something; Free, but no Guarantee.\n\nWe will:\n- try to diagnose what is wrong\n- tell you if we think we may be able to fix it today\n- tell you if you'll need a part, and where you might be able to get it\n- try to fix it to the best of our ability, but in the limited time we have\n\nHowever, we may not be able to fix it. Many products are not designed to be fixed, and just opening them up may damage them. Furthermore, we may not have someone on hand with the expertise to do a proper repair. Also, it may require a special part, tools, information, or materials to repair, or it may just require more time than we have.\n\nWe may end up damaging your item even more. Please let the repairer know how comfortable you are at each stage of diagnosis and repair.\n\nItems that are often easier to repair: lamps, types of toys, broken wires, things that need epoxy/wood glue\n\nItems that are often very difficult to repair: consumer electronics such as CD/Cassette boom boxes, TVs, radios, CD players, VCRs, and DVD players", "url": "https://www.facebook.com/events/241191552964337/", "source": "Facebook", "name": "Fix-It Friday (third Friday of every month)", "date": "2016-12-16T16:00:00-05:00"}, {"description": "Beginning November 4th, GameStart will be hosting a six-week series of Open House workshops called GameLab. Each week will feature a FREE to participate class, rotating* between two of GameStarts most popular courses: Game Creation with Unity and Minecraft Python Programming. Students are invited to try out and retake each class as often as they'd like during the six-week term.\n\nGameLab Course Schedule:\nDecember 9th, 4:00pm - 5:00pm: Minecraft Python Programming\nDecember 16th, 4:00pm - 5:00pm: Game Creation with Unity", "url": "https://www.facebook.com/events/1050535105058833/", "source": "Facebook", "name": "GameLab: Game Creation with Unity Game Engine (6/6)", "date": "2016-12-16T16:00:00-05:00"}, {"description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "url": "https://www.facebook.com/events/1807900772828520/", "source": "Facebook", "name": "Art Off The Wall Holiday Exhibition & Shopping Event", "date": "2016-12-16T18:00:00-05:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nThe League will invite volunteers from the audience to share stories about their holidays – funny, awkward, sad, or wacky – and then they will perform scenes inspired by these tales.\n\nGroup 1: Listen, Stupid \nGroup 2: With Wieck\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/1606342193002928/", "source": "Facebook", "name": "Holiday Improv Show with Listen, Stupid and With Wieck", "date": "2016-12-16T20:00:00-05:00"}, {"description": "Katie Geddes sings traditional and contemporary folk, country-folk, and folk-pop tunes. In deft interpretations of beloved songs, Katie's captivating voice and velvety-smooth delivery bring new life to the compositions of writers such as John Prine, Buffy Sainte-Marie, Michael Nesmith and Lennon and McCartney. Katie’s 2010 CD release, We Are Each Other’s Angels, has received extensive airplay across the country and around the world. When not doing her own gigs, Katie has been known to “moonlight” singing harmony for folk-rock legend Melanie and local favorite Matt Watroba.\n\nVocal trio All About Eve (Katie, Deb Wood, David Vaughn) offers up a variety of close harmony pop covers and traditional and contemporary folk and gospel songs, accompanied by John Goodell on piano.\n\nMatt Watroba brings a very special set of talents to the stage. His excellent guitar playing, mellow voice, friendship with his audience, and knowledge of his presentations is impressive. Added to that is Matt's own special brand of humor. You will feel his obvious love of folk music, whether traditional or contemporary. Matt sings songs of compassion, inner strength, humor, and everyday living. \n \nHeywood Banks is simply one-of-a-kind. Equal parts genius and buffoon, this songwriter-comic-singer-poet-musician has become a cult hero and a pop icon. Heywood intersperses his humorous observations of life with twisted, inventive, bizarre songs, sung and played in a variety of styles, from folk, to country, to rock, to pop.", "url": "https://www.facebook.com/events/253901491631138/", "source": "Facebook", "name": "Katie Geddes and Friends at Green Wood Coffee House", "date": "2016-12-16T20:00:00-05:00"}, {"description": "Apollo Booking presents, \nAdventurer / Forest Green / Welman / Texas Beachball Massacre / Complainer. \n\n12-16-16 \nThe Club Above\n215 N main, Ann Arbor MI\n--Doors at 8pm--\n18- $8\n21- $6\n\nAdventurer---- http://adventurermusic.bandcamp.com/\n\nForest Green---- http://forestgreen1.bandcamp.com/\n\nThe Texas Beachball Massacre---- https://thetexasbeachballmassacre.bandcamp.com/releases\n\nComplainer.---- http://complainermi.bandcamp.com/\n\nNature's Garbage---- http://naturesgarbage.bandcamp.com/", "url": "https://www.facebook.com/events/1812098042395213/", "source": "Facebook", "name": "Adventurer / Forest Green / Texas Beachball Massacre /", "date": "2016-12-16T20:00:00-05:00"}, {"description": "Fri. December 16 | 9pm | 18+ | $15 Cover\n\nKool Keith\nIn a world full of cheesecake rappers, one man has assembled a phenomenal team to bring you madness. So stop stop what you're doing and get ready for a journey you've never taken before. Enter the sinister doctor, the Ultramagnetic visionary, Kool Keith, whose \"Feature Magnetic,\" released Sept. 16 on Mello Music Group, is his latest bizarre transformative odyssey .\n\nAs always, Keith seems unstuck in time, oblivious to geography, brilliantly mixed unflinchingly grim details with surreal, fantastical tangents. He’s from the Bronx, but belongs to far-reaching astral dimensions. And Where many of his contemporaries have become legacy acts or revivalists, Keith continues to originate and perfect his wild style. He’s parked behind Oracle Arena in Oakland with Norah Jones -- riding a horse and carriage through Central Park (bystanders shout that he looks like Mike Tyson). He drinks with MF DOOM in dusty London basement and recruits a legendary squadron of fellow travelers including Sadat X (Brand Nubian), Bumpy Knuckles, Boston pioneer Ed O.G., Slug from Atmosphere, and Vallejo legend Mac Mall.\n\nWSG: Kosha Dillz & Headkrack + The Bodega Brovas", "url": "https://www.facebook.com/events/319661255066863/", "source": "Facebook", "name": "Kool Keith + Special Guests 12/16/16 at Blind Pig - Ann Arbor", "date": "2016-12-16T21:00:00-05:00"}, {"description": "Our League of Pointless Improvisers will invite audience members and performers to share their holiday tales, and will then create an improvised show based on these. \nNo two shows are the same! \nTickets are $10.", "url": "https://www.facebook.com/events/718892291596571/", "source": "Facebook", "name": "Crazy Holiday Feats", "date": "2016-12-16T22:00:00-05:00"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/1171307782957839/", "source": "Facebook", "name": "10% For Good for Community Action Network", "date": "2016-12-17T09:00:00-05:00"}]