[{"date": "2016-06-30T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1771333209777255/", "description": "This week is National Pollinator Week which is celebrated all across the country to raise awareness for pollinators and their importance to the ecosystem. NAP is participating in National Pollinator Week by hosting a workday in the Native Garden at Furstenberg Nature Area. Join us on Saturday, June 25th from 9:00am-Noon at Furstenberg Nature Area to help the local pollinators by removing invasive plants from within the Native Garden. For more information on the workday with NAP please visit www.a2gov.org/napevents and for more information on National Pollinator Week visit www.pollinator.org/pollinatorweek .", "name": "National Pollinator Week"}, {"date": "2016-06-30T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/959691770814453/", "description": "Take your imagination into the stratosphere as we create characters and stories that are out of this world!\n \nOur drama day camps are focused on providing young people with a safe place to explore their creativity. Each class includes warm up exercises, drama games, improvisation exercises, crafts, and of course lots of fun. The activities will be focused around the theme for the week, making each class a unique experience. On the last day of class we will have a showcase of some of the skills the children have learned throughout the course.\n\n\"Outer Space\" Drama Camp for ages 5-9\n9:00 am - noon, June 27-July 1\n$150 if you enroll by June 1\n($170 after June 1)", "name": "Outer Space Drama Camp"}, {"date": "2016-06-30T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "name": "Summer Drama Camps"}, {"date": "2016-06-30T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1607731982880818/", "description": "Ben Daniels Band\nWhen Ben Daniels decided he was going to be a musician, it was more than a career choice. A natural poet, this young songwriter went to school on Bob Dylan, Robert Johnson, and Jack White, among others. His lyrics speak directly to a younger generation that hears, sees, and thinks about the very things he’s writing. From their opening song to the finale of their set, the Ben Daniels Band cuts through with their originality, musicianship, and a sound that spans Americana, Blues, Jazz, and Rock.\nThroughout years of touring, BDB has played numerous venues in Michigan, New York City, Washington D.C., and Nashville . As a solo artist, Ben has stepped on the stage in Austin, TX at the Cactus Cafe, as well as The Barns at Wolf Trap. The son of actor Jeff Daniels, he has quietly monitored what it takes to live life as an artist. Beyond a passed down talent, the Ben Daniels Band believes in hard work, perseverance, and creatively challenging themselves and their audience.\nWith George Merkel on guitar, Tommy Reifel on bass, Wesley Fritzemeier on drums/mandolin, and Amanda Merte on percussion/vocals, BDB’s live show never fails to take over the venue. With five CDs under their belts - Coming From The C, Checkin’ In To The Michigan Inn, Can't You See, The Mountain Home EP, and their dual album & movie release Old Gold - the Ben Daniels Band is has grown to be a formidable group that sounds pleasantly familiar, yet unforgettably unique.\n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Ben Daniels Band / June 30th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE"}, {"date": "2016-06-30T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/187093148358921/", "description": "Join us every Thursday in June to help support our community partner, Growing Hope! From 6-9 pm, $1 of each beer sold will be donated towards Growing Hope's efforts to educate, inspire, and empower the community through gardening and access to healthy food.", "name": "Hops for Hope"}, {"date": "2016-06-30T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1756679691212920/", "description": "Join us for a reading, discussion and signing of Michelle Cox's new romantic mystery A Girl Like You. In this first book in “The Henrietta and Inspector Howard” series, we meet taxi dancer Henrietta as she agrees to go undercover in order to help the aloof Inspector Howard investigate a murder in the dance hall where she works. Signing to follow.\n\n“Flavored with 1930s slang and fashion, this first volume in what one hopes will be a long series is absorbing. Henrietta and Clive are a sexy, endearing, and downright fun pair of sleuths. Readers will not see the final twist coming.”  - Library Journal (starred review).", "name": "Author reading: A Girl Like You with Michelle Cox"}, {"date": "2016-06-30T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/269608000093346/", "description": "Test Batch features the newest crop of improv groups in our community. Come and watch these troupes test their chops on the Pointless stage. When they are all inevitably famous, you can say \"I saw them way back when….\"\n\nThe lineup for our first ever Test Batch is:\n\n\"Are Be Geez\" starring Havah Roussel and Sara Rose\n\n\"Gateway Butters\" starring Thom Bales, Alex Boyd, Sara Cholyway, Shannon Coon, John Kane, Mark Scott, and Minnie Raghavan\n\n\"All-Purpose Gesture\" starring Ashley Davis, Ramon Martinez, Sam Shattuck, Jenny Blair, Cyrus Naheedy, and Thomas Macias", "name": "Test Batch"}, {"date": "2016-07-01T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1737484316532702/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe"}, {"date": "2016-07-01T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/181519262246520/", "description": "Join us on Friday July 1 from 6:00-9:00pm for the Opening Reception of 'Real American'.\n\nWhat is “Real American”? We seek to explore the generational, ethnographic, cultural, and anthropological ideals of what the word American means. From fresh apple pie to Budweiser, the Star Spangled Banner to Party in the USA, what is the modern American experience? Are we entering the sci-fi World of Tomorrow, longing for the Norman Rockwell past, or painting ourselves into an Idiocracy? If our culture is our biggest export, what kind of image are we presenting to the world? \n\nJuror: Peter Baker\nPeter Baker is an Ann Arbor-based photographer who specializes in editorial, travel, and advertising photography. His clients include Herman Miller, The Wall Street Journal, Bloomberg Businessweek, ESPN The Magazine, National Geographic Traveler, and Popular Mechanics. Peter’s work has been featured in numerous exhibitions nationally and internationally, as well as in HOW Magazine, American Photography, and Hemispheres. He also serves as Creative Director at local tech darling Duo Security, and has been involved in creating many arts and culture events in Ann Arbor, MI.\n\nThis event is FREE and open to the public. \n-----------\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC. \n\nCatering generously provided by Laura's Catering (http://laurascatering.com/)", "name": "Real American: Opening Reception"}, {"date": "2016-07-01T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1019028304840040/", "description": "This is Detroit blues with a rockabilly twist. From another place and time come The Boa Constrictors, old school blues musicians who know how to build a tight set. A favorite at blues festivals in Michigan and Canada, they call their Detroit blues “very greasy, grimy, and lowdown”—a sound that arrived from the Delta Blues regions with the northern migration for factory jobs during Detroit's industrial revolution. With a recipe that comes from the legendary harmonica bands of Little Walter, Jerry Portnoy, Junior Wells, Paul Butterfield, and Sonny Boy Williamson (sr. and jr.), this is energetic and spontaneous blues that will get fans at TOP shuffling their feet.\nWebsite: http://www.theboaconstrictors.com/", "name": "The Boa Constrictors"}]