[{"url": "https://www.facebook.com/events/2029438033947526/", "description": "Wednesday only, allll of our supplements are 30% off! Stock up on your favorites, from A-Zinc!", "source": "Facebook", "date": "2016-04-13T07:00:00-04:00", "name": "One Day Sale- 30% Off Suplements"}, {"url": "https://www.facebook.com/events/1708827906036419/", "description": "It's time to get things rolling for the 9th Annual HomeGrown Festival! We need your help to plan this fun event...and the best kept secret of HomeGrown is that our planning team meetings are a blast! \n\nOur team meets twice monthly April-July and weekly in August and the first half of September. There is usually food involved. And a positive, supportive group of folks!\n\nOur kickoff planning meeting will be held Wednesday, April 13 from 6:00-8:00pm downstairs at the Bar at 327 Braun Court in Kerrytown. If you would like to consider being part of the fantastic team of volunteers that plans this amazing event please join us at this meeting and learn more about the planning process.\n\nThe festival will take place on Saturday September 10 at the Ann Arbor Farmers' Market.\n\nWe hope to see you soon!\n\nMore information at HomeGrownFestival.org", "source": "Facebook", "date": "2016-04-13T18:00:00-04:00", "name": "HomeGrown Festival Planning Committee Kickoff"}, {"url": "https://www.facebook.com/events/1089713734426876/", "description": "Literati is delighted to welcome Brian Blanchfield in support of his collection Proxies: Essays Near Knowing.\n\nPast compunction, expressly unbeholden, these twenty-four single-subject essays train focus on a startling miscellany of topics —Foot Washing, Dossiers, Br’er Rabbit, Housesitting, Man Roulette, the Locus Amoenus—that begin to unpack the essayist himself and his life’s rotating concerns: sex and sexuality, poetry and poetics, subject positions in American labor (not excluding academia), and his upbringing in working-class, Primitive Baptist, central-piedmont North Carolina. In Proxies an original constraint, a “total suppression of recourse to authoritative sources,” engineers Brian Blanchfield’s disarming mode of independent intellection. The “repeatable experiment” to draw only from what he knows, estimates, remembers, and misremembers about the subject at hand often opens onto an unusually candid assessment of self and situation. The project’s driving impulse, courting error, peculiar in an era of crowd-sourced Wiki-knowledge, is at least as old as the one Montaigne had when, putting all the books back on the shelf, he asked, “What do I know?”\n\n\"Into what some are calling a new golden age of creative nonfiction lands Brian Blanchfield’s Proxies, which singlehandedly raises the bar for what’s possible in the field. This is a momentous work informed by a lifetime of thinking, reading, loving, and reckoning, utterly matchless in its erudition, its precision, its range, its daring, and its grace. I know of no book like it, nor any recent book as thoroughly good, in art or in heart.\"  —Maggie Nelson\n\n\"Proxies: Essays Near Knowing brings a slowed-to-meaning lens to the remembered moments of a life. Blanchfield’s readers wander into his ordinary-extraordinary quotidian—the vulnerable longing of a singular voice expressing a peopled intelligence. Not since Hilton Als’s White Girls have I read anything as interrogative, unsettling, and brilliant.\"  —Claudia Rankine\n\n\"Brian Blanchfield’s sentences are modern marvels.  They coil, insinuate, embellish—and then land on the tender spot.  If Hart Crane had survived to write a book of autobiographical essays, it would resemble Proxies—but would Hart have given us the low-down on frottage?  Blanchfield is a staggeringly accomplished stylist, whose artful elucidations deserve to be savored, studied, and, yes, worshipped.\"  —Wayne Koestenbaum\n\n\"Early on his humble and stunning Proxies, Brian Blanchfield asks: “In what kind of place is all the hearing overhearing?” He knows, mostly we eavesdrop on ourselves. We call it thinking. There is no delicacy of mind like that one that moves through the facts of its own errors to arrive at understanding, and here, essay by essay, Blanchfield sifts through the astray archive of his memory to recall what all it is he needs to live. These essays remind us, as they discover inside themselves, the deep virtue of saying, “I don’t know.”\"  —Dan Beachy-Quick\n\n\"Maybe short says it best. Sexy book.\"  —Eileen Myles\n\n\"Blanchfield’s best known as a poet, and though poetry shows up here as a subject, this isn’t a poet’s essay collection, meaning that these aren’t hyperlyric half-prose essays shot with the poetry cannon: this is a book of excellent prose written by someone born to write exactly this. These are high-wire acts that are a ton of fun to read…performing close readings of cultural phenomena and tracking—with great, even heroic care—minor and major emotional transactions and tendencies. The result is a book of dynamic, thoughtful, and flat-out moving essays.\"   —Ander Monson\n\nBrian Blanchfield is the author of two books of poetry, Not Even Then and A Several World, which received the 2014 James Laughlin Award and was a longlist finalist for the National Book Award. Recent essays and poems have appeared in Harper’s, BOMB, Brick, Guernica, The Nation, Chicago Review, The Brooklyn Rail, A Public Space, Lana Turner, The Paris Review, and The Awl. He has taught as core faculty in the graduate writing programs of Otis College of Art and Design in Los Angeles and at the University of Montana, Missoula, where he was the 2008 Richard Hugo Visiting Poet. Since 2010 he has been a poetry editor of Fence. With his partner John, he lives out past the streetlights in Tucson, where is the host of Speedway and Swan on KXCI 91.3.", "source": "Facebook", "date": "2016-04-13T19:00:00-04:00", "name": "Brian Blanchfield"}, {"url": "https://www.facebook.com/events/1698946970352936/", "description": "Wed. April 13 | 9pm | 18+ | $8 adv./ $10 day of\n\nThe Appleseed Collective \nwith: Big Dudee Roo & Rick Chyme\n\nThe Appleseed Collective is a four-piece Americana band that's toured these United States since 2010, serving up songs new and old—barn-burners, old soul jazz, airy mood pieces, bluesy digressions—to crowds hungry for more. Their music is a rich Dixie-Gypsy roots-music mélange with a modern twist, a long-simmering stew of old-time, ragtime, and bluegrass constantly refreshed—like the Melting Pot itself—with immigrant sounds and international spices. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/643", "source": "Facebook", "date": "2016-04-13T21:00:00-04:00", "name": "The Appleseed Collective w/ Big Dudee Roo & Rick Chyme 4/13/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1593975464227691/", "description": "Savco Hospitality, the people that brought you Babo: A Market By Sava, Sava's Restaurant, Aventura Ann Arbor, and Tavolina Catering & Events are hiring for a variety of positions.\n\nJoin us for our career fair!\n\nEnjoy live music, refreshments, and on-the-spot interviews!\nVisit the link \"Ticket URL\" for our current job listings.", "source": "Facebook", "date": "2016-04-14T14:00:00-04:00", "name": "Savco Career Fair"}, {"url": "https://www.facebook.com/events/572638872905174/", "description": "Savco Hospitality, the people that brought you Babo: A Market By Sava, Sava's Restaurant, Aventura Ann Arbor, and Tavolina Catering & Events are hiring for a variety of positions.\n\nJoin us for our career fair!\n\nEnjoy live music, refreshments, and on-the-spot interviews!\nVisit the link \"Ticket URL\" for our current job listings.", "source": "Facebook", "date": "2016-04-14T14:00:00-04:00", "name": "Savco Career Fair"}, {"url": "https://www.facebook.com/events/245596369124191/", "description": "Savco Hospitality, the people that brought you Babo: A Market By Sava, Sava's Restaurant, Aventura Ann Arbor, and Tavolina Catering & Events are hiring for a variety of positions.\n\nJoin us for our career fair!\n\nEnjoy live music, refreshments, and on-the-spot interviews!\nVisit the link \"Ticket URL\" for our current job listings.", "source": "Facebook", "date": "2016-04-14T14:00:00-04:00", "name": "Savco Career Fair"}, {"url": "https://www.facebook.com/events/1767827183440408/", "description": "the event: our monthly beer tasting series explore the expansive world of beer through the lens of different themes. we'll gather a couple dozen brews worth sampling to bring you a novel and varied experience for your palates. We’ll pair the beer samples with an appetizer buffet, provide a program with tasting notes, and top off the night with a door prize drawing.\n\nthe style: For April's tasting, we're getting weird. Think Hefeweizen's made with curry, porters made with pig heads, historical ales made with heather.  Whatever outlandish beers that we can get out hands on, we guarantee they will be unorthodox and out of the ordinary.\n\nthe details: Arbor Brewing Company's monthly tastings run from 7-9 PM on the 2nd Thursday of each month. Ticket holders will enter through the Arbor Brewing Company Tap Room entrance. \n\nthe contest: Guests who come attired in a creative costume will get a second raffle ticket for the door prize drawing. Get wacky, get weird, get funky and double your chances!\n\nthe tickets: Tickets are available at the pub or by phone at 734-213-1393. $25 in advance, $30 day of. \nTickets are also available on Eventbrite: https://www.eventbrite.com/e/beer-tasting-april-foolishness-tickets-22819923004", "source": "Facebook", "date": "2016-04-14T19:00:00-04:00", "name": "Beer Tasting: April Foolishness"}, {"url": "https://www.facebook.com/events/1010317442371650/", "description": "April is National Poetry Month and we intend on celebrating with our voices, snaps, claps, and smiles. Light refreshments will be served. \n\nOur featured poet, Marilyn Churchill, will be reading from her new book Memory Stones. “All of life is her material. She takes the everyday and shapes it into a mix of humor and quicksilver.” (Mary Koral) Marilyn has a BFA from U of M and a Masters in Creative Writing from EMU. She is a visual artist and poet, and part-owner of the West Side Book Shop in Ann Arbor.\n\nThe event begins with an open mic session when area poets can share their own work or that of a favorite author. Signing to follow.", "source": "Facebook", "date": "2016-04-14T19:00:00-04:00", "name": "Open Mic & Share Poetry Series featuring Marilyn Churchill"}, {"url": "https://www.facebook.com/events/1621365181438631/", "description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "source": "Facebook", "date": "2016-04-14T19:30:00-04:00", "name": "Mnozil Brass"}, {"url": "https://www.facebook.com/events/1714526335426651/", "description": "Come join us to celebrate our namesake's birthday! This has always been a night of fun, dancing, music, and community. \n\nPlease note this event is 21-and-over. Minors welcome with a parent. $10 suggested donation at the door. Small appetizers will be provided!\n\nTo become a sponsor or donate to the event, please go here: https://secure.lglforms.com/form_engine/s/NMRhi10N5uVq9ZSSGKmuwg\n\nThank you to the following financial sponsors of the event:\n\nSponsors:\nComcast\nOut Post\n\nHosts:\nLeigh Greden\nWashtenaw Community College\n\nFriends of Jim Toy:\nAnn Arbor Convention & Visitors Bureau\nJustice Bridget Mary McCormack\nState Representative Jeff Irwin\nState Representative Adam F Zemke\nAnn Arbor Mayor Christopher Taylor\nCommissioner Yousef Rabhi\nJoan Lowenstein\nTravis Radina\nAngus Burch\nDoug & Joanna Scott\n\nThank you also to our community sponsors, the Washtenaw ID Project and Equality Research Center! These organizations will be in attendance at Birthday Bash - please be sure to learn more about them while you enjoy the party!", "source": "Facebook", "date": "2016-04-15T18:30:00-04:00", "name": "5th Annual Jim Toy Birthday Bash"}, {"url": "https://www.facebook.com/events/1064590700274844/", "description": "Literati is pleased to welcome Tamar Boyadjian, Tarfia Faizullah, & Airea D. Matthews to the store in celebration of National Poetry Month.\n\nTamar Boyadjian is the author of it is what it is and the vineyard of mirrors. Her poetic and academic work has been included in a number of literary journals and creative anthologies around the world including the United States, Turkey, Armenia, parts of Europe and the Middle East. Tamar teaches medieval literature (and the literature of other people and cultures) as well as creative writing at Michigan State University, and is involved with the Armenian Studies Program at the University of Michigan.\n\nPoet, editor, and educator Tarfia Faizullah was born in 1980 in Brooklyn, NY and raised in west Texas. She received an MFA in poetry from Virginia Commonwealth University and is the author of Seam, which U.S. Poet Laureate Natasha Trethewey calls “beautiful and necessary,” as well as Register of Eliminated Villages (forthcoming from Graywolf in 2017).\n\nAirea D. Matthews is a 2015 Kresge Literary Arts Fellow and the executive editor of The Offing. She is currently the Assistant Director of the Helen Zell Writers’ Program at University of Michigan, Ann Arbor, where she earned her MFA. Her poems have appeared or are forthcoming in Best American Poetry 2015, American Poet,The Missouri Review, The Baffler, Callaloo, Indiana Review, WSQ and elsewhere. Her performance work has been featured at the Cannes Lions Festival, PBS’ RoadTrip Nation and NPR. She lives in Detroit with her husband and their four children.", "source": "Facebook", "date": "2016-04-15T19:00:00-04:00", "name": "Tamar Boyadjian, Tarfia Faizullah, & Airea D. Matthews"}, {"url": "https://www.facebook.com/events/419604171550681/", "description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus. There it blended with elements of Spanish music and was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed singer Nidal Ibourk, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "name": "Zafir: Musical Winds from North Africa to Andalucía"}, {"url": "https://www.facebook.com/events/1183566044989707/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Trap Queens\" starring Annie Hendricks and Cari Sue Murphy\n\nGroup 2: \"Demon Death Stab\" starring Julia Schroeder, James Quesada, Steve Vagts, Nuverre Naami, Travis Pelto, Aaron Mondry, Andy Reid, and Anna Imesch\n\nGroup 3: \"The League of Pointless Improvisers\" starring Corene Ford, Erik Heilner, Matt Swartz, Mitch Socia, and Jason Valentini", "source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "name": "Pointless Improv with Trap Queens and Demon Death Stab"}, {"url": "https://www.facebook.com/events/506775856161991/", "description": "Scott Ainslie came of age during the Civil Rights era, and cultivated a powerful affinity for cross-cultural exchange. He has studied with elder musicians on both sides of the color line, in the old-time southern Appalachian fiddle and banjo traditions, as well as Black gospel and blues. He plays this music with affection, authority, and power. Armed with a variety of instruments -- vintage guitars, a fretless gourd banjo, a one-string, homemade diddley bow (cigar box guitar) --  and carefully chosen personal anecdotes of his encounters with senior musicians across the South, Ainslie explores the African and European roots of American music and culture, bringing the musical history of America alive.  www.cattailmusic.com", "source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "name": "Scott Ainslie at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/149342562122588/", "description": "frontier ruckus w/ Matt Jones & Bonzo live at the Blind Pig on Friday, April 15th!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/663", "source": "Facebook", "date": "2016-04-15T21:00:00-04:00", "name": "Frontier Ruckus w/ Matt Jones & Bonzo 4/15/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1033648280028364/", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring Corene Ford, Erik Heilner, Matt Swartz, Mitch Socia, and Jason Valentini", "source": "Facebook", "date": "2016-04-15T22:00:00-04:00", "name": "A Pointless Display of Improvised Feats"}, {"url": "https://www.facebook.com/events/210256089347134/", "description": "At least 6 species of turtles live and nest in the city, maybe more! Help us protect nest sites, monitor populations, and look for turtles in habitats along the river and creeks! We’ll cover species identification, nest monitoring, and how to report your turtle observations. This training will be indoors. Please register by April 14. For more information or to register call NAP 734.794.6627, or send us an email at NAP@a2gov.org.", "source": "Facebook", "date": "2016-04-16T02:30:00-04:00", "name": "Turtle Survey Training & Kick-off"}, {"url": "https://www.facebook.com/events/1574774672850185/", "description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "source": "Facebook", "date": "2016-04-16T10:30:00-04:00", "name": "Little Peeps PlayGround - \"Farm\""}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-04-16T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/941632505932642/", "description": "The State Street District is hosting a music festival!!  \nRock The District, Saturday April 16th  (3-10pm)  \n- All Ages & FREE\n- 300 block of Maynard Street will be closed. \n- Main Stage on the corner of Maynard Street & East Williams.\n- Parking garage acess on Thompson Street.  \n- There will be food and beverages available.  \n- The District is partnering with Knights to have a Beer Garden \n-  Matthew Altruda of Tree Town Sound will be our emcee \n\nLINEUP: (SET TIMES TBA) \nJoe Hertler & The Rainbow Seekers\nDave Menzo\nMisty Lyn & The Big Beautiful (Misty Solo Set)\nKate Peterson of nervous but excited\nMatt Jones\nBarelyon\nBarbarossa Brothers\nStormy Chromer\n\nListen to our lineup! \n---------------\nJoe Hertler & The Rainbow Seekers\nhttps://joehertler.bandcamp.com/album/terra-incognita\n----------------\nDave Menzo \nhttps://davemenzo.bandcamp.com\n-----------------\nMisty Lyn \nhttps://mistylyn.bandcamp.com\n-----------------\nKate Peterson \nhttps://kpeterson.bandcamp.com/releases\n------------------\nMatt Jones\nhttps://mattjones.bandcamp.com/album/the-deep-enders\n------------------\nBarelyon \nhttps://barelyonmusic.bandcamp.com\n-------------------\nBarbarossa Brothers\nhttps://soundcloud.com/barbarossa-brothers\n-------------------\nStormy Chromer\nhttps://soundcloud.com/stormy_chromer", "source": "Facebook", "date": "2016-04-16T15:00:00-04:00", "name": "Rock The District // 4/16 Saturday // Music Festival // Maynard St. Ann Arb"}, {"url": "https://www.facebook.com/events/1157822724236385/", "description": "You’re invited to the 2016-17  UMS Season Launch Party on Saturday, April 16, 5:30-7:30 pm in Ann Arbor’s Rackham Graduate Building (915 E. Washington St.).\n\nCome enjoy refreshments and light snacks while you explore the performance line-up for the 2016-17 season. Join us for this celebration, conversation with UMS staff, and screenings of the 2016-17 UMS season video.\n\nThis event is free and open to the public; no registration is required.", "source": "Facebook", "date": "2016-04-16T17:30:00-04:00", "name": "2016-17 Season Launch Party"}, {"url": "https://www.facebook.com/events/227041734321656/", "description": "Ann Arbor Poetry Slam Finals are happening Saturday, April 16th at Espresso Royale on State Street. \n\nLaboring all year to cook up their best poetic recipes, twelve champion poets rush the stage with only three minutes each—holding nothing back—to tell it all and tell it well! The audience erupts with boos, roars, applause, or refusal in silence to cast their vote before five randomly selected audience-member-judges! Excitement rises as twelve poets turns to ten, then eight, then six, until only four triumph earning their right to represent Ann Arbor at the National Poetry Slam! \n\nAnd, as if twelve award winning local poets wasn't enough, internationally acclaimed Tim \"Toaster\" Henderson (Berkeley/Chicago) is offering a feature performance. \n\nFor tickets, go to: http://www.a2poetry.org/store/finals\n\nThank you and see you there!", "source": "Facebook", "date": "2016-04-16T19:00:00-04:00", "name": "Ann Arbor Poetry Slam Finals featuring Tim \"Toaster\" Henderson"}, {"url": "https://www.facebook.com/events/1579924995611394/", "description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "source": "Facebook", "date": "2016-04-16T20:00:00-04:00", "name": "Bavarian Radio Orchestra"}, {"url": "https://www.facebook.com/events/1693491947603530/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: MATCH: the improv team\" starring Mitch Socia and Matt Penridge\n\nGroup 2: \"7 Minutes in Heaven\" starring Moni Jones, Emily Engelhart, Adam Hirzel, Steve Oliver\n\nGroup 3: \"The League of Pointless Improvisers\" starring Arthur Brannon III, Emily Engelhart, Maggie O'Reilly, Matthew Flickinger, and Jake Russell", "source": "Facebook", "date": "2016-04-16T20:00:00-04:00", "name": "Pointless Improv with Match and 7 Minutes in Heaven"}, {"url": "https://www.facebook.com/events/533365020158543/", "description": "Sat. April 16 | 9pm | 18+ | $15 Cover\n\nJai Wolf with: Jonah Baseball & Electric Mantis\n\nMixing a unique future sound with hip-hop and pop elements, Jai Wolf is gaining the attention of fans and influential musicians alike. After Skrillex saw a tweet containing Jai’s bootleg of his hit song, “Ease My Mind,” he immediately signed the remix. Since, Jai Wolf has done official work for Alesso, Dirty South, Melanie Martinez, ODESZA, and more.\n\nIn June 2015, Jai Wolf released his first original single, Indian Summer. Within three weeks, Indian Summer hit #1 on the US Spotify Viral Charts, and has gained global recognition.\n\nJai Wolf has toured nationally including pitstops at Coachella, Bonnaroo, Hard Summer, and will wrap up the year with a headlining tour in Australia this Fall.", "source": "Facebook", "date": "2016-04-16T21:00:00-04:00", "name": "Jai Wolf w/ Jonah Baseball and Electric Mantis 4/16/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1753758311520224/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"7 Minutes in Heaven\" starring Moni Jones, Emily Engelhart, Adam Hirzel, Steve Oliver\n\nGroup 2: MATCH: the improv team\" starring Mitch Socia and Matt Penridge\n\nGroup 3: \"The League of Pointless Improvisers\" starring Arthur Brannon III, Emily Engelhart, Maggie O'Reilly, Matthew Flickinger, and Jake Russell", "source": "Facebook", "date": "2016-04-16T22:00:00-04:00", "name": "Pointless Improv with 7 Minutes in Heaven and Match"}, {"url": "https://www.facebook.com/events/945932722192066/", "description": "Join us to play short-form and long-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "source": "Facebook", "date": "2016-04-17T19:00:00-04:00", "name": "The Arcade - A Pointless Improv Jam"}, {"url": "https://www.facebook.com/events/1042945595776720/", "description": "$14 adv./ $16 day of | 18+\n\nFuturistic & Devvon Terrell\nwith Munch & Mocha\n\nGrowing up around music from his Father & two older brothers, it was inevitable that Futuristic would be a natural. He wrote his first raps at the age of six and hasn't looked back since. Born in Illinois but moved to Arizona in high school, Futuristic's flow seems to be just as hot as his surroundings. His album \"The Rise\" released on May 12th 2015 debuted at #2 on itunes and #9 on Hip-Hop Billboard charts. He has been touring virtually non-stop over the last 2 years headlining his own tours and supporting bigger acts such as Somo & Machine Gun Kelly. His fast witty lyrics mixed with substance and relatable subject matter has gained him a die hard fan base called WTFGang which stands for \"We're The Future\". As an independent artist Futuristic takes pride in his creativity and versatility using his words to inspire his fans and let them know that anything is truly possible but also gives them music to BANG with the top down in the summer. Moving forward he expects to be exactly what he named his lead single from his album.... \"The Greatest\". Futuristic recently was featured on A Great Big World single \"Hold Each Other\" which has led him to National television performances on The Tonight Show Starring Jimmy Fallon, VH1 Streamy Awards, Performing for the Vice President Joe Biden & CEO of Apple Time Cook, for the HRC National Dinner in Washington D.C.\n\nGood music arguably comes from a place that is insightful, meaningful and modern.This is where the living weirdo known as Devvon Terrell lives and sleeps. Hailing from Brooklyn, New York the singer has his own urban style and sound that is a testament to his generation.\n\nDevvon Terrell took the internet by storm, showcasing his talent on various remixes and cover videos on youtube that have gained him as much as 200,000 views on a single video.\n\n \n\nDevvon Terrell wears a variety of hats to translate his music to his audience. From shooting and editing videos to engineering, mixing and mastering all of his music. This jack of all trades mentality has earned him placements with And One Live, C2C Dj Khaled's Halftime Report, a number one Mixtape on Datpiff.com and countless other mediums. Devvon Terrell recently released his first album titled \"Weird Sexy Cool\" and earned a the spot of top 16 albums on the itunes RNB charts. With all his endeavors on the rise Devvon Terrell will surely make the transformation from local talent, to mainstream superstar.", "source": "Facebook", "date": "2016-04-17T21:00:00-04:00", "name": "Futuristic and Devvon Terrel 4/17/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1160668480634425/", "description": "Literati is thrilled to welcome Amy Gustine in support of her acclaimed debut collection, You Should Pity Us Instead.\n\nYou Should Pity Us Instead explores some of our toughest dilemmas: the cost of Middle East strife at its most intimate level, the likelihood of God considered in day-to-day terms, the moral stakes of family obligations, and the inescapable fact of mortality. Amy Gustine exhibits an extraordinary generosity toward her characters, instilling them with a thriving, vivid presence.\n\n\"Gustine excels at dramatizing the cunning of the human animal—a creature renowned for its skill at self-sabotage—as well as celebrating the freakish grace that can sometimes strike an ordinary life. You Should Pity Us Instead is a devastating, funny, and astonishingly frank collection.\"    –Karen Russell\n\nAmy Gustine’s fiction has appeared in several journals, including The Kenyon Review, The Alaska Quarterly Review, The Cimarron Review, and the Chicago Tribune’s Printers Row Journal. Her work has also received Pushcart Prize Special Mention.", "source": "Facebook", "date": "2016-04-18T19:00:00-04:00", "name": "Fiction at Literati: Amy Gustine"}, {"url": "https://www.facebook.com/events/769930223136488/", "description": "Monday, April 18 | 8pm | 18+ | $15 adv./ $17 day of\n\nPolica with MOTHXR \n\nUnited Crushers (out March 4, 2016) is POLIÇA’s third full-length release and most remarkable album to date. The band, which includes Channy Leaneagh, dual drummers, Drew Christopherson and Ben Ivascu and Chris Beirden on bass with producer Ryan Olson at the helm, collectively wrote the album in Minneapolis in the winter of 2015 during their first true break from two straight years of touring. The new album builds on POLIÇA’s signature synthesizer and percussion-heavy sounds with more complex arrangements and a bigger, crisper hi-fi punch due to the new approach they took to writing and recording: together, all in the same room. There's a tighter groove to these songs and a more vulnerable quality to them, especially in Leaneagh's singing. Her incredible vocal range is consistently on display throughout, beautifully raw and less electronically effected than on previous recordings. United Crushers is the follow up to 2013’s Shulamith which EW called \"propulsive enough for dance floors, and dreamy enough for headphones\" andMOJO said \"proves that intelligent pop music still has the ability to seduce and enthral.\" Their debut, 2012's Give You The Ghost, also garnered international acclaim, with Rolling Stone hailing it as \"the sound of heartbreak and celebration happening simultaneously\" and Q praising it as \"a bewitching, urgent, magical debut.\" The band has conquered massive festivals around the world from Coachella to Glastonbury in addition to performing on Late Night With Jimmy Fallon, Later With Jools Holland and more.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/564", "source": "Facebook", "date": "2016-04-18T20:00:00-04:00", "name": "Polica w/ Mothxr 4/18/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1725654407681535/", "description": "Oats & Woes & Babo, Oh My!\n\nBabo presents Oats & Woes Ann Arbor a local oatmeal pop-up! Launching The \"babo Study Buddy\" & \"The Nutty Professor\" for the first time EVER (See ingredients below)! \n\nEach bowl is packed with oats and topped with sweet and healthy breakfast options so you can fuel up for the day.\n\nWe will be selling each bowl individually and giving away our exclusive recipe so you can create your own oatmeal bowl at home!\n\nNo tickets are required for this event. \n\nbabo Study Buddy\n-Bob's Red Mill Oats\n-Strawberry compote\n-Fresh Strawberries\n-Fresh Avocados\n-Michigan Honey \n-babo Seedtrus Granola\n\nThe Nutty Professor \n-Bob's Red Mill Oats\n-Banana Compote\n-Justin's Peanut Butter\n-Coconut Oil\n-Bananas \n-Justin's Peanut Butter cup's\n-babo roasted peanuts", "source": "Facebook", "date": "2016-04-19T09:00:00-04:00", "name": "Oats & Woes Oatmeal Pop-up!"}, {"url": "https://www.facebook.com/events/617117388436683/", "description": "This event is geared toward Ypsilanti employees. \n\nDrop in to this casual informational workshop to find out how these bus service improvements could impact your bus commute. \n\nAlso welcome are any employees who may be interested in taking to bus but are unsure what to do.\n\nFree snacks and giveaways provided!\nRSVP: https://www.messageblocks.com/commute-by-bus-ypsi", "source": "Facebook", "date": "2016-04-19T13:10:00-04:00", "name": "Commute by Bus in Ypsi? Read this!"}, {"url": "https://www.facebook.com/events/1536622576641711/", "description": "Can you feel it? Spring? It's there hiding behind the snow -- come celebrate it with us! Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Reader\n\nThis month's feature: SUSAN HUTTON!\n\nSusan Hutton graduated from Kalamazoo College, and got an MFA from the University of Michigan. She held a Wallace Stegner fellowship in poetry at Stanford University. Her poems have appeared in magazines such as Poetry, Ploughshares, and FIELD. Her book, On the Vanishing of Large Creatures (Carnegie Mellon, 2007), won the John C. Zacharis First Book Award. She works at University of Michigan and is chair of the City of Ann Arbor Environmental Commission and a member of the Ann Arbor Climate Partnership.\n\n\nNext month's feature: STEVIE EDWARDS!", "source": "Facebook", "date": "2016-04-19T19:00:00-04:00", "name": "Skazat! Poetry Series featuring Susan Hutton"}, {"url": "https://www.facebook.com/events/557979811041512/", "description": "Audtions WED & THU APRIL 20-21 4-7 PM\nNo monologue needed; Be prepared to work with scenes from the play.  Many roles are double cast.  Performances in June.", "source": "Facebook", "date": "2016-04-20T16:00:00-04:00", "name": "SITA 2016 Auditions"}, {"url": "https://www.facebook.com/events/1019071558166423/", "description": "Monica Swanson Tesler is a graduate of the University of Michigan Law School, and is an attorney in Boston, where she lives with her family.\n\nIn the tradition of Michael Vey and The Unwanteds, twelve-year-old Jasper and his friends are forced to go up against an alien society in this first book in a brand-new adventure series \nThirteen years ago, Earth Force a space-military agency discovered a connection between brain structure and space travel. Now they ve brought together the first team of cadets, called Bounders, to be trained as high-level astronauts. \n\nTwelve-year-old Jasper is part of this team being sent out into space. After being bullied back on Earth, Jasper is thrilled to have something new and different to do with other kids who are more like him. While learning all about the new technologies and taking classes in mobility otherwise known as flying with jetpacks Jasper befriends the four other students in his pod and finally feels like he has found his place in the world. \n\nBut then Jasper and his new friends learn that they haven t been told everything about Earth Force. They weren t brought to space for astronaut training, but to learn a new, highly classified brain-sync technology that allows them to manipulate matter and quantum bound, or teleport. And it isn t long before they find out this new technology was actually stolen from an alien society.\nWhen Jasper and his friends discover the truth about why Earth Force needs them, they are faced with a choice: rebel against the academy that brought them together, or fulfill their duty and protect the planet at all costs.", "source": "Facebook", "date": "2016-04-20T19:00:00-04:00", "name": "Meet Author & U of M Grad Monica Tesler for a Discussion & Signing of Her Debut YA Novel 'Bounders'"}, {"url": "https://www.facebook.com/events/557979811041512/", "description": "Audtions WED & THU APRIL 20-21 4-7 PM\nNo monologue needed; Be prepared to work with scenes from the play.  Many roles are double cast.  Performances in June.", "source": "Facebook", "date": "2016-04-21T16:00:00-04:00", "name": "SITA 2016 Auditions"}, {"url": "https://www.facebook.com/events/1715972678661999/", "description": "Jim Ottaviani (\"Feynman\", \"Primates\") is the world s preeminent writer of comics and graphic novels about science. Notable works include a biography of Niels Bohr and the fast-paced tale of the desperate lives of early paleontologists and \"T-Minus: The Race to the Moon\", from Aladdin books. He has worked as a nuclear engineer and is currently employed as a reference librarian in Ann Arbor, Michigan.\n\nEnglish mathematician and scientist Alan Turing (1912 1954) is credited with many of the foundational principles of contemporary computer science. \"The Imitation Game\" presents a historically accurate graphic novel biography of Turing's life, including his groundbreaking work on the fundamentals of cryptography and artificial intelligence. His code breaking efforts led to the cracking of the German Enigma during World War II, work that saved countless lives and accelerated the Allied defeat of the Nazis. While Turing's achievements remain relevant decades after his death, the story of his life in post-war Europe continues to fascinate audiences today. \nAward-winning duo Jim Ottaviani (the #1 \"New York Times \"bestselling author of \"Feynman \"and \"Primates\") and artist Leland Purvis (an Eisner and Ignatz Award nominee and occasional reviewer for the \"Comics Journal\") present a factually detailed account of Turing's life and groundbreaking research as an unconventional genius who was arrested, tried, convicted, and punished for being openly gay, and whose innovative work still fuels the computing and communication systems that define our modern world. Computer science buffs, comics fans, and history aficionados will be captivated by this riveting and tragic story of one of the 20th century's most unsung heroes.", "source": "Facebook", "date": "2016-04-21T19:00:00-04:00", "name": "Meet Ann Arbor Graphic Novel Author Jim Ottaviani for a Discussion & Signing of His New Novel The Imitation Game: Alan Turing Decoded"}, {"url": "https://www.facebook.com/events/207122056324562/", "description": "Bobby is over the moon after sharing a bike on the E.T. ride at Universal Studios with Katya. Join our “intrepid crusader” as he takes a leap of faith—traveling from comfortable “have-a-nice day … and have-a-warm-shower” suburban Detroit to the former center of Cold War Soviet missile production. And unbeknownst to anyone but himself, he’s bringing an engagement ring! Experience life in a city that, until the mid-1980s, was closed to foreign visitors.  R.J. Fox’s humorous, poignant, and memorable expedition is punctuated by a colorful cast of characters, adventures, and cultural mishaps and misunderstandings—from irate babushka women to hard-drinking uncles. Lesser mortals might have “phoned home” to be rescued. Armchair travelers and romantics—you will find yourself both schooled in hard knocks and heartened to have shared in the unforgettable experience of Love & Vodka!\n\n“If you've ever done something crazy in the name of love, R.J. Fox's adventures in Ukraine will strike a chord. This book is a delight!” (Davy Rothbart)  \n\nR.J. Fox is the award-winning writer of several short stories, plays, poems, and fifteen feature-length screenplays. He teaches English and Video Production in the Ann Arbor Public Schools where he uses his own dream of making movies to inspire his students to follow their own dreams. \n\nSigning to follow.", "source": "Facebook", "date": "2016-04-21T19:00:00-04:00", "name": "Love & Vodka: My Surreal Adventures in Ukraine with R.J. Fox"}, {"url": "https://www.facebook.com/events/580331615466350/", "description": "Ann Arbor Civic Theatre presents Neil Simon’s comedy, Barefoot in the Park, directed by Wendy Wright, April 21-24, 2016, at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org.  \n\nThis hilarious romantic comedy concerns New Yorkers Paul, a buttoned-down lawyer, and his free spirited bride Corrie. Their explosive and passionate relationship plays itself out in a five-story walk-up apartment, while an eccentric neighbor and a meddling mother conspire to test the newlywed’s marriage — all set to a 60’s groovy “Love, American Style” type setting. Director Wendy Wright, whose past A2CT shows have garnered critical and audience acclaim, says of this production, \"Barefoot was Neil Simon's first true hit and has autobiographical elements. It has a freshness and a spark, plus people can easily recognize and relate to the relationships between the characters. This stellar cast is having a ball and we can't wait for the audience to join in the fun. It's the perfect date night comedy!\"\n\nThe production stars Karl Kasischke as Paul, and Colleen Davis as Corrie. Ellen Finch plays the mother, and Larry Rusinsky neighbor Victor. The cast is rounded out by Theo Polley and Thom Johnson in supporting roles.  \n\n“A bubbling, rib-tickling comedy” is how the New York Times gushed about the show in 1963. “I don’t think anyone stopped laughing while the curtain was up last night” gushed The New York Daily News.The original production was Neil Simon’s first big hit and launched his remarkable career.\n\nEnjoy an April spring evening with Ann Arbor Civic Theatre as they go “barefoot in the park”", "source": "Facebook", "date": "2016-04-21T19:30:00-04:00", "name": "Barefoot in the Park"}, {"url": "https://www.facebook.com/events/1683772608545604/", "description": "Thu. April 21 | 9pm | 18+ | $15 Cover\n\nI don’t know how to write a bio for an album. I’ve never written one. I’m a comedian. My job is to talk onstage for long enough that the trapped, drunken audience has to buy more chicken wings from the club. I am not qualified to write about music. And yet here I am, writing a bio for the new The Thermals record, We Disappear. Thank god it’s a great fucking record.\n\nThe first time I heard The Thermals was on broken headphones while riding the A Train to Rockaway, Brooklyn, flying mere feet over a frozen Jamaica Bay on a too-bright January morning. I had just fallen in love with a wonderful, terrible woman who was thousands of miles away. I was very fragile, I had no boundaries, and I was the strongest I’d ever been. And that’s how this album feels. There’s a new vulnerability here, but The Thermals’ sound is as strong as it’s ever been.\n\nThe Thermals are best at making songs you put on mixtapes named ‘Drunken Sing-alongs When You’re Sad.’ They specialize in late-night, secret conversations about feeling simultaneously romantic and resentful over being raised Catholic. They’re the soundtrack to breaking glass, and an ode to the beauty of brokenness.\n\nThey say that the mark of intelligence is the ability to hold two disparate and conflicting truths in the mind at the same time: I am a good person; I am not a good person. We Disappear lives in this delicate, in-between place: at once hard and noisy, while also soft and personal. And seeming contradictions abound on this album. We Disappear is an all-too-real, dark, and intensely personal album – in the past most of singer Hutch Harris’ lyrics have been mostly fictitious tales – about how we try to outrun demise, whether personal or physical. It is an emotional document of how two people can tear each other apart, while simultaneously making you wanna get up and jump around the room.\n\nThe deeply dark, yet oddly catchy “Heart Went Cold” plays on the double metaphor of loss of love/life and features the sad realization “I pushed you away”, but is immediately followed by the super poppy “oh-oh oh”. The classic fucking rock anthem “Hey You” is a paranoid fantasy about running from the Grim Reaper as he calls after you, about “being terrified of death,” says Harris, but “a celebration of that feeling as opposed to feeling sad about it.” A surprisingly uplifting eulogy of the death of a relationship, “Thinking Of You” is explained by Harris as “one of the most straight-forward love songs we’ve ever written, a point-blank post-break up song. It’s a song that says exactly what it means. It and a lot of the record are about regret, i.e. still loving someone after a break-up and hanging on to these feelings.”\n\nWe Disappear is also about separation in terms of technology, how it can isolate us and impact our relationships, and how humans have embraced it to the point where we’ve already assimilated into it. “The Great Dying” and “Into the Code” examine how we’re so afraid we’re going to be forgotten, or overlooked, that we upload everything about our lives onto the Internet.\n\nHarris explains, “Technology, love and death are the three obsessions of the record. Our privacy used to be so important to us and now everything has changed – we freely offer once private information about relationships and reveal everything about our day-to-day lives. We’re trying to preserve our life digitally so when we’re gone people won’t forget us. We’re using technology to become immortal. You can even set up Facebook and Twitter accounts to continue updating after you die! We Disappear is about how humans fight the inevitable.”\n\nI’m sure you want to know that the record will come out March 25th, 2016 on Saddle Creek, that it features the longest running Thermals line-up of Hutch Harris, Kathy Foster, and Westin Glass, and that it was recorded in Portland, OR at Kung Fu Bakery (The Shins, Tegan and Sara) and in Seattle, WA at The Hall of Justice (Nirvana, Mudhoney), and produced by Chris Walla (formerly of Death Cab For Cutie). But what really matters is that this record GETS IT. It walks that fine line between truth and lies, between death and life, between depression and joy – all the while recognizing that one cannot exist without the other. And it brings us with it. That’s the reason to listen to this record: Because it’s a fucking great album, by an amazing band. Long Live The Thermals.", "source": "Facebook", "date": "2016-04-21T21:00:00-04:00", "name": "The Thermals w/ Summer Cannibals 4/21/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-04-22T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/1122376211138399/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Frank & Dale\" starring Julia Schroeder and Lance Purkey\n\nGroup 2: \"Butt Sweatin Tears\" starring Chris Fortin, Kelly Idzikowski, Audra Jantz, and Alex Boyd\t\n\nGroup 3: \"The League of Pointless Improvisers\" starring Doug Kolbicz, Jason Valentini, Matt Swartz, Moni Jones, and Andy Reid", "source": "Facebook", "date": "2016-04-22T20:00:00-04:00", "name": "Pointless Improv with Frank & Dale and Butt Sweatin Tears"}, {"url": "https://www.facebook.com/events/1943009162591226/", "description": "Warm as summer sunshine, real as the truth, intimate as a long overdue visit between old friends … such is a Jonathan Edwards concert. Four decades into a stellar career of uncompromising musical integrity, the man simply delivers, night after night – songs of passion, songs of insight, songs of humor, all rendered in that pure and powerful tenor which, like fine wine, has only grown sweeter with age.\nThis is one veteran performer who is neither grizzled nor nostalgic.  \nJonathan's  highly respected repertoire  includes such classics as, “Sometimes,” “One Day Closer,” “Don’t Cry Blue,” “Emma,” “Everybody Knows Her,” “Athens County,” and everyone’s favorite ode to putting a good buzz on, “Shanty.” And then, of course, there’s the anthemic “Sunshine (Go Away Today),” that fierce proclamation of protest and independence that resonated with thousands and thousands of frustrated and angry young men and women when it was first released in 1971. Almost 40 years later, at show after show, the song continues to be embraced by faithful followers and new fans alike.\nSince 1971, Jonathan has released 15 albums, including \"Blue Ridge,\" his standard-setting collaboration with bluegrass favorites the Seldom Scene, and \"Little Hands,\" his collection of children’s songs, which was honored with a National Library Association award. His brand new album is, \"Tomorrow's Child.\"\nwww.jonathanedwards.net", "source": "Facebook", "date": "2016-04-22T20:00:00-04:00", "name": "Jonathan Edwards at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/935490533173037/", "description": "Big Wild\nw/ guests TBA!\n\nFri. April 22 | 9pm | All Ages | $10 adv./ $12 day of\n\nStemming from a relentless desire to create something new, Big Wild’s sound taps into the natural curiosity we all share by exploring beyond conventional boundaries in music. This spark was ignited when he first began creating music under the heavy influence of modern hip hop producers. Since then, he has increasingly drawn inspiration from the limitless potential of electronic music, while at the same time building a style unique to him.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/637\n\nConnect with Big Wild:\nhttp://bigwildmusic.com\nhttp://soundcloud.com/bigwildmusic \nhttp://twitter.com/bigwildmusic\nhttp://instagram.com/bigwildmusic", "source": "Facebook", "date": "2016-04-22T21:00:00-04:00", "name": "Big Wild :: 4/22 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1126490137441556/", "description": "Solar Powered Faygo Whirling Test... Can you pass?\n\nall vinyl techno & house party\n\nsuitor\nhttps://soundcloud.com/suitor-1\n\npat in the hat\nhttps://soundcloud.com/patinthehatdoe\n\nsegv\nhttps://soundcloud.com/segv\n\njeff garcia\nhttps://mixcloud.com/garconsrustiques/\n\njimmy k\nhttps://soundcloud.com/jimmykdetroit\n\nvisuals by Deep Grey\n\n$3 Faygo mixed drinks\n\n9pm doors | 18 and up welcome\n\nClub Above\n215 N Main Street\nDowntown Ann Arbor", "source": "Facebook", "date": "2016-04-22T21:00:00-04:00", "name": "Solar Powered Faygo Whirling Test: suitor, pat in the hat, segv, jeff garcia & jimmy k"}, {"url": "https://www.facebook.com/events/577511505760697/", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring Doug Kolbicz, Jason Valentini, Matt Swartz, Moni Jones, and Andy Reid", "source": "Facebook", "date": "2016-04-22T22:00:00-04:00", "name": "A Pointless Display of Improvised Feats"}, {"url": "https://www.facebook.com/events/593017857529363/", "description": "Guest artist Spinning Dot Theatre's presents their newest Artist-in-Residence one-man show, \"A Mouth With Flame.\" This original piece by Korean artist Tae Hoon Yoo is a cultural experience about identity that weaves together dragon folklore, cultural and historical events, and personal stories in creative and insightful ways. A Mouth With Flame is a multimedia performance including shadow puppetry, music, and digital media for family audiences geared at ages 7-12.", "source": "Facebook", "date": "2016-04-23T10:30:00-04:00", "name": "A Mouth with Flame"}, {"url": "https://www.facebook.com/events/1589849627952742/", "description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "source": "Facebook", "date": "2016-04-23T20:00:00-04:00", "name": "The Bad Plus Joshua Redman"}, {"url": "https://www.facebook.com/events/574260982732253/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Gluck\" starring Amy Phillips, Scott Icenogle, and Tim Lally\n\nGroup 2: \"90s Music\" starring Aaron Johnstone and Tom Novik\n\nGroup 3: \"The League of Pointless Improvisers\" starring Chris Moody, Julia Schroeder, Mitch Socia, Aaron Johnstone, and James Quesada", "source": "Facebook", "date": "2016-04-23T20:00:00-04:00", "name": "Pointless Improv with Gluck and 90s Music"}, {"url": "https://www.facebook.com/events/1104519419589243/", "description": "The Kings of Crabgrass are happy to return to downtown Ann Arbor!\n\nhttp://www.blackjakeandthecarnies.com/\n\nAppearing with:\n\nStormy Chromer - prog/improv/rock\nwww.stormychromer.bandcamp.com\n\nCig Butts - jangly rock\nhttp://www.cigbutts.com/\n\nSister Helen - on tour, Brooklyn band brings the alternative\nhttps://www.facebook.com/Sister-Helen-6210178070/\n\nMore information about Heidelberg Club Above:\nhttp://heidelbergannarbor.com/club-above/", "source": "Facebook", "date": "2016-04-23T20:00:00-04:00", "name": "Black Jake & The Carnies - live at Heidelberg - Club Above w/ Stormy Chromer, Cigg Butts, Sister Helen"}, {"url": "https://www.facebook.com/events/995714530505088/", "description": "Far House presents an evening of neoclassical and avant-folk, featuring touring artist:\n\nSaul Conrad (Boston, Massachusetts)\nhttps://soundcloud.com/teamlove/sets/saul-conrad-requiem\n\nSaul Conrad’s Requiem is a musical setting of the 12th century poem Dies Irae. It combines, perhaps for the first time, singer/songwriter stylings with the rigors of a classical and sacred form—the Requiem Mass—a prayer on behalf of dying souls. Supported by piano, a pipe organ, 1st and 2nd violin, viola, electric bass, french horn and oboe, Saul sings a combination of the original Latin verse and his own words drawn from the stories and scenes of the poem. Influences include Alexander Skip Spence’s Oar, Bach’s Goldberg Variations, Mozart’s Requiem and Great C Minor Mass, Chopin’s Preludes, and the adagio of Mahler’s last symphony. Requiem is dedicated to Saul’s great-uncle, Claude Frank.\n\n\nWith local support by:\n\nBen Willis (Ann Arbor, MI)\nhttp://www.benwillis.us/\n\nBen Willis is a bassist whose affinities lie in collaborative projects, new music, improvisation, and the merging of cross-disciplinary elements. He's performed his original collaborative work at venues and festivals around the U.S., including the International Society for Improvised Music Conference, Electroacoustic Barn Dance at the University of Mary Washington, the Whitewater Arts Alliance Series at the University of Wisconsin, Whitewater and the Ratchet Series at the Skylark in Chicago. In 2013, he was a Robert Black Bass Fellow at the Bang on a Can Summer Festival. Much of his work highlights the importance of collaborative, performative process in the development of new art.\n\n\nNick Zomparelli (Ann Arbor, MI)\n\nSolo set from Far House resident and multi-instrumentalist Nick Zomparelli (PING PoNG/Daughters of Eternity).\n\n\nTravis Jarosz (Ann Arbor, MI)\n\nSolo cello with accompaniment from multi-instrumentalist, Travis Jarosz (commonly known as Watabou).\n\n\n$5 suggested donation for our out-of-town friend.\n\nDoors at 9, with music starting at 10.\nSHOW UP ON TIME!\n\nRespect the house and the artists.\nThis is a music event, not a house party.\nEngage and participate.", "source": "Facebook", "date": "2016-04-23T21:00:00-04:00", "name": "Saul Conrad (Boston) w/ Ben Willis, Nick Zomparelli, Travis Jarosz"}, {"url": "https://www.facebook.com/events/767351216732483/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"90s Music\" starring Aaron Johnstone and Tom Novik\n\nGroup 2: \"Gluck\" starring Amy Phillips, Scott Icenogle, and Tim Lally\n\nGroup 3: \"The League of Pointless Improvisers\" starring Chris Moody, Julia Schroeder, Mitch Socia, Aaron Johnstone, and James Quesada", "source": "Facebook", "date": "2016-04-23T22:00:00-04:00", "name": "Pointless Improv with 90s Music and Gluck"}, {"url": "https://www.facebook.com/events/962465290519288/", "description": "“Receiving the Shore” is a 40 page book of Jennifer’s poems, with a CD of Laszlo's settings of those poems to music.   The duo will perform some of these poems for the audience.\n\nJennifer Burd has had both haiku and lyric poetry published in numerous journals, most recently in Beloit Poetry Journal, NEAT, Acorn, and Modern Haiku. Her full-length book of poems, Body and Echo, was published by PlainView Press in 2010. She is also the author of a book of creative nonfiction, Daily Bread: A Portrait of Homeless Men & Women of Lenawee County, Michigan (Bottom Dog Press, Inc., 2009, with photographs by Lad Strayer), based on her experiences reporting on local homelessness for the Adrian, Michigan, Daily Telegram newspaper. Burd received her BA in English and her MFA in Creative Writing from the University of Washington. She currently works as an editor and writer for HighScope Educational Research Foundation in Ypsilanti, Michigan. \n\nLaszlo Slomovits is one of the twin brothers in the children’s folk music duo Gemini (GeminiChildrensMusic.com).  Laszlo has given concerts throughout the U.S. and a number of his award-winning songs are featured in songbooks music teachers use throughout the country.  In addition, he has set to music the work of many poets. His recordings include five CDs of the poetry of ancient Sufi mystics, Rumi (translated by Coleman Barks) and Hafiz (translated by Daniel Ladinsky) as well as “White Picture” by the Holocaust-era Czech poet Jiri Orten (translated by Lyn Coffin) and “Cry of Freedom,” the poetry of contemporary American poet Linda Nemec Foster. \n\nJennifer and Laszlo have also had their jointly-written poems published in a number of print and on-line journals. In addition, a children’s play they co-wrote, I Can Hear the Sun, based on a book by Patricia Polacco, was produced by Ann Arbor’s Wild Swan Theater in March 2015.", "source": "Facebook", "date": "2016-04-24T15:00:00-04:00", "name": "Join Us for an Afternoon of Poetry with Ann Arbor's Laszlo Slomovits and Jennifer Burd"}, {"url": "https://www.facebook.com/events/1697099597227373/", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "source": "Facebook", "date": "2016-04-24T19:00:00-04:00", "name": "Open Stage"}, {"url": "https://www.facebook.com/events/103567850045837/", "description": "We're celebrating spring with two great things: food and beer! Join us on Tuesday, April 26th for four spring-themed courses plus a dessert course, each paired with a Wolverine State brew. Brewmaster Oliver Roberts and Chef Mark Grasso will be on hand to present and discuss the pairings. Ticket cost is $45 per person, and seating is limited, so don't delay! Tickets are available using the Eventbrite link above or in the Tap Room. The event is for ticket holders only and will take place in the Gulo Room. Seating and welcome beer at 6:30, and we roll from there. Call 734-369-2990 with questions, or email mackenzie@wolverinebeer.com.", "source": "Facebook", "date": "2016-04-26T18:30:00-04:00", "name": "Spring Beer Dinner"}, {"url": "https://www.facebook.com/events/1535746816722754/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "source": "Facebook", "date": "2016-04-26T19:00:00-04:00", "name": "Acoustic Tuesdays: Heather Schwartz"}, {"url": "https://www.facebook.com/events/1730384527194484/", "description": "$5 cover, merch available, come have some fun. \n\nSing along: \n\nHour 24 (Toledo)\nWebsite: http://www.hour24band.com\nPre-Order the EP: https://itunes.apple.com/album/emergence-ep/id1091673720\n\nPocket Candies (Ann Arbor)\nhttps://pocketcandiesmusic.bandcamp.com/releases\n\nArson Party (Ann Arbor)\nhttps://itunes.apple.com/us/album/fall-of-the-rising-ii/id881628750?uo=4\n\nKid Grizzly (Detroit/Toledo)\nhttps://kidgriz.bandcamp.com/releases", "source": "Facebook", "date": "2016-04-26T19:30:00-04:00", "name": "Club Above Presents: Hour 24 CD Release Tour//Pocket Candies/Arson Party/Kid Grizzly"}, {"url": "https://www.facebook.com/events/1668025760140932/", "description": "Our April Artists' Meet & Greet topic is How to Photograph Your Artwork. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet events: http://www.annarborartcenter.org/artists-meet-greet/", "source": "Facebook", "date": "2016-04-27T18:00:00-04:00", "name": "How to Photograph Your Artwork"}, {"url": "https://www.facebook.com/events/991272244292924/", "description": "Wed. April 27 | 7:30pm | 18+ | $28 Cover\n\nReverend Horton Heat with: Unknown Hinson, Nashville Pussy & Lucky Tubb & the Modern Day Troubadours Live in Concert!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/612", "source": "Facebook", "date": "2016-04-27T19:30:00-04:00", "name": "Rev. Horton Heat & Company 4/27/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1740012382900420/", "description": "Nini D. And other mc's will be showing you what Michigan music is about.", "source": "Facebook", "date": "2016-04-27T21:00:00-04:00", "name": "Northern Threat Entertainment Presents Wild and Out Wednesdays Ft. Nini D."}, {"url": "https://www.facebook.com/events/1079340418752835/", "description": "Diana Wege is an artist. She has painted in all fifty states and in 2000 she published Land America Leaves Wild, a book of her paintings of 23 of those states. This is her first children’s book.  Diane also grew up in Grand Rapids and Ann Arbor and is a graduate of Greenhills School.\n\nHarbour Island, only three miles long and half a mile wide, is one of the oldest settlements in the Bahamas and is best known for its broad pink-sand beaches and for bonefishing, a compelling catch-and-release enterprise that pits a determined angler against an inedible, surprisingly powerful, and elusive quarry.\n\nYoung and fearless Flossie lives on Harbour Island and has a persistent dream is to go fishing with the legendary guide Bonefish Joe, a beloved island institution who picks up his wealthy clients at the dock and returns with them hours later, fishless but satisfied. One Sunday, after church, Flossie’s wish is surprisingly granted and she discovers the allure, the challenge, and the delights of hooking (and releasing) one of angling’s greatest prizes.\n\nDiana Wege’s illustrations of the island, its inhabitants, its customs, and its architecture,bring this story alive, perfectly catching the characters, culture and charm of Harbour Island.", "source": "Facebook", "date": "2016-04-28T19:00:00-04:00", "name": "Meet Illustrator/Artist Diane Wege for a discussion & Signing of 'A Day with Bonefish Joe' her First Children's Picture Book"}, {"url": "https://www.facebook.com/events/1318721681600135/", "description": "Thursday, April 28 | 9pm | 18+ | $15 Cover\n\nIt’s rare for an artist to bridge the divide between critical acclaim and dedicated fan engagement. Chris Pureka is a Portland-based singer-songwriter whose body of work has resonated deeply with these seemingly disparate milieus. Her bold vulnerability in processing the intimacies of her life in song has long appealed to those listeners who crave authenticity. Now, five years coming, she shares with us another powerful entry in her life’s work, her sixth release, the aptly titled, Backin the Ring. Chris’s elegant emotionality as a vocalist, and her flair and immediacy as a lyricist have garnered her favorable comparisons to Gillian Welch, Ryan Adams, Bruce Springsteen, and Patty Griffin. She’s earned accolades from such distinguished taste-making outlets as The New York Times, Paste, Magnet,Billboard.com, and The AllMusic Guide. She’s shared the stage with such diverse and esteemed artists as Dar Williams, TheLumineers, The Cowboy Junkies, Gregory Alan Isakov, Martin Sexton, and Ani DiFranco. Along the way, Chris has remained fiercely independent, selling nearly 50,000 albums through her own label, Sad Rabbit Records. Chris’s journey in music mirrors her path toward self-discovery. At 16, writing songs became a way of journaling. “I was shy and introverted, and songwriting was a very personal process. I never had any intention of performing,” she shares. Post high school, she went on to complete a biology degree at Wesleyan University, and afterwards, worked in a microbiology research lab at Smith College. Meanwhile, she established a music career parallel to her biology work through touring and issuing a clutch of well-received indie releases.In 2006, when Chris found herself turning down too many opportunities as a musician, she shifted her priorities to become a full-time artist. Her latest album, Backin the Ring, is Chris’s first studio full length since 2010’s critically acclaimedHow I Learned to See in the Dark. “I’m not interested in releasing songs I can’t get behind or records I don’t love,” she says of the five-year span between albums. The title of her latest playfully suggests something of an artistic comeback, but it also references the album’s themes of relationship conflict and making the decision to fight back against dark inner demons. “My music is the outward expression of the work I’m doing internally. What I do comes from my experiences, and I strive to express these experiences authentically. Speaking my truth, and being myself, is the way that I connect with people,” Chris confides. Her rise as an esteemed artist with captivating emotional integrity has been organic and always on her own terms.For someone who never had an intention of being a professional musician, it’s been a life of far-reaching changes and unexpected rewards. \n\nWSG: Anna Vogelzang\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/595", "source": "Facebook", "date": "2016-04-28T21:00:00-04:00", "name": "Chris Pureka w/ Anna Vogelzang 4/28/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-04-29T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/837506396394371/", "description": "The second season for AFC Ann Arbor kicks off April 29th at 7PM with a friendly against Oakland County FC.  \n\nBeginnng at 5pm, supporters will gather at Arbor Brewing Company for prematch festivities at the Official Pub of AFC Ann Arbor. Park downtown and ride the all new shuttle (FREE) to Hollway Field from ABC.  \n\nGates open at 6pm. Purchase your tickets in advance and save $2 per adult ticket!", "source": "Facebook", "date": "2016-04-29T19:00:00-04:00", "name": "AFC Ann Arbor vs. Oakland County FC - Arbor Day Opener"}, {"url": "https://www.facebook.com/events/1171388892895805/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"GC\" starring Garrett Fuller and Jeremy Conn\n\nGroup 2: \"Bird Box\" starring Alison Duffy, RJ Cach, Jess Loria, Lorin Kozlowski, Tom Novik, and Jenny Bloomer\n\nGroup 3: \"The League of Pointless Improvisers\" starring Emily Engelhart, Maggie O'Reilly, Matt Swartz, Arthur Brannon III, and Steve Oliver", "source": "Facebook", "date": "2016-04-29T20:00:00-04:00", "name": "Pointless Improv with GC and Bird Box"}, {"url": "https://www.facebook.com/events/930690620345924/", "description": "Don Campbell is a contemporary/country crossover and folk-rock singer/songwriter whose presentation of music supports the story in the song and welcomes the audience on board for the ride. Often compared to the sounds of Dan Fogelberg, Vince Gill, and Chris Isaak, Don and his ensembles are based out of New England. In 2012, Don released a double CD, \"Kites To Fly: Celebrating the Music of Dan Fogelberg,\" and in 2013 began presenting live performances of this music around his own busy schedule of Don Campbell shows.\nwww.doncampbellmusic.com", "source": "Facebook", "date": "2016-04-29T20:00:00-04:00", "name": "A Special Evening Of Dan Fogelberg Music by Don Campbell"}, {"url": "https://www.facebook.com/events/1251141591582125/", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring Emily Engelhart, Maggie O'Reilly, Matt Swartz, Arthur Brannon III, and Steve Oliver", "source": "Facebook", "date": "2016-04-29T22:00:00-04:00", "name": "A Pointless Display of Improvised Feats"}, {"url": "https://www.facebook.com/events/599092686924913/", "description": "Join us April 30th for Independent Bookstore Day! This is a free, all-day celebration of the bookstore. We will have one-of-a-kind items from authors such as Neil Gaimen (and many others) exclusively produced for Bookstore Day! Also:\n\n-Raffles\n-EXCLUSIVE Bookstore Day items\n-Photo booth (take a picture with a \"book you'd take to a deserted island!)\n-First 50 people to buy a book get a free cafe drink! (Coffee, tea, or espresso) from The Espresso Bar!\n-Story time with children's author Diana Wege (11am)\n-Signed first editions\n-Displays featuring local and Michigan authors\n\nThis is a nationwide event involving over 400 bookstores around the country. We're proud to take part and thrilled to have your support. Join us!\n\nMore info: http://www.indiebookstoreday.com", "source": "Facebook", "date": "2016-04-30T10:00:00-04:00", "name": "Independent Bookstore Day!"}, {"url": "https://www.facebook.com/events/1702271433391072/", "description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "source": "Facebook", "date": "2016-04-30T10:30:00-04:00", "name": "Little Peeps PlayGround - \"Pirates\""}, {"url": "https://www.facebook.com/events/1697126153910182/", "description": "Nicola's Books is THRILLED to be hosting a store event for NYT bestselling children's author Andy Griffiths. \n\nAndy Griffiths is one of Australia’s most popular children’s authors. Andy is best known for The Treehouse series, the JUST! books and The Day My Bum Went Psycho. Over the last 20 years Andy’s books have been New York Times bestsellers, adapted for the stage and television and won more than 50 Australian children’s choice awards. Andy, a passionate advocate for literacy, is an ambassador for The Indigenous Literacy Foundation and The Pyjama Foundation.\n\nAndy and Terry live in a 52-Story treehouse. (It used to be a 39-story treehouse, but they keep expanding.) It has a chainsaw-juggling level, a make-your-own-pizza parlor, a rocket-powered carrot-launcher, a life-size snakes and ladders game, a remembering booth, a Ninja Snail Training Academy and a high-tech detective agency, with all the latest high-tech detective technology, including the Disguise-o-Matic 5000!\nSomething that is sure to come in handy as they try to solve the mystery of: What happened to Mr. Big Nose? After all, it's hard to turn in your next book when your publisher has vanished!\nJoin \"New York Times-\"bestselling author Andy Griffiths and illustrator Terry Denton on another wild storytelling adventure in a series \"Publishers Weekly\" described as \"Anarchic absurdity at its best.\" Welcome to \"The 52-Story Treehouse...\"What are you waiting for? Come on up!", "source": "Facebook", "date": "2016-04-30T11:00:00-04:00", "name": "Meet NYT Bestselling Children's Author Andy Griffiths for a Discussion & Signing of His New Book, 'The 52- Story Treehouse'"}, {"url": "https://www.facebook.com/events/1711823135728044/", "description": "International Tabletop Day is back and this year Vault of Midnight is going to make it better than ever. Founded in 2013 by Geek & Sundry, International Tabletop Day is a worldwide celebration of board-gaming awesomeness. Join your local community of board gamers and play the latest heavy hitters or revisit a classic.\n\nInternational Tabletop Day is a free, family friendly event for both tabletop enthusiasts and curious noobs alike. Join Vault of Midnight's staff and a small army of gaming experts at The Beer Grotto - we'll teach you all the rules and make recommendations on some new games that you might want to add to your game collection.\n\nExcelsior!", "source": "Facebook", "date": "2016-04-30T12:00:00-04:00", "name": "International Tabletop Day 2016"}, {"url": "https://www.facebook.com/events/1691887031028215/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"CSI\"\n\nGroup 2: \"Question Marky Mark\" starring Aaron Johnstone, Erik Heilner, Amber Hunt, RJ Cach, and Travis Pelto\n\nGroup 3: \"The League of Pointless Improvisers\" starring Corene Ford, Jason Valentini, Julia Schroeder, Moni Jones, and Jake Russell", "source": "Facebook", "date": "2016-04-30T20:00:00-04:00", "name": "Pointless Improv with CSI and Question Marky Mark"}, {"url": "https://www.facebook.com/events/811867332280940/", "description": "Saturday, April 30 | 9:30pm | 18+ | $10 / under 21 $13\n\nQueen of Cups started with an ambitious show at the Michigan Theater in Ann Arbor MI. Pick a Card: a Burlesque Exploration of Tarot, was a successful, crowd founded, endeavor headed by Gala Delicious and co produced by Cruel Valentine. Gala Delicious has continued to produce theme shows, variety shows, Thrill Life figure drawing, and in costume live readings wit hThe Get Up Vintage. Favorite returning performers are Bunny Valentine, Red Rum (Chicago,) Dahlia Fatale (Chicago,) Mylitta La Fae, and many others!", "source": "Facebook", "date": "2016-04-30T21:30:00-04:00", "name": "Queens of Cups Burlesque Variety 4/30/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/215969065457384/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Question Marky Mark\" starring Aaron Johnstone, Erik Heilner, Amber Hunt, RJ Cach, and Travis Pelto\n\nGroup 2: \"Love Handles\" starring James Quesada and Travis Pelto\n\nGroup 3: \"The League of Pointless Improvisers\" starring Corene Ford, Jason Valentini, Julia Schroeder, Moni Jones, and Jake Russell", "source": "Facebook", "date": "2016-04-30T22:00:00-04:00", "name": "Pointless Improv with Question Marky Mark and Love Handles"}, {"url": "https://www.facebook.com/events/253856641617487/", "description": "Join us to play short-form and long-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "source": "Facebook", "date": "2016-05-01T19:00:00-04:00", "name": "The Arcade - A Pointless Improv Jam"}, {"url": "https://www.facebook.com/events/1713725442238131/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-       May 3 - Isaac Berkowitz and Chris Bota\nIsaac Berkowitz and Chris Bota are guitarists in the Michigan rock band, Desmond Jones. As an acoustic duo, they blend blugrass and country acoustic guitar style with their band's original tunes. \nDesmond Jones is a five-piece funk/rock/jazz fusion band from Grand Rapids, Michigan. With original music written to compliment the group's sound as a whole, the music is centered around melodic guitar riffs, smooth bass lines, funky drum beats, and some saxophone. \n\nNever a cover\nAlways a good time", "source": "Facebook", "date": "2016-05-03T19:00:00-04:00", "name": "Acoustic Tuesdays: Isaac Berkowitz & Chris Bota"}, {"url": "https://www.facebook.com/events/269588673372504/", "description": "Kristine Kruppa is a mechanical engineer at Ford Motor Company, writer, and world traveler. Her days are spent designing cool new car parts, but her evenings are filled with writing and cats. She has traveled solo to seventeen countries on five continents. Her other hobbies include hunting for the perfect cup of coffee, exploring used book stores, and accidentally climbing mountains. \n\nEveryone in Dahlia’s world knows when they’re going to die. Except her.\n\nHer father has never shown her the pocket watch counting down the days she has left to live. When he sacrifices himself to save her from her scheduled death, Dahlia abandons her comfortable home and sets off after his murderer to uncover the secrets her father died to protect…and the time research that could bring him back to life.\n\nThen she meets Farren Reed. She should hate him. He’s an enemy soldier, a cowardly deserter, and the most insufferable man Dahlia’s ever met. Still, she needs all the help she can get, and Farren is the only chance she has to find the man who murdered her father. But Farren has only twenty-seven days left on his watch.\n\nIn that time, Dahlia must recover her father’s time research, foil a psychotic general’s plot, and learn to survive in a world that will never be the same. But the research holds secrets more dangerous than she had ever imagined. She will have to choose what is most important: revenge, Farren’s life, or her own. And time is running out.", "source": "Facebook", "date": "2016-05-03T19:00:00-04:00", "name": "Join Us - Launch Party for Local YA Debut Author Kristina Kruppa for '27 Days to Midnight'"}, {"url": "https://www.facebook.com/events/446750598867331/", "description": "Finally! The Wednesday Daytime Market is back! Join us for the first one of the season at an earlier start time: 7:00am! \n\nAfter this our summer hours are in full effect: Wednesdays and Saturdays from 7:00 am to 3:00pm\n\nHope to see you there!", "source": "Facebook", "date": "2016-05-04T07:00:00-04:00", "name": "Wednesday Daytime Market"}, {"url": "https://www.facebook.com/events/866000246862709/", "description": "Your favorite Food Trucks are back along with some new choices! Join us on the first Wednesday of each month for some tasty, local food, music, and fun for family and friends! \n\n\nMay 4th\nJune 1st\nJuly 6th\nAugust 3rd\nSeptember 7th\nOctober 5th", "source": "Facebook", "date": "2016-05-04T17:00:00-04:00", "name": "First Wednesday Food Truck Rally"}, {"url": "https://www.facebook.com/events/597186947106593/", "description": "Join us on Cinco De Mayo for a chippin', dippin', and drink sippin' fiesta! \n\nThe Savco De Mayo pub-crawl will be taking you to Sava's Restaurant, Babo: A Market By Sava, and Aventura Ann Arbor where you can enjoy authentic Mexican food and beverage with a Savco Hospitality twist (see menus below). \n\nPurchase your tickets online, with the link above, or at any one of our Savco Hospitality establishments.\n\nBabo: A Market By Sava\n\nFood:\n- Your Choice of Tacos Papas Dulces with roasted sweet potatoes, Fresno slaw, and queso fresco or Tacos Carnitas with pulled pork, Fresno slaw, and queso fresco. \n- Chili-lime marinated grilled watermelon. \n\nBeverage:\nMicheladas with corona and clamato \n\nAventura\n\nFood: \n- Potato & poblano or braise beef flauta served with crema and sweet mango sauce\n- Aventura's famous churros with chocolate espresso sauce\n\nBeverage:\nThyme Paloma with Cazadores blanco, grapefruit, thyme, and cava.\n\nSava's\n\nFood:\n- Tostada De Tinga with corn tortillas, braised chicken, chipotle and salsa.\n- Carne Asada with flank steak, braised black beans, salsa verde, and cactus.\n- Braised bean & Queso Fresco enchiladas with mole sauce\n\nBeverage:\nWatermelon Margarita with Gold Tequila, Gran Gala,housemade sour, Fresh squeezed watermelon juice and Himalayan sea salt.", "source": "Facebook", "date": "2016-05-05T18:00:00-04:00", "name": "Savco De Mayo"}, {"url": "https://www.facebook.com/events/587174898126182/", "description": "Join us on Cinco De Mayo for a chippin', dippin', and drink sippin' fiesta! \n\nThe Savco De Mayo pub-crawl will be taking you to Sava's Restaurant, Babo: A Market By Sava, and Aventura Ann Arbor where you can enjoy authentic Mexican food and beverage with a Savco Hospitality twist (see menus below). \n\nPurchase your tickets online, with the link above, or at any one of our Savco Hospitality establishments.\n\nBabo: A Market By Sava\n\nFood:\n- Your Choice of Tacos Papas Dulces with roasted sweet potatoes, Fresno slaw, and queso fresco or Tacos Carnitas with pulled pork, Fresno slaw, and queso fresco. \n- Chili-lime marinated grilled watermelon. \n\nBeverage:\nMicheladas with corona and clamato \n\nAventura\n\nFood: \n- Potato & poblano or braise beef flauta served with crema and sweet mango sauce\n- Aventura's famous churros with chocolate espresso sauce\n\nBeverage:\nThyme Paloma with Cazadores blanco, grapefruit, thyme, and cava.\n\nSava's\n\nFood:\n- Tostada De Tinga with corn tortillas, braised chicken, chipotle and salsa.\n- Carne Asada with flank steak, braised black beans, salsa verde, and cactus.\n- Braised bean & Queso Fresco enchiladas with mole sauce\n\nBeverage:\nWatermelon Margarita with Gold Tequila, Gran Gala,housemade sour, Fresh squeezed watermelon juice and Himalayan sea salt.", "source": "Facebook", "date": "2016-05-05T18:00:00-04:00", "name": "Savco De Mayo"}, {"url": "https://www.facebook.com/events/222720931416720/", "description": "Join us on Cinco De Mayo for a chippin', dippin', and drink sippin' fiesta! \n\nThe Savco De Mayo pub-crawl will be taking you to Sava's Restaurant, Babo: A Market By Sava, and Aventura Ann Arbor where you can enjoy authentic Mexican food and beverage with a Savco Hospitality twist (See Menus Below). \n\nPurchase your tickets online, with the link above, or at any one of our Savco Hospitality establishments.\n\nFood & Beverages Menus\n\nBabo: A Market By Sava\n\nFood:\n- Your Choice of Tacos Papas Dulces with roasted sweet potatoes, Fresno slaw, and queso fresco or Tacos Carnitas with pulled pork, Fresno slaw, and queso fresco. \n- Chili-lime marinated grilled watermelon. \n\nBeverage:\nMicheladas with corona and clamato \n\nAventura\n\nFood: \n- Potato & poblano or braise beef flauta served with crema and sweet mango sauce\n- Aventura's famous churros with chocolate espresso sauce\n\nBeverage:\nThyme Paloma with Cazadores blanco, grapefruit, thyme, and cava.\n\nSava's\n\nFood:\n- Tostada De Tinga with corn tortillas, braised chicken, chipotle and salsa.\n- Carne Asada with flank steak, braised black beans, salsa verde, and cactus.\n- Braised bean & Queso Fresco enchiladas with mole sauce\n\nBeverage:\nWatermelon Margarita with Gold Tequila, Gran Gala,housemade sour, Fresh squeezed watermelon juice and Himalayan sea salt.", "source": "Facebook", "date": "2016-05-05T18:00:00-04:00", "name": "Savco De Mayo"}, {"url": "https://www.facebook.com/events/919947144747827/", "description": "Vocalist and composer Carla Cooke is the youngest daughter of the legendary Sam Cooke, whose musical life encompassed religion, romance, and history. Carla’s career mirrors that of her father, in that she crafted her sound in the church. Carla sought not to use her father’s name, but to build her own reputation. Now the younger Cooke knows that her roots are firmly entwined in her father's as she connects with them through his music.\n\nCarla Cooke’s style is diverse in gospel, Christian, R&B, soul, and pop styles. With a strong vocal range and warm personality, Carla shows that the apple doesn't fall far from the tree, as she channels the raw talent, emotion, beauty, and charisma of the Cooke family persona. www.carlacooke.com", "source": "Facebook", "date": "2016-05-06T20:00:00-04:00", "name": "An Evening of Sam Cooke by Daughter Carla Cooke"}, {"url": "https://www.facebook.com/events/1513835392257274/", "description": "Get an up-close look at what makes the water flow to your faucet.\n\nSaturday, May 7th\n11am to 3pm\n\n919 Sunset Rd\nAnn Arbor, MI 48103\n(734) 794– 6426\n\nFreebies, tours, family friendly activities and light refreshments.", "source": "Facebook", "date": "2016-05-07T11:00:00-04:00", "name": "Water Treatment Plant Open House"}, {"url": "https://www.facebook.com/events/504261986425250/", "description": "Nicola's Books is an official Children's Book Week store and we have put together a great Special Story Time for you.  We will have local picture book authors Shanda Trent and Melanie Zwegers coming who will read their books and as a special treat The Library Mouse will also stop by for a visit!  So bring you youngsters and have some fun.", "source": "Facebook", "date": "2016-05-07T11:00:00-04:00", "name": "Special Story Time w/Shanda Trent, Melanie Zwegers & The Library Mouse will Visit Too!"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-05-07T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/1763664110523989/", "description": "Sat. May 7 | 9:30pm | 18+ | $10 Cover\n\nSuper Happy Funtime Burlesque is a 16 member band/burlesque show showcasing genre defying music and sexy striptease all in the name of good jokes and bad taste.  Designed to find your line and cross it, SHFB presents its shows as full on musical theater.  Rather than the typical variety show format, SHFB presents a full on original rock opera at its many stops around the nation as it tours year after year in its big red school bus.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/652", "source": "Facebook", "date": "2016-05-07T21:30:00-04:00", "name": "Super Happy Funtime Burlesque 5/7/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/691600014313195/", "description": "Nothing says \"I love you\" like our decadent brunch buffet & bloody mary bar!\n\nMother's Day Brunch Buffet\nSunday, May 8th, 10 am – 2 pm\n\n$28 – Includes non-alcoholic beverage\n$6 Bloody Mary Bar\n\nMake your reservation today by clicking the \"Ticket URL\" above.\n\nMenu Coming Soon =)", "source": "Facebook", "date": "2016-05-08T10:00:00-04:00", "name": "Mother's Day Brunch Buffet"}, {"url": "https://www.facebook.com/events/183943595325432/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-       May 10 - Tike Anderson \nTike Anderson’s songs are genuine testaments to life on the road, life at home, life in the center of the fire and life in the Motor City. He is an accomplished guitar player with a voice that sounds trained but feels honest. Tike’s songwriting blends road worn soul with the roots rock grit of the motor city and a hint of the easy intellectual earth tones of Ann Arbor.\n\n\nNever a cover\nAlways a good time", "source": "Facebook", "date": "2016-05-10T19:00:00-04:00", "name": "Acoustic Tuesdays: Tike Anderson"}, {"url": "https://www.facebook.com/events/606755719498706/", "description": "Literati is thrilled to welcome Emily St. John Mandel, author of Station Eleven, which was chosen as the 2015-16 Great Michigan Read! This event is sponsored by the Michigan Humanities Council and is free and open to the public.\n\nStation Eleven is an audacious, darkly glittering novel about art, fame, and ambition set in the eerie days of civilization's collapse. One snowy night a famous Hollywood actor slumps over and dies onstage during a production of King Lear. Hours later, the world as we know it begins to dissolve. Moving back and forth in time—from the actor's early days as a film star to fifteen years in the future, when a theater troupe known as The Travelling Symphony roams the wasteland of what remains—this suspenseful, elegiac, spellbinding novel charts the strange twists of fate that connect five people: the actor, the man who tried to save him, the actor's first wife, his oldest friend, and a young actress with the Traveling Symphony, caught in the crosshairs of a dangerous self-proclaimed prophet. Sometimes terrifying, sometimes tender, Station Eleven tells a story about the relationships that sustain us, the ephemeral nature of fame, and the beauty of the world as we know it.\n\nEmily St. John Mandel is the author of four novels, most recently Station Eleven, which was a finalist for a National Book Award and the PEN/Faulkner Award, and won the 2015 Arthur C. Clarke Award. A previous novel, The Singer's Gun, was the 2014 winner of the Prix Mystere de la Critique in France. Her short fiction and essays have been anthologized in numerous collections, including Best American Mystery Stories 2013. She is a staff writer for The Millions. She lives in New York City with her husband and daughter.", "source": "Facebook", "date": "2016-05-11T19:00:00-04:00", "name": "Emily St. John Mandel"}, {"url": "https://www.facebook.com/events/222011124804458/", "description": "Wed. May 11 | 9pm | 18+ | $20 Cover\n\nHailing from Oakland, California, Del the Funky Homosapien and his crew, the Hieroglyphics came out as a markedly non-gangster response to a burgeoning West Coast scene. After being put on at the tender age of 17 by his cousin Ice Cube, Del released two records on Elektra, I Wish My Brother George Was Here (1991) and No Need For Alarm (1993). Despite record sales in the hundreds of thousands, he recorded a third album, Future Development, which was never commercially released. Del parted with Elektra and started work on the Hieroglyphics..family album, 3rd Eye Vision (Hiero Imperium, 1998). Hiero went on the road and toured incessantly in support of the album for much of 1998. Del also spent a good portion of his time drawing, practicing Japanese, and playing mass amounts of video games. Finally ready to unleash a new record on the world, Del comes with BOTH SIDES OF THE BRAIN. Seventeen tracks of pure Del. He says of his work on this album: ..\"I've had complete control\". At times, Del has felt restrained by the formulas in hip hop and the expectations fans place upon emcees who have had hits. I wish that I had the same freedom that someone like Bjork has when she puts out an album..Apart from collaborations with PrincePaul, El-P (Company Flow), and help from a few of his Hiero cohorts (A-plus, Casual, Domino) Del handled the majority of production on this album. By staying true to himself, Del has earned legions of adoring fans. He may have said it best in his classic, Mistadobalina when he declared all in the mind and the heart. WSG: Sean Anonymous", "source": "Facebook", "date": "2016-05-11T21:00:00-04:00", "name": "Del The Funky Homosapien wsg DJ Shiftee & Sean Anonymous 5/11/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/446969295510430/", "description": "Our Monthly Beer tasting series explore the expansive world of beer through the lens of different themes. We'll gather brews worth sampling in the theme of the month to bring you a novel and varied experience for your palates. We’ll pair beer samples with an appetizer buffet, provide a program with tasting notes, and top off the night with a door prize drawing.\n\nIn May, we tip our hats to Belgium, Germany, the UK, and other European countries with age-old brewing traditions. These are the beers and the breweries to which we owe our gratitude for being predecessors to the American craft market.\n\nGuests who come attired in a creative costume will get a second raffle ticket for the door prize drawing. We’re celebrating the ancient European spring festival with beers from across the pond.  Give a nod to European style with a beret, German alpine hat, or any other decidedly European item. \n\nABC’s monthly tastings run from 7-9 PM on the 2nd Thursday of each month. Tickets are available at the pub or by phone at 734-213-1393. $25 in advance, $30 day of.", "source": "Facebook", "date": "2016-05-12T19:00:00-04:00", "name": "Beer Tasting: May Day"}, {"url": "https://www.facebook.com/events/253770371623807/", "description": "Join the fun in Downtown Ann Arbor on Friday, May 13th!\n\nSales will be offered throughout the day, but from 5-9pm the retailers roll out the red carpet with special offers, discounts, snacks, goody bags, raffles and more! Participate in our ‘passport’ program during this time and be entered into a drawing to win fabulous prizes!\n\nPick up a Ladies Night Passport at any of the participating retailers listed below, and receive a stamp for each one you visit. Collect 15 stamps, turn in your passport at any of the participating shops, and be entered to WIN!\n\nFor a complete list of participating retailers and their Ladies Night specials, please visit www.mainstreetannarbor.org", "source": "Facebook", "date": "2016-05-13T17:00:00-04:00", "name": "Ladies Night 2016"}, {"url": "https://www.facebook.com/events/1637106023218709/", "description": "Harmony Bones is a quartet of long-time veterans of the Ann Arbor folk music scene. The band consists of Jeanne Mackey, Tom Voiles, Linda Teaman, and Laz Slomovits. The name Harmony Bones comes from an acupuncture point that harmonizes imbalances and promotes clear thinking, seeing, and hearing.\nJeanne, Tom, Linda and Laz have joined forces to explore a wide range of traditional, contemporary and original folk songs. Rich vocal harmonies and an array of instruments -- guitar, mandolin, flute, pennywhistle, fiddle, banjo, percussion, sitar -- combine to make Harmony Bones.\nSinger/songwriter Jeanne Mackey offers a blend of emotional intensity, wry humor, and global consciousness. In addition to original tunes, her repertoire ranges from Dar Williams to Patsy Cline, from Pete Seeger to Irving Berlin. A seasoned guitarist, she draws on a variety of styles -- folk, classic swing, funky blues, and more -- with the occasional sprinkle of mandolin, accordion, or banjo. Mackey rocked the 1970s East Coast topical music circuit as a young musician advocating feminist values and social justice.  In 2010, Mackey created \"Drop The Knife: A Memoir-in-Song,\" an evening of original songs and stories exploring the meaning of homeland, curses, death, and magic.\nLinda Teaman and Tom Voiles do much of their singing and playing with Nutshell, an Ann Arbor-based Celtic roots band. Nutshell plays for contra-dances and performs at festivals across North America.\nLinda is a singer who brings depth of understanding, warmth and sensitivity to the music. In 2005, her graduation recital for a degree in k-12 choral music had her singing in five languages, encompassing musical forms such as Irish sean nos singing and Italian and German arias by composers Purcell, Mozart and Brahms. She leads the Rudolf Steiner Community Singers, a small choir that sings uncommon Christmas and seasonal songs of celebration.  She hopes you'll forgive her classical background and that she is redeemed by her love of folk music.  In addition to vocals, she adds light percussion to the mix.\nTom consumes a well-rounded musical diet that ranges from Celtic to Indian to rock and roll. He enjoys mixing different styles while maintaining a respect for the traditions from which they spring. Tom has studied North Indian Classical music, Moroccan folk drumming and western classical flute. He has worked with performance artists, dancers, mimes and poets, including Hosain Mosavat, Gerry the Fool, Matthew Smith, ML Liebler and the Magic Poetry Band.\nLaz Slomovits is one of the twin brothers in Ann Arbor’s nationally-known children’s music duo, Gemini. A fine singer and multi-instrumentalist, Laz is starting his 4nd year playing music. His songs are featured in songbooks used by music teachers throughout the country, and Gemini's recordings have won numerous awards. In addition, Laz has had a notable solo career. In his solo work, Laz is best known for his powerful musical settings of the poetry of ancient Sufi mystics Rumi and Hafiz, as well as that of contemporary American poets.", "source": "Facebook", "date": "2016-05-13T20:00:00-04:00", "name": "Harmony Bones at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/961752583878622/", "description": "Far House brings you an evening of high energy rock & roll, with a special international touring guest!\n\n\nAn Atomic Whirl (Japan)\nhttp://anatomicwhirl.com/\n\nAn Atomic Whirl mixes chaotic noise, sudden soft melodies and mathy arrangements. They also throw in some doom, jazz, shoegaze and other styles they like. Since 2013, they have toured around Asia and across the US.\n\n\nLocal support by:\n\nSojii (Grand Rapids, MI)\nhttps://sojii.bandcamp.com/\n\nMusical tonic for every dark and ecstatic feeling. Recent import from Brooklyn, NY. \n\n\nRed Robe (Ann Arbor, MI)\nhttps://redrobe.bandcamp.com/\n\nRed Robe is a rock band for the modern age, for the 2000-teens. Birthed in August of 2013, this Ann Arbor area trio coalesced with common influences in Nirvana, Can, Shellac, & The Jesus Lizard. Later, a deep commonality arose in wry humor, record collecting, & true cake-eating sound craft. Psychedelic, crystalline guitars. Buoyant, charred bass. Driving, powerful drums. Bittersweet. Joyous. \n\n\nSuper Thing (Ypsilanti, MI)\nhttps://soundcloud.com/superthing-1\n\nEveryone's favorite post-doom golden boys.\n\n\n$5 suggested donation for our out-of-town friends.\n\nDoors at 9, with music starting at 10.\nSHOW UP ON TIME!\n\nRespect the house and the artists.\nThis is a music event, not a house party.\nEngage and participate.", "source": "Facebook", "date": "2016-05-13T21:00:00-04:00", "name": "An Atomic Whirl (JAPAN) w/ Sojii, Red Robe & Super Thing"}, {"url": "https://www.facebook.com/events/1060164970720196/", "description": "Gina Luttrell is an Associate Professor of Public Relations and Social Media at Eastern Michigan University with over 15 years of experience in the communications field. Her extensive background includes strategic development and implementation of public relations and social media, advertising, marketing, crisis and corporate communications.\n\nWe’ve all heard that Millennials are smarter than everyone else, unique in every way possible, that they have probably been millionaires since age seven, and that they are poised to take over the world. We’ve also heard that they are lazy, unmotivated, entitled, and condescending know-it-alls. How can this generation have such opposing characteristics? What is the truth about this generation?\n\nSocial Media: How to Engage, Share, and Connect is a step-by-step resource to better understand, create, and develop sound social media strategies. Written in a relaxed and pragmatic tone this book concentrates on both the operational and practical aspects of this ever evolving subject. Rich with concrete advice and examples from some of the most preeminent authorities in the fields of social media, public relations, and marketing this book has something for everyone.", "source": "Facebook", "date": "2016-05-14T15:00:00-04:00", "name": "Meet EMU Associate Professor & Author Gina Luttrell for a Discussion & Signing of 'The Millennial Mindset: Unraveling Fact From Fiction'"}, {"url": "https://www.facebook.com/events/1010505729023566/", "description": "A UMS Gala unlike any other.\n\nIt’s a celebration of our community featuring exceptional food, ample spirits, extraordinary company, an incredible atmosphere… and all for a sensational cause: education and the arts. We would love to see you there!\n\nJoin us, and honorary chairs Jim and Sarah Harbaugh and gala chairs Sarah and Dan Nicoli.\n\nFor more information, please contact us at 734-764-8489.\n\nWe are thrilled to be working with our partners at the Ford Motor Company Fund on this brand new event. We can’t wait to show you what’s in store.\n\nMore at: http://ums.org/performance/ovation-spring-gala/", "source": "Facebook", "date": "2016-05-14T18:30:00-04:00", "name": "Ovation Spring Gala"}, {"url": "https://www.facebook.com/events/1527151127591491/", "description": "Sat. May 14 | 9pm | 18+ | $8 adv./ $10 day of\n\nOlivia Mainville & The Aquatic Troupe with: Sedgewick Jason Dennie & Nadim Azzam\n\n     Of her own volition, Grand Rapids-based singer-songwriter and multi-instrumentalist Olivia Mainville dove headfirst into the world of music as early as the fifth grade, when she had begun playing viola and upright bass in orchestra class. Following her first Wheatland Festival in 2012, Mainville fell in love with the idea of performing her own songs on stage, which eventually inspired her 2014 gypsy swing and baroque pop debut EP, Full Steam Ahead.\n\n        Since the release of her first solo output, Olivia has forged a unique path within the Mitten scene, becoming known alongside her band, the Aquatic Troupe, for their energized, dynamic performances and their gargantuan musical talent. Olivia Mainville & the Aquatic Troupe’s debut album, Maybe the Saddest Thing, releases on December 10th, 2015. Comprised of consummate young talents Mainville, Andy Fettig, Bleu Quick, Libby DeCamp, and Ian Burke— and with a special guest appearance by none other than David Bowie’s bandleader and lead guitarist, Gerry Leonard —their multifarious, enthusiastic delivery is sure to be a hit with listeners everywhere.\n\n        Throughout her career as a professional performing musician thus far, Olivia has toured with notable folk band Caravan of Thieves, and has collaborated with stellar Michigan artists like the Ragbirds, the Appleseed Collective, the Accidentals, and Jack and the Bear. She’s also made appearances at significant festivals and venues throughout the Mitten, such as Blissfest in Harbor Springs, the Majestic in Detroit, and the Ark in Ann Arbor. Between Olivia and her band mates, the Aquatic Troupe is capable of playing 11 instruments, ranging from guitar and violin to the trumpet, accordion, and omnichord – all of which encompass their collective sound.\n\n “I really love that we’re growing as a band,” says Olivia. “We are always exploring new styles and inviting other musicians into our live shows to lend their talents and expand our sound. That’s the most exciting thing. We're not getting stale; we're getting better all the time.\"", "source": "Facebook", "date": "2016-05-14T21:00:00-04:00", "name": "Olivia Mainvill and the Aquatic Troupe 5/14/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-05-16T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/1530634843907556/", "description": "John Hart is the author of the upcoming REDEMPTION ROAD, and of four New York Times bestsellers, THE KING OF LIES, DOWN RIVER, THE LAST CHILD and IRON HOUSE. The only author in history to win the best novel Edgar Award for consecutive novels, John has also won the Barry Award, the Southern Independent Bookseller's Award for Fiction, the Ian Fleming Steel Dagger Award and the North Carolina Award for Literature. His novels have been translated into thirty languages and can be found in over seventy countries. A former defense attorney and stockbroker, John spends his time in North Carolina and Virginia, where he writes full-time.\n\nImagine:\nA boy with a gun waits for the man who killed his mother.\nA troubled detective confronts her past in the aftermath of a brutal shooting.\nAfter thirteen years in prison, a good cop walks free as deep in the forest, on the altar of an abandoned church, a body cools in pale linen…\nThis is a town on the brink.\nThis is Redemption Road.\nBrimming with tension, secrets, and betrayal, Redemption Road proves again that John Hart is a master of the literary thriller.", "source": "Facebook", "date": "2016-05-18T19:00:00-04:00", "name": "Meet NYT Bestselling Author John Hart for a Discussion & Signing of His New Novel, 'Redemption Road'"}, {"url": "https://www.facebook.com/events/1591757697781501/", "description": "In memory of Arbor Opera Theater’s first artistic director, we are pleased to announce the creation of the JAMES K. BERG AWARD for outstanding contributions to the vocal arts. Our 2016 recipients, Grammy and Pulitzer Prize winning composer William Bolcom and mezzo soprano Joan Morris, will receive their award at a black-tie dinner featuring a staged tribute of the works associated with Bolcom and Morris.\n\nYour attendance and contributions will directly support AOT’s mission by funding our June Festival and a national tour of our ground-breaking adaptation of Verdi’s La Traviata, created with the National Network of Depression Centers to fight the stigma surrounding mental illness. AOT is a 501(c)3 non-profit organization and all contributions are tax deductible as allowed by", "source": "Facebook", "date": "2016-05-20T19:00:00-04:00", "name": "James K. Berg Award Gala honoring William Bolcom & Joan Morris"}, {"url": "https://www.facebook.com/events/148870615480384/", "description": "Grammy winner Pat Donahue is one of the most popular finger pickers in the world. His musical tastes are eclectic. Though he considers himself foremost a folk guitarist, Pat’s influences are rooted in bluesmen Blind Blake, Robert Johnson, Duke Ellington, Muddy Waters and Miles Davis.\nHaving been a songwriter and guitarist for twenty years for the “Guys All Star Shoe Band” of Minnesota Public Radio’s “A Prairie Home Companion,” Pat got to show off his savvy licks and distinctive original songs to millions of listeners each week. After wrapping up this impressive longterm gig, Pat now turns to full time concert touring, presenting master guitar workshops and attending prestigious music camps. www.patdonahue.com", "source": "Facebook", "date": "2016-05-20T20:00:00-04:00", "name": "Pat Donohue at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/1572133599768114/", "description": "Join us in the Pendleton Room at the Union when Out Loud explores the process of discovering oneself. Selections include Natasha Bedingfield’s Unwritten, Defying Gravity, a medley from the smash Broadway musical, “Kinky Boots”, I've Gotta Be Me, Reflection from Mulan, and Christina Aguilera’s Beautiful. Director Paul Haebig leads the chorus with Annie Jeng on piano, Tamara Perkuhn on percussion and Edie Herrold on bass. \n\nPrice: \n—$15 advance/$18 at door, \n—$12 for seniors (65+) and students\n—Free for children under 4\n\nTickets available online http://olconline.org/ or at Common Language Bookstore.\n\nOut Loud is sponsored in part by the Michigan Council for Arts and Cultural Affairs, the National Endowment for the Arts and U-M’s Spectrum Center.  \n—http://www.michiganbusiness.org/community/council-arts-cultural-affairs/#MCACA\n—https://www.arts.gov/  \n—https://spectrumcenter.umich.edu/", "source": "Facebook", "date": "2016-05-21T20:00:00-04:00", "name": "Destination: Me - The Journey of Transformation - SATURDAY NIGHT"}, {"url": "https://www.facebook.com/events/193194074399065/", "description": "Strayaway Child Concert Series proudly presents legendary uilleann piper Paddy Keenan in concert!\n\n<>Show at 5:30pm <> Doors open 5:00pm<>\n\n<>Admission<>\nGeneral: $18  \nStudents: $16\nKids under 10: free\n\nGenerally acknowledged as the most accomplished uilleann piper performing today and a living legend, Paddy is one of the most brilliant musicians of his generation. Born in Trim, Co. Meath, to John Keenan, Sr. of Westmeath and the former Mary Bravender of Co. Cavan. The Keenans were a Travelling family steeped in traditional music; both Paddy's father and grandfather were uilleann pipers. Paddy himself took up the pipes at the age of ten, playing his first major concert at the Gaiety Theatre, Dublin, when he was 14. He later played with the rest of his family in a group called The Pavees. At 17, having fallen in love with the blues, Paddy left Ireland for England and Europe, where he played blues and rock. Returning to Ireland after a few years, he began playing around Dublin with singer/keyboardist Triona Ni Dhomhnaill and singer/guitarist Micheal O Dhomhnaill. Fiddler Paddy Glackin joined the three, then flute player Matt Molloy, accordionist Tony MacMahon, and guitarist Donal Lunny. Thus was born one of the most influential bands of the 1970s, The Bothy Band. Paddy was one of the band's founding members, and his virtuosity on the pipes combined with the ferocity of his playing made him, in the opinion of many, its driving force. Bothy Band-mate Donal Lunny once described Paddy as \"the Jimi Hendrix of the pipes\".\n\nSince the breakup of The Bothy Band in 1979, Paddy has toured as a soloist, bringing the finest example of traditional Irish music and uilleann piping to audiences around the globe, performing in Japan, Malaysia, Mali, Australia, across Europe, Russia, and of course America.\n\nVisit Paddy on the web here: http://www.paddykeenan.com/", "source": "Facebook", "date": "2016-05-22T17:30:00-04:00", "name": "Paddy Keenan- In Concert"}, {"url": "https://www.facebook.com/events/1725259194424597/", "description": "Our very own Kristin Jonna is going head to head with a mystery guest sommelier for a Somm Slam. Kristin and our guest sommelier will each pair a wine with a food course and attendees will vote for which wine and food pairing they prefer. Attendees will enjoy three food dishes, each paired with two different wines. Who'll win the Somm Slam?!?! \n\nSomm Slam costs $75 and includes tax and gratuity.", "source": "Facebook", "date": "2016-05-24T19:00:00-04:00", "name": "Somm Slam"}, {"url": "https://www.facebook.com/events/1176167649079840/", "description": "Our May Artists' Meet & Greet topic is \nHow to Submit Your Artwork to a Show or Gallery. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "source": "Facebook", "date": "2016-05-25T18:00:00-04:00", "name": "How to Submit Your Artwork to a Show or Gallery"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-05-26T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-06-06T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/589398997896295/", "description": "Are you ready for the best part of summer in Ann Arbor? Starting on June 10th, Ann Arbor transforms into a lively arts destination, a place where friends, family, neighbors and visitors can connect and share in a celebration of artistic inspiration, creativity and community spirit.\n\nCheck out the full list of events below or download the #A2SF2016 free Mobile App here: http://a2sf.org/mobile-app/\nVisit www.a2sf.org to view full season calendar.\n\n𝗦𝗮𝘁𝘂𝗿𝗱𝗮𝘆, 𝗝𝘂𝗻𝗲 𝟭1\nFlip FabriQue’s Catch Me! (Attrape-Moi)\nJune 11 at 8 PM - Power Center\nhttp://a2sf.org/events/flip-fabrique-1/\n\n𝗦𝘂𝗻𝗱𝗮𝘆, 𝗝𝘂𝗻𝗲 𝟭𝟮\nFlip FabriQue’s Catch Me! (Attrape-Moi)\nJune 12 at 3 PM - Power Center\nhttp://a2sf.org/events/flip-fabrique-2/\n\n𝗪𝗲𝗱𝗻𝗲𝘀𝗱𝗮𝘆, 𝗝𝘂𝗻𝗲 𝟭𝟱\nGregory Alan Isakov and The Ghost Orchestra\nJune 15 at 8 PM - Power Center\nhttp://a2sf.org/events/gregory-alan-isakov-and-the-ghost-orchestra/\n\n𝗦𝗮𝘁𝘂𝗿𝗱𝗮𝘆, 𝗝𝘂𝗻𝗲 𝟭𝟴\nBebel Gilberto\nJune 18 at 8 PM - Power Center\nhttp://a2sf.org/events/bebel-gilberto/\n\n𝗧𝘂𝗲𝘀𝗱𝗮𝘆, 𝗝𝘂𝗻𝗲 𝟮𝟭 \nMichael Franti and Spearhead\nJune 21 at 8 PM - Hill Auditorium\nhttp://a2sf.org/events/michael-franti-spearhead/\n\n𝗪𝗲𝗱𝗻𝗲𝘀𝗱𝗮𝘆, 𝗝𝘂𝗻𝗲 𝟮𝟮\nGregory Porter\nJune 22 at 8 PM - Power Center\nhttp://a2sf.org/events/gregory-porter/\n\n𝗦𝘂𝗻𝗱𝗮𝘆, 𝗝𝘂𝗻𝗲 𝟮𝟲\n¡Cubanismo!\nJune 26 at 7:30 PM - Power Center\nhttp://a2sf.org/events/cubanismo/\n\n𝗪𝗲𝗱𝗻𝗲𝘀𝗱𝗮𝘆, 𝗝𝘂𝗻𝗲 𝟮𝟵\nSee Jane Sing! (with Jane Lynch)\nJune 29 at 8 PM - Power Center\nhttp://a2sf.org/events/see-jane-sing-with-jane-lynch/\n\n𝗧𝗵𝘂𝗿𝘀𝗱𝗮𝘆, 𝗝𝘂𝗻𝗲 𝟯𝟬\nBruce Hornsby and The Noisemakers\nJune 30 at 8 PM - Power Center\nhttp://a2sf.org/events/bruce-hornsby-and-the-noisemakers/\n\n𝗙𝗿𝗶𝗱𝗮𝘆, 𝗝𝘂𝗹𝘆 𝟭\nMayer Hawthorne\nJuly 1 at 8 PM - Power Center\nhttp://a2sf.org/events/mayer-hawthorne/\n\nMonday, 𝗝𝘂𝗹𝘆 𝟰\nThe Capitol Steps\nJuly 4 at 4 PM - Power Center\nhttp://a2sf.org/events/the-capitol-steps-1/\n\nMonday, 𝗝𝘂𝗹𝘆 𝟰\nThe Capitol Steps\nJuly 4 at 7 PM - Power Center\nhttp://a2sf.org/events/the-capitol-steps-2/\n\n𝗪𝗲𝗱𝗻𝗲𝘀𝗱𝗮𝘆, August 𝟮𝟰\nOne-Man Circus (L’homme Cirque)\nAugust 24 at 6:30 PM - Burns Park\nhttp://a2sf.org/events/one-man-circus-lhomme-cirque-1/\n\n𝗧𝗵𝘂𝗿𝘀𝗱𝗮𝘆, August 𝟮𝟱\nOne-Man Circus (L’homme Cirque)\nAugust 25 at 6:30 PM - Burns Park\nhttp://a2sf.org/events/one-man-circus-lhomme-cirque-2/\n\n𝗙𝗿𝗶𝗱𝗮𝘆, August 𝟮𝟲\nOne-Man Circus (L’homme Cirque)\nAugust 26 at 6:30 PM - Burns Park\nhttp://a2sf.org/events/one-man-circus-lhomme-cirque-3/\n\n𝗦𝗮𝘁𝘂𝗿𝗱𝗮𝘆, August 𝟮𝟳\nOne-Man Circus (L’homme Cirque)\nAugust 27 at 6:30 PM - Burns Park\nhttp://a2sf.org/events/one-man-circus-lhomme-cirque-4/\n\n𝗦𝘂𝗻𝗱𝗮𝘆, August 𝟮𝟴\nOne-Man Circus (L’homme Cirque)\nAugust 28 at 6:30 PM - Burns Park\nhttp://a2sf.org/events/one-man-circus-lhomme-cirque-5/", "source": "Facebook", "date": "2016-06-10T17:00:00-04:00", "name": "2016 Ann Arbor Summer Festival - Mainstage Series"}, {"url": "https://www.facebook.com/events/1726113604330595/", "description": "Twirling twelve hoops, dancing with diabolos, and soaring through the air—all in a day’s play for Flip FabriQue, the new face of Quebec circus. High flying, fearless, and fun, these young artist-athletes astound audiences with adrenaline pumping feats of cutting edge nouveau cirque, dazzling in a crowd-pleasing spectacle of extreme acrobatics, dramatic turns on trampoline wall, and inventive parkour. This is a virtuoso display of athleticism and showmanship for the whole family.\n\nSponsored by: Retirement Income Solutions\n\nWatch video: https://youtu.be/k0KtN2Pzxto", "source": "Facebook", "date": "2016-06-11T20:00:00-04:00", "name": "Flip FabriQue’s Catch Me! (Attrape-Moi)"}, {"url": "https://www.facebook.com/events/2043526245873487/", "description": "Twirling twelve hoops, dancing with diabolos, and soaring through the air—all in a day’s play for Flip FabriQue Flip FabriQue, the new face of Quebec circus. High flying, fearless, and fun, these young artist-athletes astound audiences with adrenaline pumping feats of cutting edge nouveau cirque, dazzling in a crowd-pleasing spectacle of extreme acrobatics, dramatic turns on trampoline wall, and inventive parkour. This is a virtuoso display of athleticism and showmanship for the whole family.\n½ price Kids tickets available.\n\nSponsored by: Retirement Income Solutions\n\nWatch video: https://youtu.be/k0KtN2Pzxto", "source": "Facebook", "date": "2016-06-12T15:00:00-04:00", "name": "Flip FabriQue’s Catch Me! (Attrape-Moi)"}, {"url": "https://www.facebook.com/events/1760501830846645/", "description": "America’s greatest folk singers have a new addition. Plaintive and poetic, Gregory Alan Isakov crafts stunning, sepia-toned compositions that tell a story of miles and landscapes, captivating and haunting his listeners. With nods to Leonard Cohen and Andrew Bird, his lush arrangements lend themselves to a fuller sound, and he will be accompanied by his band, as well as a mini-symphonic ensemble. In a tour that includes headlining Red Rocks and The Kennedy Center, this is a rare opportunity to see a unique performance with one of indie folk’s most admired new singer/songwriters.\n\nMedia Partner: Ann Arbor's 107.1\n\nWatch video: https://youtu.be/lz2qpnRB5_E", "source": "Facebook", "date": "2016-06-15T20:00:00-04:00", "name": "Gregory Alan Isakov and The Ghost Orchestra"}, {"url": "https://www.facebook.com/events/1160727033945985/", "description": "In August 2011, The Ann Arbor City Council passed a Resolution in Support of the Allen Creek Greenway (R-11-325). Shortly thereafter, staff developed a draft scope of work for a \"master plan approach\" for the Allen Creek Greenway which includes the following study areas:\n\nAllen Creek Greenway: Argo Cascades to South State Street, primarily along Ann Arbor Railroad corridor (owned by WATCO).\n\nFirst and William: a City owned parcel located on the northeast corner of the intersection. \n\n415 West Washington Street: a City owned, 2.52-acre site located on the south side of West Washington Street between --\n\nFirst and Third Streets, within the Downtown Development Authority District and Old West Side Historic District.\n\nNorth Main Corridor:\n-721 North Main Street: a City owned, 5.10-acre site located on the west side of North Main Street between Felch Street and West Summit Street.\n-N. Main Street and adjacent parks and amenities between M-14 and Summit Street\n-N. Main and Depot Street Intersection.  \n \nOn May 18, 2015, City Council passed a resolution to adopt the FY2016 budget which includes $200,000 for consulting services for development of a master plan for the Allen Creek Greenway. The Allen Creek Greenway Master Plan process will explore improvement options that balance the needs and desires of a variety of users and considers the significant resources within the study area.  To develop this plan, City of Ann Arbor staff recommended a planning process to engage stakeholders, community leaders and residents in shaping the scope, content and direction of the master plan.  The Team Organization chart shows the various groups that will be involved in the process, including a Project Management Team, Technical Advisory Committee, Citizen Advisory Committee, and Stakeholders/Community at Large.", "source": "Facebook", "date": "2016-06-16T18:30:00-04:00", "name": "Allen Creek Greenway project Community Meeting"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-06-18T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/193970150988874/", "description": "Brazil’s beloved Bebel Gilberto arrives at the traditions of bossa nova and samba and innovates on them, weaving sultry pop and soft electronica influences into her sophisticated sound. Born into Brazil’s most famous musical family—her father is João Gilberto, mother Miúcha, stepmother Astrud Gilberto, and uncle Chico Buarque—she’s been at the forefront of Bossa 2.0, working with superstar producers like Mario Caldato, Jr. and Mark Ronson. Elegant and ethereal, her music will make you feel like you’re sipping caipirinhas on a yacht overlooking Ipanema at sunset.\n\nSponsored by: U.S. Wine Imports\n\nWatch video: https://youtu.be/4rlzdn9xk6c", "source": "Facebook", "date": "2016-06-18T20:00:00-04:00", "name": "Bebel Gilberto"}, {"url": "https://www.facebook.com/events/573249992825775/", "description": "Monday, June 20 | 9pm | 18+ | $15 adv./ $20 day of\n\nCritically acclaimed singer-songwriter James McCartney has remained fiercely dedicated to his musical vision of melding smart hooks and feral alt-rock with the grandeur and spiritually centeredness of psychedelic music. Now, he issues the sharpest entry of his vision, the majestic The Blackberry Train engineered by Steve Albini (Nirvana, The Pixies and PJ Harvey).\n\n“It’s all been an evolution,” James says. “This set of songs definitely has a harder edge, but it’s a continuation of the last album. The main thing for me is to not conform or compromise.”\n\nJames’ panoramic artistry is inspired by such diverse musicians as Kurt Cobain, The Smiths, Radiohead, PJ Harvey, The Cure, The Beatles, Neil Young, Jimi Hendrix, and Hank Williams. His fingerprint aesthetic has earned him plaudits from Rolling Stone, The Boston Globe, The New York Times, and The Daily News. He’s earned a strong following the old fashioned way, through tirelessly touring the US, Europe and the UK, and playing bigger and bigger shows with each go around.\n\nThe Blackberry Train is an epiphanic co-mingling of aesthetics. James sought out the distinct audio stylings of Steve Albini to conjure a grungier sensibility. He welcomed the engineer’s gifts for capturing music with a raw clarity, and Steve Albini’s reputation for not impinging on an artist’s vision. The results make for an eclectic album with fastidiously crafted songs documented in the studio with glorious purity.\n\n“I like the music to have elements of the avant garde, psychedelic, and be just a little against the grain,” James reveals. “But in the end, it’s about having as much emotion as possible for me, musically and lyrically. It’s all about the music being cathartic, heartfelt and true.”\n\nThe Blackberry Train manages to be both diverse and cohesive. The album opens invigoratingly with the jangling rocker, “Too Hard” and closes with the stately and aptly named folk song “Peace and Stillness.” Between these bookends, highlights include the rough-edged and urgently melodic “Unicorn,” the anthemic “Peyote Coyote,” and the soulful ballad “Prayer.” One very personal song is the winsome and reflective “Waterfall” which was inspired by memories of his mother.\n\nThis summer and fall James will embark on extensive tour dates in the U.S. Thinking ahead, James says: “I just want to keep on going, keep working, and improving as a songwriter. I’d love to feel that I realized my full potential both as a person, and as a songwriter. That feels like a great, fulfilling goal to shoot for. Making a lot of music, and striving for more depth artistically–those are my goals.”", "source": "Facebook", "date": "2016-06-20T21:00:00-04:00", "name": "James McCartney 6/20/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/842589652537183/", "description": "Capturing an irresistibly bright and uplifting sound, musical pioneer and humanitarian Michael Franti and Spearhead's globally conscious reggae pop anthems are spreading some much appreciated positivity worldwide. A Bay Area native, he’s long been known for his lyrical activism and powerful performances spanning hip hop, reggae, rock, and spoken word. Inspired by his calling to create positive change, he asks us to celebrate life, dance joyfully, and raise consciousness. This is a very rare area appearance by one of America’s most exciting artists.\n\nThis performance is generously underwritten by Emily and Rich Belanger.\nMedia Partner: Ann Arbor's 107.1\n\nWatch video: https://youtu.be/gowi31zGyQA", "source": "Facebook", "date": "2016-06-21T20:00:00-04:00", "name": "Michael Franti & Spearhead SOULROCKER TOUR with Chali 2na & The Funk Hunters"}, {"url": "https://www.facebook.com/events/1084276308260767/", "description": "Warm, soulful baritone and Grammy-winning jazz vocalist Gregory Porter's beautifully spiritual voice thrills audiences as he explores the rhythmic phrasings of jazz, the passion of R&B, the soul of gospel, and the immediacy of the blues. Charismatic, uplifting, and assured, this is modern jazz’s biggest star, and for good reason. He makes his festival debut on the heels on his new Blue Note release, Take Me To The Alley.\n\nSponsored by: Ulitho\nMedia Partner: WEMU 89.1\n\nWatch video: https://youtu.be/Fv4iZDkjzj8", "source": "Facebook", "date": "2016-06-22T20:00:00-04:00", "name": "Gregory Porter"}, {"url": "https://www.facebook.com/events/863019597153578/", "description": "For twenty incredible years, world-famous Sierra Madre trumpeter and bandleader Jesús Alemañy and his orchestra Cubanismo (banda) have been Cuba’s musical ambassadors, sharing their authentic yet innovative, danceable, and joyous sounds with the world. Fiery and passionate, they specialize in sizzling dance tunes full of swaggering horn charts and skillful polyrhythms that recall vintage big band son, traditional rumba, cha-cha, danzón, and pa’ca ritmo. These Grammy-nominated all-stars enjoy experimenting with world fusion, yet always embrace island authenticity.\n\nThis program is generously underwritten by Wendy and Ted Lawrence.\nSponsored by: Toyota\nMedia Partner: WEMU 89.1\n\nWatch video: https://youtu.be/aC1OVsJ8u2g", "source": "Facebook", "date": "2016-06-26T19:00:00-04:00", "name": "¡Cubanismo!"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-06-27T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-06-28T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/527954430710284/", "description": "Our June Artists' Meet & Greet topic is Tips on applying for grants. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "source": "Facebook", "date": "2016-06-29T18:00:00-04:00", "name": "Tips on applying for grants"}, {"url": "https://www.facebook.com/events/1354661801217687/", "description": "You’ve loved her as Sue Sylvester singing like Madonna on Glee. You still laugh at the thought of her in Best in Show prancing around with her poodle, Rhapsody in White. Now, Emmy and Golden Globe winner Jane Lynch combines her talents in an uproarious night of live musical comedy. Joining her onstage will be Glee musical arranger Tim Davis and the fiery redhead Kate Flannery of The Office. You’ll be in stitches with her American Songbook, which includes selections from The Brady Bunch, Fiddler on the Roof, and Nicki Minaj.\n\nThis show is suggested for mature audiences.\n\nWatch video: https://youtu.be/2kACpUmi3WQ", "source": "Facebook", "date": "2016-06-29T20:00:00-04:00", "name": "See Jane Sing! (with Jane Lynch)"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-06-30T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/1736299249983157/", "description": "Bruce Hornsby's work displays a creative iconoclasm that’s been a constant in the artist’s two-and-a-half decade recording career. His commercial stock soared early on, when “The Way It Is” became one of the most popular songs on American radio. Despite his early mainstream successes, Hornsby has pursued a more idiosyncratic musical path, focusing on projects that sparked his creative interest, including collaborations with the Grateful Dead, Spike Lee, and Ricky Skaggs. Hornsby’s performance will offer a glimpse of a restless spirit who continues to push forward into new musical terrain.\n\nMedia Partner: Ann Arbor's 107.1\n\nWatch video: https://youtu.be/5EVWxOMI6q4", "source": "Facebook", "date": "2016-06-30T20:00:00-04:00", "name": "Bruce Hornsby & The Noisemakers"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-07-01T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/1689609494622767/", "description": "Singer Mayer Hawthorne has an incredible ear for what makes music soulful. “Flashy but classy” and always stylish in a fine suit, he’s a sensation onstage. A hometown hero, he soaked up Curtis Mayfield, Barry White, Shuggie Otis, Hall and Oates, and hip hop producer J Dilla spinning DJ sets at The Firefly and The Blind Pig. Now this deeply talented, multi-instrumentalist, singer, and producer has moved to LA, sold millions of albums, helped Pharrell win a Grammy for best producer, and become neo-soul royalty. His album out this spring is Man About Town.\n\nSponsored by: Bank of Ann Arbor\nMedia Partner: Ann Arbor's 107.1\n\nWatch video: https://youtu.be/RWkjcq_N2YQ", "source": "Facebook", "date": "2016-07-01T20:00:00-04:00", "name": "Mayer Hawthorne"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-07-03T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/775412122559752/", "description": "Perfectly timed for an election year, America’s foremost political satirists, The Capitol Steps, make their annual Fourth of July appearance at the festival! These former Congressional staffers “mock the vote,” poking fun at both sides of the aisle with up-to-the-minute song parodies like “Deleter of the Facts” and “All About the Base.” If you are sick of hearing about the candidates, Bill Cosby, and Brian Williams, you’ve come to the wrong place.\n\nMedia Partner: WEMU 89.1\n\nWatch video: https://youtu.be/jtT41UzBhuM", "source": "Facebook", "date": "2016-07-04T16:00:00-04:00", "name": "The Capitol Steps"}, {"url": "https://www.facebook.com/events/539821406190592/", "description": "Perfectly timed for an election year, America’s foremost political satirists, The Capitol Steps, make their annual Fourth of July appearance at the festival! These former Congressional staffers “mock the vote,” poking fun at both sides of the aisle with up-to-the-minute song parodies like “Deleter of the Facts” and “All About the Base.” If you are sick of hearing about the candidates, Bill Cosby, and Brian Williams, you’ve come to the wrong place.\n\nMedia Partner: Michigan Radio 91.7\n\nWatch video: https://youtu.be/jtT41UzBhuM", "source": "Facebook", "date": "2016-07-04T19:00:00-04:00", "name": "The Capitol Steps"}, {"url": "https://www.facebook.com/events/836609109798914/", "description": "\"A young Paul Simon wrapped in a Tom Waits heart\"—Zvents", "source": "Facebook", "date": "2016-07-06T20:00:00-04:00", "name": "Matt the Electrician"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-07-07T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/1124052387614735/", "description": "Newfound Road's amazing lead vocalist steps out with music by Jackson Browne and more. This show has been rescheduled from June 16.", "source": "Facebook", "date": "2016-07-10T19:30:00-04:00", "name": "Tim Shelton"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-07-12T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/1534323640207083/", "description": "Elizabeth George’s first novel, 'A Great Deliverance', was honored with the Anthony and Agatha Best First Novel Awards and received the Grand Prix de Littérature Policière. Her third novel, 'Well-Schooled in Murder', was awarded the prestigious German prize for suspense fiction, the MIMI. 'A Suitable Vengeance', 'For the Sake of Elena', 'Missing Joseph', 'Playing for the Ashes', 'In the Presence of the Enemy', 'Deception on His Mind', 'In Pursuit of the Proper Sinner', 'A Traitor to Memory', and 'I, Richard' were international bestsellers. Elizabeth George divides her time between Huntington Beach, California, and London. Her novels are currently being dramatized by the BBC.\n\nThe unspoken secrets and buried lies of one family rise to the surface in Elizabeth George’s newest novel of crime, passion, and tragic history. As Inspector Thomas Lynley investigates the London angle of an ever more darkly disturbing case, his partner, Barbara Havers, is looking behind the peaceful façade of country life to discover a twisted world of desire and deceit.\n \nThe suicide of William Goldacre is devastating to those left behind who will have to deal with its unintended consequences—could there be a link between the young man’s leap from a Dorset cliff and a horrific poisoning in Cambridge?\n \nAfter various issues with her department, Barbara Havers is desperate to redeem herself. So when a past encounter gives her a connection to the unsolved Cambridge murder, Barbara begs Thomas Lynley to let her pursue the crime, knowing one mistake could mean the end of her career.\n \nFull of shocks, intensity, and suspense from the first page to the last, A Banquet of Consequences reveals both Lynley and Havers under mounting pressure to solve a case both complicated and deeply disturbing.", "source": "Facebook", "date": "2016-07-14T19:00:00-04:00", "name": "Meet NYT Bestselling Author Elizabeth George for a Discussion & Signing of 'a banquet of consequences' a Lynley Novel"}, {"url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "date": "2016-07-15T12:00:00-04:00", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/499152853624872/", "description": "New music form May and friends, feat. Phil Barry, Max Lockwood, Laurel Premo, & Michael Shimmin. Thunderbolt & Lightfoot open.", "source": "Facebook", "date": "2016-07-15T20:00:00-04:00", "name": "May Erlewine—EP Release Concert"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-07-18T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/994376950635153/", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "source": "Facebook", "date": "2016-07-21T10:00:00-04:00", "name": "The 2016 Ann Arbor Art Fair"}, {"url": "https://www.facebook.com/events/487403974717996/", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "source": "Facebook", "date": "2016-07-21T10:00:00-04:00", "name": "State Street Art Fair"}, {"url": "https://www.facebook.com/events/994376950635153/", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "source": "Facebook", "date": "2016-07-22T10:00:00-04:00", "name": "The 2016 Ann Arbor Art Fair"}, {"url": "https://www.facebook.com/events/487403974717996/", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "source": "Facebook", "date": "2016-07-22T10:00:00-04:00", "name": "State Street Art Fair"}, {"url": "https://www.facebook.com/events/994376950635153/", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "source": "Facebook", "date": "2016-07-24T10:00:00-04:00", "name": "The 2016 Ann Arbor Art Fair"}, {"url": "https://www.facebook.com/events/487403974717996/", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "source": "Facebook", "date": "2016-07-24T10:00:00-04:00", "name": "State Street Art Fair"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-07-25T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/994376950635153/", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "source": "Facebook", "date": "2016-07-27T10:00:00-04:00", "name": "The 2016 Ann Arbor Art Fair"}, {"url": "https://www.facebook.com/events/487403974717996/", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "source": "Facebook", "date": "2016-07-27T10:00:00-04:00", "name": "State Street Art Fair"}, {"url": "https://www.facebook.com/events/1570961503220935/", "description": "A retro-tinged jazz sound with contemporary honesty", "source": "Facebook", "date": "2016-07-27T20:00:00-04:00", "name": "Leftover Cuties"}, {"url": "https://www.facebook.com/events/1262918310390270/", "description": "The Old Tin Can tour!", "source": "Facebook", "date": "2016-07-28T20:00:00-04:00", "name": "Scythian"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-08-02T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/1694055327520106/", "description": "The king of romantic country, up close and personal", "source": "Facebook", "date": "2016-08-06T20:00:00-04:00", "name": "John Berry"}, {"url": "https://www.facebook.com/events/511007702434691/", "description": "Celtic and Americana storytelling songs from Kansas City", "source": "Facebook", "date": "2016-08-09T20:00:00-04:00", "name": "The Elders"}, {"url": "https://www.facebook.com/events/976545022426759/", "description": "Jefferson Airplane's blues-roots offshoot, sounding better than ever", "source": "Facebook", "date": "2016-08-10T20:00:00-04:00", "name": "Hot Tuna Acoustic"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-08-11T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/933146056799237/", "description": "Not a band but a Celtic event!", "source": "Facebook", "date": "2016-08-11T20:00:00-04:00", "name": "The Tartan Terrors"}, {"url": "https://www.facebook.com/events/1680680362219416/", "description": "Nashville rock 'n' roll with Motor City soul", "source": "Facebook", "date": "2016-08-12T20:00:00-04:00", "name": "Captain Ivory"}, {"url": "https://www.facebook.com/events/850613031732051/", "description": "Highly eclectic Latin sounds from Michigan", "source": "Facebook", "date": "2016-08-14T19:30:00-04:00", "name": "The Lunar Octet and The Lunar Glee Club"}, {"url": "https://www.facebook.com/events/1120634974616420/", "description": "\"Scotland's greatest living songwriter\"—Celtic World", "source": "Facebook", "date": "2016-08-19T20:00:00-04:00", "name": "Dougie MacLean"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-08-21T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/1060068290701625/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by New York Times, this world famous high wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with grand flourish, be awestuck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets must be purchased in advance, circus tent is air conditioned, wheelchair accessible and capacity is limited.\n\nPresented in part with support from: The National Empowerment of the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nWatch video: https://youtu.be/TB0Oyl1gSNk", "source": "Facebook", "date": "2016-08-24T18:30:00-04:00", "name": "One-Man Circus (L’homme Cirque)"}, {"url": "https://www.facebook.com/events/241378229531717/", "description": "Southeast Michigan's beloved songstress", "source": "Facebook", "date": "2016-08-24T20:00:00-04:00", "name": "Katie Geddes"}, {"url": "https://www.facebook.com/events/217304028639529/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by New York Times, this world famous high wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with grand flourish, be awestuck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets must be purchased in advance, circus tent is air conditioned, wheelchair accessible and capacity is limited.\n\nPresented in part with support from: The National Empowerment of the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nWatch video: https://youtu.be/TB0Oyl1gSNk", "source": "Facebook", "date": "2016-08-25T18:30:00-04:00", "name": "One-Man Circus (L’homme Cirque)"}, {"url": "https://www.facebook.com/events/1705218533059185/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by New York Times, this world famous high wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with grand flourish, be awestuck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets must be purchased in advance, circus tent is air conditioned, wheelchair accessible and capacity is limited.\n\nPresented in part with support from: The National Empowerment of the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nWatch video: https://youtu.be/TB0Oyl1gSNk", "source": "Facebook", "date": "2016-08-26T18:30:00-04:00", "name": "One-Man Circus (L’homme Cirque)"}, {"url": "https://www.facebook.com/events/1721730291447543/", "description": "\"Finds light in telling stories through music\"—Albuquerque Journal", "source": "Facebook", "date": "2016-08-26T20:00:00-04:00", "name": "Ellis Paul"}, {"url": "https://www.facebook.com/events/467970253401536/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by New York Times, this world famous high wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with grand flourish, be awestuck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets must be purchased in advance, circus tent is air conditioned, wheelchair accessible and capacity is limited.\n\nPresented in part with support from: The National Empowerment of the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nWatch video: https://youtu.be/TB0Oyl1gSNk", "source": "Facebook", "date": "2016-08-27T18:30:00-04:00", "name": "One-Man Circus (L’homme Cirque)"}, {"url": "https://www.facebook.com/events/1705288336408032/", "description": "Tonight's show explores rockabilly and related genres.", "source": "Facebook", "date": "2016-08-27T20:00:00-04:00", "name": "George Bedard’s History of American Music Series—Part 4"}, {"url": "https://www.facebook.com/events/1556374641333780/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by New York Times, this world famous high wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with grand flourish, be awestuck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets must be purchased in advance, circus tent is air conditioned, wheelchair accessible and capacity is limited.\n\nPresented in part with support from: The National Empowerment of the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nWatch video: https://youtu.be/TB0Oyl1gSNk", "source": "Facebook", "date": "2016-08-28T18:30:00-04:00", "name": "One-Man Circus (L’homme Cirque)"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-09-01T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/905763186211716/", "description": "Ireland's legends push musical boundaries", "source": "Facebook", "date": "2016-09-15T20:00:00-04:00", "name": "Altan"}, {"url": "https://www.facebook.com/events/1275355069146738/", "description": "The Free Speech (While Supplies Last) tour", "source": "Facebook", "date": "2016-09-16T20:00:00-04:00", "name": "Second City—Night 1"}, {"url": "https://www.facebook.com/events/1653085994944878/", "description": "At Woodstock, as a New York kid barely known outside the coffeehouse circuit in Greenwich Village, she sang her song, \"Beautiful People\" and inspired the first panorama of candles and cigarette lighters ever raised at a concert event. That, in turn, moved the young singer to write \"Lay Down (Candles in the Rain\"), which sold more than one million copies in 1970 and prompted Billboard, Cashbox, Melody Maker, Record World, and Bravo to anoint her as female vocalist of the year. Her single, \"Brand New Key,\" topped the charts in 1971.\nWith guitar in hand and a combination of amazing vocal talent, disarming humor, and a vibrant engagement with life, she was booked as the first solo pop/rock artist ever to appear at the Royal Albert Hall, Carnegie Hall, and the Metropolitan Opera House, and later opened the New Metropolitan Opera House in New York, the Sydney Opera House, and in the General Assembly of the United Nations, where she was invited to perform on many occasions as delegates greeted her performances with standing ovations.\nThe top television hosts of all time -- Ed Sullivan, Johnny Carson, and Dick Cavett -- battled to book her.\nUNICEF made her its spokesperson; Jimi Hendrix's father introduced her to the multitude assembled for the twentieth anniversary of Woodstock. Her records continued to sell -- more than eighty million to date. She's had her songs covered by singers as diverse as Cher, Dolly Parton, and Macy Gray. She's raised a family, won an Emmy, opened a restaurant, and written a musical about Wild Bill Hickok and Calamity Jane.\nThis is a rare opportunity to experience Melanie live and in person in an intimate venue. Don't miss it!\nwww.melaniesafka.com", "source": "Facebook", "date": "2016-09-16T20:00:00-04:00", "name": "Melanie at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/230895810592540/", "source": "Facebook", "date": "2016-09-17T20:00:00-04:00", "name": "Second City—Night 2"}, {"url": "https://www.facebook.com/events/1690454564522707/", "description": "THIS EVENT HAS BEEN POSTPONED TO LATER IN THE POLITICAL SEASON.  PLEASE CHECK OUT THE NEW NOVEMBER 1ST PROGRAM, \"JOKES IN PROCESS\" THAT WE HAVE PUT INTO ITS PLACE.  \n\nThe presidential candidates have been HILARIOUS this year, but now let's see how the professionals do.\nJoin the Emergent Art's Theater and the UnClub as they present \"UnDebateable, the UnPresidential Debates\".\n\nIf you would like to be a part of this historic event, either as a moderator, an interview, and audience reporter, or an actual campaign spokeperson, or if you can do an impression of a candidate, please click the 'Going' button.  If you can't commit, but you are interested in following this event, click 'Maybe' and we will keep you informed.\n\nWe are also looking for folks who can help us stream a webcast of this event.\n\nWant to be a sponsor?  We'll take that too.", "source": "Facebook", "date": "2016-09-18T21:00:00-04:00", "name": "UnDebateable, the UnPresidential Debates - Clown Car to the White House"}, {"url": "https://www.facebook.com/events/1581166152202412/", "description": "\"Bill Staines has been my hero since 1977.\"—Nanci Griffith", "source": "Facebook", "date": "2016-09-20T20:00:00-04:00", "name": "Bill Staines"}, {"url": "https://www.facebook.com/events/183894411968312/", "description": "\"I think the bottom of the barrel is where the answers are.\"—Fred Eaglesmith", "source": "Facebook", "date": "2016-09-22T20:00:00-04:00", "name": "The Fred Eaglesmith Traveling Steam Show"}, {"url": "https://www.facebook.com/events/992824104100196/", "description": "Sat. September 24 | 9pm | 18+ | $15 Cover\n\nThe Slackers are self styled masters of Reggae, Ska and Rock’n’Roll from New York City. The Slackers began in 1991 in NYC. After years of local gigs and rehearsing in a dingy basement in Manhattan’s lower east side, the band released its debut album, Better Late Than Never, in 1996. The band’s success resulted in the release of a second album, Red Light, on the Epitaph label in 1997. Since then the Slackers have released 11 more studio albums (The Question, Wasted Days, Slackers & Friends, Close My Eyes, Slackers in Dub, Peculiar, Boss Harmony Sessions, Self Medication, Lost and Found, The Great Rocksteady Swindle, and The Slackers [self-titled, 2016] ) 3 live albums (Live at Ernestos, Upsettin Ernestos, Slack in Japan), several EPs (International War Crimminal, My Bed is a Boat), and numerous singles and compilation tracks. Since 1997 the Slackers have played over 100 shows every year in a total of 46 american states, 7 Canadian provinces, 22 European countries, 5 Latin American countries, and 2 Asian countries. The band’s musical style is distinct from their contempories; a mix of early Jamaican music with classic 50’s and 60s American styles. There are influences from 50s and 60s Rock’n’Roll, Rythmn and Blues, Jazz and Latin music. Singer Vic Ruggiero has coined the term ‘Jamaican Rock’nRoll.’ to describe it. He says, “The band might play a classic Jamaican style but the vocals are distinctly American east coast, revealing the obvious connection of Jamaican music to the Doo-Wop of Harlem and the Bronx.” With the demise of record companies over the last 5 years, the Slackers have successfully used crowdfunding (www.bigtun.es/theslackers.) to release new music including the latest release, The Slackers [self-titled] in February 2016.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/671", "source": "Facebook", "date": "2016-09-24T21:00:00-04:00", "name": "The Slackers 9/24/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/472892626244546/", "description": "Where song, spirit, and speaking meet. Photo by Econosmith.", "source": "Facebook", "date": "2016-09-26T20:00:00-04:00", "name": "David Roth w/Reggie Harris"}, {"url": "https://www.facebook.com/events/1679614935644801/", "description": "New music from an OUT magazine OUT100 featured music honoree", "source": "Facebook", "date": "2016-10-01T20:00:00-04:00", "name": "Melissa Ferrick"}, {"url": "https://www.facebook.com/events/964923176923370/", "description": "Lou and Peter Berryman were both raised in Appleton, WI, and began playing music together in high school during the sixties. During the following nomadic decade, Lou studied classical voice and music theory in college while Peter continued an unfocused fascination with surrealist art, beatnik poetry, and jug band music. Early influences of American and British musical comedy and folk music fed a growing repertoire of original songs. A brief marriage in the early seventies resolved into a lifelong friendship, and by the late seventies and early eighties the two were honing their skills playing regular weekly concerts in Madison, becoming full-time musicians and songwriters in 1979. During those early years they wrote new songs every week, many about the history, cheese, beer and strange politics of their home state. By the mid '80s they were traveling all across the country, still writing and singing, but now with a broader perspective, finding that the quirks of their home state were not so much Midwestern as human. In twenty-five years of performing together, Lou and Peter have released twenty albums and four songbooks worth of hilarious, quirky, yet oddly profound songs, rich with word play and interesting images. Pete Seeger, Tom Paxton and Tom Lehrer count themselves among their fans. Their work has appeared in numerous compilations such as the popular \"Rise Up Singing\" songbook, in periodicals like \"SING OUT! Magazine\", and in many audio compilations. Berryman songs are being sung around the world by a legion of professional musicians including Peter, Paul and Mary, Garrison Keillor and Peggy Seeger. They have appeared numerous times on such national programs as NPR's \"A Prairie Home Companion\" and \"Weekend Edition.\"\nwww.louandpeter.com", "source": "Facebook", "date": "2016-10-07T20:00:00-04:00", "name": "Lou and Peter Berryman at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/1668844700041158/", "description": "Two nights with Steppin' in It's fast-rising lead vocalist", "source": "Facebook", "date": "2016-10-21T20:00:00-04:00", "name": "Joshua Davis—Night 1"}, {"url": "https://www.facebook.com/events/215744518775574/", "source": "Facebook", "date": "2016-10-22T20:00:00-04:00", "name": "Joshua Davis—Night 2"}, {"url": "https://www.facebook.com/events/1696673723915750/", "description": "Michigan's bluegrass and Americana success story", "source": "Facebook", "date": "2016-10-23T19:30:00-04:00", "name": "Lindsay Lou & The Flatbellys"}]