[{"date": "2016-12-03T08:00:00-05:00", "source": "Facebook", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network", "url": "https://www.facebook.com/events/280243392370950/"}, {"date": "2016-12-03T09:00:00-05:00", "source": "Facebook", "description": "Stewardship Workday\nSaturday, December 3\nRuthven Nature Area\n9 a.m. to noon\nRuthven Nature Area is lesser-known compared to nearby Furstenberg and Gallup Parks, but it certainly doesn’t lack any of the beauty! Its unique landscape features a kame, a landform resulting from a crack in a glacier filling with sediment, which allows for incredibly complex ecological communities. Unfortunately, honeysuckle and buckthorn are encroaching on this great natural area and pushing out native plants. Help us remove these invasive species and provide better habitat for the wildlife that calls Ruthven home! Please meet at the Gallup boat launch parking lot, on the southeast corner of Huron Parkway and Geddes Road. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Stewardship Workday- Ruthven Nature Area", "url": "https://www.facebook.com/events/169905536760719/"}, {"date": "2016-12-03T09:00:00-05:00", "source": "Facebook", "description": "Give the Gift of Fine Dining\nEnjoy FREE MSV Gift Certificates with your purchase.\n\nPurchase $250 or more in Gift Cards and get a free $25 Gift Certificate for every $250 spent.     \n\nPurchase $1,000 or more in Gift Cards, and get a free $50 Gift Certificate for every $250 spent. \n\nMSV Combo Package \nFor only $75 get a $50 Gift Card and TWO Distinctive Recipes Cookbooks \n\nOur Gift Cards and MSV Combo Package can be purchased at our restaurant,\n by calling (888) 456-3463 (DINE), or visit us online at: www.mainstreetventuresinc.com/shop. \n\nTake advantage of this special offer. Offer only available until 12/31/2013.", "name": "Give the gift of fine dining with MSV Gift Cards!", "url": "https://www.facebook.com/events/1374253909486568/"}, {"date": "2016-12-03T11:00:00-05:00", "source": "Facebook", "description": "Children ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. The story on December 3rd will focus on Japanese Prints of Kabuki Theater. Meet in front of the UMMA Store.\n\nStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "name": "Storytime at the Museum", "url": "https://www.facebook.com/events/1244335572254738/"}, {"date": "2016-12-03T11:00:00-05:00", "source": "Facebook", "description": "Moving Image: Landscape explores traditional notions of landscape through four very different time-based works by artists Jim Campbell, Antti Laitinen, Joanie Lemercier, and Rick Silva.\nCampbell’s recent body of work, including Seal Rock, presents pixilated images of landscapes created with grids of LEDs. The low-resolution LEDs create a tension between representation and abstraction, provoking viewers to interpret visual information on their own. In the three-channel video It’s My Island Laitinen builds his own island in the Baltic Sea by dragging two hundred sand bags into the water over a period of three months. The work explores ideas of nationality, citizenship, and identity as the artist creates his own single-citizen micro-nation. Lemercier’s computer-generated print Landforms uses patterns of black dots and projected light to create the illusion of three-dimensionality and movement when seen from a distance. The effects are more realistic than a still image, but still unsettlingly artificial. Silva’s Render Garden explores the digitized landscape, including remix and glitch aesthetics, through software that endlessly generates new plant combinations.\nThroughout the next year UMMA will present a series of exhibitions drawn from the Borusan Contemporary Art Collection in Istanbul. The Borusan’s thirty-year-old collection includes significant works across a variety of genres, and since 2011 it has focused on media arts. The works exhibited here address formal concerns such as abstraction and color, and conceptual topics such as identity or ecological issues; many represent traditional categories such as portraiture and landscape that find new resonance when explored through the strategies of dynamic technology.\n\nLead support for this exhibition is provided by the Susan and Richard Gutow Fund, the Herbert W. and Susan L. Johe Endowment, and the University of Michigan Institute for the Humanities and Penny W. Stamps School of Art and Design.", "name": "Opening - Moving Image: Landscape", "url": "https://www.facebook.com/events/334113860296034/"}, {"date": "2016-12-03T13:00:00-05:00", "source": "Facebook", "description": "Join four local SCBWI (Society of Children's Book Writers & Illustrators) children and/or YA authors for a sit and sign event.  Come and chat with these authors and find some very interesting books you just might want to have. \n\nParticipating Authors: Lisa Wheeler, Gin Price, Laura Wolfe and Kathy Higgs-Coulthard \n\n********\nLisa Wheeler: \n\nLisa Wheeler is the author of over 35 children’s books including The Christmas Boot and the popular Dino-Sports series. Lisa's book, Bubble Gum, Bubble Gum is the 2017 Michigan Reads! One Book One State Children’s Book Program recipient. Her awards include The Michigan Mitten, Texas Bluebonnet, and the Theodore Geisel Honor given by the American Library Association. Lisa shares her Michigan home with one husband, one dog, and an assortment of anthropomorphic characters. Check out Lisa’s website at: www.lisawheelerbooks.com\n\n'The Christmas Boot': \n\nLonely Hannah is delighted to discover a warm black boot as she gathers kindling in the forest. A poor woman, she doesn't have proper shoes on her cold feet. \"Glory be I only wish I had your mate,\" she says to the boot, and the next morning, to her great surprise, there is not just one boot but two sitting by her bed More wishes bring even better gifts but the best is still to come: A visitor arrives at her door a man with a big white beard, wearing a red suit and only one boot. Who could this magical visitor be? Santa Claus, of course And he has one more surprise in store for Hannah: She wakes up the next morning to find a new puppy waiting for her\n\n********\nGin Price: \n\nGin Price began writing stories in the sixth grade, though hopefully they've improved since then. She's written in a few genres, but has crashed landed on young adult shelves where she hopes to remain. Currently she lives in the Metro Detroit area with her biologist partner-in-crime David, her three children, many reptiles and an ornery cat. \n\n'On Edge': \n\nWhen a serial-killing graffiti artist starts painting your picture all over town it puts a girl On Edge. Emanuella \"LL\" Harvey puts her gymnastic skills to good use as a member of her brother's Parkour group. Freerunning, jumping, and climbing over their corner of the city like it's an obstacle course gives them something to take pride in and keeps them out of trouble-sort of. But trouble finds LL when she runs into Haze, a talented graffiti artist whose sister Heather was murdered two years before. Freerunner and Writer promptly fall in love, but they decide to hide their relationship till they're sure it's the real thing-and until they can find a way to placate LL's hotheaded brother, who has it in for Haze and his gang. But when portraits of LL-done in Haze's distinctive style-start popping up on city walls, all hell breaks loose. LL's brother threatens a gang war, which LL tries to avert by identifying the Writer who is really responsible for the paintings. But when another teen is murdered, it looks bad for Haze, especially when LL discovers that Heather's killer and her portrait-painter are one and the same.\n\n********\nLaura Wolfe: \n\nLaura is a wife and mother to two children and a lover of animals and nature. When she is not writing or reading, you can find her playing games with her kids, riding horses, cooking vegan food, or doting on her rescue dog.  She dreams of someday living on a hundred-acre horse farm. \n \nIn her previous life, she was an attorney, a legal editor, and a successful real estate broker. After having kids, she quickly decided that life was too short not to pursue her passions.\n \nShe holds a BA in English from the University of Michigan and a JD from DePaul University College of Law. She is a member of multiple writing groups, including International Thriller Writers, Sisters in Crime, and theSCBWI. \n \nHer novel, Trail of Secrets, was published in August 2015 by Fire and Ice YA, and was named a Finalist in the 2016 Next Generation Indie Book Awards - First Novel category. Additional writing credits include: articles in Practical Horseman magazine and PKA's Advocate. \n\n'Trail of Secrets': \n\nSpending three weeks of her summer in northern Michigan at the elite Foxwoode Riding Academy should have been one of the happiest times of sixteen year-old Brynlei’s life. But from the moment she arrives at Foxwoode, Brynlei can’t shake the feeling that she’s being watched. Then she hears the story of a girl who vanished on a trail ride four years earlier.\n \nWhile the other girls laugh over the story of the dead girl who haunts Foxwoode, Brynlei senses that the girl—or her ghost—may be lurking in the shadows. Brynlei’s quest to reveal the truth interferes with her plan to keep her head down and win Foxwoode’s coveted Top Rider Award. To make things worse, someone discovers Brynlei’s search for answers and will go to any length to stop her. As Brynlei begins to unravel the truth surrounding the missing girl, she finds herself faced with an unimaginable choice. Will she protect a valuable secret? Or save a life?\n\n********\nKathy Higgs-Coulthard: \n\nKathy Higgs-Coulthard lives in a small farmhouse on the prairie in Southwestern Michigan with four kids, two dogs, one kitten, and a hedgehog. Kathy's work has appeared in Jack & Jill Magazine, Women on Writing, Chicken Soup for the Soul, and Facts on File's Encyclopedia of Great American Writers. Her debut novel, Hanging with My Peeps, came out in April, 2016.\n \nHanging With My Peeps': \n\nBefore Dad’s rust-bucket lurched into the driveway with forty-three chickens in the back, the closest Sami Duggan had ever come to poultry was licking the grease off her fingers at the local KFC. Now Sami better think quick before her whole life is turned upside down by Dad’s latest get rich quick scheme.", "name": "SCBWI Merry Mitten Holiday Sit & Sign Event", "url": "https://www.facebook.com/events/318329218546552/"}, {"date": "2016-12-03T18:00:00-05:00", "source": "Facebook", "description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "name": "Art Off The Wall Holiday Exhibition & Shopping Event", "url": "https://www.facebook.com/events/1807900772828520/"}, {"date": "2016-12-03T20:00:00-05:00", "source": "Facebook", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nThe League will invite volunteers from the audience to share stories about their holidays – funny, awkward, sad, or wacky – and then they will perform scenes inspired by these tales.\n\nGroup 1: Jacobson \nGroup 2: Launch Girls\nGroup 3: The League of Pointless Improvisers", "name": "Holiday Improv Show with Jacobson and Launch Girls", "url": "https://www.facebook.com/events/218765035223620/"}, {"date": "2016-12-03T21:00:00-05:00", "source": "Facebook", "description": "Spiritus Mundi - The collective soul of the universe containing the memories of all time.. \n\nWe will be bringing together Detroit & Ann Arbor for a special event December 3rd!.. \n\nw/ \n\nDeon Jamar (Detroit)\nDJ Moppy (Detroit/Chicago)\nDj Pia (Detroit/Seoul)\nPat in the Hat (Ann Arbor)\nRoman (Ann Arbor) \n\n\nTapping into our souls for inspiration to move you on the dancefloor.. \n\n18+ $5", "name": "Spiritus Mundi * Deon Jamar * DJ Moppy * DJ Pia * Pat in the Hat", "url": "https://www.facebook.com/events/1537178406297528/"}, {"date": "2016-12-03T22:00:00-05:00", "source": "Facebook", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nThe League will invite volunteers from the audience to share stories about their holidays – funny, awkward, sad, or wacky – and then they will perform scenes inspired by these tales.\n\nGroup 1: Launch Girls\nGroup 2: Jacobson\nGroup 3: The League of Pointless Improvisers", "name": "Holiday Improv Show with Launch Girls and Jacobson", "url": "https://www.facebook.com/events/1615651592077966/"}]