[{"date": "2016-08-21T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/165758127167249/", "description": "Before joining the faculty of the Southern California Institute of Architecture in Los Angeles (Sci-Arc), Mira Henry spent several years as a project architect, immersed in the everyday, banal details of how buildings get built such as construction drawings and material specs. But as a progressive architectural thinker, her inspiration has been to “unsee” the very forms and representations that constitute an architect’s basic language. For example, through speculative experiments and conceptual drawings Henry discovers in static architectural details an unsettling range of figurative expression, such as the way the profiles of roof eaves resemble human heads. Join UMMA docents as they explore how these features animate our subjective experience–what she calls our “shifting fantasies”–of architectural space.", "name": "Guided Tour Mira Henry: The View Inside"}, {"date": "2016-08-21T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/153207758446964/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games"}, {"date": "2016-08-21T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/165685407192756/", "description": "Ann Arbor Poetry Slam is back this Sunday with another all ages open community free-speech event! To read or perform, sign up between 6:30 & 7:00. The show starts at 7. There is a five dollar suggested donation at the door. All proceeds go to send winning poets to National and International poetry tournaments. DIY. Grass-roots. Since 1987. Come early. Stay late. Bring the world. Bring your words. Your host this week is Luis Anderson!", "name": "Ann Arbor Poetry Open Mic & Slam"}, {"date": "2016-08-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1327336580627572/", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "name": "The Arcade - A Pointless Improv Jam"}, {"date": "2016-08-21T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/564009510445180/", "description": "Midwest Fest at the Blind Pig for the first time ever!\nDoors 8pm | 18+ | Tix $10 / $20 for all three days (limited availability)  Visit www.blindpigmusic.com for tickets\n\nTHURS 8/18\nThe Go Rounds - https://thegorounds.bandcamp.com/\nMinihorse - https://www.facebook.com/minihorseband/\nThe Antivillians - www.theantivillains.com\nSteven Leaf & the Ex Pats - https://www.facebook.com/steveleafandtheexpats/\nMichigander - https://www.facebook.com/michiganderband\n\nFRI 8/19\nThe Soil & the Sun - www.thesoilandthesun.com/\nMike Adams At His Honest Weight - www.mikeadams.info/\nBig Sherb - https://www.facebook.com/bigsherb/\nBoudoir Noir - https://boudoirnoir.bandcamp.com/\nAncient Language - https://www.facebook.com/AncientLanguageMusic\n \nSAT 8/20\nGuilty Simpson - http://rapraprapraprap.com/\nMister - http://rapraprapraprap.com/\nRed Pill - https://www.facebook.com/redpillrap\nLast Gasp - https://www.facebook.com/LastGaspCollective/?fref=ts\nAlexander Lynch - https://soundcloud.com/alexanderlynch", "name": "Midwest Fest IX August 18-20 at Blind Pig - Ann Arbor"}, {"date": "2016-08-22T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/171422059934834/", "description": "Literati is pleased to welcome staff-favorite Roy Scranton in support of his novel, War Porn.\n\nAbout the book:\n\n“War porn,” n. Videos, images, and narratives featuring graphic violence, often brought back from combat zones, viewed voyeuristically or for emotional gratification. Such media are often presented and circulated without context, though they may be used as evidence of war crimes. \n\nWar porn is also, in Roy Scranton’s searing debut novel, a metaphor for the experience of war in the age of the War on Terror, the fracturing and fragmentation of perspective, time, and self that afflicts soldiers and civilians alike, and the global networks and face-to-face moments that suture our fragmented lives together. In War Porn three lives fit inside one another like nesting dolls: a restless young woman at an end-of-summer barbecue in Utah; an American soldier in occupied Baghdad; and Qasim al-Zabadi, an Iraqi math professor, who faces the US invasion of his country with fear, denial, and perseverance. As War Porn cuts from America to Iraq and back again, as home and hell merge, we come to see America through the eyes of the occupied, even as we see Qasim become a prisoner of the occupation. Through the looking glass of War Porn, Scranton reveals the fragile humanity that connects Americans and Iraqis, torturers and the tortured, victors and their victims.\n\n\"What impresses is the brutal immediacy of the writing, its authority. Roy Scranton is a truth telling war writer.\"—E.L. Doctorow, National Book Critics Circle Award-winning author of Ragtime and The March\n\n\"War Porn is dire, savage, and brilliant, a simmering fever-dream of a novel that's as pure and true in its vision of the long war as anything I've read. Roy Scranton is merciless—and why should he be anything but? War's corruption soaks through every layer of life, and War Porn drives home that truth with unflinching, and ultimately harrowing, honesty.\"—Ben Fountain, author of Billy Lynn's Long Halftime Walk \n\n“Roy Scranton’s searingly honestly first novel is surreal, ultra-real, and like everything he writes from the heart. This examination of the tragedy of what happened in Iraq reaches out to touch of all us. A brilliant literary achievement.”—Jeff VanderMeer, New York Times Best Selling author of Area X: The Southern Reach Trilogy\n\n\"This book is truly unique—true in its fidelity to fact, unique in the depth of its empathy. In prose that rises to aphoristic, coruscating brilliance, Iraq vet Roy Scranton has painted, in words, the equivalent of Goya's war etchings. A rare and genuine masterpiece.\"—Joydeep Roy-Bhattacharya, author of The Watch and The Storyteller of Marrakesh\n\n“Roy Scranton makes us feel the brutalizing affects of war on both Iraqi civilians and American soldiers from the inside out. War Porn seduces, then delivers a sucker-punch no one will forget. This is one of the most honest and propaganda-free novels about the Iraq War yet written.”—Helen Benedict, author of Sand Queen and The Lonely Soldier\n\n\"Roy Scranton has created a singular structure to house public and private memory of the long Iraq War. His war stories illuminate, horrify, and seduce. This is a novel of rare ambition—War Porn gripped me as I read it and haunts me still.\"—Hilary Plum, author of They Dragged Them through the Streets\n\n\"I have never read a book like War Porn. Roy Scranton writes with unnerving power. There is much to admire here—the meticulous craftsmanship, the hysterical comic passages, the way the sheer audacity of vision is matched at every turn by the innovative skill to carry it out—but what I'm left with at the end is difficult to put into words. It's intense and troubling. It's what all truly excellent literature leaves you with. A sense of something shattering.\"—Phil Klay, National Book Award-winning author of Redeployment\n\n\"A harrowing novel of the Iraq invasion and occupation, WAR PORN exposes the dark heart of that war for all to see. Brilliant and stark, WAR PORN is that rare book that demands to be read out of sheer significance—a stunning accomplishment.\"—Matt Gallagher, author of Youngblood\n\nRoy Scranton is the author of the novel War Porn (Soho Press, 2016) and the philosophical essay Learning to Die in the Anthropocene (City Lights, 2015). His journalism, essays, fiction, poetry, and reviews have been published in The Nation, Rolling Stone, the New York Times, LIT, Boston Review, Prairie Schooner, Los Angeles Review of Books, Contemporary Literature, The Appendix, and elsewhere. He is also one of the editors of Fire and Forget: Short Stories from the Long War (Da Capo, 2013). He holds a Ph.D. in English from Princeton and an M.A. from the New School for Social Research, and teaches creative writing in the Department of English at the University of Notre Dame.", "name": "Roy Scranton"}, {"date": "2016-08-23T12:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/166444617096965/", "description": "You are invited to a reception in support of\nGretchen Driskell (MI-07) and Suzanna Shkreli (MI-08)\n\nTuesday, August 23rd, 2016 12:30pm - 2:00 pm\n\nAt Arbor Brewing Company\n114 E. Washington St. \nAnn Arbor, MI 48104\n\nSuggested Contribution Levels:\n$50 Friend\n$100 Guest\n$250 Supporter\n$500 Sponsor\n$1,000 Champion\n\nJoin us for refreshments, conversation, and an update from the campaign trail with Congresswoman Debbie Dingell, Congresswoman Cheri Bustos, and Congresswoman Lois Frankel.\n\nRSVP to Hattie McKinney at 734-707-7150 or gretchen@votegretchen.com or Arianna Kendall at 202-688.8372 or arianna@suzannaforcongress.com or Philip Stein at 202-741-1363 or Stein@dccc.org\nOR online at https://secure.actblue.com/contribute/page/driskellshkreli2016\n\nDonors may choose how much and to whom to contribute.\nChecks will be collected, treated, and reported as conduit contributions by the DCCC.\n\nPlease make checks payable to each campaign. Committee Names are also listed in the disclaimer box.\nPlease mail your check along with this form to: DCCC c/o Philip Stein\n430 South Capitol Street SE, 2nd Floor Washington, DC 20003", "name": "Women LEAD Luncheon with Rep Dingell, Rep Bustos, and Rep Frankel"}, {"date": "2016-08-23T18:15:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1570731196567699/", "description": "Please join us for a special, invitation-only \"Dinner With Circus Sensation David Dimitri\", a benefit for the Ann Arbor Summer Festival. \n\nJoin festival director Amy Nesbitt and select festival donors for a dinner supporting the week-long residency of world-renowned circus performer and high-wire walker David Dimitri.\n\nDavid will be performing his magical \"One Man Circus\" August 24th - 28th in Burns Park. This is a unique opportunity to get to know David personally, hear wonderful stories of his 20+ years of performances worldwide and enjoy charming anecdotes of a globally respected artist before Opening Night.\n\nTickets are Available Now:\n$100  Dinner Only\n$150  Dinner + 1 Ticket to Opening Night performance of One Man Circus on 8/24\n\nFestivities will kick off in the Private Room at Mezzevino on Liberty and 4th Street.\n\n6:15 pm - Join us for socializing over delicious appetizers such as the Mediterranean hummus platter with crisp vegetables and marinated olives, and creative flatbreads. Enjoy a glass of wine, beer, soda, iced tea, or coffee.\n\n6:45 pm - Dinner will include Mezzevino's famed Greek Salad, Braised Beef Tips, and Vegetarian Pasta Primavera.\n\nMany thanks to Ellie Serras and the staff at Mezzevino for their generous assistance with this event. Ticket buyers will receive an acknowledgement letter from the festival detailing the charitable portion of their purchase for tax purposes.\n\nWe look forward to seeing you!\n\nHeather Steenrod\nDonor and Corporate Partnerships Manager\nAnn Arbor Summer Festival\nSteenrod@a2sf.org", "name": "Dinner With Circus Sensation David Dimitri"}, {"date": "2016-08-23T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1568827103422152/", "description": "Drink and Draw is back just in time for the dog days of summer! This one is for all of you bar-napkin savants, you web-comic-ers, you dabblers, dawdlers and you doodlers alike. An event to unite Ann Arbor artists of all calibers, for drinking, drawing and over-all merriment (and not necessarily in that order). We invite you to join us on August 23rd at Bill's Beer Garden for a night of great company, conversation and collaboration.\n\nSpots are limited so get in touch with us today! To reserve your space, message us on Facebook, shoot us an email, or drop us a line!", "name": "Drink & Draw"}, {"date": "2016-08-23T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1799556966926824/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nZak Shaffer has an “infectious live performance that can’t be beat”! He is an incredibly talented\nrising star who’s blending of rock, blues, pop, bluegrass & country creates catchy & original sounds on\nthe guitar. He is a soulful vocalist who can growl better than any rocker & can croon with the best in\ncountry music.\nhttp://zakshaffer.com/\n\nNew a cover\nAlways a good time", "name": "Acoustic Tuesdays: Zak Shaffer"}]