[{"description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "date": "2016-10-21T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1090878344334512/", "name": "Sweetwaters Westgate Grand Opening!"}, {"description": "The members of Far House are excited to present to you two days and two nights of art and music at our house. Featuring local artists in multiple mediums such as: Glass, Beads, Organic, Jewelry,  Pins, Sculpture, Photography, Zines, along side a killer musical lineup featuring touring and local bands!!!\n\nAdmission is free, however artists will be selling their art in a wide range of prices.\n\n\n[][][][][][][][][][][]ARTISTS[][][][][][][][][][][]\n\n~Renee Lalinsky\nElaborate bead work such as tapestries & 3-D sculptures that glow in the dark and react to UV (black light). Creepy resin cast jewelry featuring plant & animal materals. Loads of various pins!!\n\n~Kevin Kissinger\nOne of Far House's very own who works with a varity of studies such as Pen & Ink, Linoleum Block Printing, & other various 2-D displays.\n\n~Dylan Harris\nFrom Jackson MI, this street artist runs Hylan Designs and makes everything from Stickers & Pins to Clothing to Painted Canvas.\n\n~Igor Kocherga & Ethan Zuck\nIgor is an established tatoo artist from Ann Arbor who has had his steady hand at the art for over 7 years.\nEthan Zuck is a young and inspiring artist who has been around tattooing the majority of his life.\nBoth of them will be offering tattoo style Body & Face Painting.\n\n<><><><><><PERFORMERS><><><><><>\n\n~Friday October 21st~\n\n2:00 Doors Open\n\n3:00 Ian Burk\n\n4:00 Telementals \nhttp://telementals.bandcamp.com/album/universal-burst\n\n5:00 Honey Monsoon\n\n6:00 BSRB\nhttps://soundcloud.com/bsrb1983\n\n7:00 Jordan Adema\nhttps://soundcloud.com/jordan-adema/thermodynamic\n\n8:00 Yaje\nhttp://yajeyaje.bandcamp.com/\n\n9:00 Corridors\nhttps://corridorsypsi.bandcamp.com\n\n10:00 Prisim Print\nhttps://soundcloud.com/user-309584363\n\n11:00 Hanging Hearts (CHI)\nhttps://www.youtube.com/watch?v=Olr_r-FZww8\n\n\n~Saturday October 22nd~\n\n2:00 Doors Open\n\n3:00 Soft Milk\nhttps://m.soundcloud.com/soft-milk\n\n4:00 NO DATA\nhttp://nodata1.bandcamp.com/\n\n5:00 Modus Operandi\nhttp://modusoperandi.bandcamp.com/releases\n\n6:00 Brian Tucker\n\n7:00 Outer Realms\nhttps://outerrealms.bandcamp.com/album/city-demos\n\n8:00 STRCHLD\nhttps://soundcloud.com/strchldmusic\n\n9:00 Liars & Theives\nhttps://soundcloud.com/liars-and-thieves\n\n10:00 Big Bad Wolf\nhttps://www.reverbnation.com/bigbadwolftheband\n\n11:00 Ada Z\nhttps://adazmusic.bandcamp.com\n\nIf you are interested in playing music or selling your art, please contact Far House via facebook: https://www.facebook.com/profile.php?id=131037849418&tsid=0.1526037330586194&source=typeahead\n\nAs always, everyone is welcome (18+) as long as everyone respects the space, the artists/performers and of course eachother.", "date": "2016-10-21T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1128442770578344/", "name": "Far Fest"}, {"description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "date": "2016-10-21T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/612348712258851/", "name": "Drink & Draw / Imbibe & Inscribe"}, {"description": "Bring your well-worn items that could use a tune up, and we'll take a look at them! \n\nOr, make someone else's day by volunteering at Fix-It Friday and repairing their items.\n\nFix-It Friday:\nThink of this as the last chance before you get rid of something; Free, but no Guarantee.\n\nWe will:\n- try to diagnose what is wrong\n- tell you if we think we may be able to fix it today\n- tell you if you'll need a part, and where you might be able to get it\n- try to fix it to the best of our ability, but in the limited time we have\n\nHowever, we may not be able to fix it. Many products are not designed to be fixed, and just opening them up may damage them. Furthermore, we may not have someone on hand with the expertise to do a proper repair. Also, it may require a special part, tools, information, or materials to repair, or it may just require more time than we have.\n\nWe may end up damaging your item even more. Please let the repairer know how comfortable you are at each stage of diagnosis and repair.\n\nItems that are often easier to repair: lamps, types of toys, broken wires, things that need epoxy/wood glue\n\nItems that are often very difficult to repair: consumer electronics such as CD/Cassette boom boxes, TVs, radios, CD players, VCRs, and DVD players", "date": "2016-10-21T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1779109862332329/", "name": "October Fix-It Friday"}, {"description": "Fall, beer, Eastern Market! What more do you need? Beer list to be released soon. Tickets: http://www.mibeer.com/detroit-fall-festival", "date": "2016-10-21T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1112511325491127/", "name": "Detroit Fall Beer Festival"}, {"description": "How about some last minute storytelling at AHA this Friday Evening? Bilal Ghalib is in town and we would love to get together to hear and share what everyone has been doing and where everyone is going in the next five years.\n\nBring a snack (optional) and some thoughts (required) of a beautiful vision of your life in five years : ) \n\nWho is this Bilal? He was the seed that sprouted All Hands Active and many other collaborative community spaces across the globe.", "date": "2016-10-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/574951066025102/", "name": "Reality Story Time!"}, {"description": "Public sale of Tickets available beginning 10:00 am on Friday, August 26th at Nicola's Books, Ticketmaster.com, and all Ticketmaster outlets. Charge by phone 800-745-3000.\n\nTicket/book packages are $39.50 and $49.50 with limited Gold Circle seating available.  All tickets purchased come with a copy of the book Good Clean Fun. Copies purchased with tickets can then be picked up from the Nicola's Books designated table the night of event.  Additional books will also be on sale on the night of the show at the Michigan Theater. \n\nNick Offerman is a man of many talents: actor on stage and screen, humorist, author of two New York Times bestsellers: Paddle Your Own Canoe and Gumption, and a woodworker. This fall, he is releasing the humorous how-to guide GOOD CLEAN FUN: Misadventures in Sawdust at Offerman Woodshop (scheduled for release on October 18), featuring how-to, mirth, fashion tips, recipes, odes to wood, and assorted tomfoolery. He will be stopping by the Michigan Theater as part of an exclusive 12-stop tour in honor of the book's release.\n\nLovers of all things crafty are invited to join him for a good ol' fashioned discussion & book signing, where you will get to know more about the craftsman side of Offerman as well as the entire Offerman Woodshop team. In the words of Offermanhimself, \"you will find that making things with your hands brings you solace (when you're not cussing out a visible glue seam) and better hand-eye coordination.\"\n\nPresented in partnership with Nicola's Books.", "date": "2016-10-21T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/295094260857468/", "name": "Nick Offerman Presented by Nicola's Books at the Michigan Theater"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Listen, Stupid \nGroup 2: $13 Special\nGroup 3: The League of Pointless Improvisers", "date": "2016-10-21T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/528950367310297/", "name": "Pointless Improv with Listen, Stupid and $13 Special"}, {"description": "Fri., October 21 | 9pm | $15 Cover | 18+\n\nJoe Hertler & The Rainbow Seekers wsg: FlightWave\n\nJoe Hertler & The Rainbow Seekers will make a sprightly young groove doctor out of anyone. With spectacular energy pulsating from every member of the band, the Rainbow Seekers could illuminate the very chambers of Heaven. Lead singer Joe Hertler splashes through lyrical puddles of golden rain, leaving his audience wearing flowery crowns and bubbling smiles. A ride on the Rainbow will take you across the mountains of Motown, through the fjords of folk, over the archipelagos of Americana, and-at last-into a funky firth, where only the fiercest of friendships can be found.\n\nThe Rainbow Seekers began their quest beneath the fingertips of songwriter Joe Hertler. Bassist and producer Kevin Pritchard, recently thawed from an extremely rare prehistoric groove glacier, discovered the forlorn Hertler in a twinkling, mysteriously fortuitous place called The Quilted Attic. Alongside legendary glacier-hunter Rick Hale-who would later spend decades forging a drum set from pure, white-hot, ancient stardust to mark the occasion-Pritchard changed the world: He wrangled Hertler into musical collaboration. And the lonely little songsmith, it turned out, was not quite as alone as he seemed: With him came the irresistibly sexy blues guitar prodigy who is now known to the world as Ryan Hoger.", "date": "2016-10-21T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/746969122072900/", "name": "Joe Hertler & The Rainbow Seekers 10/21/16 at Blind Pig - Ann Arbor"}, {"description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNow with spooky campfire stories!\n\nNo two shows are the same!", "date": "2016-10-21T22:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/834720333226858/", "name": "A Pointless Display of Improvised Feats"}]