[{"description": "Ann Arbor Civic Theatre announces auditions for its main stage production of John Cariani’s Almost Maine, directed by Kat Walsh. Auditions take place Sunday, December 4th at 2pm and Monday, December 5th at 6:30 pm at 6155 Jackson Rd., Ann Arbor, MI 48103. (PLEASE NOTE: the general audition sessions are offsite). Callbacks are Tuesday, December 6th at 6:30 pm at the Ann Arbor Civic Theatre Studio. Those auditioning should attend one of the two regular audition dates, and should be available for callbacks. No pre-registration is required. All actors cast must attend a mandatory workshop on Saturday, January 7, 2017, from 1-6 pm. Rehearsals begin January 16. Production dates are March 9-12, 2017 at the Arthur Miller Theatre on UM’s North Campus.\n\nOne cold, clear Friday night in the middle of winter, while the northern lights hover in the sky above, Almost’s residents find themselves falling in and out of love in the strangest ways. Knees are bruised. Hearts are broken. Love is lost, found, and confounded. And life for the people of Almost, Maine will never be the same. \n\nThe show has 19 characters, but the director may double cast roles based on talent at auditions. Those auditioning do not need to prepare anything. Please wear movement clothes. \n\nPLOT AND CHARACTER BREAKDOWN:\n\n\nAlmost, Maine by John Cariani comprises nine short plays that explore love and loss in a remote, mythical almost-town called Almost, Maine. Almost, Maine is a town that’s so far north, it’s almost not in the United States—it’s almost in Canada. And it almost doesn’t exist. Because its residents never got around to getting organized. So it’s just…Almost. One cold, clear Friday night in the middle of winter, while the northern lights hover in the sky above, Almost’s residents find themselves falling in and out of love in the strangest ways. Knees are bruised. Hearts are broken. Love is lost, found, and confounded. And life for the people of Almost, Maine will never be the same. A note about this play from the playwright: \n\n\nThe people of Almost, Maine are not quaint, quirky eccentrics. They don't wear funny clothes and funny hats.  They don't have Maine accents.  They are not \"Down Easters.\"  They are not fishermen or lobstermen.  They don't wear galoshes and rain hats. They don't say, \"Ayuh.\" \n\nThe people of Almost, Maine are ordinary people. They work hard for a living.  They are extremely dignified. They are honest and true.  They are not cynical. They are not sarcastic. They are not glib. But this does not mean that they are dumb.  They're very smart. They just take time to wonder about things.  They speak simply, honestly, truly, and from the heart. They are never precious about what they say or do.", "url": "https://www.facebook.com/events/1051418098337234/", "source": "Facebook", "name": "Auditions for Almost, Maine", "date": "2016-12-05T14:00:00-05:00"}, {"description": "Calling all Ann arbor Beer Lovers!! \n\nThe revered head brewers of Arbor Brewing Company (Chris), Blue Tractor (Pat) and Grizzly Peak (Duncan) joined forces to bring you Washingtonacity, an English Bitter brewed at each location by all 3 brewers.\n\nWe are together hosting a Washington Street pub crawl starting at 5PM Monday, December 5th. Blue Tractor BBQ & Brewery, Arbor Brewing Company and Grizzly Peak Brewing Company will each be serving their versions of the collaboration beer. Each beer was brewed with the same malts and hops, while featuring a different traditional yeast strain at each brewery.\n\nThe brewers will kick off the crawl at Blue Tractor at 5, moving to ABC at 6, and to the GP Den at 7. \n\nThe event is open to the public and we hope to see our collective fans there!", "url": "https://www.facebook.com/events/205495663241203/", "source": "Facebook", "name": "Washingtonacity Pub Crawl", "date": "2016-12-05T17:00:00-05:00"}, {"description": "Don't miss our holiday display Avant Garden: Weaving Fashion & Nature Together. The exhibit explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs Saturday, November 26, 2016-Sunday, January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "url": "https://www.facebook.com/events/723312037871156/", "source": "Facebook", "name": "Holiday Exhibit - Avant Garden", "date": "2016-12-06T10:00:00-05:00"}, {"description": "A full sensory experience with 8 wines, cheese, and charcuterie! We will discuss the history, tasting notes, and body of the wines. \n\nWe are featuring Italian Wines for this tasting, with our next tasting being Sparkling Wines!", "url": "https://www.facebook.com/events/1788770901385546/", "source": "Facebook", "name": "Sava's Uncorked: Italy Wine Tasting", "date": "2016-12-06T18:00:00-05:00"}, {"description": "Free and open to the public. Seating is first-come, first-served.\nPresented by: Swarupa Anila, Director of Interpretive Engagement, Detroit Institute of Arts\n\nAs museums strive to serve broad, ever-diversifying publics, it is no longer possible to deny the ways museums mirror and reinforce racial, cultural, and class inequities of the broader society. Skillful racial and cultural representation in interpretation and programming is not only an intellectual exercise; it is an ethical responsibility that requires fracturing the known through consistent individual and institutional self-reflection and action. This talk focuses on the challenging and often painful internal work toward developing diversity and strategies and actions supporting systemic change in museum representation, interpretation, and ideation.\n\nSwarupa Anila is director of interpretive engagement at the Detroit Institute of Arts. Key issues she pursues in interpretive planning practice include examining whose voices and perspectives are missing in museum interpretation, how to integrate visitor voices to flatten museum and art historical knowledge hierarchies, and how to design museum interpretation that supports dynamic, meaningful visitor engagements with art.\n\nFor more information, please visit the Museum Studies website.\nCo-sponsored by the U-M Museum of Art", "url": "https://www.facebook.com/events/1778744065683778/", "source": "Facebook", "name": "U-M Museum Studies Program Presents: \"Inclusion Requires Fractur", "date": "2016-12-06T18:30:00-05:00"}, {"description": "In his Wine Report 2005, British wine writer Tom Stevenson honored Larry Mawby with the title “fizzmaster exraordinaire”. Mawby has indeed brought a spark to the North American wine industry since he began to produce his bubbles on Leelanau Peninsula in northern Michigan in 1984.\n\nL. Mawby’s bubbles are favorites from Zingerman’s Roadhouse wine list to pair with Chef Alex Young’s reserve collection of oysters, and we look forward to the selections he will bring to the Roadhouse on December 6th. Chef Alex has prepared a menu for this occasion that will perfectly accompany Mawby’s offerings. Look forward to Apalachicola Oysters, which are considered the world’s finest wild oysters with their clean, mineral flavor. And need we say more with a choice of Oyster Stuffed Skirt Steak or Oyster Stuffed Quail as an entrée?\n\nDon’t miss this opportunity to let Mawby’s bubbles tickle your taste buds while you enjoy Chef Alex’s delectable oyster dishes. Reserve your seat today on our events website, \nhttp://events.zingermanscommunity.com/event/oysters-bubbles-evening-l-mawby", "url": "https://www.facebook.com/events/679963915514271/", "source": "Facebook", "name": "Oysters and Bubbles Dinner, #203, featuring L. Mawby", "date": "2016-12-06T19:00:00-05:00"}, {"description": "TICKETS: https://www.paintnite.com/events/1130619.html\n\nLet’s raise our glasses and raise funds for a great cause.\n\nWe're hosting a Paint Nite event to raise money for the Ruth Ellis Center – and you’re invited!\n\nAt Paint Nite, a local artist will assist and inspire us– all while we socialize and sip cocktails for a great cause. We’ll end up painting fond memories and a priceless masterpiece. No art experience needed!\n\nWhere: Joe's Crab Shack, 3020 Lohr Rd, Ann Arbor\n\nWhen: Tuesday, 12/6/16\n\nWhy: The Ruth Ellis Center is a youth social services agency with a mission “to provide short-term and long-term residential safe space and support services for runaway, homeless, and at-risk lesbian, gay, bi-attractional, transgender and questioning (LGBTQ) youth.” The Center is available for young people in times of crisis and in times of celebration, but could not be here at all if it was not for all gifts and donations, large and small, that it receives from the community. (For more information on the REC, click here: http://www.ruthelliscenter.org/)\n\nHow: Buy your ticket now at https://www.paintnite.com/events/1130619.html\n\nLet’s get together and get painting– please RSVP and register now!  Space is limited.\n\nThanks so much for your support,\nSharon & Mili", "url": "https://www.facebook.com/events/1218586501546669/", "source": "Facebook", "name": "Paint Nite Fundraiser for the Ruth Ellis Center", "date": "2016-12-06T19:00:00-05:00"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/324709987912141/", "source": "Facebook", "name": "10% For Good for Community Action Network", "date": "2016-12-07T08:00:00-05:00"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/1171307782957839/", "source": "Facebook", "name": "10% For Good for Community Action Network", "date": "2016-12-07T09:00:00-05:00"}, {"description": "Come join us for some Holiday Make & Take family fun!\nCreate your own \"traditional\" style Holiday stocking or make a fun paw print stocking for the four-legged member of your family. This workshop gives a soft introduction to machine sewing paired with vinyl cutter fun and sealed with our heat press. No prior knowledge or experience necessary, fun for all ages!\n\nPlease arrive 10 minutes early if this is your first time to Maker Works. \nRegister at http://www.supersaas.com/schedule/makerworks/CheckOut?day=7&month=12&year=2016&view=day or call 734-222-4911.", "url": "https://www.facebook.com/events/1742137892777150/", "source": "Facebook", "name": "Family Make & Take: Holiday Stockings - $35/person - 1.5hrs", "date": "2016-12-07T16:00:00-05:00"}]