[{"url": "https://www.facebook.com/events/257242884639852/", "description": "From epicraces.com: The Suburban Chevrolet Cadillac Tri Goddess Tri celebrates women of all abilities, inspiring them to reach new heights of health and set new fitness goals by training for and completing a triathlon. The first-ever all-women’s triathlon/duathlon in Michigan, the Suburban Chevrolet Cadillac Tri Goddess Tri is organized by women who know how to make your first (or hundredth!) triathlon tons of fun! The event is held just 12 miles west of Chelsea at Big Portage Lake in Waterloo Recreation Area, surrounding our participants in scenery as beautiful and inspiring as themselves.\n\nVist epicraces.com for more information!", "source": "Facebook", "date": "2016-06-26T07:30:00-04:00", "name": "TriGoddess Tri"}, {"url": "https://www.facebook.com/events/1771333209777255/", "description": "This week is National Pollinator Week which is celebrated all across the country to raise awareness for pollinators and their importance to the ecosystem. NAP is participating in National Pollinator Week by hosting a workday in the Native Garden at Furstenberg Nature Area. Join us on Saturday, June 25th from 9:00am-Noon at Furstenberg Nature Area to help the local pollinators by removing invasive plants from within the Native Garden. For more information on the workday with NAP please visit www.a2gov.org/napevents and for more information on National Pollinator Week visit www.pollinator.org/pollinatorweek .", "source": "Facebook", "date": "2016-06-26T09:00:00-04:00", "name": "National Pollinator Week"}, {"url": "https://www.facebook.com/events/1706443009629359/", "description": "Manuel Álvarez Bravo spent nearly his entire career photographing his native Mexico. His style drew upon numerous international influences including, among others, Modernism andSurrealism. Although not strictly Surrealist, many of Álvarez Bravo’s works manifest a similarly fantastical mood. One of the artist’s most arresting qualities is his ability to imbue scenes of everyday life with an otherworldly, metaphysical power. The photographs in the exhibition, from UMMA’s collections, show the artist using motifs drawn from Mexican\nreligious and indigenous works as well as plant forms, in a Modernist approach to image making. UMMA docents will discuss these motifs and the artist’s use of light as a metaphor and revealer of life, animating even the emptiest and most silent of Álvarez Bravo’s scenes.\n\nPublic exhibition tours are generously supported by the Richard and Rosann Noel Fund for Museum Education.", "source": "Facebook", "date": "2016-06-26T14:00:00-04:00", "name": "Guided Tour - Manuel Álvarez Bravo: Mexico's Poet of Light"}, {"url": "https://www.facebook.com/events/126949477712284/", "description": "HELLAWELL...Driftwood on Sand\nFriction Quartet\n\nSHOSTAKOVICH...Sonata for Cello and Piano in D minor, Op. 40\nPaul Watkins, cello; Alessio Bax, piano\n\nBOLCOM...Three Rags for String Quartet\nAltius Quartet\n\nArensky | Piano Trio No. 1 in D minor, Op. 32\nTrio Honoré\n\nTickets: Please contact Kerrytown Concert House at 734-769-2999 or visit their website for more information.", "source": "Facebook", "date": "2016-06-26T14:00:00-04:00", "name": "GLCMF at Kerrytown Concert House"}, {"url": "https://www.facebook.com/events/452279421633430/", "description": "Photographed in nearby Detroit, Catie Newell’s new images from her series Nightly frame scenes of the urban landscape illuminated at night. The resulting large-scale photographs transform mundane views of city streets into luminous vignettes that reveal surprising views of familiar spaces. Join newly arrived Assistant Curator of Photography, Jennifer Friess, for a guided exploration of Newell’s intriguing photographs and learn how artificial light has been used to shape our experience of urban spaces throughout the last century.\n\nLead support for the exhibition Catie Newell: Overnight is provided by the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Taubman College of Architecture and Urban Planning.", "source": "Facebook", "date": "2016-06-26T15:00:00-04:00", "name": "In Conversation: Through the Looking Glass, Nightly"}, {"url": "https://www.facebook.com/events/1121859661190359/", "description": "Celebrate #MarriageEquality's anniversary!  Come Aut for brunch, stay for a special champagne toast, enjoy music featuring DJ Amy, catch an exclusive screening of Accidental Activists, and more!\n\n10:00am - 3:00pm\nSpecial Brunch at Aut Bar\n\nNoon - 1:30pm and 2:00pm - 3:30pm\n[Outdoor Pre-Screenings of Accidental Activists in Braun Court]\n*Location: Trillium Real Estate\n\n4:30 - 5:00pm\nSpeaking Ceremony and Champagne Toast\n\n5:00 - 7:00pm\nMusic and dancing with DJ Amy\n\n7:00 - 8:30pm\nScreening of Accidental Activists: One couple's journey to the U.S.Supreme Court ($10 Suggested Donation)\n*Location: Kerrytown Concert House\n\nNote:  In the event of inclement weather,  some activities will be moved indoors to the Jim Toy Community Center or Kerrytown Concert House.", "source": "Facebook", "date": "2016-06-26T15:30:00-04:00", "name": "Day of Decision: One Year Anniversary"}, {"url": "https://www.facebook.com/events/1570182926615340/", "description": "Join us for the first 'Friends of babo' event, presenting Wolverine State Brewing Co.\n\nA four-course dining experience that is sure to please your pallet by showcasing the babo products you love paired with exquisite craft beer by Wolverine Brewing Co. \n\nView our menu below and purchase your tickets today!\n\n\nHORS D'OEUVRES\n__________________________________\n\nBeer: Verano | Mexican-style Amber Lager | 4.3% ABV | 15 IBU\nAn easy-drinking and flavorful amber lager brewed in the tradition of Mexican lagers. Best enjoyed with a fresh lime.\n\nFood: Tomato Basil Bruschetta \nSun ripened Roma tomatoes with fresh basil and balsamic glazed onion served on crostinis  \n\n\nFIRST COURSE\n__________________________________\n\nBeer: Au Sable | Rye Beer/ Rye IPL | 5.5% ABV | 59 IBU\nA beer with a tight, edgy hop bouquet that is lemony with a bit of orange character and a distinct “essence of hops” profile.\n\nFood: Stone Fruit Arugula Salad  \nRipe and juicy peach and apricot slices with arugula, white balsamic vinaigrette, creamy goat cheese fritter, honey roasted walnuts and crispy prosciutto di parma \n\n \nMAIN COURSE\n__________________________________\n\nBeer: Raucher | Smoked Beer | 5.5% ABV | 19 IBU\n2016 World Beer Cup Bronze Medal Winner! That features balanced notes of sweet malt, smoke, and hop bitterness. Hallertau Mittelfruh hops provide balancing hop bitterness to the delicately smoky beach wood smoked malt used in the mash.\n\nFood: Kansas City Chicken \nAll natural and hormone free chicken breast with sweet and spicy dry rub pan seared and topped with a savory roasted tomato sauce; served with garden vegetable medley and crispy potato coins \n\n \nDESSERT\n__________________________________\n\nBeer: Barrista | Coffee Lager | 6.6% ABV | 18 IBU\nA Coffee Brown Lager with big, punchy coffee flavor and aroma from locally roasted RoosRoast coffee beans. We fill up our hop torpedo with Columbian beans from Roos and push Barista through until it attains nectar-of-the-gods coffee status.\n\nFood: Cherry Cream Panna Cotta \nClassic Italian custard with fresh cherries, candied citrus, marsala whipped cream and chocolate covered coffee beans", "source": "Facebook", "date": "2016-06-26T18:00:00-04:00", "name": "Friends of babo - Wolverine Beer Dinner"}, {"url": "https://www.facebook.com/events/959691770814453/", "description": "Take your imagination into the stratosphere as we create characters and stories that are out of this world!\n \nOur drama day camps are focused on providing young people with a safe place to explore their creativity. Each class includes warm up exercises, drama games, improvisation exercises, crafts, and of course lots of fun. The activities will be focused around the theme for the week, making each class a unique experience. On the last day of class we will have a showcase of some of the skills the children have learned throughout the course.\n\n\"Outer Space\" Drama Camp for ages 5-9\n9:00 am - noon, June 27-July 1\n$150 if you enroll by June 1\n($170 after June 1)", "source": "Facebook", "date": "2016-06-27T09:00:00-04:00", "name": "Outer Space Drama Camp"}, {"url": "https://www.facebook.com/events/214510118917962/", "description": "We've got a whole bunch of drama camps for kids this summer! \n\nFor ages 5-9, 9:00 am - noon:\n   - Outer Space: June 27-July 1\n   - Music and Movement: July 5-8\n   - Art and Stories: July 11-15\n   - Under the Sea: August 1-5\n   - Nature: August 8-12\n   - Magical Creatures: August 15-19\n$150 before June 1; $170 after June 1\n\nFor ages 10-13, 3:00 pm - 5:00 pm:\n   - Pointless Playmaking: July 18-21 & July 25-28  \n$160 before June 1; $180 after June 1\n\nEnroll for 2 or more class and get $10 off each!", "source": "Facebook", "date": "2016-06-27T09:00:00-04:00", "name": "Summer Drama Camps"}, {"url": "https://www.facebook.com/events/258306201206111/", "description": "This project is designed to complete an Integrated Storm Water Level of Service and Rate Assessment linking capital improvement needs, financing and policy. Discussions will provide guidance for the consultant, Hawksley and Associates, to complete a comprehensive plan including information sufficient to support recommendations by June 2017 to the City Council regarding the city's storm water utility and rate modifications.", "source": "Facebook", "date": "2016-06-27T10:00:00-04:00", "name": "Ann Arbor Storm Water Level of Service and Rate Analysis Project Advisory Group Meeting"}]