[{"url": "https://www.facebook.com/events/1627795417544876/", "description": "Restoration work here has brought back a grassland in this bend of the river, but it is being invaded by exotic weed species. Volunteers will help protect the park’s diversity by removing them. Meet at the Barton Dam parking lot on Huron River Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "source": "Facebook", "date": "2016-07-10T09:00:00-04:00", "name": "Barton Park Stewardship Workday"}, {"url": "https://www.facebook.com/events/1062516293785042/", "description": "We're grilling burgers to order, with toppings galore, just $5. Summer, we love you!", "source": "Facebook", "date": "2016-07-10T11:00:00-04:00", "name": "Burger Bar $5"}, {"url": "https://www.facebook.com/events/635642046590268/", "description": "Aura Cacia Aromatherapy essential oils are 50% off through Thursday! Used for everything from making you smell good to massages, from soothing ailments to creating a soothing environment, essential oils have benefits big and small.", "source": "Facebook", "date": "2016-07-10T11:00:00-04:00", "name": "Aura Cacia Essential Oils 50% Off"}, {"url": "https://www.facebook.com/events/108096409603561/", "description": "This event is at the Ann Arbor District Library Main Branch - for more information go to bit.ly/1W24PIo  \n\nNicola's Books is the official bookseller for this event\n\nKate DiCamillo is the acclaimed author of many books for young readers, including The Tale of Despereaux, winner of the Newbery Medal; Because of Winn-Dixie, a Newbery Honor Book; and The Tiger Rising, a National Book Award finalist. She lives in Minneapolis, Minnesota.\n\n'Raymie Nightingale'\nRaymie Clarke has come to realize that everything, absolutely everything, depends on her. And she has a plan. If Raymie can win the Little Miss Central Florida Tire competition, then her father, who left town two days ago with a dental hygienist, will see Raymie's picture in the paper and (maybe) come home. To win, not only does Raymie have to do good deeds and learn how to twirl a baton; she also has to contend with the wispy, frequently fainting Louisiana Elefante, who has a show-business background, and the fiery, stubborn Beverly Tapinski, who's determined to sabotage the contest. But as the competition approaches, loneliness, loss, and unanswerable questions draw the three girls into an unlikely friendship and challenge each of them to come to the rescue in unexpected ways.", "source": "Facebook", "date": "2016-07-10T14:00:00-04:00", "name": "Meet Newbery Award Winning Author Kate DiCamillo at the AADL Main Library for Discussion of New YA Novel, 'Raymie Nightingale'"}, {"url": "https://www.facebook.com/events/986817678034563/", "description": "Are you interested in learning more about how to care for our natural areas? Then join the Stewardship Network's Huron Arbor cluster for an informal discussion on a monthly topic with volunteer and professional land stewards, plus others interested in nature. Free! This month’s topic: Establishing A Rain Garden – Clean up the River, One Garden at a Time: Rain gardens are shallow gardens that collect rain water before it enters the municipal stormwater pipe system. Rain gardens alleviate flooding, recharge the ground water supply, filter water before it enters local rivers, provide habitat for wildlife, and enhance the beauty of yards and communities. Join us to discuss how you can incorporate rain gardens into your own landscapes.", "source": "Facebook", "date": "2016-07-12T07:30:00-04:00", "name": "Stewards' Circle- Establishing A Rain Garden"}, {"url": "https://www.facebook.com/events/1556397304662788/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nRyan Racine\nhttp://ryan-racine.squarespace.com/\nIt's been a twenty-plus year journey for Ryan Racine to get to where his music finds itself. Recording for the first time as a solo artist and writing without what he refers to as \"the shackles of genre\", the direction is really a culmination of the variety in his past projects. The sound is still very much grounded in American Roots music but is unbound by the narrow concepts he has applied to previous outings. \n\nRyan Racine first made a name for himself as the front man of Ann Arbor’s rockabilly outfit Lucky Haskins. Formed when he was only 15, the band burst onto the metro Detroit rockabilly scene and quickly garnered attention and a loyal fan base. Besides introducing the genre to a whole new generation in the area, they earned spots opening for legends like Carl Perkins, Johnny Cash, and Lee Rocker as well as a slot in the 1995 Detroit Music Awards.\n\nNever a cover\nAlways a good time", "source": "Facebook", "date": "2016-07-12T19:00:00-04:00", "name": "Acoustic Tuesdays: Ryan Racine"}, {"url": "https://www.facebook.com/events/635642046590268/", "description": "Aura Cacia Aromatherapy essential oils are 50% off through Thursday! Used for everything from making you smell good to massages, from soothing ailments to creating a soothing environment, essential oils have benefits big and small.", "source": "Facebook", "date": "2016-07-13T11:00:00-04:00", "name": "Aura Cacia Essential Oils 50% Off"}, {"url": "https://www.facebook.com/events/151786345231127/", "description": "Literati is pleased to welcome Stevie Edwards in support of her latest collection, Humanly.\n\nOf Humanly, Patricia Smith says, “With an unpredictability that alternately jolts and mesmerizes, Stevie Edwards has crafted an intricate exploration of life as we’d rather not know it. There is much in these stanzas to jolt and unsettle—stark crafting and a relentless respect for the possibilities of word create a tension only felt in the presence of revelation.”\n\nStevie Edwards is Editor-in-Chief at Muzzle Magazine and Senior Editor in Book Development at YesYes Books. Her first book, GOOD GRIEF (Write Bloody 2012), received the Independent Publisher Book Awards Bronze in Poetry and the Devil's Kitchen Reading Award. Her second book, HUMANLY, was released in 2015 by Small Doggies Press. She has an MFA in poetry from Cornell University, and will be starting a PhD in the English Department at the University of North Texas next fall. She currently resides in Ann Arbor, MI, and grew up in Lansing, MI. Her poems have appeared in Indiana Review, The Offing, Salt Hill, Baltimore Review, The Journal, Rattle, Verse Daily, PANK, and elsewhere.\n\nEvent date: \nWednesday, July 13, 2016 - 7:00pm", "source": "Facebook", "date": "2016-07-13T19:00:00-04:00", "name": "Poetry at Literati: Stevie Edwards"}, {"url": "https://www.facebook.com/events/1746139232293636/", "description": "Ozone House provides a safe place, shelter, and continued support to thousands of runaway, homeless and high-risk youth in our community who don't have a safe place to call home. When you shop with us on July 14th, we'll donate 10% of our sales to support the amazing work they do for young people in Ann Arbor, so mark your calendar and start making your list now!", "source": "Facebook", "date": "2016-07-14T07:00:00-04:00", "name": "Impact Day benefiting Ozone House"}, {"url": "https://www.facebook.com/events/1591964217760402/", "description": "The Suffers are here to shake up the notion that they’re another soul revival band. Just as much influenced by classic rock & roll, country, Latin and Southern hip hop as they are the Stax/Volt or Muscle Shoals era, The Suffers are bringing a fresh approach to what they have coined Gulf Coast Soul. Late night legend David Letterman proclaimed in early 2015 \"If you cant do this, get out of the business\", let it be known that The Suffers are here to stay! With a year that included performances for NPR’s Tiny Desk, Newport Folk Fest, Austin City Limits Music Festival and The Late Show, The Suffers have delivered over 150 stirring performances of their signature 3rd Coast Soul sound to thousands of new and old fans alike. The large ensemble packs each position of the rhythm and horn section with a level of talent and taste that provides the perfect foundation for singer Kam Franklin's massive voice. The band's sincerity and emotion are laid bare in their music, which has garnered an audience so broad and varied that they may prove to be the panacea for a jaded and stratified live music scene. Their 2016 self-titled debut album is set to hit shelves on February 12th and will be the continuation of what 2015's Make Some Room EP started. Expect to see the band’s name continue to climb up the tier on posters of the best festivals around!\nhttp://www.thesuffers.com\n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "source": "Facebook", "date": "2016-07-14T12:00:00-04:00", "name": "The Suffers / July 14th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE"}]