[{"url": "https://www.facebook.com/events/585713071616738/", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "source": "Facebook", "date": "2016-09-25T12:00:00-04:00", "name": "POP-X"}, {"url": "https://www.facebook.com/events/243563482709889/", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.\nEngaging with Art tours are generously supported by the Berkowitz Family Endowed Fund.", "source": "Facebook", "date": "2016-09-25T13:00:00-04:00", "name": "Guided Tour: Engaging with Art"}, {"url": "https://www.facebook.com/events/166502213757646/", "description": "The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink celebrates gifts to the museum from two accomplished scholars with eclectic interests, a keen appreciation of form, and a love of learning from objects. Nesta Spink, curator at UMMA from 1967 to 1979, is regarded as the preeminent authority on the lithographs of J a.m.es McNeill Whistler. U-M professor emeritus Walter Spink is a world-renowned specialist on early Buddhist art and architecture in India. UMMA docents will discuss the exquisite Whistler prints, a rich representation of South Asian folk art, and other highlights from their gifts", "source": "Facebook", "date": "2016-09-25T14:00:00-04:00", "name": "Guided Tour The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink"}, {"url": "https://www.facebook.com/events/1005664552885633/", "description": "Shutta Crum is an author, lecturer, teacher, and retired librarian, all in the field of children s books. Among her most popular titles are Thunder-Boomer (Clarion), which received four starred reviews, was nominated for a Cybil Award, and was an SLJ Best Book, a Smithsonian Magazine Notable Book, and an ALA Notable Book, and Mine (Knopf), which also received four starred reviews. She lives in Michigan. Learn more at www.shutta.com.\n\nKristin Bartley Lenz is a writer and social worker whose career has taken her through rural Appalachia, the California Bay Area, and inner-city Detroit. She graduated from the University of Michigan and Wayne State University, and co-edits the Michigan Chapter blog for the Society of Children’s Book Writers and Illustrators. Her debut young adult novel,The Art of Holding On and Letting Go, is a Junior Library Guild Fall 2016 Selection. Learn more at www.kristinbartleylenz.com.\n\n\nhttp://bit.ly/2bQGKoc", "source": "Facebook", "date": "2016-09-25T15:00:00-04:00", "name": "Launch Party for Shutta Crum & Kristin Bartley Lenz"}, {"url": "https://www.facebook.com/events/1160032467389616/", "description": "The Celtic Room at Conor O'Neill's Pub\n318 South Main St, Ann Arbor, MI 48104\nShow starts at 5:30pm - Doors at 5:00pm\nGeneral: $15 | Students: $12 | Kids under 10 free\n_________________________________________\nAislinn Gagliardi is an Irish harpist and composer based in Chicago, and is well sought after as a performer, teacher and recording artist. Drawing from her background in Irish dance, and influenced by a diverse musical range from classical to Cape Breton, Aislinn’s distinct style shines through her music in an open and honest way. Known for her syncopated and rhythmic accompaniment, her compositions and arrangements offer a fresh perspective to the Irish music tradition.\n\nRaised immersed in the Irish culture (the shared heritage on both sides of her family) Aislinn learned about Irish customs through dance, music and language lessons. She was drawn to the harp from an early age, and studied with various Irish and Celtic harpers including Janet Harbison and Michael Rooney. Aislinn also spent a semester abroad at the University of Limerick where she worked closely with Irish harper Fionnuala Rooney.\n\nAislinn’s recently released debut solo harp album The Thin Place has been called “stunning, a monumental piece of work from a very talented and driven harper” and “for a first CD it’s a winner” (Jack Baker of Irish American News). The album blends popular traditional Irish tunes with those less commonly played, and features four of her own compositions including one with the album’s namesake. Joining Aislinn on select tracks are some of Chicago’s finest Irish musicians: Liz Carroll (fiddle), Teresa Shine (fiddle) and John Williams (concertina). Aislinn’s tune The Thin Place and accompanying track is also featured on the Irish Traditional Music Archive’s Newly Composed Tunes and Songs in the Irish Tradition playlist. Listen to a sample here.\n\nFrom performing annually at Irish festivals including the Milwaukee Irish Fest, to private events and traditional Irish music sessions, Aislinn is in high-demand as a performer and keeps a busy schedule. She is a featured musician for the annual iBAM! (Irish Books Arts & Music) Gala Dinner, and played for celebrations honoring the opening of the Ireland: Crossroads of Art & Design, 1690-1840 exhibit at the Art Institute of Chicago.\n\nAislinn holds a B.F.A. in Inter-Arts (music and dance), an interdisciplinary major in Ethnic Studies and a certificate in Celtic Studies. She has taught workshops at the Milwaukee Irish Fest School of Music (MIFSM), the Milwaukee Irish Fest Summer School, the Great Lakes Harpers (GLH) Regional Conference, and the Madison Folk Harp Society. Currently Aislinn teaches from her private studio in Chicago and via Skype, is on faculty at the MIFSM, and teaches workshops at the Old Town School of Folk Music.\n\nVisit Aislinn on the web at www.aislinnmusic.com\n\nThis project is partially supported by an Individual Artist Program Grant from the City of Chicago Department of Cultural Affairs & Special Events, as well as a grant from the Illinois Arts Council, a state agency through federal funds provided by the National Endowment for the Arts.", "source": "Facebook", "date": "2016-09-25T17:30:00-04:00", "name": "Aislinn Gagliardi- Irish Harp Concert"}, {"url": "https://www.facebook.com/events/1048254868623346/", "description": "Join us for the next installment of Friends of babo on Sunday, September 25th at 6pm. We'll be serving four rounds of beer featuring local brews from North Peak Brewing Company and three courses of food that's perfectly paired to its counterpart beer.\n\nThis event is 21+.", "source": "Facebook", "date": "2016-09-25T18:00:00-04:00", "name": "Friends of babo: North Peak Brewing Company Beer Dinner"}, {"url": "https://www.facebook.com/events/832214916910877/", "description": "Sunday, September 29 | 8pm | 18+ | $17 adv./ $20 day of\n\nSongbook: A Night Of Stories & Songs with:\nBlitzen Trapper and special guest Kacy & Clayton\n\nOver the course of 15 years and seven full-length albums, Blitzen Trapper has crafted one of the more compelling and varied catalogs in contemporary rock and roll. Indeed, singer and guitarist Eric Earley, who is also the Portland, Oregon-based band's primary songwriter, is possessed of a musical and lyrical sensibility that is remarkably deep and wide; big ideas and universal emotions are wrung from the seemingly plainspoken details of small-screen and often highly personal stories, and set to music that reaches way, way back to old-timey folk and bluegrass, travels through everything from country, psychedelia and soul to prog, garage and metal, indulges gloriously in the classic rock of the 70s and 80s, and makes occasional side trips into hip-hop, skewed pop and noisey freakouts.", "source": "Facebook", "date": "2016-09-25T20:00:00-04:00", "name": "Songbook: A Night Of Stories & Songs with Blitzen Trapper 9/25/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1288029951210111/", "description": "The City of Ann Arbor invites the public to attend and participate in the next round of public meetings in the Ann Arbor Station Environmental Review project to discuss and comment on the Alternatives Analysis Phase II report. \n\nPublic Meeting \nMonday, September 26 \n4:00 p.m.-5:30 p.m., 6:30 p.m.-8:30 p.m. (presentations at 4:30 p.m. and 7:00 p.m.)\nLower level multipurpose room, Downtown Ann Arbor District Library, 343 S. 5th Ave., \nAnn Arbor\n\nThis Alternatives Analysis is the result of technical and environmental analysis compliant with the National Environmental Policy Act (NEPA) and public input received since February 2014. The Ann Arbor Station planning effort is led by the City of Ann Arbor with the Michigan Department of Transportation (MDOT) and the Federal Railroad Administration (FRA). The Phase II report, along with additional project information and documents, is available online at www.a2gov.org/annarborstation.", "source": "Facebook", "date": "2016-09-26T16:00:00-04:00", "name": "Ann Arbor Station Phase II Public Meeting"}, {"url": "https://www.facebook.com/events/1066706776749534/", "description": "The City of Ann Arbor invites the public to attend and participate in the next round of public meetings in the Ann Arbor Station Environmental Review project to discuss and comment on the Alternatives Analysis Phase II report. \n\nPublic Meeting \nMonday, September 26 \n4:00 p.m.-5:30 p.m., 6:30 p.m.-8:30 p.m. (presentations at 4:30 p.m. and 7:00 p.m.)\nLower level multipurpose room, Downtown Ann Arbor District Library, 343 S. 5th Ave., \nAnn Arbor\n\nThis Alternatives Analysis is the result of technical and environmental analysis compliant with the National Environmental Policy Act (NEPA) and public input received since February 2014. The Ann Arbor Station planning effort is led by the City of Ann Arbor with the Michigan Department of Transportation (MDOT) and the Federal Railroad Administration (FRA). The Phase II report, along with additional project information and documents, is available online at www.a2gov.org/annarborstation.", "source": "Facebook", "date": "2016-09-26T18:30:00-04:00", "name": "Ann Arbor Station Phase II Public Meeting"}, {"url": "https://www.facebook.com/events/1566449190330413/", "description": "Literati is delighted to welcome Margaret Lazarus Dean and Christopher Hebert back to Ann Arbor, in celebration of their recent (staff-favorite!) works. \n\nChristopher Hebert's Angels of Detroit draws us into the lives and voices of multiple characters struggling to define their futures in this desolate landscape: a scrappy group of activists trying to save the city with placards and protests; a curious child who knows the blighted city as her own personal playground; an elderly great-grandmother eking out a community garden in an oil-soaked patch of dirt; a carpenter with an explosive idea of how to give the city a new start; a confused idealist who has stumbled into debt to a human trafficker; a weary corporate executive who believes she is doing right by the city she remembers at its prime—each of these characters’ desires are as distinct as their voices, and their visions for a better city are on a collision course. In this propulsive, masterfully plotted epic, an urban wasteland whose history is plagued with riots and unrest is reimagined as an ambiguous new frontier—a site of tenacity, possibility, even hope. Driven by struggle and suspense, and shot through with a startling empathy, Christopher Hebert’s magnificent second novel unspools an American story for our time.\n\n“A humbler, more endearing bunch of rainbow-hued misfits never fumbled their broken-hearted way towards revolution than those we meet in Christopher Hebert’s Angels of Detroit–truly a novel of our moment, both in the way it stares unsentimentally at the real trouble we are in–a world of poisoned children and cities in ruins–and in the deep and detailed empathy it shows for characters of every class and provenance. Hebert gets Detroit right, in this beautifully made book: his careful drawing of its physical catastrophe locates the city at the exact boundary between gritty-real and surreal, between last hope and post-apocalyptic nightmare.”—Jaimy Gordon, author of the National Book Award-winning Lord of Misrule\n\nChristopher Hebert is the author of the novels Angels of Detroit and The Boiling Season, winner of the 2013 Friends of American Writers award. He is also co-editor of Stories of Nation: Fictions, Politics, and the American Experience (forthcoming from UT Press). His short fiction and nonfiction have appeared in such publications as FiveChapters, Cimarron Review, Narrative, Interview, and the Millions. He is a graduate of the University of Michigan and is editor-at-large for the University of Michigan Press. Currently he lives in Knoxville, TN, where he is Assistant Professor of English at the University of Tennessee.\n\n*\n\nMargaret Lazarus Dean's Leaving Orbit: Notes from the Last Days of American Spaceflight won the Graywolf Press Nonfiction Prize. In the 1960s, humans took their first steps away from the earth, and for a time our possibilities in space seemed endless. But in a period of austerity and in the wake of high-profile disasters like Challenger, that dream has ended. In early 2011, Margaret Lazarus Dean traveled to Cape Canaveral for NASA’s last three space shuttle launches in order to bear witness to the end of an era. With Dean as our guide to Florida’s Space Coast and to the history of NASA, Leaving Orbit takes the measure of what American spaceflight has achieved while reckoning with its earlier witnesses like Norman Mailer, Tom Wolfe, and Oriana Fallaci. Along the way Dean meets NASA workers, astronauts, and space fans, gathering possible answers to the question: what does it mean that a spacefaring nation won’t be going to space anymore?\n\n“Margaret Lazarus Dean is that rarest of hybrids, the dearest of hyphenates. She brings to science such exquisite sentence making, to futurism the sound anchorage of the past, to space travel the tidings of personal journey. Journalist, essayist, memoirist and storyteller—her prized text shows Americans, each and every, how we came to be the ones we are. And where we’re going. This is rocket science, reliable witness, replete with poetry.”—Thomas Lynch, author of The Undertaking\n\nMargaret Lazarus Dean received a BA in anthropology from Wellesley College and an MFA from the University of Michigan. She is the author of the novel The Time It Takes to Fall and the recipient of fellowships from the NEA and the Tennessee Arts Commission. She is an associate professor of English at the University of Tennessee.", "source": "Facebook", "date": "2016-09-26T19:00:00-04:00", "name": "Margaret Lazarus Dean & Christopher Hebert"}]