[{"date": "2016-12-01T08:00:00-05:00", "description": "All week, all Garden of Life products are 35% off! That includes plant-based protein supplements, vitamins, and even special products just for kids. Stop in to chat with our friendly and knowledgable Natural Living team, and stock up on wellness!", "url": "https://www.facebook.com/events/144098819397112/", "name": "35% Off Garden of Life", "source": "Facebook"}, {"date": "2016-12-01T16:00:00-05:00", "description": "Come join us for some Holiday Make & Take family fun!\nCreate your own \"traditional\" style Holiday stocking or make a fun paw print stocking for the four-legged member of your family. This workshop gives a soft introduction to machine sewing paired with vinyl cutter fun and sealed with our heat press. No prior knowledge or experience necessary, fun for all ages!\n\nPlease arrive 10 minutes early if this is your first time to Maker Works. \nRegister at http://www.supersaas.com/schedule/makerworks/CheckOut?day=1&month=12&year=2016&view=day or call 734-222-4911.", "url": "https://www.facebook.com/events/1891057434457925/", "name": "Family Make & Take: Holiday Stockings - $35/person - 1.5hrs", "source": "Facebook"}, {"date": "2016-12-01T18:00:00-05:00", "description": "Every year, we ask members of the community to join us for an end-of-year potluck at the Jim Toy Community Center. This is an opportunity to meet and network with members of our board and reflect/celebrate the year.\n\nIt is also an opportunity to volunteer to help the Center thrive. In addition to enjoying good food and one another's company, we ask that attendees please help us prepare our end-of-year mailing. In past years, we've had such incredible turnout that this portion of the evening has been relatively quick.\n\nPlease sign up for the potluck at the form below:\nhttps://docs.google.com/spreadsheets/d/1_Y5Qz-s_YBVdzDtFn2K-gatv0Pz08XQw5Vqs1IdI0rM/edit#gid=0", "url": "https://www.facebook.com/events/1855141028106007/", "name": "End-of-Year Potluck & Envelope Stuffing Party", "source": "Facebook"}, {"date": "2016-12-01T19:00:00-05:00", "description": "Come join us for some Holiday Make & Take family fun!\nCreate your own \"traditional\" style Holiday stocking or make a fun paw print stocking for the four-legged member of your family. This workshop gives a soft introduction to machine sewing paired with vinyl cutter fun and sealed with our heat press. No prior knowledge or experience necessary, fun for all ages!\n\nPlease arrive 10 minutes early if this is your first time to Maker Works. \nRegister at http://www.supersaas.com/schedule/makerworks/CheckOut?day=1&month=12&year=2016&view=day or call 734-222-4911.", "url": "https://www.facebook.com/events/357215301307904/", "name": "Family Make & Take: Holiday Stockings - $35/person - 1.5hrs", "source": "Facebook"}, {"date": "2016-12-01T19:00:00-05:00", "description": "James Boggs (1919-1993) and Grace Lee Boggs (1915-2015) were two largely unsung but critically important figures in the black freedom struggle. Born and raised in Alabama, James Boggs came to Detroit during the Great Migration, becoming an automobile worker and a union activist. Grace Lee was a Chinese American scholar who studied Hegel, worked with Caribbean political theorist C. L. R. James, and moved to Detroit to work toward a new American revolution. As husband and wife, the couple was influential in the early stages of what would become the Black Power movement, laying the intellectual foundation for racial and urban struggles during one of the most active social movement periods in recent U.S. history. \n\nStephen Ward details both the personal and the political dimensions of the Boggses' lives, highlighting the vital contributions these two figures made to black activist thinking. At once a dual biography of two crucial figures and a vivid portrait of Detroit as a center of activism, Ward's book restores the Boggses, and the intellectual strain of black radicalism they shaped, to their rightful place in postwar American history.\n\nStephen Ward, Associate Professor at the University of Michigan Residential College, is a historian in the Social Theory and Practice program and is jointly appointed in the Department of Afroamerican and African Studies. He was the founding coordinator of the Urban Studies minor and serves as the faculty director of the Semester in Detroit program. He teaches courses in African American history, urban and community studies, and Detroit history. He is the author of In Love and Struggle: The Revolutionary Lives of James and Grace Lee Boggs (2016) and the editor of Pages From a Black Radical's Notebook: A James Boggs Reader (2011). He is a board member of the James and Grace Lee Boggs Center to Nurture Community Leadership in Detroit.", "url": "https://www.facebook.com/events/649877431853670/", "name": "Meet U of M RC Prof & Author Stephen Ward", "source": "Facebook"}, {"date": "2016-12-01T22:30:00-05:00", "description": "Come out of the cold and see some of your favorite Burlesque performers! Also, an amazing live band! Doors at 9:30p, show at  10:30p\n\nFeaturing:\nGala Delicious\nBethany Cinna Moan\nKitt Y. Bourree \nSadie Sparkles \nThe hostest with the mostest: Bunny Valentine\n\nLive band Krillin!\n\nGogo from Kitty Hawkk and Sophia LeStardust!", "url": "https://www.facebook.com/events/978748282251935/", "name": "Snow Queens of Cups", "source": "Facebook"}, {"date": "2016-12-02T10:00:00-05:00", "description": "Don't miss our holiday display Avant Garden: Weaving Fashion & Nature Together. The exhibit explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs Saturday, November 26, 2016-Sunday, January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "url": "https://www.facebook.com/events/723312037871156/", "name": "Holiday Exhibit - Avant Garden", "source": "Facebook"}, {"date": "2016-12-02T16:00:00-05:00", "description": "Beginning November 4th, GameStart will be hosting a six-week series of Open House workshops called GameLab. Each week will feature a FREE to participate class, rotating* between two of GameStarts most popular courses: Game Creation with Unity and Minecraft Python Programming. Students are invited to try out and retake each class as often as they'd like during the six-week term.\n\nGameLab Course Schedule:\nDecember 2nd, 4:00pm - 5:00pm: Game Creation with Unity\nDecember 9th, 4:00pm - 5:00pm: Minecraft Python Programming\nDecember 16th, 4:00pm - 5:00pm: Game Creation with Unity", "url": "https://www.facebook.com/events/958976467569002/", "name": "GameLab: Game Creation with Unity (4/6)", "source": "Facebook"}, {"date": "2016-12-02T17:00:00-05:00", "description": "It’s party time in the Main Street Area! Stores stay open late with lots of holiday specials including deals, discounts, sweets and treats. While you shop enjoy the sidewalk entertainment, and say hello to Santa Claus and Miss Washtenaw County, who will be roaming the sidewalks from 7-9pm! Join local business owners as they roll out the red carpet and welcome guests with extra special savings.\n\nFor more information and a full list of participating retailers visit www.mainstreetannarbor.org", "url": "https://www.facebook.com/events/1784751885141397/", "name": "Midnight Madness", "source": "Facebook"}, {"date": "2016-12-02T17:00:00-05:00", "description": "Known for high caliber art work, the Ann Arbor Potters Guild sale features the work of more than twenty artists and is the perfect \"go to\" for your holiday gifts. It takes place on Saturday and Sunday, December 3 & 4 from 10 am to 5 pm. New this year is an Opening Night party on Friday, December 2 from 5-8 pm.", "url": "https://www.facebook.com/events/345324652488819/", "name": "A2 Potters Guild Winter SALE", "source": "Facebook"}]