[{"date": "2016-06-14T07:30:00-04:00", "source": "Facebook", "description": "Are you interested in learning more about how to care for our natural areas? Then join the Stewardship Network's Huron Arbor cluster for an informal discussion on a monthly topic with volunteer and professional land stewards, plus others interested in nature. Free! \nThis month’s topic: Join staff and representatives of the Huron-Arbor Cluster for a lively discussion of ongoing programs and new opportunities at the Stewardship Network. Topics will range from the Garlic Mustard Challenge to new TSN staff in Clusters across the Great Lakes and New England!", "url": "https://www.facebook.com/events/1550798168561405/", "name": "Stewards' Circle- The Stewardship Network"}, {"date": "2016-06-14T12:00:00-04:00", "source": "Facebook", "description": "NEW SPRING MENUS!\n\nNew season, new Menu. Introducing new menu items that are seasonally fresh, bright, and delicious!\n\nBringing all things spring to the table, with new colorful and locally sourced food and beverage options. \n\nCheck out our new menus at http://aventuraannarbor.com \n\nMAKE A RESERVATION\nClick link listed in \"Tickets Available\"", "url": "https://www.facebook.com/events/478741615584046/", "name": "New Spring Cocktail & Dinner Menus"}, {"date": "2016-06-14T15:00:00-04:00", "source": "Facebook", "description": "A community gathering in downtown Ypsilanti on Tuesday, June 14th. \n\nDuring the farmers market, there will be volunteers passing out chalk to share messages on the sidewalk, then later the community will meet outside the downtown library on Michigan ave at 7:00pm, everyone is welcome to bring candles to light. Chalk will be available to share messages of love on the sidewalks through downtown. Flowers can be left at the fountain to show love and peace. Please share this event with your friends, loved ones, neighbors, and strangers. People and organizations will be able to speak in front of the library. \n\nPlease stop by the farmers market during the afternoon or meet at the library at 7pm. \n\n #PeaceLoveOrlando\n\nFarmers market it 3-7pm\n\nVigil is 7pm at the library\n\nI had to create a second one to make it a public event. The original will stand.", "url": "https://www.facebook.com/events/1049899268427355/", "name": "Vigil for Orlando"}, {"date": "2016-06-14T19:00:00-04:00", "source": "Facebook", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-June 14 Jon Ponder Trio\n\nBased in Ann Arbor, Michigan, Jon Ponder is a singer/songwriter and a librarian with a passion for preserving and telling good stories. Using acoustic roots instrumentation and styles that range from old-time string band music to country to Americana folk and folk-rock, Jon writes songs with memorable melodies, clear images, and stories that take listeners to specific times, places, and experiences. For this performance, Jon will be joined by Eric Anderson on banjo and mandolin and Azalea Grace on harmony vocals\n\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/978649115584453/", "name": "Acoustic Tuesdays: Jon Ponder Trio"}, {"date": "2016-06-14T20:00:00-04:00", "source": "Facebook", "description": "A community-wide performance of Mozart's Requiem in memory of the victims of Sunday's massacre in Orlando. The performance will be held at 8 pm in Hill Auditorium. Admission is free. \n\nAll peaceful individuals, regardless of race, creed, sexuality, gender, and background are welcome to be present for this event, either as a performer or listener. The work is not being performed in the context of a religious service; however, we must acknowledge that it is from theChristian tradition. If there are particular professions of faith in the text with which you are not comfortable (i.e. the speaking of the name G-d in any language), please feel free to observe a personal silence at these moments. There will be guest speakers who offer poetry and comments, and there will be a single ecumenical, pan-faith reflection offered.\n\nPlease share this widely and freely.", "url": "https://www.facebook.com/events/1196514203692732/", "name": "Requiem for Orlando"}, {"date": "2016-06-15T00:00:00-04:00", "source": "Facebook", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $28 for a three course dinner! \n\nThe Main Street Area Association (Main Street Area Ann Arbor) is proud to bring you Ann Arbor's favorite semi-annual dining event - Restaurant Week!\nThe specials run June 12-17th. Visit www.annarborrestaurantweek.com for details.", "url": "https://www.facebook.com/events/725944687548567/", "name": "Ann Arbor Restaurant Week"}, {"date": "2016-06-15T07:00:00-04:00", "source": "Facebook", "description": "For just one day, our whole supplements department is 30% off! Vitamins, protein supplements, tinctures, and so much more- stock up on wellness!", "url": "https://www.facebook.com/events/599624360199105/", "name": "30% Off Supplements- One Day Only!"}, {"date": "2016-06-15T11:00:00-04:00", "source": "Facebook", "description": "We are gearing up for another week of culinary bliss during Ann Arbor's summer Restaurant Week! \n\nWe are featuring these special menus available in addition to our regular menu all week long.  \n-------------------------------------------------------------------------------\nSummer Restaurant Week 2016\n-------------------------------------------------------------------------------\nTwo for $15 lunch\nTax and gratuity not included\n•\tChoose one entrée for each person\no\tBBQ Tofu Sandwich\no\tWhitefish Po-boy\no\tChicken BLT\no\tCaesar Salad\no\tCherry Almond Salad\n-------------------------------------------------------------------------------\nTwo for $28 dinner per person\nTax and gratuity not included\n\nAppetizer\nTo share, please choose one\n•\tFried Pickle Spears \n•\tTruffle Sprouts\n•\tHummus and Pita \n\nEntree\nEach guest chooses one entree\n•\tMac and Cheese\n•\tFish and Chips\n•\tUrban Cowboy Bean Burger\n•\tAr-burger\n\nDessert or Beer\nTo share, please choose one\n•\tStout Chocolate pudding cake\n•\tStrawberries and Cream Belgian waffle\n•\tMaple Bourbon Bread Pudding\n\nNot interested in dessert? Swap it out for your choice of two 16oz drafts", "url": "https://www.facebook.com/events/1008482025896787/", "name": "Restaurant Week"}, {"date": "2016-06-15T18:30:00-04:00", "source": "Facebook", "description": "Thursdays through Sundays June 9-26.  Check out Tickets Available link for arb member advance ticket info plus note Summer 2016 construction impacting arboretum area parking & traffic.  Arrive early for tickets and time to walk to location of the first scene.", "url": "https://www.facebook.com/events/235874080125426/", "name": "Shakespeare in the Arb 2016 - Love's Labour's Lost Opening Week"}, {"date": "2016-06-15T19:00:00-04:00", "source": "Facebook", "description": "Literati is pleased to host Megan Tompkins-Stange in support of her book Policy Patrons: Philanthropy, Education Reform, and the Politics of Influence.\n\nPolicy Patrons offers a rare behind-the-scenes view of decision making inside four influential education philanthropies: the Ford Foundation, the W. K. Kellogg Foundation, the Bill & Melinda Gates Foundation, and the Eli and Edythe Broad Foundation. The outcome is an intriguing, thought-provoking look at the impact of current philanthropic efforts on education. Over a period of several years, Megan E. Tompkins-Stange gained the trust of key players and outside observers of these four organizations. Through a series of confidential interviews, she began to explore the values, ideas, and beliefs that inform these foundations’ strategies and practices. The picture that emerges reveals important differences in the strategies and values of the more established foundations vis-à-vis the newer, more activist foundations—differences that have a significant impact on education policy and practice, and have important implications for democratic decision making. In recent years, the philanthropic sector has played an increasing role in championing and financing education reform. Policy Patrons makes an original and invaluable contribution to contemporary discussions about the appropriate role of foundations in public policy and the future direction of education reform.\n\n\"Policy Patrons takes us deep inside traditional and venture philanthropies to learn, in the unfiltered words of decision makers, about profound shifts affecting public education and the practice of democracy. Tompkins-Stange has delivered an eye-opening portrait of this fast-changing field.\" — Dale Russakoff, author of The Prize: Who’s in Charge of America’s Schools?\n\nMegan E. Tompkins-Stange is an assistant professor at the  Gerald R. Ford School of Public Policy  at the University of Michigan.", "url": "https://www.facebook.com/events/661311077358368/", "name": "Megan Tompkins-Stange"}]