[{"date": "2016-05-07T07:00:00-04:00", "description": "Pucker up! All cosmetics and facial care are 25% off Friday through Sunday, so stock up for yourself or someone you love <3", "url": "https://www.facebook.com/events/1060585290673795/", "source": "Facebook", "name": "25% Off Cosmetics and Facial Care"}, {"date": "2016-05-07T09:00:00-04:00", "description": "Garlic Mustard Weed-Out Day is an annual tradition! On one day, volunteers hand-pull invasive garlic mustard in natural areas all around Ann Arbor! Garlic mustard is an aggressive invasive plant which can quickly crowd out native plant species and decrease natural diversity in the woods. Identifying and pulling garlic mustard is fun and easy for all ages, making this is a great volunteer opportunity for families. \nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free. \nParticipating parks:\n•\tArgo - Meet at the north end of the Argo Canoe Livery parking lot near the entrance to the woods, 1055 Longshore Drive.\n•\tCedar Bend  - Meet us at the Island Park parking lot, at the end of Island Drive\n•\tHannah - Meet at the west end of Bath Street, off 7th, just north of Huron.\n•\tMarshall - Meet in the parking lot off Dixboro Road, north of Plymouth Road\n•\tMiller - Meet at the Arborview Boulevard entrance, just east of Wildwood Avenue.\n•\tWhite Oak - Meet at the park entrance on White Oak Drive.", "url": "https://www.facebook.com/events/1699521606955785/", "source": "Facebook", "name": "Garlic Mustard Weed-Out Day!"}, {"date": "2016-05-07T10:00:00-04:00", "description": "Every year, on the first Saturday in May, Vault of Midnight takes part in Free Comic Book Day. This is a nationwide event in which free comic books rain down from the heavens into the hands of THOUSANDS of eagerly awaiting fans and unsuspecting bystanders alike. The goal of the event is to spread the word about comic books and to share with the curious (but uninitiated) an approachable, inexpensive way to get introduced to what the medium has to offer. \n\nAnn Arbor loves Free Comic Book Day. Every year comic book fans from all over South Eastern Michigan travel to Ann Arbor on a sacred yearly pilgrimage of nerdy enlightenment. This year travelers can expect even more amazing cosplay, trivia, high-fives, and FREE comics than ever before. The Vault staff will be opening the doors to the ever sought-after Sales Grotto with it's treasures aplenty, and will be constructing a Great Wall of Comics filled with their favorite trade paperbacks. Some killer local businesses wanted to get in on the mix and will be offering deals to anyone who visits them with a Free Comic Book Day bag. Participants include:\n\nBeer Grotto\nCherry Republic\nConor O'Neill's\nEspresso Bar\nLiterati Bookstore\nMichigan Theater & State Theatre\nMoosejaw\nOld Town\nShinola\nSpencer\nFjallraven", "url": "https://www.facebook.com/events/976597525749572/", "source": "Facebook", "name": "Free Comic Book Day"}, {"date": "2016-05-07T10:00:00-04:00", "description": "Is your medicine cabinet full of expired drugs or medications you no longer use? Keep prescription drugs out of the wrong hands by bringing them to our next event.\n\nThe Division of Pain Research (Dept of Anesthesiology, University of Michigan) and Ann Arbor Police Department are partnering together on Saturday, May 7 from 10-2PM to collect unwanted, expired, or unused pain medicines. Dispose of your pain medications safely at this free event!\n\nhttps://medicine.umich.edu/dept/pain-research/events/201605/may-7-2016-pain-medication-take-back-event", "url": "https://www.facebook.com/events/244448292574244/", "source": "Facebook", "name": "Pain Medication Take-Back Event UM/Ann Arbor Police Department"}, {"date": "2016-05-07T11:00:00-04:00", "description": "Literati is delighted to welcome Wendy BooydeGraff, author of Salad Pie, to a very special story time. Kids of many ages are welcome to attend. Free and open to the public.\n\nAbout the book: There is nothing sweeter than arriving at the playground, seeing it empty, and knowing you have it all to yourself--the silent comfort of playing alone. Maggie is overjoyed to have that solitude to make her Salad Pie. But then Herbert saunters over and wants to play too. \"I'm making salad. Salad Pie. And don't you touch it!\" Herbert just wants to help, even though Maggie makes it clear she won't let him. Then her imaginary pie takes a spill, and she realizes Herbert's intentions are not so bad after all.\n\nWendy BooydeGraaff grew up making mud pies on a fruit farm in Ontario, Canada. She now lives in Michigan with her family, where she whips up all kinds of salads and all kinds of pies.\n\nEvent date: \nSaturday, May 7, 2016 - 11:00am", "url": "https://www.facebook.com/events/1566275347035929/", "source": "Facebook", "name": "Story Time with Wendy Booydegraff"}, {"date": "2016-05-07T11:00:00-04:00", "description": "Of COURSE you're buying flowers for your mother this Mother's Day weekend, and we're here to wrap them for you for free! Gilding the lily, daisy, or rose for your mama <3", "url": "https://www.facebook.com/events/1781874288712388/", "source": "Facebook", "name": "Free Flower Wrapping"}, {"date": "2016-05-07T11:00:00-04:00", "description": "In addition to learning about drinking water, two art exhibits will be available for viewing.  All of the submissions to the city's Art in the Sky contest will be on display, along with artwork by Penny W. Stamps School of Art and Design students who have illustrated their interpretation of the theme, \"Imagine a Day Without Water.\" Free water bottles and refreshments will be available. \n\nSaturday, May 7th\n11am to 3pm\n\n919 Sunset Rd\nAnn Arbor, MI 48103\n(734) 794– 6426", "url": "https://www.facebook.com/events/1513835392257274/", "source": "Facebook", "name": "Water Treatment Plant Open House"}, {"date": "2016-05-07T11:00:00-04:00", "description": "Nicola's Books is an official Children's Book Week store and we have put together a great Special Story Time for you.  We will have local picture book authors Shanda Trent and Melanie Zwegers coming who will read their books and as a special treat The Library Mouse will also stop by for a visit!  So bring you youngsters and have some fun.", "url": "https://www.facebook.com/events/504261986425250/", "source": "Facebook", "name": "Special Story Time w/Shanda Trent, Melanie Zwegers & The Library Mouse will Visit Too!"}, {"date": "2016-05-07T13:30:00-04:00", "description": "“Oh, the thinks you can think” when Dr. Seuss’s best-loved stories collide and cavort in an unforgettable musical caper! Adapted from the Broadway version, this adaptation especially for young audiences features thirteen actors and enhanced production values. Seussical is TheatreworksUSA’ biggest show ever!\nYouth Theatre\nPresented By: Toyota, Benard L. Maas Foundation\nNicola's Books will be there selling Seuss books", "url": "https://www.facebook.com/events/243086976043980/", "source": "Facebook", "name": "Not Just For Kids Series: Seussical"}, {"date": "2016-05-07T19:00:00-04:00", "description": "AFC Ann Arbor will compete in their inaugural NPSL match, Saturday, May 7th vs. the Dayton Dynamo. \n\nFirst 250 fans receive a free commemorative poster. \nRide the Shuttle for FREE! From Arbor Brewing to Hollway. \nEnjoy donut and ice cream food trucks every match. \nAdult tickets $8 // Youth tickets $5 (in advance) ($10/$6 at gate)", "url": "https://www.facebook.com/events/631012520381314/", "source": "Facebook", "name": "AFC Ann Arbor vs. Dayton Dynamo - NPSL Home Opener"}]