[{"date": "2016-08-13T09:00:00-04:00", "name": "Bright Rec/Torn Shirt Trail Days", "description": "Please help us finish the fantastic addition and re-route that has been added to Torn Shirt. We will have two back-to-back trail days on Saturday and Sunday, from 9am-1pm both days.  You'll be helping us add the finishing touches to this new section. Tools will be provided.\n\nWe will meet at the trail head at Bishop Lake  at 9:00 and then split up into groups.", "url": "https://www.facebook.com/events/636392859875157/", "source": "Facebook"}, {"date": "2016-08-13T09:00:00-04:00", "name": "Olson Park Stewardship Workday", "description": "This park has come a long way from its past as a gravel quarry. Now bicyclists, dog owners, soccer players and hikers all use it. Volunteers are needed to hand-pull invasive weeds where they are invading open meadows. There are several uncommon species of butterflies in this park that use these open spaces. Please meet at the entrance on Dhu Varren Road, just east of Pontiac Trail. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/280716698937457/", "source": "Facebook"}, {"date": "2016-08-13T11:00:00-04:00", "name": "Paws for a Cause with the Huron Valley Humane Society", "description": "Join the Humane Society of Huron Valley and SW  in raising funds for our furry friends.\n\nGet a drink & and we’ll provide a treat for your pup! 30% of drink proceeds go to HSHV.\n\nAlso, meet great dogs looking for their forever homes.", "url": "https://www.facebook.com/events/1729212003999250/", "source": "Facebook"}, {"date": "2016-08-13T12:00:00-04:00", "name": "Build Your Own Burger Bar", "description": "It's back- build your own burger! Our all-natural burgers + your fave toppings, $5.", "url": "https://www.facebook.com/events/694072357407148/", "source": "Facebook"}, {"date": "2016-08-13T16:00:00-04:00", "name": "Icebreakers^2", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/1769408583305605/", "source": "Facebook"}, {"date": "2016-08-13T20:00:00-04:00", "name": "Bobrauschenbergamerica", "description": "“Art is made in the freedom of the imagination with no rules”\n\n\"bobrauschenbergamerica\" is a fast paced non-traditional slice of life story revolving around relationships, explored through wacky images, poetry, jokes, dance, and more, providing a wild look at American culture. \n\nWritten by Charles L. Mee. Featuring: Danielle Clevenger, Elizabeth Dieterich, Rick Eva, Alanna Elling, Mark Isler, Kelsea Kerkes, Josie Lapczynski, Sara Long, Jeffery Stringer, and James Walrod. \n\nFriday, August 12 @ 8 pm \nSaturday, August 13 @ 8 pm\nSunday, August 14 @ 7 pm", "url": "https://www.facebook.com/events/494075117454653/", "source": "Facebook"}, {"date": "2016-08-13T20:00:00-04:00", "name": "KTRL at Club Above", "description": "Electric Playground Entertainment presents:\n\nKTRL\n\nHaving roots in Chicago, KTRL is redefining the music scene with his unique sound. With a catalogue of released music on a multitude of labels such as Buygore, EDM.com, Resistance Records and a few others, Adam is gaining support from the likes of Oliver Hendens, Dr. Fresch, Borgore, Ghastly, and more.\nKTRL is hastily readying for what the future is going to bring; with a backlog of unreleased music being meticulous planned to be released throughout the remainder of 2016 and multiple shows already being lined up, KTRL will be on the tip of everyone’s tongue in 2017.\n\nNickyBoom\n\nNick Stong AKA NickyBoom. 29 years old originally from Milwaukee, WI. Now I live in the music heavy Detroit. I've been listening to electronic music since I've been 13 and produced my first track when I was 20. I've played alongside artists as Datsik, Excision, Luminox, Protohype, InIt, Riot Ten and AFK. Music is what defines me and I just like to get down, and when I'm playing I just like everyone to dance with me. That's what it's all about. Forget the genres, forget the drama....just dance. New music coming soon! Be on the lookout for what I release! And enjoy what I do. \n\nTrauma Kidd\n\nTrauma Kidd has been involved in Electronic music since the late 90's being involved in the warehouse scene in columbus Ohio. Many years went by as a spectator until recently when he decided to hit the decks all over again. Inspired by the variety of electronic music out there depending on the crowd and location no one set is the same. He has been tearing it up in North carolina for the last two years. He is an up and coming talent you won't want to miss in columbus. He has opened for AC Slater, Roevy, Buku,Rusko, Trill Clinton, Crizzly, Milo& Otis, and regulators. \n\nCass Wasacz\n\nCameron “Cass” Wasacz is a 21 year old DJ/Music Producer, Drummer, and Lighting Specialist. Raised in Detroit, MI, Cam infuses his love for Metal/Rock/Funk with electronic production. And not only stops at sound design but brings the full show to his live performances with a spectacular lighting experience. He’s transformed the underground scene with his lighting company ProLux Entertainment. Allowing upcoming bands, rappers and produces like himself to experience the next level during their performances. \n\nCass has supported many names that have made their way through michigan including: Kayzo, Liquid Stranger, Jackal, Party Thieves, Vaski, MUST DIE!, TrollPhace, Eptic and the DiscoTech Heroes!\n\nQuack Attak\n\nQuack Attak is an up and coming Detroit based DJ and producer dedicated to various genres of house and techno. Growing up in, and around Detroit, he was influenced by many genres of music such as motown, disco, funk, soul, house, techno, and many more. Quack Attak began his quest to express himself through the speakers after being reintroduced to the dance music scene in 2013. Since then, he has dedicated his life to sharing his experiences with the next generation of music lovers. \n\nPocketMonsta\n\nAt level 21, the dirty beat challenger Shay Smith aka PocketMonsta has been making her way into Detroit’s electronic music scene. Born and raised in Metro Detroit by a tech head/rocker father she was hooked on dirty beats at a young age. Some of her early influences include LCD Soundsystem, Nine Inch Nails, and The Flaming Lips. She began her musical journey with the guitar and flute, which she hopes to incorporate into some filthy tunes. Currently she’s in the works of producing a variety of genres that come from the rhythm of the heart and her desire to inspire. From her bouncy house drops to her love of percussive, funky beats, she aims to provide a brilliant booty shakin experience that makes you let it all loose on the dance floor.\n___________________________________________________\n\nLighting provided by ProLux Entertainment\n\nProLux Entertainment focuses on putting on the best quality show for every event! We specialize in lighting/sound & stage production and offer multiple stage set ups - perfect for any venue space.\n___________________________________________________\n\nVendors\n\nPhiber Printing\n\nPhiber. /Fy-búr/. \n\n1. The movement of who you are, what you believe and the means to express it. \n\nHeather Alyson - Cosmic Kisses\n___________________________________________________\n\nPhotography by CUTE but PSYCHO Photography\n___________________________________________________\n\nVIP TABLES/BOTTLE SERVICE: ELECTRICPLAYGROUNDENT@GMAIL.COM\n\nDoors 8pm\n18+ with valid ID\n21+ to drink\n\nTickets: http://Eventbrite.com/e/ktrl-at-club-above-tickets-26675849183", "url": "https://www.facebook.com/events/868707606568472/", "source": "Facebook"}, {"date": "2016-08-14T09:00:00-04:00", "name": "Bright Rec/Torn Shirt Trail Days", "description": "Please help us finish the fantastic addition and re-route that has been added to Torn Shirt. We will have two back-to-back trail days on Saturday and Sunday, from 9am-1pm both days.  You'll be helping us add the finishing touches to this new section. Tools will be provided.\n\nWe will meet at the trail head at Bishop Lake  at 9:00 and then split up into groups.", "url": "https://www.facebook.com/events/636392859875157/", "source": "Facebook"}, {"date": "2016-08-14T14:00:00-04:00", "name": "Guided Tour - Catherine Opie: 700 Nimes Road", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.\n￼\nEngaging with Art tours are generously supported by the Berkowitz Family Endowed Fund.", "url": "https://www.facebook.com/events/552129054974239/", "source": "Facebook"}, {"date": "2016-08-14T14:00:00-04:00", "name": "Stanley Cup and Kevin Porter at Jolly Pumpkin!", "description": "Former University of Michigan hockey standout and Hobey Baker award winner Kevin Porter just won the 2016 Stanley Cup with the Pittsburgh Penguins.  He will be bringing the Cup back to his home state to share with his many fans on August 14th from 2pm to 5pm at the Jolly Pumpkin restaurant.\n \nFor a donation of $10 take your photo with @kporter12 and the Cup.  All proceeds benefit Athletes Connected. #stanleycup #hockey #annarbor\n\nFor more information about @Aths_Connected please visit http://athletesconnected.umich.edu.", "url": "https://www.facebook.com/events/821495207950213/", "source": "Facebook"}]