[{"description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "date": "2017-02-24T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/230775294023258/", "name": "Exhibit: Avant Garden-Fashion & Plants Together!"}, {"description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "date": "2017-02-24T11:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1724899501156129/", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration"}, {"description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "date": "2017-02-24T15:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1138729056224663/", "name": "Drink & Draw / Imbibe & Inscribe"}, {"description": "There's no winter warmer like the Winter Beer Festival! Join us in Comstock Park for the Michigan Brewers Guild's annual Winter Beer Festival. Beer list forthcoming! Saturday is sold out, but get your Friday tickets here: http://www.mibeer.com/winter-festival", "date": "2017-02-24T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/634509003388839/", "name": "Winter Beer Festival"}, {"description": "Coffee and board games are a part of a long, sacred partnership; each is enhanced and made better by the other. Scholars have argued that neither can actually be enjoyed at all on their own and I think that they may be on to something. 'Twas ever thus. \n\nIn the spirit of this storied tradition, Vault of Midnight is happy to be partnering up with our friends over at Roos Roast for what is destined to be a pretty kick butt night of board gaming, friendship building, and coffee drinking. \n\nFor a mere $8, you may secure your spot and join in the raucous game-playing and general merriment. Tickets are available at Vault of Midnight Ann Arbor and will not only grant you entry to this event, but will also serve as a voucher for one Roos Roast beverage. AND THAT'S SOMEHOW NOT ALL: your ticket ALSO acts as a 10% off one game coupon! What a busy little ticket!\n\nTICKETS ON SALE NOW!", "date": "2017-02-24T18:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/225509001252321/", "name": "Game Night at Roos Roast"}, {"description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2017-02-24T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/195810100885174/", "name": "Wine, Women, and Song XV"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: With Wieck \nGroup 2: Homemade Bangs\nGroup 3: The League of Pointless Improvisers", "date": "2017-02-24T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/241522596300279/", "name": "Pointless Improv with With Wieck and Homemade Bangs"}, {"description": "Desmond Jones is a five-piece funk/rock/jazz fusion band from Grand Rapids, Michigan. With original music written to compliment the group's sound as a whole, the music is centered around melodic guitar riffs, smooth bass lines, funky drum beats, and tasteful saxophone. \n\nDesmond Jones puts on exciting and high energy shows and is proud to say that each set list and each song is different from show to show. \n\nwww.desmondjonesband.com\n\nThe North 41 (Chicago)\n\nThe North 41 is a dynamic blend of Rock, Funk, and Jazz, with the danceability of Pop music and sophisticated musicianship that keeps you hanging on every guitar solo, every drum solo, and every whaling vocal lick.\n\nwww.thenorth41.com\n\nPajamas\n\n\"This jam-heavy group know how to make you groove (with or without pajamas). The guitar is melodic and jazzy with epic bass runs and rhythmic drums, all with their own unique style. We’d love to see what these guys have in store in terms of a full-length release (fingers crossed!). They’re definitely masters of their craft and will most likely pajama-jam your socks right off.\"", "date": "2017-02-24T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/104388773403079/", "name": "Desmond Jones, The Blind Pig, Ann Arbor, MI"}, {"description": "Ann Arbor native, Just-B’s love for music started when he was 8 years old as a break-dancer. Today he uses traditional mixing techniques to blend music from all genres and all generations to get people moving. This DJ plays everything but loves hip hop, reggae, Booty and Tech House. \n\nJoin us Friday the 24th as DJ Just-B is joined by special guest Groovematist!", "date": "2017-02-24T22:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/739917182843383/", "name": "Social Friday"}, {"description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\nNo two shows are the same!\nTickets are $10.", "date": "2017-02-24T22:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1481562925217071/", "name": "A Pointless Display of Improvised Feats"}]