[{"description": "This event is geared toward downtown Ann Arbor employees. \nDrop in to this casual informational workshop to find out how these bus service improvements could impact your bus commute. \n\nAlso welcome are any employees who may be interested in taking to bus but are unsure what to do.\n\nFree lunch and giveaways provided!\nRSVP: https://www.messageblocks.com/commute-by-bus", "name": "Commute By Bus? May Service Improvements Explained", "source": "Facebook", "date": "2016-04-12T12:00:00-04:00", "url": "https://www.facebook.com/events/1692753224315937/"}, {"description": "The Zell Visiting Writers Series Presents:\n\nAlice McDermott \nZell Distinguished Writer in Residence\nFiction Reading and Book Signing\nTuesday, April 12th, 5:30pm \nUMMA Apse\n\nAlice McDermott: In Conversation with Peter Ho Davies\nThursday, April 14th, 5:30 pm\nUMMA Helmut Stern Auditorium \n\nAll events free & open to the public.\n\n* * *\nAlice McDermott is an American writer and university professor. For her 1998 novel Charming Billy she won an American Book Award and the U.S. National Book Award for Fiction.\n\nMcDermott is Johns Hopkins University's Richard A. Macksey Professor of the Humanities. Born in Brooklyn, New York, McDermott attended St. Boniface School in Elmont, New York, on Long Island (1967), Sacred Heart Academy in Hempstead (1971), and the State University of New York at Oswego, receiving her BA in 1975. She received her MA from the University of New Hampshire in 1978.\n\nShe has taught at UCSD and American University, has been a writer-in-residence at Lynchburg College and Hollins College in Virginia, and was lecturer in English at the University of New Hampshire. Her short stories have appeared in Ms., Redbook, Mademoiselle, The New Yorker and Seventeen. She has also published articles in the New York Times and Washington Post.\n\nMs. McDermott lives outside Washington, D.C. with her husband, a neuroscientist, and three children.\n\nFor more info, please visit: https://events.umich.edu/event/26829", "name": "Alice McDermott Fiction Reading & Book Signing", "source": "Facebook", "date": "2016-04-12T17:30:00-04:00", "url": "https://www.facebook.com/events/546120148869085/"}, {"description": "Peppercorns could well be said to have changed the world. Economically, politically and culturally, because it was the pursuit of pepper that led Columbus to sail west across the Atlantic. Culinarily because the Columbian Exchange that followed brought tomatoes, potatoes, corn and cacao to the Eastern Hemisphere; cows, goats, and pigs among others went west. And, probably above all, because very few of us sit down to eat a meal that hasn’t been spiced with peppercorns in one way or another.\n\nFor this special meal we’ve put together the culinary talents of Roadhouse Chef Alex Young and Philippe de Vienne, master pepper trader for over thirty years. Together they’ve put together a menu that features some of THE finest peppercorns the world has to offer, all right here at the Roadhouse in form of one delicious meal, all personally selected the de Vienne family who have rightly earned their moniker of Spice Traders by traveling the globe and searching for the most remarkable spices anywhere.\n\nMise en Bouche:\nGrilled Issan Chicken wings\nwith green pepper and garlic, hot sweet and sour dip\n\nAppetizer:\nIsekaya-Style Fish Tartare\nwith sancho pepper, nori and toasted sesame\n\nEntree Choices:\nBraised Cornman Farms’ Pork\nwith figs, almonds and sweet and sour Long pepper sauce\nOR\nSlow Roasted Goat\nwith cubebs, white pepper and lemon grass shallot sauce\n\nDessert:\nChocolate Voatsiperifery Pot de Crême", "name": "In Pursuit of Pepper", "source": "Facebook", "date": "2016-04-12T19:00:00-04:00", "url": "https://www.facebook.com/events/868952316560479/"}, {"description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "name": "Acoustic Tuesdays: Nick Zomparelli", "source": "Facebook", "date": "2016-04-12T19:00:00-04:00", "url": "https://www.facebook.com/events/1686417714974855/"}, {"description": "Tuesday, April. 12 | 9pm | 18+ | $13 Adv./ $15 Day of\n\nDenzel Curry 2055 The Ult Experience\nwsg: Allan Kingdom, & Sdotbraddy\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/636", "name": "Denzel Curry - 2055: The Ult Experience 4/12/16 @ Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-04-12T21:00:00-04:00", "url": "https://www.facebook.com/events/523621744459410/"}, {"description": "Wednesday only, allll of our supplements are 30% off! Stock up on your favorites, from A-Zinc!", "name": "One Day Sale- 30% Off Suplements", "source": "Facebook", "date": "2016-04-13T07:00:00-04:00", "url": "https://www.facebook.com/events/2029438033947526/"}, {"description": "It's time to get things rolling for the 9th Annual HomeGrown Festival! We need your help to plan this fun event...and the best kept secret of HomeGrown is that our planning team meetings are a blast! \n\nOur team meets twice monthly April-July and weekly in August and the first half of September. There is usually food involved. And a positive, supportive group of folks!\n\nOur kickoff planning meeting will be held Wednesday, April 13 from 6:00-8:00pm downstairs at the Bar at 327 Braun Court in Kerrytown. If you would like to consider being part of the fantastic team of volunteers that plans this amazing event please join us at this meeting and learn more about the planning process.\n\nThe festival will take place on Saturday September 10 at the Ann Arbor Farmers' Market.\n\nWe hope to see you soon!\n\nMore information at HomeGrownFestival.org", "name": "HomeGrown Festival Planning Committee Kickoff", "source": "Facebook", "date": "2016-04-13T18:00:00-04:00", "url": "https://www.facebook.com/events/1708827906036419/"}, {"description": "Literati is delighted to welcome Brian Blanchfield in support of his collection Proxies: Essays Near Knowing.\n\nPast compunction, expressly unbeholden, these twenty-four single-subject essays train focus on a startling miscellany of topics —Foot Washing, Dossiers, Br’er Rabbit, Housesitting, Man Roulette, the Locus Amoenus—that begin to unpack the essayist himself and his life’s rotating concerns: sex and sexuality, poetry and poetics, subject positions in American labor (not excluding academia), and his upbringing in working-class, Primitive Baptist, central-piedmont North Carolina. In Proxies an original constraint, a “total suppression of recourse to authoritative sources,” engineers Brian Blanchfield’s disarming mode of independent intellection. The “repeatable experiment” to draw only from what he knows, estimates, remembers, and misremembers about the subject at hand often opens onto an unusually candid assessment of self and situation. The project’s driving impulse, courting error, peculiar in an era of crowd-sourced Wiki-knowledge, is at least as old as the one Montaigne had when, putting all the books back on the shelf, he asked, “What do I know?”\n\n\"Into what some are calling a new golden age of creative nonfiction lands Brian Blanchfield’s Proxies, which singlehandedly raises the bar for what’s possible in the field. This is a momentous work informed by a lifetime of thinking, reading, loving, and reckoning, utterly matchless in its erudition, its precision, its range, its daring, and its grace. I know of no book like it, nor any recent book as thoroughly good, in art or in heart.\"  —Maggie Nelson\n\n\"Proxies: Essays Near Knowing brings a slowed-to-meaning lens to the remembered moments of a life. Blanchfield’s readers wander into his ordinary-extraordinary quotidian—the vulnerable longing of a singular voice expressing a peopled intelligence. Not since Hilton Als’s White Girls have I read anything as interrogative, unsettling, and brilliant.\"  —Claudia Rankine\n\n\"Brian Blanchfield’s sentences are modern marvels.  They coil, insinuate, embellish—and then land on the tender spot.  If Hart Crane had survived to write a book of autobiographical essays, it would resemble Proxies—but would Hart have given us the low-down on frottage?  Blanchfield is a staggeringly accomplished stylist, whose artful elucidations deserve to be savored, studied, and, yes, worshipped.\"  —Wayne Koestenbaum\n\n\"Early on his humble and stunning Proxies, Brian Blanchfield asks: “In what kind of place is all the hearing overhearing?” He knows, mostly we eavesdrop on ourselves. We call it thinking. There is no delicacy of mind like that one that moves through the facts of its own errors to arrive at understanding, and here, essay by essay, Blanchfield sifts through the astray archive of his memory to recall what all it is he needs to live. These essays remind us, as they discover inside themselves, the deep virtue of saying, “I don’t know.”\"  —Dan Beachy-Quick\n\n\"Maybe short says it best. Sexy book.\"  —Eileen Myles\n\n\"Blanchfield’s best known as a poet, and though poetry shows up here as a subject, this isn’t a poet’s essay collection, meaning that these aren’t hyperlyric half-prose essays shot with the poetry cannon: this is a book of excellent prose written by someone born to write exactly this. These are high-wire acts that are a ton of fun to read…performing close readings of cultural phenomena and tracking—with great, even heroic care—minor and major emotional transactions and tendencies. The result is a book of dynamic, thoughtful, and flat-out moving essays.\"   —Ander Monson\n\nBrian Blanchfield is the author of two books of poetry, Not Even Then and A Several World, which received the 2014 James Laughlin Award and was a longlist finalist for the National Book Award. Recent essays and poems have appeared in Harper’s, BOMB, Brick, Guernica, The Nation, Chicago Review, The Brooklyn Rail, A Public Space, Lana Turner, The Paris Review, and The Awl. He has taught as core faculty in the graduate writing programs of Otis College of Art and Design in Los Angeles and at the University of Montana, Missoula, where he was the 2008 Richard Hugo Visiting Poet. Since 2010 he has been a poetry editor of Fence. With his partner John, he lives out past the streetlights in Tucson, where is the host of Speedway and Swan on KXCI 91.3.", "name": "Brian Blanchfield", "source": "Facebook", "date": "2016-04-13T19:00:00-04:00", "url": "https://www.facebook.com/events/1089713734426876/"}, {"description": "Wed. April 13 | 9pm | 18+ | $8 adv./ $10 day of\n\nThe Appleseed Collective \nwith: Big Dudee Roo & Rick Chyme\n\nThe Appleseed Collective is a four-piece Americana band that's toured these United States since 2010, serving up songs new and old—barn-burners, old soul jazz, airy mood pieces, bluesy digressions—to crowds hungry for more. Their music is a rich Dixie-Gypsy roots-music mélange with a modern twist, a long-simmering stew of old-time, ragtime, and bluegrass constantly refreshed—like the Melting Pot itself—with immigrant sounds and international spices. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/643", "name": "The Appleseed Collective w/ Big Dudee Roo & Rick Chyme 4/13/16 at Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-04-13T21:00:00-04:00", "url": "https://www.facebook.com/events/1698946970352936/"}, {"description": "Savco Hospitality, the people that brought you Babo: A Market By Sava, Sava's Restaurant, Aventura Ann Arbor, and Tavolina Catering & Events are hiring for a variety of positions.\n\nJoin us for our career fair!\n\nEnjoy live music, refreshments, and on-the-spot interviews!\nVisit the link \"Ticket URL\" for our current job listings.", "name": "Savco Career Fair", "source": "Facebook", "date": "2016-04-14T14:00:00-04:00", "url": "https://www.facebook.com/events/1593975464227691/"}]