[{"source": "Facebook", "date": "2016-10-05T17:00:00-04:00", "name": "Wednesday Food Truck Rally", "description": "This is it! Our last food truck rally of the year! Help us end the season right and make this an event to remember! Delicious food, great music, wonderful community...we can't ask for a better way to greet the Fall. We'll see you there!", "url": "https://www.facebook.com/events/143806542708744/"}, {"source": "Facebook", "date": "2016-10-05T18:00:00-04:00", "name": "How to Use Storytelling to Boost Your Brand", "description": "Watch, learn and experience extraordinary business stories of triumph, wonderment and joy. This light competition will feature Metro Detroit's top nine business retail, tech and social enterprise innovators.\n\nWednesday, October 5th\n6:00 - 9:00pm \nTechTown Detroit\n440 Burroughs St, Detroit, Michigan 48202\n\nSchedule\n6:00 - 7:00pm - Registration. Strolling Dinner. Connecting/Networking\n7:15 - 8:15pm - The business storytelling competition begins\n8:15 - 8:30pm - Winners are announced\n8:40 - onward - Celebration, S'mores and more . . .\n\nBenefits of Attending\n1. You'll capture tips for how to discover what makes your brand unique\n2. You'll receive multiple boosts of inspiration for ways to build the story about your brand\n3. You'll learn tips for how to be use storytelling to be smart marketer\n4. You'll play with ways to use storytelling to boost sales confidence\n5. You'll meet others who are like-minded, passionate and ready show up in authentic ways to share their stories\n\nHow to Register\nOnline: http://www.entreslam.com/showcase\nEventbrite: https://www.eventbrite.com/e/a-night-of-business-storytelling-dinner-tickets-27350028672\nBy phone: Iphone or Android\n\nProgram Highlight/Past Winner/Current Candidates\nWhat is Entre-SLAM? https://youtu.be/8x7tFMn3Z58\nVideo of one of the Past Winners (with judge's comments): https://youtu.be/OYPPLoaV1D0\n\nJudging Panel:\nNailah Ellis Brown - Ellis Island Tea\nMr. Lee Thomas - FoxTV 2\nStefan Sysko - Sysko Thinking\n\nCancellation Policy:\nRegistrants who cannot attend an event are encouraged to exercise the option of providing a substitute participant to attend in his/her place. A written notification of a substitution will be accepted by email up to the morning of the event. \n\nIf Entre-SLAM or its event partner cancels an event, all registrants will receive a full refund of fees paid (no administration charge) no later than two business days following the scheduled date of the event.\n\nAll refunds will only be made using the original form of payment. For example, if you registered using a Visa card, any refund will be credited back to that same Visa card.\n\nEntre-SLAM would not be possible without the support of our sponsors:\n\nTechTown Dinsmore Goldman Sachs Waterhill Creative", "url": "https://www.facebook.com/events/1825878380977818/"}, {"source": "Facebook", "date": "2016-10-05T18:00:00-04:00", "name": "How to Use Storytelling to Boost Your Brand", "description": "Watch, learn and experience extraordinary business stories of triumph, wonderment and joy. This light competition will feature Metro Detroit's top nine business retail, tech and social enterprise innovators.\n\nWednesday, October 5th\n6:00 - 9:00pm \nTechTown Detroit\n440 Burroughs St, Detroit, Michigan 48202\n\nSchedule\n6:00 - 7:00pm - Registration. Strolling Dinner. Connecting/Networking\n7:15 - 8:15pm - The business storytelling competition begins\n8:15 - 8:30pm - Winners are announced\n8:40 - onward - Celebration, S'mores and more . . .\n\nBenefits of Attending\n1. You'll capture tips for how to discover what makes your brand unique\n2. You'll receive multiple boosts of inspiration for ways to build the story about your brand\n3. You'll learn tips for how to be use storytelling to be smart marketer\n4. You'll play with ways to use storytelling to boost sales confidence\n5. You'll meet others who are like-minded, passionate and ready show up in authentic ways to share their stories\n\nHow to Register\nOnline: http://www.entreslam.com/showcase\nEventbrite: https://www.eventbrite.com/e/a-night-of-business-storytelling-dinner-tickets-27350028672\nBy phone: Iphone or Android\n\nProgram Highlight/Past Winner/Current Candidates\nWhat is Entre-SLAM? https://youtu.be/8x7tFMn3Z58\nVideo of one of the Past Winners (with judge's comments): https://youtu.be/OYPPLoaV1D0\n\nJudging Panel:\nNailah Ellis Brown - Ellis Island Tea\nMr. Lee Thomas - FoxTV 2\nStefan Sysko - Sysko Thinking\n\nCancellation Policy:\nRegistrants who cannot attend an event are encouraged to exercise the option of providing a substitute participant to attend in his/her place. A written notification of a substitution will be accepted by email up to the morning of the event. \n\nIf Entre-SLAM or its event partner cancels an event, all registrants will receive a full refund of fees paid (no administration charge) no later than two business days following the scheduled date of the event.\n\nAll refunds will only be made using the original form of payment. For example, if you registered using a Visa card, any refund will be credited back to that same Visa card.\n\nEntre-SLAM would not be possible without the support of our sponsors:\n\nTechTown  Dinsmore   Goldman Sachs Waterhill Creative", "url": "https://www.facebook.com/events/1121111204622842/"}, {"source": "Facebook", "date": "2016-10-05T19:00:00-04:00", "name": "My Beliefs About Cooking Special Dinner #201, with Ari Weinzweig", "description": "We still have tickets available at Zingerman's Roadhouse for the My Beliefs about Cooking with Ari Weinzweig special dinner, #201! Join Ari as he talks about his beliefs on cooking from his new book, \"Zingerman's Guide to Good leading, Part 4: A Lapsed Anarchist's Approach to the Power of Beliefs in Business\". Chef Alex Young has prepared an approachable, uncomplicated menu that will highlight the quality of local, artisan ingredients, including beautiful autumn vegetables from Cornman Farms and his full-flavored pasture-raised beef. One of the beliefs about food that Ari will talk about at the dinner is that every single thing should be delicious on its own, but then develop even more character in combination. \"We define full flavor as complexity, balance and finish, and that's what each ingredient on the menu should bring.\" Don't miss out on this amazing opportunity to learn more about how beliefs can impact your own approach to food and cooking, and to taste the difference with our really good menu.", "url": "https://www.facebook.com/events/1810203432597328/"}, {"source": "Facebook", "date": "2016-10-05T19:00:00-04:00", "name": "Derek Palacio", "description": "Literati is thrilled to welcome Derek Palacio in support of his novel, The Mortifications.\n\nDerek Palacio’s stunning, mythic novel marks the arrival of a fresh voice and a new chapter in the history of 21st century Cuban-American literature.\n\nIn 1980, a rural Cuban family is torn apart during the Mariel Boatlift. Uxbal Encarnación—father, husband, political insurgent—refuses to leave behind the revolutionary ideals and lush tomato farms of his sun-soaked homeland. His wife Soledad takes young Isabel and Ulises hostage and flees with them to America, leaving behind Uxbal for the promise of a better life. But instead of settling with fellow Cuban immigrants in Miami’s familiar heat, Soledad pushes further north into the stark, wintry landscape of Hartford, Connecticut. There, in the long shadow of their estranged patriarch, now just a distant memory, the exiled mother and her children begin a process of growth and transformation.\n\nEach struggles and flourishes in their own way: Isabel, spiritually hungry and desperate for higher purpose, finds herself tethered to death and the dying in uncanny ways. Ulises is bookish and awkwardly tall, like his father, whose memory haunts and shapes the boy’s thoughts and desires. Presiding over them both is Soledad. Once consumed by her love for her husband, she begins a tempestuous new relationship with a Dutch tobacco farmer. But just as the Encarnacións begin to cultivate their strange new way of life, Cuba calls them back. Uxbal is alive, and waiting.\n\nBreathtaking, soulful, and profound, The Mortifications is an intoxicating family saga and a timely, urgent expression of longing for one’s true homeland.\n\n“A revelatory tale of Cuba and America, of faith and family, of the spirit and the flesh, The Mortifications is a debut remarkable for its wise and scrupulous insight into the human heart. Palacio feelingly reminds us that all immigrants are also exiles, wounded with loss, striving to make a home even as they yearn for the one they’ve left behind.” —Peter Ho Davies\n\n“A novel of stunning sweep and vision. The story of the Encarnación family plunges the reader into the dislocating heartache of life in exile, in the intermediary land between the home that has been forsaken and the one that might, in the future, await. Derek Palacio’s prose is so assured it’s hard to believe The Mortifications is his first novel—but it is, miraculously, and it is one magnificent debut.” —Laura van den Berg\n\nDerek Palacio received his MFA in Creative Writing from the Ohio State University. His short story “Sugarcane” appeared in The O. Henry Prize Stories 2013, and his novella How to Shake the Other Man was published by Nouvella Books. He lives and teaches in Ann Arbor, MI, is the co-director, with Claire Vaye Watkins, of the Mojave School, and serves as a faculty member of the Institute of American Indian Arts MFA program.\n\nEvent date: \nWednesday, October 5, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1685511088438901/"}, {"source": "Facebook", "date": "2016-10-06T09:00:00-04:00", "name": "Maker Space Operations Bootcamp", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "url": "https://www.facebook.com/events/1676692335988216/"}, {"source": "Facebook", "date": "2016-10-06T17:30:00-04:00", "name": "Zell Visiting Writers Series: China Miéville in conversation", "description": "Thursday, October 6, 5:30–6:30 p.m.\r\nHelmut Stern Auditorium\n\nChina Miéville lives and works in London. He is a three-time winner of the prestigious Arthur C. Clarke Award (Perdido Street Station, Iron Council, and The City & the City) and has also won the British Fantasy Award twice (Perdido Street Station and The Scar). The City & The City, an existential thriller, was published in 2009 to dazzling critical acclaim and drew comparison with the works of Kafka and Orwell (The Times) and Phillip K. Dick (The Guardian). The City & The City recently won the British Science Fiction Award, the Arthur C. Clarke Award, and tied with Paolo Bacigalupi's The Windup Girl for the 2010 Hugo Award. It was also shortlisted for the Nebula.\rUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. \n\nThe Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please \rsee lsa.umich.edu/writers/readingsevents/zellvisitingwritersseries.com", "url": "https://www.facebook.com/events/178290599278647/"}, {"source": "Facebook", "date": "2016-10-06T17:30:00-04:00", "name": "China Miéville In Conversation with Josh Miller", "url": "https://www.facebook.com/events/850779015057470/"}, {"source": "Facebook", "date": "2016-10-06T18:00:00-04:00", "name": "The Senses are Alive and Well: Art, Music, and Connecting", "description": "Thursday, October 6, 6–7:30 p.m. \nThe Silver Club\n\nIn this interactive, 90-minute program, University of Michigan Museum of Art docents and staff will demonstrate their use of art, music, storytelling and touch to create successful and rewarding experiences for visitors with memory loss, their families, and care-partners. The evening will also include tips and ideas from UMMA and Silver Club for using these modes to connect with loved ones at home or anywhere.\r￼The University of Michigan Museum of Art’s Meet Me Program has served people with\r \rmemory loss and their families and care partners for the last six years in partnership with Silver Club.\rThis program is free and light refreshments will be served.\rSilver Club will also provide a respite of alternative activities and refreshments for Silver Club members, or guests with memory loss during the program.\r\n\nRegistration: \rPlease register by emailing umma-program-registration@umich.edu so that we can accommodate all of your party, including people with memory loss who will join the Silver Club activity session.\r\n\nLocation\r: The Silver Club, 2401 Plymouth Road, Suice C Ann Arbor, Michigan 48105.\r\n\nQuestions:\r For more information about this program, please call Mary LaVenture at 734-647-0522 or The Silver Club Programs at 734-998-9349.\r\n\nMeet Me at UMMA is generously supported by the Monroe-Brown Foundation Discretionary Fund for Outreach to the State of Michigan and individual donors.", "url": "https://www.facebook.com/events/664614673705320/"}, {"source": "Facebook", "date": "2016-10-06T18:00:00-04:00", "name": "Nature Walk with Ann Arbor District Library- Mary Beth Doyle Park", "description": "Nature Walk with Ann Arbor District Library\nThursday, October 6\n6 to 7:30 p.m. \nMary Beth Doyle Park\nMary Beth Doyle Park is an 81-acre park located a couple blocks east of the Malletts Creek branch of the AADL. It has both paved and unpaved trails that meander through woods and wetlands. A large pond near the center of the park is a wonderful area for wildlife viewing. During October, late fall wildflowers will be in bloom!\nThe nature walks are a collaboration between the AADL and Natural Area Preservation that take place once a month throughout the summer and fall. This is the final one of 2016! We'll be meeting in the parking area off Packard Road just east of Cobblestone Farm on the south side of the street. Wear comfortable clothes and bring water if desired. Some of the AADL Science Tools will be available for use during the walk, too!", "url": "https://www.facebook.com/events/588314098007062/"}]