[{"url": "https://www.facebook.com/events/1839182856327434/", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "source": "Facebook", "name": "Women's History Month and Planned Parenthood", "date": "2017-03-02T10:00:00-05:00"}, {"url": "https://www.facebook.com/events/1353503771380668/", "description": "Join our meat department manager for some tips about chosing and preparing the best and freshest meat and seafood.", "source": "Facebook", "name": "Meat & Seafood 101 with KPW", "date": "2017-03-02T17:00:00-05:00"}, {"url": "https://www.facebook.com/events/344285915971490/", "description": "Literati is pleased to welcome Ypsilanti's own Amy Shrodes, co-author of Lost and Found Cat: The True Story of Kunkush's Incredible Journey, for an all-ages event.\n\nThe true story about one cat’s journey to be reunited with his war-torn family has been seen by millions of people and is now a heartwarming picture book. When an Iraqi family is forced to flee their home, they can’t bear to leave their beloved cat, Kunkush, behind. So they carry him with them from Iraq to Greece, keeping their secret passenger hidden away. But during the crowded boat crossing to Greece, his carrier breaks and the frightened cat runs from the chaos. In one moment, he is gone. After an unsuccessful search, his family has to continue their journey, leaving brokenhearted.\n \nA few days later, aid workers in Greece--Amy among them--find the lost cat. Knowing how much his family has sacrificed already, they are desperate to reunite them with the cat they love so much. A worldwide community comes together to spread the word on the Internet and in the news media, and after several months the impossible happens—Kunkush’s family is found, and they finally get their happy ending in their new home. This remarkable true story is told by the real people involved, with the full cooperation of Kunkush’s family.\n\nAmy Shrodes and co-author Doug Kuntz felt compelled to travel to Greece to help with the refugee crisis, each in their own unique way—Amy as a volunteer helping the arriving refugees and raising awareness back at home through a podcast, and Doug as a photojournalist, who spent time in Greece, Turkey, France, Germany, and finally Norway, bringing the plight of the refugees to people around the globe. When they met Kunkush, they knew he was very special to someone and they wanted to do everything they could to reunite him with his family.", "source": "Facebook", "name": "Amy Shrodes: Lost and Found Cat", "date": "2017-03-02T19:00:00-05:00"}, {"url": "https://www.facebook.com/events/254338798323472/", "description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "source": "Facebook", "name": "Sing Happy!", "date": "2017-03-02T19:30:00-05:00"}, {"url": "https://www.facebook.com/events/215059972302859/", "description": "Thursday: March 2 | 8pm | 18+ | $5 (8 for under 21)\n\nOak Valley Drive is a local Ann Arbor rock band that combines the sex appeal of meatloaf with the pop-rock sensibilities of Meatloaf. OVD consists of three faces, 29 toes, and one goal: to not be a disappointment to those we love --thankfully their music isn’t half-bad. If you’re a fan of happy indie rock with depressing yet inspiring lyrics, catchy hooks, and a voice you can’t quite tell if you love or hate (hint, it’s love and he loves you too).\n\nOak Valley Drive Social Media: https://www.facebook.com/OakValleyDriveBand/\nhttps://oakvalleydrive.bandcamp.com/releases\n\nNorthern Poetic Social Media\nhttps://www.facebook.com/thenorthernpoetic/\nhttps://soundcloud.com/thenorthernpoetic/time-traveler-demo", "source": "Facebook", "name": "Oak Valley Drive w/ Northern Poetic 3/2/17 at the Blind Pig", "date": "2017-03-02T20:00:00-05:00"}, {"url": "https://www.facebook.com/events/1628484420511493/", "description": "Magical Mitten Productions and Further Frequencies Presents: Esseks & Perkulat0r w/ support from Patches O'Malley, KNGHT, Hans Play, Dawning Music\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n18+ w/ Valid ID\nDoors at 8:30\nTickets = $12 Presale | $15 DOS | 4 for $40 \nlink - https://www.eventbrite.com/e/lost-boys-tour-esseks-perkulat0r-necto-ann-arbor-mi-tickets-31650652955\n--------------------------\nWhat to expect? Forward thinking bass music accompanied by local vendors and artists creates an experience destined to satisfy all your senses\n-=-=-=-=-=-=-=-=-=-=-=-=\nMusic\nDawning Music\nhttps://soundcloud.com/dawning-music\n=+=+=+=+=+=\nHans Play\nhttps://soundcloud.com/realhansplay\n=+=+=+=+=+=\nKNGHT\nhttps://soundcloud.com/knightofficialmusic\n=+=+=+=+=+=\nPatches O'Malley\nhttps://soundcloud.com/patchesomalley\n+=+=+=+=+=+=\nEsseks\nhttp://soundcloud.com/esseks\nEsseks (Sam Eckstein) is a Brooklyn based producer and visual artist. His music ranges all the bass-centric genres with a focus on the off-kilter. The diverse elements of his music are tied together with Esseks’ subtle but instantly recognizable sound. It is dark but in a playful sense. Cartoon Villain music you could say. He has built up a large catalog of music since his first release in 2012 and put out releases with Wakaan (AZ), Gravitas Recordings (TX), Foundations Recordings (CA), and Smokers Cough (NY) along with a number of self releases and collaborations with artists like Yheti, Space Jesus, GDP.\n+=+=+=+=+=+=\nPerkulat0r\nhttp://soundcloud.com/perkulat0r\nPerkulat0r aka Ben Jamer was sent from outer space to smack the world with a fourth dimension of sound. Hailing from the suburbs of Vancouver, Jamer has made a name for himself with his soulful brand of intelligent beatmaking. Saucing listeners from the feet up with his signature soundscapes, lush with weaving melodies and dripping with delicious bass, Perkulat0r has delivered his take on multi-genre bass music to audiences at festivals across North America. Fresh off his Hyperdrive Tour throughout Canada, and with his debut US tour to follow, Perkulat0r continues to melt eardrums in 2016 with a dose of space gangster soul like no other.\n/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\nVendors\n-----------------\nMI kulture\nPhiber Printing\nKativated Designs \n\nArtists \nTBA", "source": "Facebook", "name": "Lost Boys Tour: Esseks & Perkulat0r w/ Patches_O_Malley & More", "date": "2017-03-02T20:30:00-05:00"}, {"url": "https://www.facebook.com/events/601566876699752/", "description": "Free to attend; for students 3rd through 8th grade.\n\nStudents learn to experiment with the basics in Computer Aided Design (CAD) by creating miniature Minecraft character keepsakes.\n\nNote: sessions must have at least 4 students registered to attend in order to be held. Registration deadline is 48 hours before scheduled time.", "source": "Facebook", "name": "3D Printing & Design (Week 1 of 6)", "date": "2017-03-03T17:00:00-05:00"}, {"url": "https://www.facebook.com/events/631477160373613/", "description": "Bookbound is pleased to welcome back local author Shelley Schanfield for the launch of the second book in her fantasy trilogy. By inclination a voracious reader and by profession a librarian, Shelley looked for a good novel about the Buddha . When she didn’t find one that satisfied her, she had the notion to write her own based on the spiritual struggles of women in the Buddha’s time, set in the fascinating world that gave birth to yoga and Buddhism. Steeped in India’s myths and legends, this novel is fresh territory for Western readers of fantasy and historical epics. Through its strong female characters, it will appeal to readers of historical fiction with a woman’s perspective. Light refreshments. Signing to follow.\n\nMore about the book:\nA beautiful warrior princess. A tormented prince. A terrible choice between love, duty, and spiritual freedom.\n\nRebellious Dhara runs away from her Himalayan clan to study with the powerful yogi Mala, a mysterious woman with a violent past. Flung by war onto an adventure-filled journey, Dhara meets and captures the heart of Siddhartha, whose skill in the martial arts and extraordinary mental powers equal her own.\n \nWorldly power and pleasure seduce Dhara, creating a chasm between her and her husband, who longs to follow a sage’s solitary path. She takes on the warrior’s role Siddhartha does not want, and when she returns wounded from battle court intrigue drives them further apart. As Siddhartha’s discontent with royal life intensifies, Dhara’s guru Mala, who has returned to her life as a ruthless outlaw queen, seeks her former pupil for her own evil purposes. \n \nDhara’s and Siddhartha’s love keeps evil at bay, but their son’s birth brings on a spiritual crisis for the prince.  If he leaves his kingdom to seek enlightenment, he turns his back on love and duty and risks destroying his people. Only Dhara can convince him to stay.", "source": "Facebook", "name": "Book Launch: The Mountain Goddess with Shelley Schanfield", "date": "2017-03-03T19:00:00-05:00"}, {"url": "https://www.facebook.com/events/1093572227425292/", "description": "In a career that spans 23 albums and includes three Grammy awards, Tom Chapin has covered a lot of creative ground. In addition to his work as a recording artist and concert performer, Chapin has acted on Broadway and worked in films, television and radio. Tom grew up in a family that encouraged artistic pursuits. He began performing professionally as a teenager in the early 1960s, playing in Greenwich Village folk clubs alongside his siblings, Harry and Steve, as one of The Chapin Brothers. In 1971, he began a five-year run as the host of the ABC-TV children's series, \"Make A Wish.\" Chapin and his songs were also featured in the 1970 documentary film, \"Blue Water, White Death,\" for which he spent six months sailing the Indian Ocean searching for great white sharks.\n\nAs a music-maker, Chapin has maintained two parallel careers, as a highly respected contemporary folk artist and as a pioneer in the field of children's music. In the former role, Chapin has established a reputation for insightful, heartfelt songcraft and charismatic live performances. In the latter, he continues to engage the hearts, minds and imaginations of young listeners with witty, life-affirming original songs delivered in a sophisticated array of musical styles. Chapin's infectious songs, sterling musicianship and personal warmth shine, whether he's performing on record or in a concert hall, an outdoor festival, a school, in front of a symphony orchestra, or in an intimate coffeehouse.  www.tomchapin.com", "source": "Facebook", "name": "Tom Chapin at Green Wood Coffee House", "date": "2017-03-03T20:00:00-05:00"}, {"url": "https://www.facebook.com/events/657765481078555/", "description": "SUBSONNIK INVITES YOU !!!\nCelebrate our Record Release Party with Us bringing you the best entertainment to kick off your weekend! \nHosted at Club Above, Ann Arbor, expect to hear a dynamic range of genres, Open kitchen and Drink Specials served all night long.\n\n--- L i n e U p ---\nVest And Tyler\nhttps://soundcloud.com/vestandtyler\nhttps://itunes.apple.com/us/album/glitch/\nhttps://www.facebook.com/vestandtyler/\n\nCurtis Wolfe (L.O) Operator of Statik Records   \n[b2b] Mushkilla\nhttps://www.facebook.com/LODeepHouseMusic/\nhttp://popmuzik.se/2016/02/dj-l-o-not-without-my-coffee/\nhttps://www.beatport.com/artist/l-o/465288\nhttps://soundcloud.com/mushkilla\nhttps://www.facebook.com/DJMushkilla/\n\nTek - Mazter\nhttps://soundcloud.com/tek-mazter\nhttps://www.facebook.com/tek.mazter/\n\nQUENAUDON [b2b] Dan Ryan\nhttps://soundcloud.com/itsquenaudon\nhttps://soundcloud.com/quenaudon-remixs\nhttps://www.facebook.com/Quenaudon/\nhttps://www.facebook.com/TheRealDanRyan/\nhttps://soundcloud.com/apollo-671613041\n\nCody Popov (CHERRYZ)\nfacebook.com/cody.popov.5\nsoundcloud.com/cherryzofficial\n\nGrab your tickets at the door!!!\n$5 (21+)\n$7 (18+)\n\nSponsored By: SUBSONNIK and Statik Records\nwww.wearesubsonnik.com\nhttp://statikrecords.com/", "source": "Facebook", "name": "Subsonnik Takeover", "date": "2017-03-03T21:00:00-05:00"}]