[{"source": "Facebook", "date": "2016-12-14T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/280243392370950/", "name": "10% For Good for Community Action Network"}, {"source": "Facebook", "date": "2016-12-14T10:00:00-05:00", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "url": "https://www.facebook.com/events/230775294023258/", "name": "Exhibit: Avant Garden-Fashion & Plants Together!"}, {"source": "Facebook", "date": "2016-12-14T11:45:00-05:00", "description": "Come learn how to create Multi-Channel Digital Marketing Strategies from Paul Clancy & Scott DeRoche from Daniel Brian Advertising. This talk will surely help your business as you plan your marketing strategy for 2017. Hope to see you there!", "url": "https://www.facebook.com/events/2150452768513897/", "name": "Multi-Channel Digital Marketing Strategies That Scale"}, {"source": "Facebook", "date": "2016-12-14T18:00:00-05:00", "description": "How do you use computer-controlled (“CNC”) tools?  It may look like magic when the ShopBot, plasma cutter, Tormach, or other machine accurately cuts an intricate shape, but in fact we have some powerful software tools that  let even beginners create fantastic projects.\n\nThis class is an overview of “CNC”–that is, computer controlled machines.  You’ll learn what CAD means, the difference between 2D and 3D, and other concepts.  We will do some very simple hands-on activities, including creating a drawing in a CAD program, using a CAM program to generate code to run on a CNC machine, and each person will send their job to a simple CNC machine and see it run!\n\nIf you have no CNC experience, this would be a great class to take before checkout classes for specific CNC machines. \n\nThere is no prerequisite for this class, but familiarity with using software on a computer will be needed–things like clicking with the mouse and so on.\n\nNotes and other handouts will be provided.\n\nBe sure to check out our CNC toolchain map (which we’ll explain in class) and CNC glossary at http://maker-works.com/cadcam-toolchain/\n\nClass size: 4 people\n\nPlease arrive 10 minutes early if this is your first time to Maker Works.\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=14&month=12&year=2016&view=day to sign up!", "url": "https://www.facebook.com/events/194194467708726/", "name": "Intro to CNC - $25"}, {"source": "Facebook", "date": "2016-12-14T20:00:00-05:00", "description": "Wed. Dec. 14 | 8pm | 18+ | $15 adv./ $18 Day of\n\nLive For Live Music Presents\nDopapod & Pigeons Playing Ping Pong\nat Blind Pig\nAnn Arbor, MI\n\nTickets: http://tktwb.tw/2asPQDi\n\nWant to earn a FREE ticket to the show? Sign up for the street team by clicking here: http://bit.ly/2b3tDvt\n\nDOPAPOD: \n\nThe Boston born, now generally Northeast based, but ever on-the-go Dopapod has come a long way from their college basement, DIY party roots. While maintaining to be as grassroots as their humble beginnings, the group has earned praise from taste making critics like Rolling Stone, Huffington Post, Jambase, Relix, and The Boston Herald, all the while tending to their ever expanding community of devoted listeners. The past 4 years have individually held the weight of about 150 shows, which have included numerous festival appearances like Bonnaroo, Wakarusa, Summer Camp, Electric Forest, Camp Bisco, Peach Fest, & Gathering Of the Vibes. All of this time on stage with each other has given the band the opportunity to explore the wide variety of influences that has impacted them to be the players they are today. But, don’t be quick to think that the no holds barred experimentation is unguided. While the brush in their hand uses every color, it’s the stroke on the canvas that gives Dopapod a distinct voice in the way of crafty songwriting.\n\nThat calculated, compositional mindset and restless nature to never sit too still is what has allowed Dopapod to fully realize their fourth studio release, Never Odd Or Even. Guitarist/vocalist Rob Compa giddily tells, “We really felt that the material this time around represented a big leap forward, not just in the way we’ve been interacting as a band, but in the way our focus has become sharper in paying attention to things like melody, theme, lyrical imagery, and structure – all the elements that make a great song.”\n\nDetermined to have that maturity translate in the studio, the band enlisted friend and producer Jason “Jocko” Randall to both engineer and produce the record. Keys/vocalist Eli Winderman couldn’t be happier about how things went. “We lived at his studio for about a month for these sessions and it just clicked right away. Jocko immediately became another member of band in many ways. With his attitude and approach to the recording process, we were able to really dial in the sounds we wanted, get those perfect takes we were aiming for, and have a blast the whole way through.” Released in November of 2014, Never Odd Or Even serves as the spark that the band has ignited to launch them into and exciting 2015.", "url": "https://www.facebook.com/events/1574155032886638/", "name": "Dopapod & Pigeons Playing Ping Pong at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-12-15T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/324709987912141/", "name": "10% For Good for Community Action Network"}, {"source": "Facebook", "date": "2016-12-15T10:00:00-05:00", "description": "This week, all our body care is 25% off! Skin care, hair care, cosmetics, soaps- it's all on sale, just in time for your holiday shopping. And with prices like this, you can pick up a few things to treat yo' self, too <3", "url": "https://www.facebook.com/events/381601068852607/", "name": "25% Off Body Care"}, {"source": "Facebook", "date": "2016-12-15T19:00:00-05:00", "description": "Join our friends from New Belgium Brewing to try their new Ben & Jerry's Chocolate Chip Cookie Dough Ale! They'll be pairing it with Ben and Jerry's ice creams to get the full effect- beer float, anyone?", "url": "https://www.facebook.com/events/944135112354321/", "name": "Adult Ice Cream Social"}, {"source": "Facebook", "date": "2016-12-15T21:00:00-05:00", "description": "Southpaw Events  proudly presents...\n\nCloZee and Psymbionic - Biohackers Tour at Necto Nightclub\nDecember 15th, 2016\n\nLocal Support by Adam Westing & r1x0music\n\nDoors at 9pm | 18+ are welcome\n$10 Presale | $15 DOS | 4 pack presale for $30\n\nClozee\nHailing from Toulouse, CloZee is Chloé, a young music producer who seamlessly combines technical precision with a wild imagination. An accomplished instrumentalist, she began playing the classical guitar at 11. Influenced by edIT, Bonobo, The Widdler and Amon Tobin, she started producing electronic music at the age of 16.\n\nIn 2014, she won the 'Best International Newcomer of 2013' at the UK Glitch-Hop Award.\n\nHer tracks defy genres, oscillating between World Bass, Tribal Trap, Glitch-Hop, Trip-Hop, and Downtempo. She created her own place in the glitch community, thanks to a unique, highly surprising style, mixing powerful basslines, funky off beat percussion and emotional cinematic sounds. A musical identity which led her to play in the USA (including the festivals Coachella, Lightning In A Bottle, Shambhala...), Canada, India, Berlin, and more than 30 cities in France, alongside artists like Bonobo, Gramatik, Chet Faker, Tipper, TOKiMONSTA, Tipper, Big Gigantic, GRiZ...\n\nRunner-up of several remix contests (launched by artists like Mr. Bill, Asian Trash Boy, Crazy Daylight, Daenine...), CloZee was spotted by respected labels such as Gravitas Recordings, Glitch Hop Community, Adapted Records, Digital Whomp, Empathy Recordings, MOR Records, Waxhole Records… \n\nWebsite - http://www.clozeemusic.com/\nSoundcloud - https://soundcloud.com/clozee\nFacebook - https://www.facebook.com/CloZee \n\nPsymbionic\nCresting the modern wave of electronic producers, Psymbionic creates aural experiences that explore the range of multi-tempo Bass Music within an influential and dynamic culture. With an ear for situational relevance, Psymbionic enjoys turning non-traditional sound design and infectious rhythms into dancefloor heat, while also maintaining his history in the downtempo, emotive side of the electronic sound.\n\nJohn Burcham has been moving bodies and turning heads as Psymbionic for several years in all corners of the USA, playing with acts such as Bassnectar, STS9, Big Gigantic, ill.Gates, Excision, EOTO, and Tipper. His passion and innovation in the music world are showcased through album releases on Muti Music and MalLabel, as well as in his role as label manager for the popular Electronic imprint Gravitas Recordings.\n\nIn a live show context, Psymbionic confronts mixes that are limited to the scope of the build and release, avoiding an industry epidemic of drop-monotony that overpowers the flow of music. Burcham seeks to prove that there are more powerful influences in moving a crowd than simple tension, providing an interwoven dynamic that relies on the strength of his blend, rather than the sole force or familiarity of the apex.\n\nPsymbionic's theory of music is a journey that doesn't visit the same place twice, building excitement for what's next not because you can anticipate it, but because you've never been there before.\n\nWebsite - http://www.psymbionicmusic.com/\nFacebook - https://www.facebook.com/psymbionic\nSoundcloud - https://soundcloud.com/psymbionic", "url": "https://www.facebook.com/events/1417695524925106/", "name": "CloZee & Psymbionic - Biohackers Tour at Necto - 12/15"}, {"source": "Facebook", "date": "2016-12-15T21:30:00-05:00", "description": "Dead Hit will be back at the Blind Pig - Ann Arbor, MI on Thursday, December 15 for an evening of live music. Come Boogie Down during a fun night of musical mischief! Doors will be opening at 9:30, and music will start at 10:00.\n\nWe will be playing two sets of tunes throughout the night.\n\nSet 1\n10:00-11:45\n\nSet 2\n12:00 ~1:30\n\nBe sure to drop by for a tasty platter rock n' roll with a healthy slosh of improvisation.", "url": "https://www.facebook.com/events/237397100022638/", "name": "Dead Hit at the Blind Pig 12/15"}]