[{"url": "https://www.facebook.com/events/208434849627331/", "description": "Join us for Ann Arbor\nRestaurant Week\nJanuary 15th – 20th, 2017\nLunch & Dinner\n\nhttp://www.annarborrestaurantweek.com/\n\nReservations Recommended\n(888) 456-3463 (DINE)", "source": "Facebook", "date": "2017-01-30T10:00:00-05:00", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/1844201079197076/", "description": "Ann Arbor Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price.\n\nVinology Wine Bar and Restaurant is proud to be part of this great event, offered from January 15 - 20.  Enjoy a three course dinner for only $28!", "source": "Facebook", "date": "2017-01-30T10:00:00-05:00", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/1894155567471093/", "description": "We'd love for you to join us for Ann Arbor Restaurant Week, January 15th-20th. Click the link to view our lunch and dinner options for two. We have vegetarian, vegan, and gluten free options.\n\nAlso, $.50 from each Restaurant Week meal purchased at the brewpub will be donated to Food Gatherers!\n\nhttp://www.annarborrestaurantweek.com/…/arborbrewingcompany/", "source": "Facebook", "date": "2017-01-30T11:00:00-05:00", "name": "Ann Arbor Restaurant Week at Arbor Brewing Company"}, {"url": "https://www.facebook.com/events/357869054582083/", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "source": "Facebook", "date": "2017-01-30T11:00:00-05:00", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/731926473638010/", "description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "source": "Facebook", "date": "2017-01-30T17:00:00-05:00", "name": "Sunseed Farm CSA Pickup"}, {"url": "https://www.facebook.com/events/1910373179195334/", "description": "The Force has been awakened once again. A surreptitious stirring is sweeping the Galaxy, awakening hope and passion in even the most unsuspecting hearts. It is a clandestine phenomenon and it is known only by the name Star Wars Destiny. \n\nStar Wars Destiny is the newest collectable card game (CCG) on the market and it's very quickly becoming a very big deal. You may have heard of it, you may not have. Either way, if Star Wars has got you as pumped as it's got us, you should join us in the Vault of Midnight Ultra Lounge on Monday January 30th to explore the riviting world of Star Wars Destiny. \n\nThe evening will be friendly to those who have not played Star Wars Destiny as well as those who have, so no need to fret if you don't have much experience, we would love to introduce you to this crazy fun game. \n\nCheck out more about Star Wars Destiny here:\nhttps://boardgamegeek.com/boardgame/205359/star-wars-destiny\n\nIf you have any questions about the event, or require any additional information, please feel free to contact us!", "source": "Facebook", "date": "2017-01-30T18:00:00-05:00", "name": "Star Wars Destiny Cantina Soireé"}, {"url": "https://www.facebook.com/events/195810100885174/", "description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "source": "Facebook", "date": "2017-01-30T20:00:00-05:00", "name": "Wine, Women, and Song XV"}, {"url": "https://www.facebook.com/events/360112051012337/", "description": "Shop with us on January 31st, and we'll donate 10% of everything you buy to Ann Arbor YMCA! They're committed to expanding wellness in Ann Arbor, so start making your grocery list and mark this day on your calendar!", "source": "Facebook", "date": "2017-01-31T08:00:00-05:00", "name": "Impact Day benefiting Ann Arbor YMCA"}, {"url": "https://www.facebook.com/events/1848102932125078/", "description": "For the past 25 years, Image has been changing the comic book industry. Image put comics in the hands of the creators, therefore unleashing a whole world of stories just waiting to be told. The very foundation of their business was and still is to empower creators by giving them the liberty to tell the stories they find relevant. For the last 25 years, Image has been a beacon for the weird, the strange, the fantastical, the subversive, and the wonderous. Join us in celebrating these 25 years and all that it has meant for the industry. Here's to many more!", "source": "Facebook", "date": "2017-02-01T10:00:00-05:00", "name": "Image Comics' 25th Anniversary"}, {"url": "https://www.facebook.com/events/230775294023258/", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "source": "Facebook", "date": "2017-02-01T10:00:00-05:00", "name": "Exhibit: Avant Garden-Fashion & Plants Together!"}]