[{"url": "https://www.facebook.com/events/830729107033305/", "description": "This long slim park has plenty of native trees, including a lovely big bur oak, but the understory has been invaded by garlic mustard and other invasive species. You and your friends and family can help us celebrate Earth Day by removing invasive plants that crowd out native wildflowers. Meet at the park entrance at the intersection of Powell Avenue and Columbia Avenue.", "source": "Facebook", "date": "2016-04-23T09:00:00-04:00", "name": "Earth Day Stewardship Workday"}, {"url": "https://www.facebook.com/events/593017857529363/", "description": "Guest artist Spinning Dot Theatre's presents their newest Artist-in-Residence one-man show, \"A Mouth With Flame.\" This original piece by Korean artist Tae Hoon Yoo is a cultural experience about identity that weaves together dragon folklore, cultural and historical events, and personal stories in creative and insightful ways. A Mouth With Flame is a multimedia performance including shadow puppetry, music, and digital media for family audiences geared at ages 7-12.", "source": "Facebook", "date": "2016-04-23T10:30:00-04:00", "name": "A Mouth with Flame"}, {"url": "https://www.facebook.com/events/1145455765473834/", "description": "Under its namesake trees, this park along Malletts Creek has some great woodland wildflowers, including wild ginger and white trout lily. At this Earth Day workday we will remove garlic mustard and other invasive herbs that would otherwise take over the park.\nMeet at the park entrance at the intersection of Parkwood Avenue and Jeanne Street. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "source": "Facebook", "date": "2016-04-23T13:00:00-04:00", "name": "Earth Day Stewardship Workday"}, {"url": "https://www.facebook.com/events/649771805161029/", "description": "Ann Arbor's Youth-led early music ensemble will be presenting a full program of Bach, Biber and Purcell.  Event proceeds go towards need-based scholarships. Sponsored by Riverfolk Music and Arts and the Ann Arbor Area Community Foundation.", "source": "Facebook", "date": "2016-04-23T19:30:00-04:00", "name": "The Brandenburg Project Presents Bach, Biber and Purcell"}, {"url": "https://www.facebook.com/events/574260982732253/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Gluck\" starring Amy Phillips, Scott Icenogle, and Tim Lally\n\nGroup 2: \"90s Music\" starring Aaron Johnstone and Tom Novik\n\nGroup 3: \"The League of Pointless Improvisers\" starring Chris Moody, Julia Schroeder, Mitch Socia, Aaron Johnstone, and James Quesada", "source": "Facebook", "date": "2016-04-23T20:00:00-04:00", "name": "Pointless Improv with Gluck and 90s Music"}, {"url": "https://www.facebook.com/events/1104519419589243/", "description": "The Kings of Crabgrass are happy to return to downtown Ann Arbor!\n\nhttp://www.blackjakeandthecarnies.com/\n\nAppearing with:\n\nStormy Chromer - prog/improv/rock\nwww.stormychromer.bandcamp.com\n\nCig Butts - jangly rock\nhttp://www.cigbutts.com/\n\nSister Helen - on tour, Brooklyn band brings the alternative\nhttps://www.facebook.com/Sister-Helen-6210178070/\n\nMore information about Heidelberg Club Above:\nhttp://heidelbergannarbor.com/club-above/", "source": "Facebook", "date": "2016-04-23T20:00:00-04:00", "name": "Black Jake & The Carnies - live at Heidelberg - Club Above w/ Stormy Chromer, Cig Butts, Sister Helen"}, {"url": "https://www.facebook.com/events/767351216732483/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"90s Music\" starring Aaron Johnstone and Tom Novik\n\nGroup 2: \"Gluck\" starring Amy Phillips, Scott Icenogle, and Tim Lally\n\nGroup 3: \"The League of Pointless Improvisers\" starring Chris Moody, Julia Schroeder, Mitch Socia, Aaron Johnstone, and James Quesada", "source": "Facebook", "date": "2016-04-23T22:00:00-04:00", "name": "Pointless Improv with 90s Music and Gluck"}, {"url": "https://www.facebook.com/events/2008427479381407/", "description": "We’re celebrating Earth Day all week! You can too by joining us for work in this 20 acre nature area, rich in different habitats (woods, stream, and ponds!). Bring friends and family out to lend a hand combating garlic mustard and other spring invasive plants that threaten the growth of native plants and provide no food for wildlife.\nMeet us at 3470 Woodland Road, off East Huron River Drive, home of one of the Park’s Stewards.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "source": "Facebook", "date": "2016-04-24T09:00:00-04:00", "name": "Earth Day Stewardship Workday"}, {"url": "https://www.facebook.com/events/962465290519288/", "description": "“Receiving the Shore” is a 40 page book of Jennifer’s poems, with a CD of Laszlo's settings of those poems to music.   The duo will perform some of these poems for the audience.\n\nJennifer Burd has had both haiku and lyric poetry published in numerous journals, most recently in Beloit Poetry Journal, NEAT, Acorn, and Modern Haiku. Her full-length book of poems, Body and Echo, was published by PlainView Press in 2010. She is also the author of a book of creative nonfiction, Daily Bread: A Portrait of Homeless Men & Women of Lenawee County, Michigan (Bottom Dog Press, Inc., 2009, with photographs by Lad Strayer), based on her experiences reporting on local homelessness for the Adrian, Michigan, Daily Telegram newspaper. Burd received her BA in English and her MFA in Creative Writing from the University of Washington. She currently works as an editor and writer for HighScope Educational Research Foundation in Ypsilanti, Michigan. \n\nLaszlo Slomovits is one of the twin brothers in the children’s folk music duo Gemini (GeminiChildrensMusic.com).  Laszlo has given concerts throughout the U.S. and a number of his award-winning songs are featured in songbooks music teachers use throughout the country.  In addition, he has set to music the work of many poets. His recordings include five CDs of the poetry of ancient Sufi mystics, Rumi (translated by Coleman Barks) and Hafiz (translated by Daniel Ladinsky) as well as “White Picture” by the Holocaust-era Czech poet Jiri Orten (translated by Lyn Coffin) and “Cry of Freedom,” the poetry of contemporary American poet Linda Nemec Foster. \n\nJennifer and Laszlo have also had their jointly-written poems published in a number of print and on-line journals. In addition, a children’s play they co-wrote, I Can Hear the Sun, based on a book by Patricia Polacco, was produced by Ann Arbor’s Wild Swan Theater in March 2015.", "source": "Facebook", "date": "2016-04-24T15:00:00-04:00", "name": "Join Us for an Afternoon of Poetry with Ann Arbor's Laszlo Slomovits and Jennifer Burd"}, {"url": "https://www.facebook.com/events/220537764986115/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "source": "Facebook", "date": "2016-04-24T16:00:00-04:00", "name": "Beer and Board Games"}]