[{"date": "2016-07-19T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/267429063616714/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nJames Cornelison \nChicago Native James Cornelison has been working as a multi-instrumentalist in Michigan for 5 years. He has played locally with Theo Katzman, the Macpodz, Tree City, Madelyn Grant, Antwaun Stanley, Anna Ash, Heather Black Project, MC Kadence and Chis Good in addition to a number of jazz groups across Detroit and Ann Arbor.  James grew up playing and singing in the Chicago blues scene and currently works as a producer for Michigan based artists.  James is increasingly stepping out from working behind the scenes and as a sideman to pursue his own projects\n\nNever a cover\nAlways a good time", "name": "Acoustic Tuesdays: James Cornelison"}, {"date": "2016-07-19T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1649063915414389/", "description": "It's been HOT out there, but our poetry is hotter and the drinks at Sweetwaters Coffee & Tea  are cool. Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Readers\n\nThis month's feature: ANN ARBOR YOUTH POETRY SLAM TEAM!\n\nHelp welcome the A2 Youth Poetry Slam Team home from Brave New Voices, the international youth slam festival in Washington DC, July 12-16. These 5 young poets -- Sam Kass, Kyndall Flowers, Dylan Gilbert, Brookhlynn McDonald, and Genera Fields -- are repping Ann Arbor hard, so let's give them a warm welcome home with a reprise of the work they just took all the way to the international stage.\n\n\nNext month: No reading in August!\n\nSeptember: DANEZ SMITH!", "name": "Skazat! Poetry Series featuring the Ann Arbor Youth Slam Team"}, {"date": "2016-07-19T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1534323640207083/", "description": "Elizabeth George’s first novel, 'A Great Deliverance', was honored with the Anthony and Agatha Best First Novel Awards and received the Grand Prix de Littérature Policière. Her third novel, 'Well-Schooled in Murder', was awarded the prestigious German prize for suspense fiction, the MIMI. 'A Suitable Vengeance', 'For the Sake of Elena', 'Missing Joseph', 'Playing for the Ashes', 'In the Presence of the Enemy', 'Deception on His Mind', 'In Pursuit of the Proper Sinner', 'A Traitor to Memory', and 'I, Richard' were international bestsellers. Elizabeth George divides her time between Huntington Beach, California, and London. Her novels are currently being dramatized by the BBC.\n\nThe unspoken secrets and buried lies of one family rise to the surface in Elizabeth George’s newest novel of crime, passion, and tragic history. As Inspector Thomas Lynley investigates the London angle of an ever more darkly disturbing case, his partner, Barbara Havers, is looking behind the peaceful façade of country life to discover a twisted world of desire and deceit.\n \nThe suicide of William Goldacre is devastating to those left behind who will have to deal with its unintended consequences—could there be a link between the young man’s leap from a Dorset cliff and a horrific poisoning in Cambridge?\n \nAfter various issues with her department, Barbara Havers is desperate to redeem herself. So when a past encounter gives her a connection to the unsolved Cambridge murder, Barbara begs Thomas Lynley to let her pursue the crime, knowing one mistake could mean the end of her career.\n \nFull of shocks, intensity, and suspense from the first page to the last, A Banquet of Consequences reveals both Lynley and Havers under mounting pressure to solve a case both complicated and deeply disturbing.", "name": "DATE CHANGED to 7/19 Meet NYT Bestselling Author Elizabeth George for a Discussion & Signing of 'a banquet of consequences' a Lynley Novel"}, {"date": "2016-07-20T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/255268508163922/", "description": "The Ann Arbor Art Center and The Guild of Artists & Artisans are hosting a very special edition of our Artists Meet & Greet Series: Art Fair Edition. \n\nPlease join us at the 117 Gallery on Wednesday, July 20 (6:00 to 9:00 pm) and enjoy an evening of networking, connecting with the Art Fair artist community while enjoying a refreshing drink and delicious appetizers.\n\nYou will also get to see our exhibition Real American, an exhibit that explores the generational, ethnographic, cultural, and anthropological ideals of what the word American means.  \n\nThis is a free event.", "name": "Art Fair Edition"}, {"date": "2016-07-20T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/241018282944889/", "description": "This is a free event on July 20th at Arbor Brewing Company in downtown Ann Arbor. Come out to meet and greet Stephen Johnson, author of \"Detroit Beer - A History of Brewing in the Motor City.\" and special guest David Bardallis who is the author of the Ann Arbor Beer Book. This event will be a talk and Q&A on Detroit beer history. Purchase signed copies of the book while enjoying a fine malted beverage in the process. Arbor Brewing Company. This is in conjunction with the bookstore next door - Literati Bookstore", "name": "Detroit Beer Book - Author Signing - Arbor Brewing Company"}, {"date": "2016-07-20T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"date": "2016-07-20T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/578381809033122/", "description": "Literati is excited to join author and owner of Motor City Brew Tours, Stephen C. Johnson, and author of Ann Arbor Beer, David Bardallis, for a discussion of Detroit Beer: A History of Brewing in the Motor City. This event will take place next door in the tap room at Arbor Brewing Company, with the bar open for business! Both books will be available for purchase.\n\nWhile in recent years Detroit’s craft beer scene has exploded with activity and innovation, brewing has a long history in the Motor City. Small brewers popped up during the mid-1800s to support nearby saloons. Many breweries survived the dry years by producing “near beer,” or non-alcoholic beer, which was quickly abandoned after Prohibition. Consolidation marked the following decades until only Stroh Brewery Company remained. Local brewing returned triumphantly with dozens of breweries opening their doors since the 1990s, including Motor City Brewing Works, Atwater Brewery and Kuhnhenn Brewing Company. \n\nStephen Johnson is the owner and founder of Motor City Brew Tours, a tour company that provides guided tours to Michigan breweries. He is also an adjunct professor of marketing at Macomb Community College and has worked in both sales and marketing for over twenty years. Stephen earned a bachelor’s in business from Western Michigan University and a master’s of business administration from Walsh College of Business. A Michigan native, Stephen loves to share his knowledge and history of Detroit the beer scene.\n\nDavid Bardallis is the author of Ann Arbor Beer: A Hoppy History of Tree Town Brewing, and a former beer columnist for the Ann Arbor News an MLive. He has written for Great Lakes Brewing News, Michigan Beer Guide, the Metro Times, and Mitten Brew, among other websites.", "name": "Stephen C. Johnson & David Bardallis"}, {"date": "2016-07-20T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1070299019731690/", "description": "Chigozie Obioma was born in 1986 in Akure, Nigeria. His short stories have appeared in the \"Virginia Quarterly Review \"and \"New Madrid\". He was a fall 2012 Omi Fellow at Ledig House in New York. Obioma has lived in Nigeria, Cyprus, and Turkey and currently resides in the United States, where he has completed an MFA in creative writing at the University of Michigan. \"The Fishermen \"is his first novel.\n\nTold by nine-year-old Benjamin, the youngest of four brothers, THE FISHERMEN is the Cain and Abel-esque story of a childhood in Nigeria, in the small town of Akure. When their father has to travel to a distant city for work, the brothers take advantage of his absence to skip school and go fishing. At the forbidden nearby river, they meet a madman who persuades the oldest of the boys that he is destined to be killed by one of his siblings. What happens next is an almost mythic event whose impact-both tragic and redemptive-will transcend the lives and imaginations of the book's characters and readers.", "name": "Chigozie Obioma - Author & U of M MFA Grad"}, {"date": "2016-07-21T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/994376950635153/", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "name": "The 2016 Ann Arbor Art Fair"}, {"date": "2016-07-21T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/487403974717996/", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "name": "State Street Art Fair"}]