[{"date": "2017-03-22T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/189417071550325/", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "name": "Women's History Month and Planned Parenthood"}, {"date": "2017-03-22T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1839182856327434/", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "name": "Women's History Month and Planned Parenthood"}, {"date": "2017-03-22T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1821291198093435/", "description": "The Ann Arbor Film Festival has been around for over 50 years, fascinating, challenging, enchanting, even appalling and often surprising tens of thousands of viewers - some who have been attending for decades. The AAFF is a highlight of Michigan's cultural year. The majority of screenings will take place at the Michigan Theater (603 E Liberty St, Ann Arbor, MI 48104) with additional events and exhibitions at other venues around downtown Ann Arbor. Tickets and passes are available for purchase on our website.\n\nFind out more info on our website:\nhttp://aafilmfest.org", "name": "The 55th Ann Arbor Film Festival"}, {"date": "2017-03-22T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/348084575586028/", "description": "NOTE: Orchid Festival dates are Sat. & Sun., March 18 & 19, 2017\n\nA two-day orchid extravaganza with orchid displays, orchids in bloom, and regional commercial vendors. Tropical and hardy orchids and orchid-growing supplies and related items for sale. Free informational talks and demos. Presented by Ann Arbor Orchid Society. Free. For hours, photos, and info follow this link: mbgna.blogspot.com/2017/02/2017-ann-arbor-orchid-festival-at.html", "name": "Ann Arbor Orchid Festival"}, {"date": "2017-03-22T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1569594503068582/", "description": "On this Acoustic Tuesday, we welcome Carly Bins to the brewpub.", "name": "Acoustic Tuesday - Carly Bins"}, {"date": "2017-03-22T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1785553591771206/", "description": "Ann Arbor Storytellers' Guild members  Lyn Davidge, Jane Fink, Darryl Mickens and Patti Smith  in a concert of  favorite stories. Judy Schmidt will add smidgens of history from 25 years of storytelling in Ann Arbor.  Copies of the Guild's new 2-CD package Tellabration! LIVE with the Ann Arbor Storytellers' Guild available for sale.\n\nFor more information about the Storytellers go to http://bit.ly/2lWu6oI", "name": "Ann Arbor Storytellers 'Stories for a Spring Evening'"}, {"date": "2017-03-22T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/624580851067696/", "description": "Our Jazz Residency Concert will see all of our jazz combos, both Youth and Adult, performing alongside Paul Keller performing a variety of the pieces they have worked on!", "name": "Jazz Residency Concert with Paul Keller"}, {"date": "2017-03-23T00:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1006014226188234/", "description": "Can't make it to Ann Arbor on March 26? You can still participate in the Probility Ann Arbor Marathon by registering for our Virtual Half Marathon! Virtual participants run or walk 13. 1 miles at a location of their choosing: at a park, on a trail, on a treadmill, even in a different part of Ann Arbor! All Virtual Half Marathons must be completed between February 1 and March 26. When you've completed your Virtual Half Marathon, tell us about it! Post your stats, photos, and story here on the Probility Ann Arbor Marathon Virtual Half Facebook event page; if you post on Twitter, be sure to tag @epicraces and @a2marathon. Best of all, you get the same race shirt and medal as those who join us in downtown Ann Arbor for the actual event!\n\nPlease note: Epic Races does not ship swag to Canada or internationally. If you are a resident of Canada or another country and wish to participate in an Epic Races virtual event, please provide us with a U.S. shipping address.", "name": "2017 Probility Ann Arbor Marathon Virtual Half Marathon"}, {"date": "2017-03-23T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/209961842816480/", "description": "Ah, Nerd Nite! A time for nerds of all kinds to come together and talk of many things. This time around, we’re talking about what medical diagnostic tests can (and cannot) tell us, sustainable living in a solar-powered house made of straw, and how time is dumb - we’re looking at you, Daylight Saving Time!\n\nTesting, testing! NNA2 alum and PhD/MD student Carl Engelke is here to talk about medical testing - the how, the why, and the reality of what some of these common screening exams can and can’t tell us. Science!\n\nHay is for houses! Professor, designer, and farmer Joe Trumpey built his house out of straw and field rocks and determination and ingenuity, and he’s here to tell you the practical side of transitioning to an off-the-grid, sustainable lifestyle.\n\n(H)our third speaker is engineer Matt Carpenter - he’ll take a moment to explain the stories behind leap years and the agony and ecstasy that is falling back and springing forward with Daylight Saving Time. \n\nSo text the friend you’ve been meaning to hang out with and come see us for Tests, Transition, & Time: How to save lives, energy, and daylight at LIVE on First St, Thursday, 3/23, doors at 6:30 pm.", "name": "NNA2 #43: Tests, Transition, & Time"}, {"date": "2017-03-23T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1820736668190406/", "description": "Literati is thrilled to welcome Lindy West in celebration of the paperback release of her memoir, Shrill: Notes from a Loud Woman, a New York Times bestseller, winner of the 2016 Stranger Genius Award for Literature, and a staff pick here at Literati.\n\nShrill is an uproarious memoir, a feminist rallying cry in a world that thinks gender politics are tedious and that women, especially feminists, can't be funny. Coming of age in a culture that demands women be as small, quiet, and compliant as possible--like a porcelain dove that will also have sex with you--writer and humorist Lindy West quickly discovered that she was anything but. From a painfully shy childhood in which she tried, unsuccessfully, to hide her big body and even bigger opinions; to her public war with stand-up comedians over rape jokes; to her struggle to convince herself, and then the world, that fat people have value; to her accidental activism and never-ending battle royale with Internet trolls, Lindy narrates her life with a blend of humor and pathos that manages to make a trip to the abortion clinic funny and wring tears out of a story about diarrhea.\n\nWith inimitable good humor, vulnerability, and boundless charm, Lindy boldly shares how to survive in a world where not all stories are created equal and not all bodies are treated with equal respect, and how to weather hatred, loneliness, harassment, and loss, and walk away laughing. Shrill provocatively dissects what it means to become self-aware the hard way, to go from wanting to be silent and invisible to earning a living defending the silenced in all caps.\n\nLindy West is a Seattle-based writer, editor, and performer whose work focuses on pop culture, social justice, humor, and body image. She's currently a culture writer for GQ magazine and GQ.com and a weekly columnist at The Guardian, as well as the founder and editor of I Believe You | It's Not Your Fault, an advice blog for teens. In 2015 she wrote and recorded a story for This American Life about confronting an Internet troll who impersonated her dead father. She also was listed as \"Internet's Most Fascinating of 2015\" by Cosmopolitan.com, and helped launch the viral #ShoutYourAbortion hashtag in defense of women's reproductive rights.\n \n\nEvent date: \nThursday, March 23, 2017 - 7:00pm\nEvent address: \nLiterati Bookstore\n124 E. Washington St.\nAnn Arbor, MI 48104", "name": "Lindy West"}]