[{"date": "2016-07-30T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/636137526533231/", "description": "This park along the river has lots of great ecological diversity, including restored prairie and oak savanna. Help is needed to protect it from invasive weeds that crowd out natives and  maintaining the Native Garden at this park. The Garden is a living demonstration of the beauty of native wildflowers, both a help for identification and an example of how they can be used in landscaping. Please meet in the parking lot off of Fuller Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Furstenberg Park Stewardship Workday"}, {"date": "2016-07-30T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1185908814776939/", "description": "Moving Image: Landscape explores traditional notions of landscape through four very different time-based works by artists Jim Campbell, Antti Laitinen, Joanie Lemercier, and Rick Silva.\n\nCampbell’s recent body of work, including Seal Rock, presents pixilated images of landscapes created with grids of LEDs. The low-resolution LEDs create a tension between representation and abstraction, provoking viewers to interpret visual information on their own. In the three-channel video, It’s My Island, Laitinen builds his own island in the Baltic Sea by dragging two hundred sand bags into the water over a period of three months. The work explores ideas of nationality, citizenship, and identity as the artist creates his own single-citizen micro-nation. Lemercier’s computer-generated print Landform uses patterns of black dots and projected light to create the illusion of three-dimensionality and movement when seen from a distance. The effects are more realistic than a still image, butstill unsettlingly artificial. Silva’s Render Garden explores the digitized landscape, including remix and glitch aesthetics, through software that endlessly generates new plant combinations.\n\nThroughout the next year, UMMA will present three exhibitions drawn from the Borusan Contemporary Art Collection in Istanbul. The Borusan’s 30-year-old collection includes significant works across a variety of genres, and since 2011 it has focused on media arts. The works exhibited here address formal concerns such as abstraction and color, and conceptual topics such as identity or ecological issues; many represent traditional categories such as portraiture and landscape that find new resonance when explored through the strategies of dynamic technology.\n\nLead support for this exhibition is provided by Susan and Richard Gutow Fund, the Herbert W. and Susan L. Johe Endowment, and the University of Michigan Institute for the Humanities and Penny W. Stamps School of Art and Design.", "name": "Moving Image: Landscape"}, {"date": "2016-07-30T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/529476830574990/", "description": "Who made it first- Texas or New Mexico? Either way, we make it best! Chili+chips+toppings, $5.", "name": "Walking Frito Pie"}, {"date": "2016-07-30T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1560428460931710/", "description": "Our bands play music of Horace Silver and Wayne Shorter", "name": "CMSa2 Jazz concert "}, {"date": "2016-07-30T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/982202251896415/", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2"}, {"date": "2016-07-30T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/888881867907292/", "description": "Brazilian pianist and composer André Mehmari returns to Kerrytown Concert House this summer for another spectacular performance following his 2013 and 2015 shows where he played to packed houses. From the earliest days of classical music through the development of jazz and the other musics of the Americas, composer-improvisors have created repertoire that became the musical literature of each era. Mehmari carries this tradition forward into the 21st century and will show listeners the beauty of improvised music throughout history in solo piano performance. He is regarded as an artistic leader in his native Brazil and is winner of major awards in both classical and popular music.\n\nThis program was developed with support from the Catskill Jazz Factory.\n\n\"André Mehmari is one of those musicians with a prodigious talent, who flashes across the stratosphere once in a lifetime.\"\n- Raul d'Gama, Latin Jazz Network\n\n\"His fingers, well trained to navigate the piano keyboard, can do just about anything. Want speed? Power? Elegance? Lyricism? Experimentation? This guy does it all.\"\n- Adam Parker, The Post and Courier (Charleston, South Carolina)\n\n\"Pianist André Mehmari is a precocious genius, an extraordinary talent of vibrant and generous imagination. He uses his classical training to approach popular music ... in a rich and creative way, making the formality of one language work for the enrichment of the other.”\n- Mauro Dias, O Estado de São Paulo (Brazil)\n\nTickets:\nAssigned Seats in Rows 1-2 - $30\nAssigned Seats in Rows 3-5 - $20\nGeneral Admission - $15\nStudent General Admission - $5 (w/valid ID)", "name": "Pianist André Mehmari: Improvisation through the Ages"}, {"date": "2016-07-30T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1616853798644437/", "description": "Ann Arbor Festival of Song presents the Twenty-Third Annual\nWeek After Art Fair Song Fest\n\nWednesday though Friday, July 27-29, 2016\nKerrytown Concert House\nwww.kerrytownconcerthouse.com    (734-769-2999)  \n415 N. Fourth Ave., Ann Arbor, MI 48104\n\nWednesday July 27, 8:00PM (FREE ADMISSION)\nSONGS WE LOVE TO SING:   Various Composers, Eras, Styles\n\nThursday July 28, 8:00PM (FREE ADMISSION)\nLES CHEMINS DE L’AMOUR:  The Lyrical Legacy of Francis Poulenc\n\nFriday July 29, 8:00PM (Call 734-769-2999 for tickets and reservations)\nSPEAK LOW:  Songs of Weill and Sondheim\n\nFeaturing Kevin Bylsma at the piano, with your favorite singers! \nSOPRANOS\nEmily Benner  \t\nChelsea Cloeter  \t\nJenny Cresswell  \t\nMadeline Harts  \t\nTeri Herron   \t\nRebekah Kroesing   \t\nHillary LaBonte  \t\nJane Schoonmaker Rodgers  \t\n\nMEZZOS\nChristine Amon  \t\nLaura Reaper  \t\nDeanna Relyea  \t\nEllen Strba Scholl \t\nMonica Swartout-Bebow  \t\n\nTENORS\nGregory Ashe\nJohn Hopkins  \t\nChristopher Scholl  \t\n\nBARITONES\nChy Billings \t\nJohn Glann \t\nJohn Mink  \t\nRobert Peavler \t\nDale Schriemer", "name": "2016 Week After Art Fair Song Fest"}, {"date": "2016-07-30T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1754076671528232/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Thursday Interns\"\n\nGroup 2: \"Birdbox\" \n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Andy Reid, Erik Heilner, and Doug Kolbicz", "name": "Pointless Improv with Thursday Interns and Birdbox"}, {"date": "2016-07-30T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/165493343871598/", "description": "Join us on the eve of Harry Potter's birthday, July 30th, for a Harry Potter release party to celebrate the new script, Harry Potter and The Cursed Child! The purchase of one of our event packets will get you a copy of The Cursed Child (available at the end of the party, July 30 at midnight), entry to all of the evening's activities, and lots of HP goodies and treats!  Contact the store directly for ticket information.\n\nWe are also very excited to be partnering on this event with Washtenaw Literacy. 30% of our event packet proceeds will go straight to them and they'll be on hand at the party with information about the good they do and how you can help! Check back here for more event details as they are revealed, or follow us on Facebook, Instagram, or Twitter to see what fun we're preparing for the party! Pre-order your event packet below and mark your calendar for this magical Harry Potter celebration!", "name": "Harry Potter & the Cursed Child Midnight Release Party - Ticketed Event"}, {"date": "2016-07-30T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/639324139578509/", "description": "After the Chelsea/ Real Madrid game \ndoors open 9pm - \nFREE B4 11 if you say you're down with Ann Arbor Reggae. \neveryone else FREE before 10pm\n\nDj Adrenalin\nDiscipline Sound\nDj Maxx\nAnn Arbor Reggae \n18+ welcome\n\n#-DRINK*SPECIALS-# \n$2 bud light/ P.B.R. bottles\n$3 infused Pearl vodka\n$3.50 Heineken \n$4 Malibu Black\n(wells are $5 premiums) makes those $2 beers sound like a steal. come beat the heat with an ICE COLD drink.", "name": "Reggae After The Soccer Game. (Club Above)"}]