[{"date": "2016-11-20T08:00:00-05:00", "name": "35% Off Garden of Life", "description": "All week, all Garden of Life products are 35% off! That includes plant-based protein supplements, vitamins, and even special products just for kids. Stop in to chat with our friendly and knowledgable Natural Living team, and stock up on wellness!", "source": "Facebook", "url": "https://www.facebook.com/events/144098819397112/"}, {"date": "2016-11-20T11:15:00-05:00", "name": "Learn the wood lathe - $50 - 2 Hrs", "description": "Learn how to use our Oliver Model 159 wood lathe. This class will cover how to go about safely using the lathe, to turn both spindles and small bowls. We will also touch on choosing the best wood for your project.\n\nNo prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.\n\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut/15640133 to register!", "source": "Facebook", "url": "https://www.facebook.com/events/174401883020315/"}, {"date": "2016-11-20T13:00:00-05:00", "name": "Stewardship Workday- Sunset Brooks Nature Area", "description": "Stewardship Workday\nSunday, November 20\nSunset Brooks Nature Area\n1 to 4 p.m.\nSunset Brooks is truly a gem among our nature areas. It features 7.8 acres of beautiful wetlands and rolling woods dotted with oaks and hickories, which are further decorated by dogwood groves and wildflowers in the spring. To ensure the health of these vibrant ecological communities, the Park Stewards here need your help! Come learn how to identify and remove the invasive species threatening this much loved park. Please meet at the park entrance on Beechwood Drive, and be sure to wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "source": "Facebook", "url": "https://www.facebook.com/events/1138006042927153/"}, {"date": "2016-11-20T16:00:00-05:00", "name": "Ann Arbor Derby Dimes 2016 season", "description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nRSVP on FB: http://bit.ly/29dSJv0\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule\n\n______________________________________________\n\n\nPreviously this season:\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nRSVP on FB: http://bit.ly/29dSikp\nBUY JUNE 11 TICKETS: http://bpt.me/2538000", "source": "Facebook", "url": "https://www.facebook.com/events/192972824428594/"}, {"date": "2016-11-20T16:00:00-05:00", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "source": "Facebook", "url": "https://www.facebook.com/events/372265006445716/"}, {"date": "2016-11-20T17:30:00-05:00", "name": "Alison Perkins + Nicolas Brown- Album Release Concert!", "description": "The Celtic Room at Conor O'Neill's Pub\n318 South Main St, Ann Arbor, MI 48104\nShow starts at 5:30pm - Doors at 5:00pm\nGeneral: $15 | Students: $12 | Kids under 10 free\n\nAlbum release show! \"All Covered With Moss\"\nMichigan's own ALISON PERKINS (of Finvarra's Wren) and NICOLAS BROWN have been playing Irish traditional music on uilleann pipes and fiddle together for close to a decade. As individuals, they have performed onstage at festivals and concerts across the U.S and Canada. Together they are bringing their close musical partnership to the stage. Introducing old Irish tunes with new feeling, they bring forth the beauty found in jigs, reels, and more. Join Strayaway Child Concert Series, and special guests, in a concert to celebrate the release of their debut album All Covered With Moss.\n\nVisit Alison and Nick on the web to hear them! www.pipesandfiddle.com", "source": "Facebook", "url": "https://www.facebook.com/events/125627861239407/"}, {"date": "2016-11-20T19:00:00-05:00", "name": "Open Mic and Feature: Daniel Bigham", "description": "Daniel Bigham is a poet, performer, and educator from Ann Arbor.  In 2005, he was part of the Brave New Voices team that made it all the way to a final stage of 3500 people, and since then he’s made it his mission to share that gift as best he can.  He coaches youth slam teams, taught at the Volume Youth Poetry Project, tutors English at WCC, and spends his time chilling with they young’uns as the Drop-In Advisor at the Neutral Zone.\n\nWe'll have one round of open mic, and then a feature set from Daniel.  Come on out and share your work!", "source": "Facebook", "url": "https://www.facebook.com/events/1733379946981534/"}, {"date": "2016-11-20T19:00:00-05:00", "name": "Transgender Day of Remembrance 2016", "description": "Trans Day of Remembrance (TDOR) is an annual observance on November 20 that honors the memory of those whose lives were lost in acts of anti-transgender violence. We will gather in Student Center room 352 to learn, listen, and hold memory. Vigil immediately following.", "source": "Facebook", "url": "https://www.facebook.com/events/652985328217339/"}, {"date": "2016-11-20T19:00:00-05:00", "name": "The Arcade - A Pointless Improv Jam", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "source": "Facebook", "url": "https://www.facebook.com/events/1775178866064005/"}, {"date": "2016-11-21T18:00:00-05:00", "name": "Trans Day of Remembrance (TDOR)", "description": "Please join us in honoring Trans lives that have been lost and remembering their names as they rest in power.", "source": "Facebook", "url": "https://www.facebook.com/events/262534960811351/"}]