[{"date": "2017-03-07T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1839182856327434/", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "name": "Women's History Month and Planned Parenthood"}, {"date": "2017-03-07T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1866046956943397/", "description": "We're excited to bring back Acoustic Tuesdays to the brewpub! Please join us on our first night back as Joel Rydecki of the Joel Rydecki Band kicks off the year.", "name": "Acoustic Tuesdays Return - Joel Rydecki"}, {"date": "2017-03-08T00:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/388503011499248/", "description": "COLD-PRESSED JUICE CLEANSES ARE BACK!\n\n... and just in time for the New Year! For the month of January only– get 10% off your juice cleanse and a free yoga class with Bikram Yoga West!\n\nBook your Cleanse now with promo code JUICECLEANSEJANUARY at Store.BaboAnnArbor.com!", "name": "Babo Juice Cleanses"}, {"date": "2017-03-08T18:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1645450165471879/", "description": "The mission of The Open Organization Of Lockpickers is to advance the general public knowledge about locks and lockpicking. By examining locks, safes, and other such hardware and publicly discussing our findings, we hope to strip away the mystery with which so many of these products are imbued.\n\nAll are welcome.  If you have any locks or tools, feel free to bring\nthem.  If not, there is plenty to go around.  Meetings generally\nconsist of people picking locks while we talk about physical or cyber security, or just about anything else. \n\nhttp://a2-locksport.org/", "name": "The Open Organization Of Lockpickers (second Wed of the month)"}, {"date": "2017-03-08T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1757326974583331/", "description": "Literati is pleased to welcome Nickolas Butler in support of his new novel, The Hearts of Men.\n\nThe Hearts of Men is an epic novel of intertwining friendships and families set in the Northwoods of Wisconsin at a beloved Boy Scout summer camp--and a finalist for the 2016 Prix Médicis Etrangere--from the bestselling author of Shotgun Lovesongs.\n\nCamp Chippewa, 1962. Nelson Doughty, age thirteen, social outcast and overachiever, is the Bugler, sounding the reveille proudly each morning. Yet this particular summer marks the beginning of an uncertain and tenuous friendship with a popular boy named Jonathan. Over the years, Nelson, irrevocably scarred from the Vietnam War, becomes Scoutmaster of Camp Chippewa, while Jonathan marries, divorces, and turns his father’s business into a highly profitable company. And when something unthinkable happens at a camp get-together with Nelson as Scoutmaster and Jonathan’s teenage grandson and daughter-in-law as campers, the aftermath demonstrates the depths—and the limits—of Nelson’s selflessness and bravery. The Hearts of Men is a sweeping, panoramic novel about the slippery definitions of good and evil, family and fidelity, the challenges and rewards of lifelong friendships, the bounds of morality—and redemption.\n\n\"Like a great campfire story, The Hearts of Men is epic and hushed in the right places, simultaneously local and universal, and brilliantly, beautifully unspooled. It s both a love letter to good men of the past and a hopeful cheer for the good men to come.\" --J. Ryan Stradal, author of Kitchens of the Great Midwest\n\nNickolas Butler was born in Allentown, Pennsylvania, raised in Eau Claire, Wisconsin and educated at the University of Wisconsin-Madison and the University of Iowa Writer's Workshop. He is the author of the internationally-best selling novel Shotgun Lovesongs, a collection of short stories entitled, Beneath the Bonfire, and The Hearts of Men which has already been longlisted for two of France's top literary awards. He is the winner of France's prestigious PAGE Prix America, the 2014 Great Lakes Great Reads Award, the 2014 Midwest Independent Booksellers Award, the 2015 Wisconsin Library Association Literary Award, the 2015 UW-Whitewater Chancellor's Regional Literary Award, and has been long-listed for the 2014 Flaherty Dunnan Award for First Novel and short-listed for France's FNAC Prix. Along the way, he has worked as: a Burger King maintenance man, a tutor, a telemarketer, a hot-dog vendor, an innkeeper (twice), an office manager, a coffee roaster, a liquor store clerk, and an author escort. His itinerant work includes: potato harvester, grape picker, and Christmas tree axe-man. His short stories, poetry, and non-fiction have appeared in: Ploughshares, The Kenyon Review Online, The Lumberyard, The Christian Science Monitor, Narrative, Sixth Finch, and several other publications.\n\nEvent date: \nWednesday, March 8, 2017 - 7:00pm", "name": "Nickolas Butler"}, {"date": "2017-03-08T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/340989426297521/", "description": "Alley Bar is once again partnering with A2CT for their Give Back Thursdays program!  Here's how it works: Alley Bar donates 10% of their sales each Thursday in March to A2CT.  So come on out., hang out with friends, support a great local bar AND your favorite theatre! Hope to see you there.", "name": "Give Back Thursdays"}, {"date": "2017-03-08T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1727652404193596/", "description": "This semester, in an effort to select one lucky musician from the University of Michigan campus, MUSIC Matters will be hosting MUSIC Madness, a Battle of the Bands competition. The winner will be offered an opportunity to perform during our music and arts festival, Springfest!\n\nThis event will be carried out in three rounds. The first two are the preliminary rounds, in which any student musician or artist from the Ann Arbor community can sign up to compete in one of two locations. The first event will take place Friday, February 17th in the Michigan League Basement and the second will be at the Kerrytown Concert House on Wednesday, March 8th. We ask that musicians sign up for only one of the two preliminary events. From there we will take the most enigmatic four of each round to make up our final competition, an opportunity for eight of the most highly regarded musicians in Ann Arbor to come together and play a song or two. Not only will the room be charged with excited energy in anticipation of the winner, but there is no question that the talent presented will be unprecedented! This third and final event will occur on Thursday, March 30th at Club Above. From then on, one artist will be invited to perform at Springfest, partnered with world renown artists from some of the most celebrated labels.   \n\nAt-will donations appreciated", "name": "MUSIC Matters: Battle of the Bands"}, {"date": "2017-03-08T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1238031392951145/", "description": "Aaaaaand we're back! After countless semesters of contests and concerts, the organizers at MUSIC Matters have decided to take their talents to the world of sports. This semester, we will be hosting the first annual MUSIC Madness: a battle of the bands tournament.The winner will have the opportunity to perform at our spring festival!! \n\nTHREE EVENTS, ONE CHAMPION\n\nPRELIMS: \nFebruary 17th: Michigan League Basement\n\t\nMarch 8th: Kerrytown Concert House\n\nFINALS: \nMarch 30th @ Club Above  \n\nThis 3 night, 3 venue knockout-style tournament was created to answer the question we've all been asking...who really is the best musician at Michigan? Two preliminary rounds will take place Friday, February 17th and Wednesday, March 8th. From there we will take the final four of each round to make up our elite 8! These top acts will then put everything on the line as they juke it out for the 'ship March 30th at Club Above. Winner will have the opportunity to perform at our music and art festival, SpringFest!\n\nIf you think you got what it takes to go the distance, submit your application through the link below. We will be accepting participants till February 10th, 11:59pm.\n\n\nhttps://docs.google.com/a/umich.edu/forms/d/e/1FAIpQLSfjzNz8zVAdVYYhx51Ut6Y0jW_vRTLDLPZzqluMfR4S_jgkqg/viewform\n\nSurvive and Advance.", "name": "MUSIC Madness: A Battle of the Bands Tournament"}, {"date": "2017-03-09T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/230775294023258/", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "name": "Exhibit: Avant Garden-Fashion & Plants Together!"}, {"date": "2017-03-09T17:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/249095642207755/", "description": "Jenny Offill's first novel Last Things, published in 1999, was a New York Times Notable book and a finalist for the L.A Times First Book Award. Offill's second novel Dept. of Speculation was published in January 2014 and was named one of the 10 Best Books of 2014 by the New York Times Book Review. Dept. of Speculation has been shortlisted for the Folio Prize in the UK, the Pen/Faulkner Award and the L.A. Times Fiction Award. Her work has appeared in the Paris Review. She is also the co-editor with Elissa Schappell of two anthologies of essays and the author of several children's books.\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon ’13).", "name": "Zell Visiting Writers Series: Jenny Offill, Prose"}]