[{"source": "Facebook", "url": "https://www.facebook.com/events/1146731132025884/", "description": "Come on out for National Get Outdoors Day! Volunteers are needed to remove invasive plants that provide no food for wildlife and crowd out native wildflowers. This park offers some interesting views of the river, and has a small hidden prairie. Meet at the park entrance on Sunset Road. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "date": "2016-06-11T09:00:00-04:00", "name": "Bluffs Park Stewardship Workday-National Get Outdoors Day"}, {"source": "Facebook", "url": "https://www.facebook.com/events/623453207808430/", "description": "Join Poto MBA for Take a Kid Mountain Biking Day on the Appleton Loop at Brighton Recreation Area on June 11, 2016. \n\nTKMBD is a celebration developed and coordinated by IMBA, which strives to encourage communities around the world to join together and ride mountain bikes with youth. TKMBD celebrates the joy of riding in the dirt. \n\nBesides being good, healthy fun, the goal is to develop a connection between kids and the natural world around them. Today’s children are tomorrow’s bike enthusiasts, trail coordinators, land managers, and politicians.\n\nThere will also be food and events for kids and guided rides of the Appleton Loop. A balance bike course will be set up for early riders. Hometown Bicycles will be on site, as well as your local Poto MBA chapter. Bike enthusiasts will be promoting safety including bike and helmet checks, skills development, and Leave No Trace principles.\n\nThere will be IMBA swag for kids. IMBA TKMBD care packages include CLIF Kid Z bars, a kid-friendly Rules of the Trail poster, IMBA icon stickers, and commemorative race plates (while supplies last).\n\nDETAILS:\nDate: June 11, 2016 from 10am – 2pm\nLocation: Brighton Recreation Center, Appleton Trail Loop (2 mile, beginner-level) - Visit: http://www.mtbproject.com/trail/7004478 to see a trail map. \nCost: Free! (Entrance fee applies unless you have a Michigan Recreation Passport)\nFor more information: Visit http://www.potomba.org/tkmbd/ \n\nCome out and enjoy the fun with the kids. #TKMBD\n\nParticipants are required to sign a waiver the day of the event. Children must be accompanied by an adult.\n\nPlease continue to watch for event updates.", "date": "2016-06-11T10:00:00-04:00", "name": "Take a Kid Mountain Biking Day #TKMBD"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1761827144051389/", "description": "This exhibition presents new and recent work by Los Angeles-based artist Catherine Opie, one of the essential figures in contemporary photography. Beginning in 2010, Opie spent six months taking photographs at the Bel Air, California, residence of Elizabeth Taylor (1932–2011). The exhibition includes 50 works drawn from two series, Closets and Jewels and 700 Nimes Road. Opie’s lens captures the essence of the Hollywood legend through her personal objects and mementos, and portrays Taylor’s life experience and eccentricity as an illusory subject, one that cannot be specifically designated or precisely described. In the artist’s words, the project is not about the relationship to celebrity but about “the relationship to what is human.”\nCatherine Opie: 700 Nimes Road is organized by the Museum of Contemporary Art, Los Angeles. This exhibition is made possible with lead support provided by J.P. Morgan Private Bank and major support from Jamie McCourt, and Gilena Simons.", "date": "2016-06-11T11:00:00-04:00", "name": "Opening Exhibition: Catherine Opie: 700 Nimes Road"}, {"source": "Facebook", "url": "https://www.facebook.com/events/507910882734023/", "description": "Detroit-based architect Catie Newell’s work is focused on the tactile, sensory qualities of the materials we use to build things: their texture, density, or malleability. Her investigations combine architectural research, material studies, and art experiments, a strategy she began as a student that now defines her career.\n\nThe most important element in her formal vocabulary is light, not only as a “material” in its own right, but also as a condition. Varying in strength, form, and duration, light constructs architecture as a situational experience rather than a fixed space. Newell’s fascination with light is a fascination with darkness. Through urban interventions, installations, and photographs, she investigates how darkness creates alternate environments, with unseen geographies, untold histories, and secret identities.\n\n\nLead support for this exhibition is provided by the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Taubman College of Architecture and Urban Planning.", "date": "2016-06-11T11:00:00-04:00", "name": "Catie Newell: Overnight"}, {"source": "Facebook", "url": "https://www.facebook.com/events/478741615584046/", "description": "NEW SPRING MENUS!\n\nNew season, new Menu. Introducing new menu items that are seasonally fresh, bright, and delicious!\n\nBringing all things spring to the table, with new colorful and locally sourced food and beverage options. \n\nCheck out our new menus at http://aventuraannarbor.com \n\nMAKE A RESERVATION\nClick link listed in \"Tickets Available\"", "date": "2016-06-11T12:00:00-04:00", "name": "New Spring Cocktail & Dinner Menus"}, {"source": "Facebook", "url": "https://www.facebook.com/events/485616464964635/", "description": "Join families across the country and get outdoors on National Get Outdoors Day. At this workday, volunteers will help restore this nature area by removing spotted knapweed and other invasive plant species. This makes more room for the rich diversity of wildflowers here. Meet at the park entrance on Beechwood Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "date": "2016-06-11T13:00:00-04:00", "name": "Kuebler Langford Park Stewardship Workday-National Get Outdoors Day"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1581480665515146/", "description": "Barbara J. Rebbeck is a teacher and writer who lives in Royal Oak, Michigan. She has degrees from Eastern Michigan University and Oakland University in French and English. She has published poetry, fiction and professional articles. She is a past-president of the Michigan Council of Teachers of English and a former Director of the Oakland Writing Project. \n\nEssence LaFontaine and Grace Woodson don’t know each other, but soon Hurricane Katrina will blow into their lives, forcing them together into a different kind of storm—a storm swirling with the winds of bigotry and prejudice. Can the girls find their way to the light behind the clouds?\n\nNew Orleans: Essence watches her neighbors prepare to evacuate, but her stubborn grandma refuses to budge, jeopardizing the lives of both her granddaughters, Essence and her little sister, Chardonnai, while their mother works as a nurse at a local hospital.\n\nHouston: Grace listens to her iPod and sighs when her mom urges her to finish her summer reading, but Grace can think only of her forbidden MySpace page.\n\nKatrina strikes with a fury and although Essence and Chardonnai are rescued, their grandmother Mimmi stays behind with their skinny poodle, George. After terrifying hours in the Superdome they board a bus for the Houston Astrodome along with other victims of Hurricane Katrina, including a man named Harold, who Essence strongly suspects is her long-lost father.\n\nAfter Grace is suspended from St. Catherine’s for her disobedient behavior, she accompanies her father, a psychologist, to the Astrodome to help with the evacuees.\n\nSo Grace begins her essay for English class, her attempt to describe her day with the pitiful Katrina victims. She sees before her the lessons of her required reading, To Kill a Mockingbird, and at a loss as to what to do, she begins to read the book aloud to a tattered group including Essence and her new family of fellow survivors.\n\nWith the city of New Orleans devastated, the Woodson family allows Essence and Chardonnai to live with them and both girls begin school at St. Catherine’s. But, like a hurricane, trouble is brewing.", "date": "2016-06-11T15:00:00-04:00", "name": "Meet Michigan Author Barbara Rebbeck for a Discussion & Signing of Her Debut Young Adult Novel, 'NOLA Gals'"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1092854707438377/", "description": "Join Ann Arbor Roller Derby at Buhr Park on June 11 for a Derby Double Header! Two great roller derby mash ups for one low price! \n\n6:00- Ann Arbor Brawlstars vs. North Star Roller Girls Supernovas. \n\n7:30- Arbor Bruising Co. vs. North Star Roller Girls Northern Lights. \n\nBouts include kid-friendly activities, half-time entertainment, sponsored concessions, and giveaways! \n\nEnjoy a cold Pabst Blue Ribbon, Founder's Pale Ale, or Angry Orchard Cider while you watch the games!\n\nDoors open at 5:00, first whistle at 6:00.\n\nAfter party location: * Aubree's Pizzeria and Grill* 39 E. Cross Street, Ypsilanti, MI 48198 * http://aubrees.com/\n\nBuy tickets for this event at http://a2d2doubleheader061116.brownpapertickets.com/\n\nOR save $15 by buying a season pass! Now only $30!\nhttp://a2d2seasontickets2016.bpt.me/", "date": "2016-06-11T17:00:00-04:00", "name": "Ann Arbor Roller Derby Double Header"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1084451288291551/", "description": "Live in Ann Arbor.  The Club Above is great venue with great sound, location and plenty of room for a crowd! Bring good vibes!", "date": "2016-06-11T18:00:00-04:00", "name": "Human Juicebox, The Lefties, The Landmarks LIve at the Club Above"}, {"source": "Facebook", "url": "https://www.facebook.com/events/221236044925450/", "description": "Contact J. Spikes For Pre Sale Tickets", "date": "2016-06-11T21:00:00-04:00", "name": "Take That Music J.Spikes Summer Madness Party"}]