[{"source": "Facebook", "url": "https://www.facebook.com/events/1816550935245704/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe", "date": "2016-07-29T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1615653315411397/", "description": "Literati is pleased to welcome Margaret Wappler in support of her debut novel, Neon Green.\n\nIt's the summer of 1994 in suburban Chicago: Forrest Gump is still in theaters, teens are reeling from the recent death of Kurt Cobain, and you can enter a sweepstakes for a spaceship from Jupiter to land in your backyard. Welcome to Margaret Wappler's slightly altered 90s. Everything's pretty much the way you remember it, except for the aliens. When a flying saucer lands in the Allens' backyard, family patriarch and environmental activist Ernest is up in arms. According to the company facilitating the visits, the spaceship is 100 percent non-toxic, but as Ernest's panic increases, so do his questions: What are the effects of longterm exposure to the saucer and why is it really here? The family starts logging the spaceship's daily fits and starts but it doesn't get them any closer to figuring out the spaceship's comically erratic behavior. Ernest s wife Cynthia and their children, Alison and Gabe, are less concerned with the saucer, and more worried about their father s growing paranoia (not to mention their mundane, suburban existences). Set before the arrival of the internet, Neon Green will stun, unnerve, and charm readers with its loving depiction of a suburban family living on the cusp of the future.\n\nMargaret Wappler has written about the arts and pop culture for the Los Angeles Times, Rolling Stone, Elle, The Believer, The Village Voice, and several other publications. Her work has appeared in Black Clock, Public Fiction, and the anthology Joyland Retro. Neon Green is her first novel. She lives in Los Angeles.", "name": "Fiction: Margaret Wappler", "date": "2016-07-29T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1108266935906140/", "description": "Come join friends & neighbors alike for a fun, slow, community bike ride through Ann Arbor.\n\nThe fun starts at the Ann Arbor Farmers Market and will continue at a leisurely pace around town, where we will \"bike-in\" to the Sic Transit Cycles Showroom on Swift St. (https://goo.gl/maps/eGwYfrTDTLq) for some post-ride refreshments and shop discounts.\n\nSic Transit is a full-service bicycle shop specializing in urban cycling, commuting, touring, cyclocross bikes and all levels of road riding. They're super friendly, too!\n\nMeet up time is 7:00 PM (departing 7:15 PM). Plan on a nice & easy route, 10 miles or less, within city limits. Check back later this month for route & other details to come. Until then, ride safe, be friendly, and have fun!\n\n\nWhat's Bike-in?\nSee the community page:\nhttps://www.facebook.com/bikeinannarbor/info?tab=page_info\n\nOR read below\n\nBike-in is: Slow bike rides throughout Ann Arbor for everyone. Post-ride fun with friends, neighbors, and visitors around the community.\n\nEach ride we will begin at the listed location & time, ride casually, then finish the ride by \"biking-in\" to a post-ride time together at a local establishment, green space, or other friendly host setting (i.e. Bike-in :: Movie (outdoor), Creamery (ice cream), Picnic (potluck), Garden (beer garden), etc.).\n\nRides will be open and friendly to all. For gathering information, times, locations, riding routes, weather updates, etc. like/follow the page or visit for updates.\n\nPlease practice safe riding and abide by all legal riding rules at all times, especially while riding with a Bike-in community. Be sure to provide your own helmet, riding lights, and other appropriate accessories.", "name": "Bike-in :: Sic Transit", "date": "2016-07-29T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1759561060951794/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"MATCH\" starring Matt Pendrige and Mitch Socia\n\nGroup 2: \"50 States of Cray Cray\" \n\nGroup 3: \"The League of Pointless Improvisers\" starring Corene Ford, Jason Valentini, Moni Jones, and Mitch Socia", "name": "Pointless Improv with MATCH and 50 States of Cray Cray", "date": "2016-07-29T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/502248113299977/", "name": "Fallow Land All is Well The Great Indoors Dogwood and Adam Kahana at the Club Above", "date": "2016-07-29T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1775506519330854/", "description": "House | EDM | Trap | Twerk | Electro\nmusic by KEVIN MICHAEL\n\nKevin Michael, aka Kevin Kerber aka The Dangling Participle has been started from the bottom and now he’s here. From rocking stages to rocking chairs, Kevin Michael has always been a bastion of excellence in music, arts, culture, and oxford commas. His frenetic, open-format style of mixing has been described as, “pop-meets-electro-meets-slow-cooker.” This Ann Arbor based DJ is in it to win it. On his off time, Kevin Michael can be found lifting weights, eating mammies, not reading directions, and sardonically pontificating on miscellaneous etcetera. If you’re looking for the same old DJ, swipe left. http://bit.ly/LiveA2b", "name": "Festival Friday", "date": "2016-07-29T22:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/295103527490250/", "description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring Corene Ford, Jason Valentini, Moni Jones, and Mitch Socia", "name": "A Pointless Display of Improvised Feats", "date": "2016-07-29T22:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/636137526533231/", "description": "This park along the river has lots of great ecological diversity, including restored prairie and oak savanna. Help is needed to protect it from invasive weeds that crowd out natives and  maintaining the Native Garden at this park. The Garden is a living demonstration of the beauty of native wildflowers, both a help for identification and an example of how they can be used in landscaping. Please meet in the parking lot off of Fuller Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Furstenberg Park Stewardship Workday", "date": "2016-07-30T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1185908814776939/", "description": "Moving Image: Landscape explores traditional notions of landscape through four very different time-based works by artists Jim Campbell, Antti Laitinen, Joanie Lemercier, and Rick Silva.\n\nCampbell’s recent body of work, including Seal Rock, presents pixilated images of landscapes created with grids of LEDs. The low-resolution LEDs create a tension between representation and abstraction, provoking viewers to interpret visual information on their own. In the three-channel video, It’s My Island, Laitinen builds his own island in the Baltic Sea by dragging two hundred sand bags into the water over a period of three months. The work explores ideas of nationality, citizenship, and identity as the artist creates his own single-citizen micro-nation. Lemercier’s computer-generated print Landform uses patterns of black dots and projected light to create the illusion of three-dimensionality and movement when seen from a distance. The effects are more realistic than a still image, butstill unsettlingly artificial. Silva’s Render Garden explores the digitized landscape, including remix and glitch aesthetics, through software that endlessly generates new plant combinations.\n\nThroughout the next year, UMMA will present three exhibitions drawn from the Borusan Contemporary Art Collection in Istanbul. The Borusan’s 30-year-old collection includes significant works across a variety of genres, and since 2011 it has focused on media arts. The works exhibited here address formal concerns such as abstraction and color, and conceptual topics such as identity or ecological issues; many represent traditional categories such as portraiture and landscape that find new resonance when explored through the strategies of dynamic technology.\n\nLead support for this exhibition is provided by Susan and Richard Gutow Fund, the Herbert W. and Susan L. Johe Endowment, and the University of Michigan Institute for the Humanities and Penny W. Stamps School of Art and Design.", "name": "Moving Image: Landscape", "date": "2016-07-30T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/529476830574990/", "description": "Who made it first- Texas or New Mexico? Either way, we make it best! Chili+chips+toppings, $5.", "name": "Walking Frito Pie", "date": "2016-07-30T12:00:00-04:00"}]