[{"url": "https://www.facebook.com/events/1736136836668228/", "description": "To celebrate Earth Day and help teach kids how being a friend to the enviroment pays off, we're giving every child under 12 a piece of organic fruit when they bring in something to be recycled! Just have your kiddo bring their recycleable in to trade with one of our produce team members- happy Earth Day!", "date": "2016-04-22T07:00:00-04:00", "source": "Facebook", "name": "Earth Day for Kids"}, {"url": "https://www.facebook.com/events/821215881341821/", "description": "Earth Day is one of our very favorite days, and to celebrate, our bulk department is 30% off, Friday only! That's all our grains, coffee, dried fruit, granola, nut butters, olive oil, candy, trail mix, and so much more! The first 50 customers who purchase something from our bulk department get a free mason jar, to boot :)\n\nPS- We love it when you bring in your own containers! Just ask one of our cashiers to weigh your container before you fill it up so you're not paying for your container, too.\n\nThis sale is does not include our pre-packaged bulk products.", "date": "2016-04-22T07:00:00-04:00", "source": "Facebook", "name": "Bulk Sale- One Day Only!"}, {"url": "https://www.facebook.com/events/1731942977018995/", "description": "Come enjoy the myriad of sonic airwaves that Hullabaloo creates with their Latin Jazz, Afro- Caribbean, Ska-Reggea, rock and funk infused music!  Free show at the Necto!   Drink specials and great atmosphere!  Tips greatly appreciated, and dancing shoes are encouraged!", "date": "2016-04-22T18:30:00-04:00", "source": "Facebook", "name": "Hullabaloo Happy Hour!"}, {"url": "https://www.facebook.com/events/1122376211138399/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Frank & Dale\" starring Julia Schroeder and Lance Purkey\n\nGroup 2: \"Butt Sweatin Tears\" starring Chris Fortin, Kelly Idzikowski, Audra Jantz, and Alex Boyd\t\n\nGroup 3: \"The League of Pointless Improvisers\" starring Doug Kolbicz, Jason Valentini, Matt Swartz, Moni Jones, and Andy Reid", "date": "2016-04-22T20:00:00-04:00", "source": "Facebook", "name": "Pointless Improv with Frank & Dale and Butt Sweatin Tears"}, {"url": "https://www.facebook.com/events/1943009162591226/", "description": "Warm as summer sunshine, real as the truth, intimate as a long overdue visit between old friends … such is a Jonathan Edwards concert. Four decades into a stellar career of uncompromising musical integrity, the man simply delivers, night after night – songs of passion, songs of insight, songs of humor, all rendered in that pure and powerful tenor which, like fine wine, has only grown sweeter with age.\nThis is one veteran performer who is neither grizzled nor nostalgic.  \nJonathan's  highly respected repertoire  includes such classics as, “Sometimes,” “One Day Closer,” “Don’t Cry Blue,” “Emma,” “Everybody Knows Her,” “Athens County,” and everyone’s favorite ode to putting a good buzz on, “Shanty.” And then, of course, there’s the anthemic “Sunshine (Go Away Today),” that fierce proclamation of protest and independence that resonated with thousands and thousands of frustrated and angry young men and women when it was first released in 1971. Almost 40 years later, at show after show, the song continues to be embraced by faithful followers and new fans alike.\nSince 1971, Jonathan has released 15 albums, including \"Blue Ridge,\" his standard-setting collaboration with bluegrass favorites the Seldom Scene, and \"Little Hands,\" his collection of children’s songs, which was honored with a National Library Association award. His brand new album is, \"Tomorrow's Child.\"\nwww.jonathanedwards.net", "date": "2016-04-22T20:00:00-04:00", "source": "Facebook", "name": "Jonathan Edwards at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/620213251459948/", "description": "BOARD+BREW: A2 No. 2 Eh Tu \nwhere: Ground Floor @ 327 Braun Court Kerrytown \nadmission: nothing \ndonation: zero \nbring: everyone!\n\n** New Library Games **\n\nFUSE -- it's amazing!\nDIAMONDS -- it's shiny!\nYardmaster Express -- it's fine!", "date": "2016-04-22T20:00:00-04:00", "source": "Facebook", "name": "Board Game Night at Bar Braun Court"}, {"url": "https://www.facebook.com/events/935490533173037/", "description": "Big Wild\nw/ Aash Mehta & Azura Music\n\nFri. April 22 | 9pm | All Ages | $10 adv./ $12 day of\n\nStemming from a relentless desire to create something new, Big Wild’s sound taps into the natural curiosity we all share by exploring beyond conventional boundaries in music. This spark was ignited when he first began creating music under the heavy influence of modern hip hop producers. Since then, he has increasingly drawn inspiration from the limitless potential of electronic music, while at the same time building a style unique to him.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/637\n\nConnect with Big Wild:\nhttp://bigwildmusic.com\nhttp://soundcloud.com/bigwildmusic \nhttp://twitter.com/bigwildmusic\nhttp://instagram.com/bigwildmusic", "date": "2016-04-22T21:00:00-04:00", "source": "Facebook", "name": "Big Wild :: 4/22 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1126490137441556/", "description": "Solar Powered Faygo Whirling Test... Can you pass?\n\nall vinyl techno & house party\n\nsuitor\nhttps://soundcloud.com/suitor-1\n\npat in the hat\nhttps://soundcloud.com/patinthehatdoe\n\nsegv\nhttps://soundcloud.com/segv\n\njeff garcia\nhttps://mixcloud.com/garconsrustiques/\n\njimmy k\nhttps://soundcloud.com/jimmykdetroit\n\nvisuals by Deep Grey & Franny\n\n$3 Faygo mixed drinks\n\n9pm doors | 18 and up welcome\n\nClub Above\n215 N Main Street\nDowntown Ann Arbor", "date": "2016-04-22T21:00:00-04:00", "source": "Facebook", "name": "Solar Powered Faygo Whirling Test: suitor, pat in the hat, segv, jeff garcia & jimmy k"}, {"url": "https://www.facebook.com/events/577511505760697/", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring Doug Kolbicz, Jason Valentini, Matt Swartz, Moni Jones, and Andy Reid", "date": "2016-04-22T22:00:00-04:00", "source": "Facebook", "name": "A Pointless Display of Improvised Feats"}, {"url": "https://www.facebook.com/events/830729107033305/", "description": "This long slim park has plenty of native trees, including a lovely big bur oak, but the understory has been invaded by garlic mustard and other invasive species. You and your friends and family can help us celebrate Earth Day by removing invasive plants that crowd out native wildflowers. Meet at the park entrance at the intersection of Powell Avenue and Columbia Avenue.", "date": "2016-04-23T09:00:00-04:00", "source": "Facebook", "name": "Earth Day Stewardship Workday"}]