[{"date": "2016-06-02T11:30:00-04:00", "name": "Aventura Spring Menu Launch", "description": "Your favorite dinner spot just became your favorite lunch spot.\nBringing great food, and quick service to your lunch break. Offering paella for two, Spanish flatbreads, salads, and more!\nCheck out the new menu with the link listed above.", "source": "Facebook", "url": "https://www.facebook.com/events/138543229893757/"}, {"date": "2016-06-02T12:00:00-04:00", "name": "Wild Belle / June 2nd / Bank of Ann Arbor's Sonic Lunch / 12PM FREE", "description": "Wild Belle\n – multi-instrumentalist Elliott Bergman and his younger sister Natalie Bergman – is an American indie reggae and rock band based in Chicago. Their debut studio album Isles was released 2012.  Wild Belle's latest album, Dreamland was released in April of 2016. \nElliot and Natalie Bergman are two of four children born to musician parents, who brought them up in a house full of music. Elliot, the older sibling, is a multi-instrumentalist studied at the University of Michigan where he started an Afrobeat band called Nomo. His younger sister, Natalie, started performing with Nomo, playing tambourine and singing backing vocals when she was sixteen. Elliott and Natalie decided to branch off with their own project and chose the name, Wild Belle. Wild Belle has gained recognition through touring with Toro y Moi in the past. Wild Belle will continue with their touring kick by appearing at music festivals across the United States, including Lollapalooza, Coachella, Forecastle Festival, and others. http://www.wildbelle.com \n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\n Sonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "source": "Facebook", "url": "https://www.facebook.com/events/272381566427718/"}, {"date": "2016-06-02T17:00:00-04:00", "name": "Tap Takeover with Founders Brewing Company", "description": "We're super excited for our very first tap takeover with none other than our good friends from Founders Brewing Company. 5 taps of local hoppy hour goodness- we can hardly wait!", "source": "Facebook", "url": "https://www.facebook.com/events/1149030195130531/"}, {"date": "2016-06-02T18:00:00-04:00", "name": "Adult Coloring Night", "description": "$2 pints and custom coloring pages- Thursday is the new Friday! Bonus- Founders Brewing Co.will be here from 5-7 for a tap takeover <3", "source": "Facebook", "url": "https://www.facebook.com/events/498663607009941/"}, {"date": "2016-06-02T18:00:00-04:00", "name": "Hops for Hope", "description": "Join us every Thursday in June to help support our community partner, Growing Hope! From 6-9 pm, $1 of each beer sold will be donated towards Growing Hope's efforts to educate, inspire, and empower the community through gardening and access to healthy food.", "source": "Facebook", "url": "https://www.facebook.com/events/583947551773311/"}, {"date": "2016-06-02T19:00:00-04:00", "name": "The Annual Bacon Ball: A Snout-to-Tail History of the Humble Pig", "description": "Join the Roadhouse and Zingerman's Camp Bacon® as we celebrate the pig with author Mark Essig, sharing stories from his new book \"Lesser Beasts: A Snout-to-Tail History of the Humble Pig.\" Mark and Chef Alex have created a menu featuring bacon throughout the courses, showing no part of the pig is to be taken for granted.\n\nAMUSE\nSorghum and Long Pepper Pork Belly on Scrapple\n\nFIRST COURSE\nMilk-Braised Pork Pie with Grilled Ramps\n\nSECOND COURSE\nAsparagus with a Smoked Hock-Red Pea Vinaigrette\n\nENTREE COURSE\nGuanciale-Wrapped Cobia with Low Country Red Rice and Creamed Kale\n\nDESSERT COURSE\nChocolate Dipped Bacon Lollipops", "source": "Facebook", "url": "https://www.facebook.com/events/612017728947333/"}, {"date": "2016-06-02T19:00:00-04:00", "name": "A Conversation with Authors Ray Robertson and Jas Obrecht About Music, Poets and Guitars", "description": "Ray Robertson - \nRay Robertson is the author of the novels Home Movies, Heroes, Moody Food, Gently Down the Stream, What Happened Later, and David, as well as a collection of non-fiction, Mental Hygiene: Essays on Writers and Writing. He is a contributing book reviewer to the Globe and Mail.\n\nJas Obrecht - \nA twenty-year editor for Guitar Player and the founding editor of Pure Guitar magazine, Jas Obrecht has been writing about music since the mid 1970s. He wrote the first nationally published cover stories on Eddie Van Halen, Eric Johnson, Steve Lukather, Steve Morse, Yngwie Malmsteen, Steve Vai, and Joe Satriani.  He  has written for all of the major blues magazines, as well as for scholarly journals, fanzines, and websites. His books include Masters of Heavy Metal, Blues Guitar: The Men Who Made the Music, Rollin’ & Tumblin’: The Postwar Blues Guitarists, and My Son Jimi, co-authored with James A. Hendrix. \n\n'Lives of Poets' \nPicking up where Samuel Johnson left off more than two centuries ago, Ray Robertson’s Lives of the Poets (with Guitars) offers up an amplified gathering of thirteen portraits of rock & roll, blues, folk, and alt-country’s most inimitable artists. Irreverent and riotous, Robertson explores the “greater or lesser heat” with which each musician shaped their genre, while offering absorbing insight into their often tumultuous lives.\n\n'Early Blues: The First Stars of the Blues Guitar'\nLike the best music documentaries, \"Early Blues: The First Stars of Blues Guitar\" interweaves musical history, quotes from celebrated musicians (B.B. King, John Lee Hooker, Ry Cooder, and Johnny Winter, to name a few), and a spellbinding array of life stories to illustrate the early days of blues guitar in rich and resounding detail.", "source": "Facebook", "url": "https://www.facebook.com/events/1109313369133337/"}, {"date": "2016-06-02T19:30:00-04:00", "name": "The Wedding Singer", "description": "Ann Arbor Civic Theatre presents the musical comedy The Wedding Singer, directed by Ron Baumanis, June 2-5, 2016, at UM’s Lydia Mendelssohn Theatre, 911 N. University, Ann Arbor, 48109.  Performances are Thursday at 7:30 pm, Friday and Saturday at 8pm, with a 2pm matinee on Sunday.  Friday, Saturday and Sunday tickets are $25, with tickets at $22 for seniors and $13 for students. On Thursday only, all seats are $19, with $13 tickets for students. Tickets and information are available online at www.a2ct.org, through the A2CT office at 734-971-2228, or at the door of the theater before each performance.\n\nGenerally considered one of the best screen-to-stage musical adaptations, The Wedding Singer is based on the hit movie of the same name. It's 1985 and rock-star wannabe Robbie Hart is New Jersey's favorite wedding singer. He's the life of the party, until his own fiancee leaves him at the altar. Shot through the heart, Robbie makes every wedding as disastrous as his own. Enter Julia, a winsome waitress who wins his affection. As luck would have it, Julia is about to be married to a Wall Street shark, and unless Robbie can pull off the performance of a decade, the girl of his dreams will be gone forever. Director Ron Baumanis says of the show “it’s sort of a ‘Grease-celebrating-the-80s’ that’s melodic and very, very funny.”\n\nMusic direction for The Wedding Singer  is by Jim Territo, with choreography by Patricia Mazzola. The talented cast includes Chip Mezo as Robbie Hart and Kimberly Elliott as Julia Sullivan, Becca Nowak as Holly, Daniel Hazlett as Sammy, Chris Joseph as George, Michael Cicirelli as Glen Guglia, Karen Underwood as Rosie, Salina Burke as Linda, and Patti Ringe as Angie. The ensemble is rounded out by Jason Atwood, Brandon Cave, Don Coyote, Andrew Godell, Rich Roselle, Laurie Atwood, Linda Lee Austin, Angela Elowsky, Krista Gladney, Annie Jenkins, Gayle Martin, Jessica Miorelli, Sarah Sweeter, and Kelly Wade.", "source": "Facebook", "url": "https://www.facebook.com/events/860758777384844/"}, {"date": "2016-06-02T21:00:00-04:00", "name": "Camp Bacon®: Bacon Beautiful Music", "description": "Camp Bacon is bringing you another night of delicious music! Partnering with Club Above, we'll be rocking your world with some tasty folkin' tunes from Barbarossa Brothers, lip smacking alternative sounds from Dave Menzo, and some mouth-watering songs by familiar faces from your favorite Zingerman’s Businesses! Please swing by to share some great memories, have some awesome bacon-inspired snacks, and help the Southern Foodways Alliance keep Southern Food Culture alive!", "source": "Facebook", "url": "https://www.facebook.com/events/725643570911531/"}, {"date": "2016-06-03T19:00:00-04:00", "name": "AFC Ann Arbor vs. Michigan Stars // Friday, June 3rd // 7pm", "description": "The Mighty Oak remain in 1st place of the Great Lakes West conference. See them take on the Michigan Stars, this Friday at Pioneer Hugh School's Hollway Field, Presented by Move Wellness. \n\nRide the Shuttle from Arbor Brewing Company for FREE! Pregame festivities start at 5pm! http://bit.ly/ABCShuttle\n\nOnline Adult Ticket $8\nOnline Youth Ticket $5 (Ages 4-12) \n\nKids under 4 are FREE \nTickets at the gate: $10 adult / $6 youth", "source": "Facebook", "url": "https://www.facebook.com/events/1727064960903463/"}]