[{"date": "2017-03-17T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/189417071550325/", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "name": "Women's History Month and Planned Parenthood"}, {"date": "2017-03-17T11:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/296390034113010/", "description": "We're making our once a year house-brined corned beef sandwich for a very limited time on Friday. They'll be making these meaty treats from 11-30- 1:30, and again from 4-7. Don't miss this!", "name": "Big Arse Corned Beef Sandwich"}, {"date": "2017-03-17T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1008319905968712/", "description": "March 11–August 20, 2017\nPhotography Gallery\n\nIn 2013, artist Ernestine Ruben (BSDEs ’53) photographed the once-famed industrial complex Willow Run in Washtenaw County, Michigan. Designed by her grandfather, Detroit architect Albert Kahn, for the Ford Motor Company, Willow Run was an exemplar of American defense manufacturing because of its efficient mass-production of B-24 Liberators during World War II.\nFor this exhibition, Ruben overlaid interior views of the now-dormant factory with imagined glimpses into her body’s interior landscape. The resulting compositions seem to breathe energy and light into the stagnant and cavernous spaces of Willow Run and suggest a longing for a productive existence undeterred by mortality for both Willow Run and the artist. Her grandfather’s role in the history of the site underscores Ruben’s personal connection.\nThe exhibition presents Ruben’s photographs of Willow Run in UMMA’s Photography Gallery and an original film—co-created by Ruben and video artist Seth Bernstein and featuring an original score by award-winning composer Stephen Hartke—in the Museum’s Forum.\n\nLead support for Ernestine Ruben at Willow Run: Mobilizing Memory is provided by the University of Michigan Office of the Provost and the Herbert W. and Susan L. Johe Endowment.", "name": "Ernestine Ruben at Willow Run: Mobilizing Memory"}, {"date": "2017-03-17T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1377715072279250/", "description": "For the first time in a long time, we are shutting down the street (E. Washington) to party for St. Patrick's Day! We'll have food, drinks, and live music by the Joel Rydecki Band (6pm-10pm). 21+ Only.\n\nOutdoor Beer List:\nMichael Faricy's Irish Stout\nHeart O' Ire IPA (red IPA)\nEuchre Pils\nBollywood Blonde\n\nFood \nHot Dogs and Brats", "name": "St. Patrick's Day at the Brewpub"}, {"date": "2017-03-17T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/348084575586028/", "description": "NOTE: Orchid Festival dates are Sat. & Sun., March 18 & 19, 2017\n\nA two-day orchid extravaganza with orchid displays, orchids in bloom, and regional commercial vendors. Tropical and hardy orchids and orchid-growing supplies and related items for sale. Free informational talks and demos. Presented by Ann Arbor Orchid Society. Free. For hours, photos, and info follow this link: mbgna.blogspot.com/2017/02/2017-ann-arbor-orchid-festival-at.html", "name": "Ann Arbor Orchid Festival"}, {"date": "2017-03-17T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1077954158983632/", "description": "We're making our once a year house-brined corned beef sandwich for a very limited time on Friday. They'll be making these meaty treats from 11-30- 1:30, and again from 4-7. Don't miss this!", "name": "Big Arse Corned Beef Sandwich"}, {"date": "2017-03-17T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1660598647567412/", "description": "Bring your well-worn items that could use a tune up, and we'll take a look at them! \n\nOr, make someone else's day by volunteering at Fix-It Friday and repairing their items.\n\nFix-It Friday:\nThink of this as the last chance before you get rid of something; Free, but no Guarantee.\n\nWe will:\n- try to diagnose what is wrong\n- tell you if we think we may be able to fix it today\n- tell you if you'll need a part, and where you might be able to get it\n- try to fix it to the best of our ability, but in the limited time we have\n\nHowever, we may not be able to fix it. Many products are not designed to be fixed, and just opening them up may damage them. Furthermore, we may not have someone on hand with the expertise to do a proper repair. Also, it may require a special part, tools, information, or materials to repair, or it may just require more time than we have.\n\nWe may end up damaging your item even more. Please let the repairer know how comfortable you are at each stage of diagnosis and repair.\n\nItems that are often easier to repair: lamps, types of toys, broken wires, things that need epoxy/wood glue\n\nItems that are often very difficult to repair: consumer electronics such as CD/Cassette boom boxes, TVs, radios, CD players, VCRs, and DVD players", "name": "Fix-It Friday (third Friday of every month)"}, {"date": "2017-03-17T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/404085033287135/", "description": "Join us at Sava's to Celebrate St. Patrick's Day with our take on some traditional Irish Classics.\n\nFOOD SPECIALS\n\nPOTATO & PARSNIP SOUP\nleeks, garlic, cream, buttermilk, nutmeg, cracked black pepper, chives, toasted irish soda bread with cultured butter     $6\n\nBEER CHEESE BALL\nsharp cheddar, brown ale, spicy mustard, cayenne, chives, celery seed, sesame seeds, scallion, crackers, crudités, quick pickled vegetables, pretzel bread     $9\n\nCORNED BEEF SANDWICH\nbraised corned beef, brinery sauerkraut, horseradish cheddar, gruyère, farm bread, with french fries      $12\n\nCORNED BEEF BRISKET\nbraised cabbage and onions, roasted carrots and fennel with caraway seeds, smashed redskin potatoes with kale and chives, spicy horseradish cream      $18\n\nDRINK SPECIALS\n\nJAMESON IRISH WHISKEY\n$5 shots\n\nSNAKES ON A SHAMROCK\n$4 pints wolverine state brewing co. | irish red lager", "name": "Sava's St. Patrick's Day Featured Specials"}, {"date": "2017-03-17T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1029875997118498/", "description": "Free to attend; for students 3rd through 8th grade.\n\nStudents learn to experiment with the basics in Computer Aided Design (CAD) by creating miniature Minecraft character keepsakes.\n\nNote: sessions must have at least 4 students registered to attend in order to be held. Registration deadline is 48 hours before scheduled time.", "name": "3D Printing & Design (Week 3 of 6)"}, {"date": "2017-03-17T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1909840532571007/", "description": "One MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.\n\nThis week's reading features Kristen Roupenian (Introduced by Ashley Whitaker) & Robert Heald (Introduced by Ambalila Hemsell).\nKristen Roupenian was the 2015 Grand Prize winner of the Writer's Digest Popular Fiction Awards. She is currently at work on a novel.\nRobert Heald is a poet from Atlanta, Georgia.", "name": "Mark Webster Reading Series"}]