[{"description": "Romaine calm! Our salad bar is full of healthy green, veggies, and proteins, and we even have our Made-In House salads like Kale Caesar, Thai Noodle, Broccoli Crunch, and more- for Friday only, it's just $4.99 a pound!", "date": "2016-04-29T07:00:00-04:00", "name": "Salad Bar Sale- $4.99/lb For One Day Only!", "source": "Facebook", "url": "https://www.facebook.com/events/1708976646026554/"}, {"description": "To celebrate out namesake holiday, we are celebrating by releasing 2 outstanding beers! \n\nCelebrating our 2nd year of partnership with AFC Ann Arbor, our local National Premier Soccer League team, we are excited to release Strength in the Oak, ABC's Oak Aged Old Ale. We brewed up our award winning Old Ale, Jackhammer, and aged it in new white oak. The beer’s chocolate and cherry character is broadened and accented by the wood, producing additional notes of marshmallow, candied pecan, and toffee, with a warming alcohol finish. Release on the first match of the 2016 season. \n\nNext up is the Treebeard Strong Pale Ale. This resinous and dank SPA is straight out of the tropical forest with notes of mango, pineapple and orange citrus. It has woodsy, piney and light biscuity finish with a lingering yet smooth bitterness. We like to consider ourselves modern day hippies at ABC so when we have a chance to raise a glass, or better, brew a beer, in honor of Arbor Day, we will take it!\n\nCheers to tree's, Ann Arbor, Soccer and of course, outstanding local craft beer!", "date": "2016-04-29T11:30:00-04:00", "name": "Arbor Day Beer Releases", "source": "Facebook", "url": "https://www.facebook.com/events/1770822083146908/"}, {"description": "http://cafegive.com/make_the_match/boaa-volunteermatch\nWe believe everyone should have the chance to make a difference. That's why United Way of Washtenaw County's Volunteer Center makes it easy for good people and good causes to connect. The Bank of Ann Arbor is a proud sponsor and matching all donations up to $3,000 for a grand total of $3,000 for this amazing volunteer program. www.volunteerwashtenaw.org\n\nPlease share this on your social media to help us hit our goal!!", "date": "2016-04-29T14:00:00-04:00", "name": "Bank of Ann Arbor is matching donation up to a total of $3,000 for United Way's Volunteer program", "source": "Facebook", "url": "https://www.facebook.com/events/1739721849644306/"}, {"description": "The second season for AFC Ann Arbor kicks off April 29th at 7PM with a friendly against Oakland County FC.  \n\nBeginnng at 5pm, supporters will gather at Arbor Brewing Company for prematch festivities at the Official Pub of AFC Ann Arbor. Park downtown and ride the all new shuttle (FREE) to Hollway Field from ABC.  \n\nGates open at 6pm. Purchase your tickets in advance and save $2 per adult ticket!", "date": "2016-04-29T19:00:00-04:00", "name": "AFC Ann Arbor vs. Oakland County FC - Arbor Day Opener - 4/29 FRI", "source": "Facebook", "url": "https://www.facebook.com/events/837506396394371/"}, {"description": "Come join friends & neighbors alike for a fun, slow, community bike ride through Ann Arbor.\n\nThe fun starts at the Ann Arbor Farmers Market and will continue at a leisurly pace around town, where we will \"bike-in\" to Mark's Carts (https://goo.gl/maps/QxaxTTR172T2) for some post-ride enjoyment.\n\nMeet up time is 7:00 PM (departing 7:15 PM). Plan on a nice & easy route, 10 miles or less, within city limits. Check back later this month for route & other details to come. Until then, ride safe, be friendly, and have fun!\n\n\nWhat's Bike-in?\nSee the community page:\nhttps://www.facebook.com/bikeinannarbor/info?tab=page_info\n\nOR read below\n\nBike-in is: Slow bike rides throughout Ann Arbor for everyone. Post-ride fun with friends, neighbors, and visitors around the community.\n\nEach ride we will begin at the listed location & time, ride casually, then finish the ride by \"biking-in\" to a post-ride time together at a local establishment, green space, or other friendly host setting (i.e. Bike-in :: Movie (outdoor), Creamery (ice cream), Picnic (potluck), Garden (beer garden), etc.).\n\nRides will be open and friendly to all. For gathering information, times, locations, riding routes, weather updates, etc. like/follow the page or visit for updates.\n\nPlease practice safe riding and abide by all legal riding rules at all times, especially while riding with a Bike-in community. Be sure to provide your own helmet, riding lights, and other appropriate accessories.", "date": "2016-04-29T19:00:00-04:00", "name": "Bike-in :: Mark's Carts", "source": "Facebook", "url": "https://www.facebook.com/events/1001170546625831/"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"GC\" starring Garrett Fuller and Jeremy Conn\n\nGroup 2: \"Bird Box\" starring Alison Duffy, RJ Cach, Jess Loria, Lorin Kozlowski, Tom Novik, and Jenny Bloomer\n\nGroup 3: \"The League of Pointless Improvisers\" starring Emily Engelhart, Maggie O'Reilly, Matt Swartz, Arthur Brannon III, and Steve Oliver", "date": "2016-04-29T20:00:00-04:00", "name": "Pointless Improv with GC and Bird Box", "source": "Facebook", "url": "https://www.facebook.com/events/1171388892895805/"}, {"description": "Don Campbell is a contemporary/country crossover and folk-rock singer/songwriter whose presentation of music supports the story in the song and welcomes the audience on board for the ride. Often compared to the sounds of Dan Fogelberg, Vince Gill, and Chris Isaak, Don and his ensembles are based out of New England. In 2012, Don released a double CD, \"Kites To Fly: Celebrating the Music of Dan Fogelberg,\" and in 2013 began presenting live performances of this music around his own busy schedule of Don Campbell shows.\nwww.doncampbellmusic.com", "date": "2016-04-29T20:00:00-04:00", "name": "A Special Evening Of Dan Fogelberg Music by Don Campbell", "source": "Facebook", "url": "https://www.facebook.com/events/930690620345924/"}, {"description": "On Friday April 28th, join Kevin Michael for the third installment of Festival Fridays.\n\nHouse | EDM | Trap | Twerk | Electro\nmusic by KEVIN MICHAEL\n\nKevin Michael, aka Kevin Kerber aka The Dangling Participle has been started from the bottom and now he’s here. From rocking stages to rocking chairs, Kevin Michael has always been a bastion of excellence in music, arts, culture, and oxford commas. His frenetic, open-format style of mixing has been described as, “pop-meets-electro-meets-slow-cooker.” This Ann Arbor based DJ is in it to win it. On his off time, Kevin Michael can be found lifting weights, eating mammies, not reading directions, and sardonically pontificating on miscellaneous etcetera. If you’re looking for the same old DJ, swipe left.", "date": "2016-04-29T22:00:00-04:00", "name": "Festival Friday", "source": "Facebook", "url": "https://www.facebook.com/events/1349165705098631/"}, {"description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring Emily Engelhart, Maggie O'Reilly, Matt Swartz, Arthur Brannon III, and Steve Oliver", "date": "2016-04-29T22:00:00-04:00", "name": "A Pointless Display of Improvised Feats", "source": "Facebook", "url": "https://www.facebook.com/events/1251141591582125/"}, {"description": "Join us April 30th for Independent Bookstore Day! This is a free, all-day celebration of the bookstore. We will have one-of-a-kind items from authors such as Neil Gaimen (and many others) exclusively produced for Bookstore Day! Also:\n\n-Raffles\n-EXCLUSIVE Bookstore Day items\n-Photo booth (take a picture with a \"book you'd take to a deserted island!) provided by Photo Booth Plus Michigan!\n-First 50 people to buy a book get a free cafe drink! (Coffee, tea, or espresso) from The Espresso Bar!\n-Story time with children's author Diana Wege (11am)\n-Signed first editions\n-Displays featuring local and Michigan authors\n\nThis is a nationwide event involving over 400 bookstores around the country. We're proud to take part and thrilled to have your support. Join us!\n\nMore info: http://www.indiebookstoreday.com", "date": "2016-04-30T10:00:00-04:00", "name": "Independent Bookstore Day!", "source": "Facebook", "url": "https://www.facebook.com/events/599092686924913/"}]