[{"source": "Facebook", "date": "2016-06-05T10:00:00-04:00", "name": "Holistic & Psychic Expo, June 4-5, 2016", "description": "Come join us for the Intuitives Interactive Holistic & Psychic Expo! The largest event of its kind in Michigan!\nNOW TWO DAYS LONG! Saturday-Sunday, June 4-5, 2016\n\nNEW LOCATION: \nThe beautiful EMU Student Center\nEastern Michigan University in Ypsilanti (next-door to Ann Arbor)\n900 Oakwood Street, 2nd floor Ballroom and Auditorium \n(ground floor as you enter from the parking lot)\nYpsilanti, MI 48197\n\nSPONSORED BY: Body Mind Spirit Guide & Body Mind Spirit Radio, Crazy Wisdom Bookstore & Tea Room, and the Enlightened Soul Center\n\nSATURDAY, JUNE 4, 2016 - 10:00 am - 8:00 pm\nDoors open 9:30 am for registration on Saturday.\nSUNDAY, JUNE 5, 2016 - 11:00 am - 5:00 pm\nDoors open 10:30 am for registration on Sunday\n\nADMISSION: \n$10 for one day or \n$15 for a weekend pass\nKids 12-18 yrs: $5 daily pass / Under 12 free \nIncludes FREE presentations! \nFREE PARKING at designated lots\n\nREADINGS: There will be Mediums, Psychics, Tarot & Angel Card Readers, Intuitive & Channeled Readings, Palm Readings. \nSPECIALTY READINGS: Crystal Ball, Rare Hungarian Gypsy Cards, Runes, Numerology, Shamanic Stone Bowl...and more!\nDETAILS: http://www.holisticpsychicexpo.com/#!readers/e75ww\n\nOTHER GREAT OFFERINGS INCLUDE: Aura Photography, Body & Energy Workers, Vendors of Holistic & Metaphysical Products, and More!\nDETAILS: http://www.holisticpsychicexpo.com/#!vendors/tcvqd\n\nFEATURED PRESENTATION: \n6:30 PM SATURDAY - \"Michigan Mediums: Group Gallery Reading Extravaganza\" Three mediums who'll share the stage to connect the audience members with their departed loved ones: Marybeth Rombach Nelson, Kathy Tertzag, and Tom Pierce.\n\nSCHEDULE of FREE PRESENTATIONS:\nDETAILS: http://www.holisticpsychicexpo.com/#!speakers/uoauv\n\nSATURDAY, JUNE 4:\n11:00 am-12:00 pm - Juliana Schriemer\n\"Conscious Nutrition: Cultivating Intuition & More\"\n12:30-1:30 pm - Steve Schriemer\n“Expanding Awareness Through Qi Gong”\n2:00-3:00 pm - Christine Fodor\n\"Embodying Your Higher Self: Clearing the Ego\"\n3:30-4:30 pm - Sue Burton Hidalgo\n“The House Whisperer - Feng Shui and More”\n5:00-6:00 pm - Constance Hart, ND\n\"Rahanni Celestial Healing\"\n6:30-8:00 pm\n\"Michigan Mediums\" - Group Gallery Reading Extravaganza with Marybeth Rombach Nelson, Kathy Tertzag, and Tom Pierce\n\nSUNDAY, JUNE 5:\n11:30 am-12:30 pm - Lynda Forbes\n\"Chinese Face-Reading: Your Health Is Written On Your Face\"\n1:00-2:00 pm - Wendy Piepenberg\n\"Mediumship Gallery Reading with Departed Loved Ones\"\n2:30-3:30 pm - Daphne Mead-Derbyshire\n\"Tidbits & Tips for the Spiritual Explorer\" \n4:00-5:00 pm - Allegra Miller\n\"Healing Oils of the Bible\"\n\nVOLUNTEERS NEEDED! Volunteers get special perks in exchange for their dedicated service. Apply at http://www.holisticpsychicexpo.com/#!volunteer/glc6s\n\nMAILING LIST: Join our mailing list by filling out the form at:\nhttp://holisticpsychicexpo.com\n\nTO APPLY FOR A BOOTH as a reader, bodyworker, or vendor:   http://holisticpsychicexpo.com - click on \"Apply\" in the menu.\nAPPLICATION DEADLINE: Friday, May 6\nLate applications will be accepted until we are full, but may not be included in the program book.\n\nThanks and we look forward to seeing YOU and your friends at this transformative event!!!\n\nSunflower painting courtesy of Molly Indura, bethelight.org", "url": "https://www.facebook.com/events/1731320327107940/"}, {"source": "Facebook", "date": "2016-06-05T10:00:00-04:00", "name": "Potters Guild Spring Sale", "description": "Join us on the 4th and 5th under the big tent.  Over 30 ceramic artists offering handmade works that range from dinnerware and  fuctional work to home decor, tiles and jewelery.  Find that perfect wedding or graduation gift!", "url": "https://www.facebook.com/events/571217649726581/"}, {"source": "Facebook", "date": "2016-06-05T11:00:00-04:00", "name": "Taste of Ann Arbor Beer Garden", "description": "Arbor Brewing Company is once again setting up our own beer garden adjacent to the Taste of Ann Arbor event on the street with several of our summer's best beers on tap: Strawberry Blonde, Bavarian Bliss, Sacred Cow IPA and Anahata Chakra. The beer garden will be on Washington at Main. Beers start flowing in the garden at 11am and will feature live music by Third Coast Kinds. No cover but you must be 21 or accompanied by a parent to visit the beer garden. Beers, Sangria and soft drinks will be available for purchase with Taste of Ann Arbor Tickets.\n\nTaste is an annual tradition in Ann Arbor. It is a strolling outdoor feast featuring taste-sized samples from dozens of restaurants, cafes and pubs. The event is free and open to the public. Tickets for food tastes and beer can be purchased on Main Street. Don't miss this opportunity to get a sample of cuisine from restaurants you've been meaning to try!", "url": "https://www.facebook.com/events/1766408086928556/"}, {"source": "Facebook", "date": "2016-06-05T11:00:00-04:00", "name": "Taste of Ann Arbor", "description": "This annual community event features local restaurants offering visitors bite size, and some not so bite size, tastes of what they do best. Tickets for food tastes can be purchased at the event for $.50 each.\n\n****************************\n\nWe will be offering the following menu items:\n\nAgua Frescas – 5 tickets\nChicken Momo Yakitori – 6 tickets\nElotes – 4 tickets\n\n*****************************\n\nForty of Ann Arbor’s favorite restaurants will be set up on the two blocks of Main Street between William and Washington. \n\nFood prices range from .50 (1 ticket) to $4.00 (8 tickets), nothing is priced over $4.00!! Tickets are sold at the event by strolling ticket sellers, look for the blue aprons, and at ticket booths on Main at William and Washington.\n\nFamily fun abounds with live entertainment throughout the day served with performances at the Main & Liberty stage by:\nDan Henig\nMadelyn Grant\nWilla Rae & The Minor Arcana\nBarelyon\nGirls Who Care\n\nMore event info here: http://bit.ly/27I6q9U", "url": "https://www.facebook.com/events/1756618144575140/"}, {"source": "Facebook", "date": "2016-06-05T11:30:00-04:00", "name": "2016 Taste of Ann Arbor Music Stage / June 5th Sunday / 11:30AM to 5PM", "description": "2016 Taste of Ann Arbor Music Stage \nsponsored by bank of ann arbor's Sonic Lunch!  \nemcee: Matthew Altruda from Tree Town Sound\n ann arbor's 107one\nMain Street Area Ann Arbor\n\n2016 Lineup 11:30AM to 5PM \nDan Henig\nMadelyn Grant\nWilla Rae & The Minor Arcana\nBarelyon\nGirls Who Care\nthe brain plasticity ukulele collective\n(with a couple of surprises too!) \n\nLooking for more information about Taste of Ann Arbor?\nhttp://www.mainstreetannarbor.org/", "url": "https://www.facebook.com/events/513747882160265/"}, {"source": "Facebook", "date": "2016-06-05T11:30:00-04:00", "name": "Aventura Spring Menu Launch", "description": "Your favorite dinner spot just became your favorite lunch spot.\nBringing great food, and quick service to your lunch break. Offering paella for two, Spanish flatbreads, salads, and more!\nCheck out the new menu with the link listed above.", "url": "https://www.facebook.com/events/138543229893757/"}, {"source": "Facebook", "date": "2016-06-05T12:00:00-04:00", "name": "Spring Menu Launch", "description": "Experience the flavors of the season and try our new Spring menu. Featuring new food and beverages you are sure to love! \nBut, don't worry we have kept some of the classics on our menu too.\nYou can make your reservation with OpenTable link above.", "url": "https://www.facebook.com/events/1745052782438333/"}, {"source": "Facebook", "date": "2016-06-05T13:00:00-04:00", "name": "$5 Apple Fritter Bacon Cheese Burger", "description": "Our most decadent offering yet- our apple fritter donuts with a bacon cheeseburger nestled inside. Just crazy enough to be amazing, right?", "url": "https://www.facebook.com/events/121441028276516/"}, {"source": "Facebook", "date": "2016-06-05T13:00:00-04:00", "name": "Black Pond Woods Park Stewardship Workday-National Trails Day", "description": "As part of National Trails Day come on out to experience a woods filled with oak, hickory, maple and dogwood. Volunteers will work on trails and remove invasive Garlic Mustard. This is a great park to bring families out to enjoy a day outdoors. Please meet at the Tibbits Court entrance to the park. \nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/587366668093374/"}, {"source": "Facebook", "date": "2016-06-05T14:00:00-04:00", "name": "Guided Tour - Albert Kahn: Under Construction", "description": "In the last two decades there has been a tremendous swell of interest in Detroit architect Albert Kahn (1869–1942), arguably the most important architect of American industrialization. Albert Kahn: Under Construction focuses on the remarkable archive of photographs from the Highland Park Ford Plant to the Willow Run Bomber Plant. Shot by an array of professional photographers, these often striking documentary images were a novel strategy for conveying information—showing buildings as they grew on site—to busy managers at the main office. UMMA docents will explore these artifacts as photographs\nand evidence of Kahn’s innovative solutions to the architectural challenges of his day.\n\nPublic exhibition tours are generously supported by the Richard and Rosann Noel Fund for Museum Education.", "url": "https://www.facebook.com/events/1700743653510313/"}]