[{"source": "Facebook", "url": "https://www.facebook.com/events/571486126359926/", "description": "Join us for the Grand Opening of the first 5 mile loop of this highly-anticipated new mountain bike trail (also open to foot travel) at Waterloo State Recreation Area.  Be among the first to use this state-of-the-art, modern and sustainable trail, built using \"flow trail\" construction.  We will also be revealing the rebranding of the trail to the community, including a new trail name and logo. \n\nMeet at the trailhead (west off M-52, 5 miles north of Chelsea and 1/2 mile south of North Territorial Rd) at 10:45am for the 11:00am trail dedication and ribbon cutting, followed immediately by the inaugural 5 mile ride/hike/run on the new trail. \n\nBottled water and cookies will be provided.\n\nREI will be on site offering light mechanical support beginning at 9:30am. If you need air in your tires, lubrication on your chain, saddle position adjustment, etc., just come out early and REI will be there to help you before the ride.\n\nImmediately after, we will continue the celebration at Chelsea Alehouse with lunch and beverages.  A celebration cake will be provided by Potawatomi Mountain Biking Association.\n\nCan’t make it out that early? Join us for an after work ride, hike, or run! \n\nMeet at the new trailhead at 6:00pm for a 6:15pm departure.  We will follow up the evening ride/hike/run with pizza and beverages at Jet’s Pizza in Chelsea.  After ride cake will be provided by Potawatomi Mountain Biking Association.", "date": "2016-06-16T10:45:00-04:00", "name": "Waterloo Trail Grand Opening, Ribbon Cutting and Renaming Cermony"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1045565085496652/", "description": "We're doing a special pop-up wing bar to celebrate everyone's favorite wing man- Dad! We'll have toppings like bq sauce, pickled jalepeno, cheese, awesome sauce (you'll just have to see!), and more. 6 jumbo wings and your choice of toppings, $5. \n\nPS- Dad status not required!", "date": "2016-06-16T11:00:00-04:00", "name": "Wing Man Wing Bar"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1722976337920509/", "description": "frontier ruckus is an American folk-rock band from Michigan.   Frontier Ruckus was named \"Best Folk Group\" in Detroit by Real Detroit Weekly.  They’re centered on the lyrically intensive songs of Matthew Milia, and was formed by Milia and banjo player David Winston Jones while living in Metro Detroit.   Frontier Ruckus released their fourth full-length album, Sitcom Afterlife. Prior to the complete album release, the tracks \"Sad Modernity\", \"Bathroom Stall Hypnosis\", and \"Darling Anonymity\" were released individually, highlighting the band's shift toward a greater focus on classic power pop arrangements, while still remaining densely lyrical\nhttp://www.frontierruckus.com\n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "date": "2016-06-16T12:00:00-04:00", "name": "Frontier Ruckus / June 16th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1132383946823737/", "description": "I hope you can come to the reception of Aura's photography exhibition, but the show is up until June 29.   http://www.kerrytownconcerthouse.com/index.php/events/event/aura_glaser_photographer/", "date": "2016-06-16T17:00:00-04:00", "name": "Aura Glaser - Photography Exhibit Reception"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1576623099301542/", "description": "Join us every Thursday in June to help support our community partner, Growing Hope! From 6-9 pm, $1 of each beer sold will be donated towards Growing Hope's efforts to educate, inspire, and empower the community through gardening and access to healthy food.", "date": "2016-06-16T18:00:00-04:00", "name": "Hops for Hope"}, {"source": "Facebook", "url": "https://www.facebook.com/events/799178996885556/", "description": "Thursdays through Sundays through June 26. Check out Tickets Available link for arb member advance ticket info plus note Summer 2016 construction impacting arboretum area parking & traffic. Arrive early for tickets and time to walk to location of the first scene.", "date": "2016-06-16T18:30:00-04:00", "name": "Shakespeare in the Arb 2016 Love's Labour's Lost Week 2"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1160727033945985/", "description": "In August 2011, The Ann Arbor City Council passed a Resolution in Support of the Allen Creek Greenway (R-11-325). Shortly thereafter, staff developed a draft scope of work for a \"master plan approach\" for the Allen Creek Greenway which includes the following study areas:\n\nAllen Creek Greenway: Argo Cascades to South State Street, primarily along Ann Arbor Railroad corridor (owned by WATCO).\n\nFirst and William: a City owned parcel located on the northeast corner of the intersection. \n\n415 West Washington Street: a City owned, 2.52-acre site located on the south side of West Washington Street between --\n\nFirst and Third Streets, within the Downtown Development Authority District and Old West Side Historic District.\n\nNorth Main Corridor:\n-721 North Main Street: a City owned, 5.10-acre site located on the west side of North Main Street between Felch Street and West Summit Street.\n-N. Main Street and adjacent parks and amenities between M-14 and Summit Street\n-N. Main and Depot Street Intersection.  \n \nOn May 18, 2015, City Council passed a resolution to adopt the FY2016 budget which includes $200,000 for consulting services for development of a master plan for the Allen Creek Greenway. The Allen Creek Greenway Master Plan process will explore improvement options that balance the needs and desires of a variety of users and considers the significant resources within the study area.  To develop this plan, City of Ann Arbor staff recommended a planning process to engage stakeholders, community leaders and residents in shaping the scope, content and direction of the master plan.  The Team Organization chart shows the various groups that will be involved in the process, including a Project Management Team, Technical Advisory Committee, Citizen Advisory Committee, and Stakeholders/Community at Large.", "date": "2016-06-16T18:30:00-04:00", "name": "Allen Creek Greenway project Community Meeting"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1689877964609383/", "description": "Join us for this hilarious retelling of Geoffrey Chaucer's classic tale, in which every character plays numerous parts, to fantastic effect. This recent adaptation maintains Chaucer's biting humor while keeping the bawdiness to a minimum, so all can enjoy the show in Ann Arbor's West Park! The show runs June 16, 17, 18, 23, 24, 25, 30, July 1, and 2.  Curtain at 7pm each night.  Tickets are just $10 for adults, $7 for kids 12 and under.", "date": "2016-06-16T19:00:00-04:00", "name": "The Canterbury Tales"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1741421642801033/", "description": "We’re back! NNA2 returns from break Thursday, June 16 — mark your calendar! We’ve got a solid session featuring quick thinking, robotic legs and sticky brains!  First up, Patti Smith schools us on the history of improv comedy, illuminating the ways its concepts pops up in our day-to-day lives. Shai Rezen opines on the greatness of legs, and walking us through his related research — making robot legs and mobility better and better. Capping things off, social worker Sara Tischler breaks down obsession, compulsion, OCD research, and techniques that help people \"un-stick\" the brain. Grab a fellow nerd, order a refreshing drink, and we’ll see you there!\n\n\nWhen: Thursday, June 16, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER! Thanks for having our back, Ann Arbor District Library!\n\n\nPatti Smith — Improv is Life: History & Facts About Improv Beyond \"Whose Line is it Anyway?\"\nWe use improv our entire lives, even we don't realize it. One could say that humans started doing improv when we started using the spoken language. But how did improv as art form get started? And what does it look like now? Most importantly--how and why should YOU try it? Patti Smith will talk about the history of the art form, examples of improv, and local opportunities to try it yourself. \n\nAbout Patti: Patti Smith is a special education teacher and writer who lives in Ann Arbor with her husband and cats. Patti is the author of two books about history in Ann Arbor, the most recent of which is The History of Ann Arbor's People's Food Co-op. She loves storytelling, most forms of public speaking, especially improv! She believes that improv is for everyone!\n\n\nSara Tischler — Un-sticking your Brain: OCD and its Treatment\nObsessions are \"sticky\" thoughts, images or impulses that occur over and over again and feel uncontrollable. Compulsions are repetitive behaviors or rituals that someone uses to get rid of the obsessions. Together they make up obsessive compulsive disorder, or OCD. Hear about OCD and exposure and response prevention (ERP), an evidence-based treatment for the mental health disorder that affects approximately 3.3 million people in the United States.\n\nAbout Sara: Sara is a clinical social worker in the department of outpatient psychiatry at the University of Michigan Health System. She has a Bachelor’s degree in psychology from Michigan State University (Go Green! Sorry, Ann Arbor) and a Master’s in Social Work from the University of Michigan. She completed her internship and fellowship at the University of Michigan Child and Adolescent Outpatient Psychiatry clinic, where she is now a staff social worker. She provides psychotherapy for children of all ages and their families. Besides OCD, her clinical interests include anxiety disorders, autism spectrum disorder, depression, and trauma/grief. She was born and raised in Southeast Michigan and lives with her partner, Alex. Together they have two beautiful (furry) “children” — Phoebe the dog and Bu the cat, whom she talks about constantly.\n\n\n\nShai Rezen —  A Few Reasons Why I Love Legs\nNo animals other than ourselves move on wheels. That might seems strange, given how efficient and effective wheels are for moving around on land. Nevertheless, there are many good reasons to love legs. These include more obvious reasons, like the ability to use sparse footholds on rough surfaces, and less obvious reasons, such as newly discovered ways that legs make it easier for animals to control their movements. Insights from the animal world are leading to new and amazingly capable walking and running robots.\n\nAbout Shai:  Shai Revzen is an Assistant Professor in the Electrical Engineering and Computer Science Department and in the Ecology and Evolutionary Biology Department of the University of Michigan, and heads the BIRDS Lab. This confusion about where he belongs isn't new -- he is a bit of many things that don't seem to fit together neatly in a box. His research focuses on the biomechanics of organisms, the legged locomotion of robots, and the mathematical tools that connect the two. Before becoming an academic by running cockroaches on treadmills for six years at the University of California at Berkeley, he worked as a Chief Architect in mid-sized company in Silicon Valley, went around the world, and was unabashedly nerdy.", "date": "2016-06-16T19:00:00-04:00", "name": "Improv, OCD, and Legs"}, {"source": "Facebook", "url": "https://www.facebook.com/events/585356308304131/", "description": "Join us for a fun night of live music in downtown Ann Arbor to benefit No Boundaries Flint: All Arts Camp\n\nFeatured bands include: \nBroccoli Unofficial \n-- Hruodberht Loozinsky\n\nSweet Demon\n-- Rose Carver, vocals and acoustic guitar\n-- Leo Crown, electric guitar\n\nFallow Land \n-- Whitaker Fineberg, lead vocals and guitar\n-- Evan Veasey, lead guitar and vocals \n-- Armand Terrell, drums and vocals\n-- Caelin Amin, bass and vocals\n\nBobbiejak \n-- @Tessa Patterson, vocals and keys\n-- Tariq Gardner, drums\n-- Annick Odom, bass\n\nIron Star\n-- John Bochnowski, bass\n-- Gabriel Wilk, guitar\n-- Everett Reid\n-- Ian Gold\n\nDoors open at 9, music starts at 9:30\n$5-10 suggested donation at the door to support NBF!\n\nAbout No Boundaries Flint: All Arts Camp: \nNo Boundaries Flint is a free and exciting one week summer arts camp for Flint kids age 7-10 housed in the Flint Cultural Center. Students will create theatre, dance, music, and visual art through hands-on workshops in the morning. They'll practice their craft by working toward creating a project of their own design, and participate in field trips to the Flint Institute of Arts, Flint Institute of Music, Flint Youth Theatre, and The Whiting! We don't stop there; students also receive free transportation to and from camp, as well as free meals. \n\nCan't make the show, but still want to support us? Click here to make a tax-deductible donation today! \nhttps://www.fracturedatlas.org/site/fiscal/profile?id=14275", "date": "2016-06-16T21:00:00-04:00", "name": "Live Music to Support No Boundaries Flint"}]