[{"date": "2017-03-21T12:00:00-04:00", "url": "https://www.facebook.com/events/1008319905968712/", "source": "Facebook", "description": "March 11–August 20, 2017\nPhotography Gallery\n\nIn 2013, artist Ernestine Ruben (BSDEs ’53) photographed the once-famed industrial complex Willow Run in Washtenaw County, Michigan. Designed by her grandfather, Detroit architect Albert Kahn, for the Ford Motor Company, Willow Run was an exemplar of American defense manufacturing because of its efficient mass-production of B-24 Liberators during World War II.\nFor this exhibition, Ruben overlaid interior views of the now-dormant factory with imagined glimpses into her body’s interior landscape. The resulting compositions seem to breathe energy and light into the stagnant and cavernous spaces of Willow Run and suggest a longing for a productive existence undeterred by mortality for both Willow Run and the artist. Her grandfather’s role in the history of the site underscores Ruben’s personal connection.\nThe exhibition presents Ruben’s photographs of Willow Run in UMMA’s Photography Gallery and an original film—co-created by Ruben and video artist Seth Bernstein and featuring an original score by award-winning composer Stephen Hartke—in the Museum’s Forum.\n\nLead support for Ernestine Ruben at Willow Run: Mobilizing Memory is provided by the University of Michigan Office of the Provost and the Herbert W. and Susan L. Johe Endowment.", "name": "Ernestine Ruben at Willow Run: Mobilizing Memory"}, {"date": "2017-03-21T14:00:00-04:00", "url": "https://www.facebook.com/events/1821291198093435/", "source": "Facebook", "description": "The Ann Arbor Film Festival has been around for over 50 years, fascinating, challenging, enchanting, even appalling and often surprising tens of thousands of viewers - some who have been attending for decades. The AAFF is a highlight of Michigan's cultural year. The majority of screenings will take place at the Michigan Theater (603 E Liberty St, Ann Arbor, MI 48104) with additional events and exhibitions at other venues around downtown Ann Arbor. Tickets and passes are available for purchase on our website.\n\nFind out more info on our website:\nhttp://aafilmfest.org", "name": "The 55th Ann Arbor Film Festival"}, {"date": "2017-03-21T18:00:00-04:00", "url": "https://www.facebook.com/events/396460264046116/", "source": "Facebook", "description": "On Tuesday, March 21st, celebrate the return of the sun with an hour of all-levels vinyasa in the Gulo Room! This is an \"Equinox Edition\" of our very popular Pints and Poses event, which last took place in November. The event sold out quickly, so don't miss out! Local yoga instructor Robin Schultz-Purves will lead the class through a series of flows dedicated to welcoming spring. Class is, of course, followed by a pint of your choice. Bring a yoga mat and a water bottle and wear comfortable clothes. We'll gather beginning at 6 pm and class will start at 6:30. Limited tickets available -", "name": "Pints and Poses - Equinox Edition"}, {"date": "2017-03-21T18:30:00-04:00", "url": "https://www.facebook.com/events/1726757667635462/", "source": "Facebook", "description": "OPENING NIGHT RECEPTION\n3/21/2017 6:30-8:00pm\nMichigan Theater Grand Foyer\nKick off the Festival with cocktails and food from some of the best local vendors. Open bar, a great assortment of hors d'oeuvres and desserts, and music spun by DJ Jeremy Wheeler make the Opening Night Reception an event to remember! Entrance includes seats to the first screening of the festival, the Opening Night Films in Competition 1. Tickets start at $40.00 and you can purchase them here: http://bit.ly/2mkq9ZA\n\nOPENING NIGHT SCREENING - Films in Competition 1\n3/21/2017 8:15pm\nMichigan Theater Main Auditorium\nJoin us for an exciting first program of nine short films including recent experimental, documentary, and animated works. Features a 35mm found-footage hand-manipulated collage, a love tale between a human cannonball circus man and a young secretary from Liverpool, a kinetic romp investigating the images imprinted onto wine corks, a visit to a place without ever going there, mind-bending animation, the most narrative narrative never narrated, and more.\nhttp://bit.ly/2ngEZVK", "name": "55th AAFF Opening Night"}, {"date": "2017-03-21T19:00:00-04:00", "url": "https://www.facebook.com/events/1569594503068582/", "source": "Facebook", "description": "On this Acoustic Tuesday, we welcome Carly Bins to the brewpub.", "name": "Acoustic Tuesday - Carly Bins"}, {"date": "2017-03-21T19:00:00-04:00", "url": "https://www.facebook.com/events/392020407817982/", "source": "Facebook", "description": "Drummunity Circle with Lori Fithian • Feb. 22, Mar. 21, Apr. 20; 7 p.m. in the Crazy Wisdom Community Room • Get your hands on a drum and add your sound and spirit to the community groove. All are welcome to join the circle. No experience necessary. Drums available. Free. Call 426-7818; lorifithian@mac.com or drummunity.com.", "name": "Drummunity Circle with Lori Fithian"}, {"date": "2017-03-22T10:00:00-04:00", "url": "https://www.facebook.com/events/189417071550325/", "source": "Facebook", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "name": "Women's History Month and Planned Parenthood"}, {"date": "2017-03-22T11:00:00-04:00", "url": "https://www.facebook.com/events/1839182856327434/", "source": "Facebook", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "name": "Women's History Month and Planned Parenthood"}, {"date": "2017-03-22T14:00:00-04:00", "url": "https://www.facebook.com/events/1821291198093435/", "source": "Facebook", "description": "The Ann Arbor Film Festival has been around for over 50 years, fascinating, challenging, enchanting, even appalling and often surprising tens of thousands of viewers - some who have been attending for decades. The AAFF is a highlight of Michigan's cultural year. The majority of screenings will take place at the Michigan Theater (603 E Liberty St, Ann Arbor, MI 48104) with additional events and exhibitions at other venues around downtown Ann Arbor. Tickets and passes are available for purchase on our website.\n\nFind out more info on our website:\nhttp://aafilmfest.org", "name": "The 55th Ann Arbor Film Festival"}, {"date": "2017-03-22T15:00:00-04:00", "url": "https://www.facebook.com/events/348084575586028/", "source": "Facebook", "description": "NOTE: Orchid Festival dates are Sat. & Sun., March 18 & 19, 2017\n\nA two-day orchid extravaganza with orchid displays, orchids in bloom, and regional commercial vendors. Tropical and hardy orchids and orchid-growing supplies and related items for sale. Free informational talks and demos. Presented by Ann Arbor Orchid Society. Free. For hours, photos, and info follow this link: mbgna.blogspot.com/2017/02/2017-ann-arbor-orchid-festival-at.html", "name": "Ann Arbor Orchid Festival"}]