[{"source": "Facebook", "date": "2017-03-25T10:00:00-04:00", "name": "Photo Monitoring Kick-off & Training", "description": "Do you like photography and spending time outdoors? Photo monitoring may be the perfect volunteer opportunity for you! We need volunteers to take beautiful photos at specific locations each season to record the progress of our restoration work. Come join us at this informational meeting for more details about this volunteer opportunity! Please register by March 19. For more information or to register call NAP 734.794.6627, or send us an email at NAP@a2gov.org.", "url": "https://www.facebook.com/events/1864939247128977/"}, {"source": "Facebook", "date": "2017-03-25T11:00:00-04:00", "name": "Family Art Studio: Handheld Sculptures from Tibet", "description": "11:00 a.m.–1:00 p.m. OR 2–4:00 p.m.\nFree. Registration is required: email umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11:00 a.m. session or the 2:00 p.m. session and how many adults and children are in your group.\n\nCreate your own project inspired by the exquisitely detailed sculptural book covers in UMMA's exhibition Protecting Wisdom: Tibetan Book Covers from the MacLean Collection. UMMA docent and local artist Susan Clinthorne will lead a tour of the exhibition followed by a hands-on workshop. Designed for families with children ages six and up to experience art together. Parents must accompany children.\n\nLead support for Protecting Wisdom: Tibetan Book Covers from the MacLean Collection is provided by the University of Michigan Office of the Provost, Michigan Medicine, and the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund and the Department of Asian Languages and Cultures.\n\nFamily Art Studio is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "url": "https://www.facebook.com/events/778220992327599/"}, {"source": "Facebook", "date": "2017-03-25T12:00:00-04:00", "name": "Workday Leader Training", "description": "For volunteers interested in leading and/or co-leading NAP volunteer stewardship workdays. We will focus on procedures, ecological considerations, tips and tricks to lead a successful event. An interest and background in ecology (and plant ID) is strongly desired, but not required. A strong commitment to preserving the environment, while fostering community and engaging the public is necessary. Participants should be dressed for classroom and possible field training. Minimum age of 18. Please register by March 19. For more information or to register call NAP 734.794.6627, or send us an email at NAP@a2gov.org.", "url": "https://www.facebook.com/events/919321841538130/"}, {"source": "Facebook", "date": "2017-03-25T12:00:00-04:00", "name": "Health & Wellness Expo", "description": "This free event is open to both participants and the public! Visit vendors such as Probility Physical Therapy, American Home Fitness, Wright and Filippis, LOLE, Orangetheory Fitness, and more! Learn about our featured charity, Ozone House, which will be fundraising through the Ann Arbor Marathon. Pick up your race packet … or register if you haven’t already done so.\n\nBring your race questions to our Marathon FAQs Sessions at 1 PM and 3 PM at the Expo conference room. Check out the course maps, meet other participants, and get ready for the race to come!", "url": "https://www.facebook.com/events/269514466839209/"}, {"source": "Facebook", "date": "2017-03-25T16:00:00-04:00", "name": "LezRead March - Celebrating Children's Lit", "description": "For this month's meeting, we're reading and sharing children's lit!  This meeting is open to the broader community - non-members are welcome to join the discussion.\n\n*This month's selection is The War that Saved My Life, by Kimberly Brubaker Bradley. This 2016 Newberry award winning novel is an easy read designed for middle school students.  \n\n*To further celebrate the genre, bring a favorite LGBT children's book to share.  From My Two Mommies to The Sissy Duckling, there's quite a bit to choose from. For ideas, check out 21 LGBT books that children should read here: https://goo.gl/I5Pfzm\n---\nBook Description:\n\nThe War that Saved My Life, Kimberly Brubaker Bradley\n\nAn exceptionally moving story of triumph against all odds set during World War 2, from the acclaimed author of Jefferson's Sons and for fans of Number the Stars.\n\nNine-year-old Ada has never left her one-room apartment. Her mother is too humiliated by Ada's twisted foot to let her outside. So when her little brother Jamie is shipped out of London to escape the war, Ada doesn't waste a minute - she sneaks out to join him.\n\nSo begins a new adventure of Ada, and for Susan Smith, the woman who is forced to take the two kids in. As Ada teaches herself to ride a pony, learns to read, and watches for German spies, she begins to trust Susan - and Susan begins to love Ada and Jamie. But in the end, will their bond be enough to hold them together through wartime? Or will Ada and her brother fall back into the cruel hands of their mother?\n\nThis masterful work of historical fiction is equal parts adventure and a moving tale of family and identity - a classic in the making.\nhttps://goo.gl/E5IKtO\n---\n* As always, we'll spend the first hour talking literature at the Jim Toy Community Center, and the second hour having drinks/snacks at the the Aut Bar.\n* Don't forget that we take up a small collection for use of the Community Center. If you can, please bring a small cash donation.\n* New members welcome!  Email kerenem@jimtoycenter.org to join the private Facebook group.\n\nWhat's LezRead?\nLezRead is Ann Arbor's lesbian book club.  We read and discuss fascinating books on all lesbian topics, including books by local authors.", "url": "https://www.facebook.com/events/691102207730029/"}, {"source": "Facebook", "date": "2017-03-25T20:00:00-04:00", "name": "The Cold Hard Cash Show 3/25/17 at Blind Pig - Ann Arbor", "description": "Sat. March 25 | 8pm | $15 | 18+\n\nThe Cold Hard Cash Show an original and innovative tribute to the music of Johnny Cash and The Tennessee Three! Fronted by guitarist and singer Merle Travis Peterson, The Cold Hard Cash Show brings to life classic Cash songs from the Sun & Columbia Records Catalogs to the modern American recordings, performing with the energy of the Live at Folsom and San Quentin albums with a sound so accurate you’d think you’re listening to The Man in Black himself! The band formed in 2005 and in addition to Merle Travis Peterson fronting the band on vocals and guitar, the line up includes long time member Fel Torres on drums and John Sporman on double bass. Since the formation, they have performed on hundreds of stages often sharing them with a diverse variety of artists such as as Darryl Worley, John Anderson, Eric Church, Charlie Daniels, Lonestar, Eddie Money, Eli Young Band, Los Lobos, James Hunnicutt, Dale Watson and countless others as well as performing at several high profile private functions with guests such as Katy Perry, Shawn Colvin, John Oates, Justin Timberlake, David Ryan Harris, John Mayer and have at times performed with a few of them! In 2008 the band made their National Television debut when they performed on The Late Show with David Letterman, gaining a solid world wide fan base and landing them on stages at several nationally known festivals such as Memphis in May Festival (Memphis,TN), Sturgis Motorcycle Rally (Sturgis,SD), Daytona Bike Week (Daytona, FL), Lonestar Rally (Galveston,TX) and Johnny Cash Festival- Roadshow Revival (Ventura,CA). In 2014 the band recorded a song for long time Eddie Money drummer Glenn Symmonds and were featured on his ‘Friends of Glenn’s’ album along with multiple artists including Eddie Money. The band continues to tour across the country non-stop spreading the great word and music of The Man in Black, Johnny Cash! Say what you will about Tribute Bands, The Cold Hard Cash Show is an excellent band, excellent show, excellent experience and hands down the BEST Johnny Cash Tribute around!", "url": "https://www.facebook.com/events/1950461244970460/"}, {"source": "Facebook", "date": "2017-03-25T20:00:00-04:00", "name": "Takács Quartet: Beethoven Quartet Cycle Concerts 5 & 6", "description": "“They are not for you, but for a later age!”\n\nSo wrote Ludwig van Beethoven about his Op. 59 quartets, which will be performed in Ann Arbor as part of a complete Beethoven string quartet cycle by the Takács Quartet over six concerts (three weekends) in the 2016-17 season. Composed against the turbulent backdrop of the Napoleonic Wars and their aftermath, this radical music is as invigorating now as it was for its first performers and audiences.\n\nMore info: http://ums.org/performance/takacs-quartet-3/", "url": "https://www.facebook.com/events/135653360170391/"}, {"source": "Facebook", "date": "2017-03-26T07:30:00-04:00", "name": "2017 Probility Ann Arbor Marathon", "description": "Take to the scenic streets of Ann Arbor on Sunday, March 26 for the 2017 Probility Ann Arbor Marathon, brought to you by Epic Races and Champions for Charity. Featuring a full marathon, half marathon, 10K, and 5K, you’ll find that the Probility Ann Arbor Marathon is your ideal early-spring race, whether you’re walking your first 5K or running your 50th marathon. Be sure to check in on race day! For full details, visit http://www.theannarbormarathon.com.", "url": "https://www.facebook.com/events/1849004435342777/"}, {"source": "Facebook", "date": "2017-03-26T10:00:00-04:00", "name": "Women's History Month and Planned Parenthood", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "url": "https://www.facebook.com/events/189417071550325/"}, {"source": "Facebook", "date": "2017-03-26T10:00:00-04:00", "name": "Photo Monitoring Kick-off & Training", "description": "Do you like photography and spending time outdoors? Photo monitoring may be the perfect volunteer opportunity for you! We need volunteers to take beautiful photos at specific locations each season to record the progress of our restoration work. Come join us at this informational meeting for more details about this volunteer opportunity! Please register by March 19. For more information or to register call NAP 734.794.6627, or send us an email at NAP@a2gov.org.", "url": "https://www.facebook.com/events/1864939247128977/"}]