[{"source": "Facebook", "date": "2016-06-25T09:00:00-04:00", "description": "This park along the river has lots of great ecological diversity, including restored prairie and oak savanna. Help is needed to protect it from invasive weeds that crowd out natives and  maintaining the Native Garden at this park. The Garden is a living demonstration of the beauty of native wildflowers, both a help for identification and an example of how they can be used in landscaping. Please meet in the parking lot off of Fuller Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Furstenberg Park Stewardship Workday", "url": "https://www.facebook.com/events/637977313016320/"}, {"source": "Facebook", "date": "2016-06-25T21:00:00-04:00", "description": "A little magic in the air. Lots of hope, a little despair. Join us...\n\nDeath Posture\nhttps://deathpostureband.bandcamp.com/\n\nFallow Land\nhttps://fallowland.bandcamp.com/\n\niO Megaji\nhttps://iomegaji.bandcamp.com/\n\nShortly\nhttps://shortly.bandcamp.com/\n\nHarison Zamperla\nhttps://www.youtube.com/watch?v=m7qKsN5qIHA\n\n$5 | 18 and up welcome\n\nclub above \n215 N Main Street\nDowntown Ann Arbor\n[above the Heidelberg]", "name": "Death Posture \\\\ Fallow Land \\\\ Harison Zamperla \\\\ iO Megaji \\\\ Shortly", "url": "https://www.facebook.com/events/267060887018329/"}, {"source": "Facebook", "date": "2016-06-25T21:30:00-04:00", "description": "Sat. June 25 | 9:30pm | 18+ | $10 Cover\n\nSuper Happy Funtime Burlesque is a 12 member touring monstrosity. A live band, a burlesque troupe, a circus act, that is all together too contemporary, too modern, too bawdy, and too controversial to be defined just as “burlesque”. So, calling itself ‘burlesque’ for lack of a better term, SHFB is heading out for their 7th national tour this fall with its newest musical production. Designed to find your line and cross it, some kind of strange mix of GWAR and Benny Goodman with touches of SNL and the Price is Right, SHFB sprays you with glitter and love while playfully degrading taboo subjects like religion, politics, and sex. “For every 100 people dancing, there are usually ten or so walking out the door,” says host and bandleader Mr. Happypants, “You either get it or you don’t; the right people get it.” SHFB sets itself apart from other burlesque shows, and touring acts in general, for one major reason: its live band playing original music. Somewhere in a middle ground between Frank Zappa and Tom Waits, this show that gets curiosity seekers out with the promise of tits keeps them in the seats with a set of original tunes that get stuck in your head for weeks after the performance. “People are surprised by the songwriting! What they don’t know is that we’re all professional artists who’s day jobs are in the musical theater world, we bring that aesthetic and blend it with an underground edginess that leaves peoples jaws on the floor.” SHFB is presenting a new and contemporary musical theater at its finest. Come see it now before it gets so big that you can’t afford the ticket!!", "name": "Super Happy Funtime Burlesque 6/25/16 at Blind Pig - Ann Arbor", "url": "https://www.facebook.com/events/251628825201774/"}, {"source": "Facebook", "date": "2016-06-25T23:15:00-04:00", "description": "Children ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. The story on June 25 will focus on work from UMMA’s Japanese collection. Meet in front of the UMMA Store.\n\nIn conjunction with U-M Center for Japanese Studies’ Ann Arbor Japan Week, June 20– 26.\n\nStorytime is generously supported by the University of Michigan Credit Union, UMMA's Lead Sponsor for Student and Family Engagement.", "name": "Storytime at the Museum", "url": "https://www.facebook.com/events/1742573179322455/"}, {"source": "Facebook", "date": "2016-06-26T07:30:00-04:00", "description": "From epicraces.com: The Suburban Chevrolet Cadillac Tri Goddess Tri celebrates women of all abilities, inspiring them to reach new heights of health and set new fitness goals by training for and completing a triathlon. The first-ever all-women’s triathlon/duathlon in Michigan, the Suburban Chevrolet Cadillac Tri Goddess Tri is organized by women who know how to make your first (or hundredth!) triathlon tons of fun! The event is held just 12 miles west of Chelsea at Big Portage Lake in Waterloo Recreation Area, surrounding our participants in scenery as beautiful and inspiring as themselves.\n\nVist epicraces.com for more information!", "name": "TriGoddess Tri", "url": "https://www.facebook.com/events/257242884639852/"}, {"source": "Facebook", "date": "2016-06-26T09:00:00-04:00", "description": "This week is National Pollinator Week which is celebrated all across the country to raise awareness for pollinators and their importance to the ecosystem. NAP is participating in National Pollinator Week by hosting a workday in the Native Garden at Furstenberg Nature Area. Join us on Saturday, June 25th from 9:00am-Noon at Furstenberg Nature Area to help the local pollinators by removing invasive plants from within the Native Garden. For more information on the workday with NAP please visit www.a2gov.org/napevents and for more information on National Pollinator Week visit www.pollinator.org/pollinatorweek .", "name": "National Pollinator Week", "url": "https://www.facebook.com/events/1771333209777255/"}, {"source": "Facebook", "date": "2016-06-26T14:00:00-04:00", "description": "Manuel Álvarez Bravo spent nearly his entire career photographing his native Mexico. His style drew upon numerous international influences including, among others, Modernism andSurrealism. Although not strictly Surrealist, many of Álvarez Bravo’s works manifest a similarly fantastical mood. One of the artist’s most arresting qualities is his ability to imbue scenes of everyday life with an otherworldly, metaphysical power. The photographs in the exhibition, from UMMA’s collections, show the artist using motifs drawn from Mexican\nreligious and indigenous works as well as plant forms, in a Modernist approach to image making. UMMA docents will discuss these motifs and the artist’s use of light as a metaphor and revealer of life, animating even the emptiest and most silent of Álvarez Bravo’s scenes.\n\nPublic exhibition tours are generously supported by the Richard and Rosann Noel Fund for Museum Education.", "name": "Guided Tour - Manuel Álvarez Bravo: Mexico's Poet of Light", "url": "https://www.facebook.com/events/1706443009629359/"}, {"source": "Facebook", "date": "2016-06-26T14:00:00-04:00", "description": "HELLAWELL...Driftwood on Sand\nFriction Quartet\n\nSHOSTAKOVICH...Sonata for Cello and Piano in D minor, Op. 40\nPaul Watkins, cello; Alessio Bax, piano\n\nBOLCOM...Three Rags for String Quartet\nAltius Quartet\n\nArensky | Piano Trio No. 1 in D minor, Op. 32\nTrio Honoré\n\nTickets: Please contact Kerrytown Concert House at 734-769-2999 or visit their website for more information.", "name": "GLCMF at Kerrytown Concert House", "url": "https://www.facebook.com/events/126949477712284/"}, {"source": "Facebook", "date": "2016-06-26T15:00:00-04:00", "description": "Photographed in nearby Detroit, Catie Newell’s new images from her series Nightly frame scenes of the urban landscape illuminated at night. The resulting large-scale photographs transform mundane views of city streets into luminous vignettes that reveal surprising views of familiar spaces. Join newly arrived Assistant Curator of Photography, Jennifer Friess, for a guided exploration of Newell’s intriguing photographs and learn how artificial light has been used to shape our experience of urban spaces throughout the last century.\n\nLead support for the exhibition Catie Newell: Overnight is provided by the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Taubman College of Architecture and Urban Planning.", "name": "In Conversation: Through the Looking Glass, Nightly", "url": "https://www.facebook.com/events/452279421633430/"}, {"source": "Facebook", "date": "2016-06-26T15:30:00-04:00", "description": "Celebrate #MarriageEquality's anniversary!  Come Aut for brunch, stay for a special champagne toast, enjoy music featuring DJ Amy, catch an exclusive screening of Accidental Activists, and more!\n\n10:00am - 3:00pm\nSpecial Brunch at Aut Bar\n\nNoon - 1:30pm and 2:00pm - 3:30pm\n[Outdoor Pre-Screenings of Accidental Activists in Braun Court]\n*Location: Trillium Real Estate\n\n4:30 - 5:00pm\nSpeaking Ceremony and Champagne Toast\n\n5:00 - 7:00pm\nMusic and dancing with DJ Amy\n\n7:00 - 8:30pm\nScreening of Accidental Activists: One couple's journey to the U.S.Supreme Court ($10 Suggested Donation)\n*Location: Kerrytown Concert House", "name": "Day of Decision: One Year Anniversary", "url": "https://www.facebook.com/events/1121859661190359/"}]