[{"date": "2016-06-07T18:00:00-04:00", "description": "Join us for a brew and a book signing with local author, Stephen Johnson, and his new title from Arcadia Publishing & The History Press, Detroit Beer! Have a beer, grab a book, and chat with Steve on June 7th from 6-8pm.\n\nStephen Johnson is the owner and founder of Motor City Brew Tours, a tour company that provides guided tours to Michigan breweries. He is also an adjunct professor of marketing at Macomb Community College and has worked in both sales and marketing for over twenty years. Stephen earned a bachelor’s in business from Western Michigan University and a master’s of business administration from Walsh College of Business. A Michigan native, Stephen loves to share his knowledge and history of Detroit beer scene", "url": "https://www.facebook.com/events/831264297006986/", "name": "Book Signing: Detroit Beer by Stephen C Johnson", "source": "Facebook"}, {"date": "2016-06-07T18:30:00-04:00", "description": "This event is completely and totally full! If you would like to be added to a waitlist in case any spots open up, please contact Vault of Midnight with your name, phone number and email address, and we will add you to the queue. And stay tuned, we may be having another Drink & Draw very soon!\n\nDrink and Draw is coming to Ann Arbor this June. This one is for all of you bar-napkin savants, you web-comic-ers, you dabblers, dawdlers and you doodlers alike. Finally, an event to unite Ann Arbor artists of all calibers, for drinking, drawing and over-all merriment (and not necessarily in that order). We invite you to join us for a night of great company, conversation and collaboration.\n\nThis is a limited space event, so get in touch with us to reserve your space today!", "url": "https://www.facebook.com/events/1596196837358933/", "name": "Drink & Draw [At Capacity]", "source": "Facebook"}, {"date": "2016-06-07T19:00:00-04:00", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n- June 7 James Cornelison \n\nChicago Native James Cornelison has been working as a multi-instrumentalist in Michigan for 5 years. He has played locally with Theo Katzman, the Macpodz, Tree City, Madelyn Grant, Antwaun Stanley, Anna Ash, Heather Black Project, MC Kadence and Chis Good in addition to a number of jazz groups across Detroit and Ann Arbor.  James grew up playing and singing in the Chicago blues scene and currently works as a producer for Michigan based artists.  James is increasingly stepping out from working behind the scenes and as a sideman to pursue his own projects\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/1606436323007032/", "name": "Acoustic Tuesdays: James Cornelison", "source": "Facebook"}, {"date": "2016-06-07T19:00:00-04:00", "description": "Literati is thrilled to host the launch of Julie Lawson Timmer's second novel, Untethered.\n\nPlease note: this event will take place on our main level. \n\nWhen Char Hawthorn’s husband dies unexpectedly, she is left questioning everything she once knew to be true: from the cozy small town life they built together to her relationship with her stepdaughter, who is suddenly not bound to Char in any real way. Untethered explores what bonds truly form a family and how, sometimes, love knows no bounds.\n\nChar Hawthorn, college professor, wife and stepmother to a spirited fifteen-year-old daughter, loves her family and the joyful rhythms of work and parenting. But when her husband dies in a car accident, the “step” in Char’s title suddenly matters a great deal. In the eyes of the law, all rights to daughter Allie belong to Lindy, Allie’s self-absorbed biological mother, who wants to girl to move to her home in California.\n\nWhile Allie begins to struggle in school and tensions mount between her and Char, Allie’s connection to young Morgan, a ten-year-old-girl she tutors, seems to keep her grounded. But then Morgan, who was adopted out of foster care, suddenly disappears, and Char is left to wonder about a possible future without Allie and what to do about Morgan, a child caught up in a terrible crack in the system.\n\nJulie Lawson Timmer grew up in Stratford, Ontario, Canada. She lives in Ann Arbor, Michigan with her husband, their four teenage children and two rescued dogs. By turns, she is a writer, lawyer, mom/stepmom, and dreadful cook. Five Days Left (Putnam 2014) is her first novel. Her second book, Untethered, will be available June 7, 2016.\n\nEvent date: \nTuesday, June 7, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1141498692561970/", "name": "Julie Lawson Timmer", "source": "Facebook"}, {"date": "2016-06-08T19:00:00-04:00", "description": "Literati is delighted to welcome Nathan Bomey in support of Detroit Resurrected: To Bankruptcy and Back.\n\nIn Detroit Resurrected, Nathan Bomey delivers the inside story of the fight to save Detroit against impossible odds. Bomey, who covered the bankruptcy for the Detroit Free Press, provides a gripping account of the tremendous clash between lawyers, judges, bankers, union leaders, politicians, philanthropists, and the people of Detroit themselves.\n\nThe battle to rescue this iconic city pulled together those who believed in its future—despite their differences. Help came in the form of Republican governor Rick Snyder, a technocrat who famously called himself “one tough nerd”; emergency manager Kevyn Orr, a sharp-shooting lawyer and “yellow-dog Democrat”; and judges Steven Rhodes and Gerald Rosen, the key architects of the grand bargain that would give the city a second chance at life.\n\nDetroit had a long way to go. Facing a legacy of broken promises, the city had to seek unprecedented sacrifices from retirees and union leaders, who fought for their pensions and benefits. It had to confront the consequences of years of municipal corruption while warding off Wall Street bond insurers who demanded their money back. And it had to consider liquidating the Detroit Institute of Arts, whose world-class collection became an object of desire for the city’s numerous creditors. In a tight, suspenseful narrative, Detroit Resurrected reveals the tricky path to rescuing the city from $18 billion in debt and giving new hope to its citizens.\n\nBased on hundreds of exclusive interviews, insider sources, and thousands of records, Detroit Resurrected gives a sweeping account of financial ruin, backroom intrigue, and political rebirth in the struggle to reinvent one of America’s iconic cities.\n\nNathan Bomey, a journalist at USA Today, was the lead reporter on Detroit’s bankruptcy and General Motors for the Detroit Free Press. He lives in the Washington, DC, area.", "url": "https://www.facebook.com/events/631220000369326/", "name": "Nathan Bomey: Detroit Resurrected", "source": "Facebook"}, {"date": "2016-06-09T11:30:00-04:00", "description": "Your favorite dinner spot just became your favorite lunch spot.\nBringing great food, and quick service to your lunch break. Offering paella for two, Spanish flatbreads, salads, and more!\nCheck out the new menu with the link listed above.", "url": "https://www.facebook.com/events/138543229893757/", "name": "Aventura Spring Menu Launch", "source": "Facebook"}, {"date": "2016-06-09T12:00:00-04:00", "description": "Laith Al-Saadi will be returning for his 9th season of Sonic Lunch but this time as a national act after making his triumphant rise on NBC’s The Voice.    Laith Al-Saadi was crowned “King of the Blues” by Guitar Center making him one of the top 4 Blues guitarists in the Country.  Laith has been a staple of the Michigan music scene for most of his adult life.  He has shared the stage with greats like Buddy Guy, BB King, Taj Mahal, Kenny Wayne Shepard, Luther Allison, Son Seals & Johnny Winter.  Laith is one of the best and most polished guitar-driven acts you are likely to find on earth.  In 2013, Al-Saadi teamed up with producer Jeffrey Weber and an all star cast of L.A. session legends to make his third release \"REAL.\". The album was recorded live to 2-track with no edits, overdubs, autotune or compression at the world famous Ocean Way Recording Studios in Hollywood. The album features a dream-band of musicians such as Jim Keltner (Drums), Leland Sklar (Bass), Larry Goldings (Hammond B-3), Jimmy Vivino (Rhythm Gtr/ Backing Vox), Tom Scott (Sax), Lee Thornburg (Tpt), Brandon Fields (Bari Sax), Nick Lane (Trombone / Horn Arranger) and more... \nThe soulful new album harkens back to the great musical traditions of New Orleans and Chicago with a splash of Blues, Country, Gospel, and Roots Rock and is arguably Al-Saadi's best work to date.\nhttp://www.laithmusic.com \n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\n Sonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "url": "https://www.facebook.com/events/498423150365579/", "name": "Laith Al-Saadi / June 9th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE", "source": "Facebook"}, {"date": "2016-06-09T15:01:00-04:00", "description": "Did you know that babo now offers craft cocktails along with craft beer and various varietals of wine?\n\nEvery Monday through Friday we will be offering 20% off our signature cocktails, draft beers, and wine by the glass for Happy Hour.\n\nSo take this time to Treat yo' self!", "url": "https://www.facebook.com/events/531425863725580/", "name": "Happy Hour at babo", "source": "Facebook"}, {"date": "2016-06-09T16:30:00-04:00", "description": "This is the 5th installment of Intellect Records annual fest! \nHere's the schedule:\n\nFriday June 3rd  Lampshade  206 W Michigan Ave\n4:30 The Vagrant Symphony\n5:15 Doctor Pizza\n6:00 J. Washburn Gardner  \n7:30 Mental Health Day \n8:15 Joanna Ransdell\n\nThe Tap Room    201 W Michigan Ave\n9:00  Mercury Salad Sandwich\n9:45  The Parsnips\n10:30  Las Drogas \n11:15  Gruesome Twosome \n12:00  Old Man\n\nSaturday June 4th  Frog Island Park      699 Rice St  \nAcoustic Open Mic  2:20-4:00       \n\nGood Vibes Glass   15 E Cross St. \n4:15 Kurmudgeon\n5:00  Ada Z \n5:45 Russell Davis\n6:30 Ypsi's Stimulators of Mutiny\n\nCanada House      310 Olive\n8:00  Nina & The Buffalo Riders\n8:45 Modern Lady Fitness \n9:30  Dangerous Pleasure Detroit\n10:15  BaTTery Acid\n11:00  Mellified Man\n\nSunday June 5th Bandemer Park  1352 Lakeshore Dr. \nDisc Golf 4:00- 6:00\nDock Concert/ Swim Fun!\n6:00 Jobin\n6:45  Flycatcher\n7:30 Science for Sociopaths\n  \nClub Above    215 N Main St. \nOpen Mic 8:30-10:30\n10:30 The Cool Birds \n11:15 The Pineapple Army\n12:00  Grizzly Season\n\nMonday June 6th  Prospect Park DIY Skate Park  \n4:30 BSRB\n5:30 Modus Operandi\n\nArbor Brewing Company Microbrewery  720 Norris St. \n7:30  Shelley Catalan\n8:15  Nina Sofia\n9:00  Fangs and Twang\n9:45 Once United\n10:30 The Butts\n\nTuesday June 7th  Lampshade  206 W. Michigan Ave\n4:30 Antonia Moses\n5:15 Dede Alder \n \nBona Sera\n6:30 Stray Talk\n7:15 Abe Maybe\n8:00 March of the Ant\n8:45   \n\nCrossroads  517 W Cross St. \n10:00 Nathanael Paul Romero\n10:45 Barelyon\n11:30 Cig Butts \n12:15 As a Lark\n\nWednesday June 8th  Cultivate  307 N River St. \n2:30  Laura Taylor\n3:15  Rustbelt Angels\n4:00 Lefty Leadfoot\n4:45  Black Sqirl \n\n5:30 Sidetracks Happy Hour!  56 E Cross St. \n\nThursday June 9th Fuller Pool  1519 Fuller Rd. \nSwimming fun! 2:00-5:00\n\nIsland Park  1450 Island Dr. \nOpen Mic/ Bocce Ball/ BBQ  5:00-8:00\n\n8:15 Fuzz Fest 3 at the Blind Pig   https://www.facebook.com/events/557595637741480/\n\nFriday June 10th (33rd Birthday Celebration!) \nDisc Golf  2:00-4:00  Mary Beth Doyle Park\nBirthday BBQ! 4:00-5:00 Clinton Park \nAcoustic Open Mic 5:00-8:00  West Park  215 Chapin St.\n8:30 Ann Arbor Summer Fest with Hullabaloo http://a2sf.org/category/top-of-the-park/\nBirthday Bar Crawl! \n\nSaturday June 11th  The Farmhouse  6580 Park Rd. \nOpen Mic/ Open Stage 4:15-7:45\n\nThe Fire Stage \n7:45 Strchld \n10:00 Antarctique\n12:15 East of Awake\nThe Barn Stage \n9:15 Liars and Thieves  \n10:45 Corridors \n1:00  Bandana Brothers \nThe Jungle Room \n8:30  Slim Pickins \n11:30 Doogatron\n1:45 Fa La Las (Allah Las tribute)\n\nSunday June 12th \nDisc Golf Tourney & BBQ  12:00- 5:00\n\nThe Fire Stage \n4:30 Mike Gentry  \n7:30 Unicorn\n11:15 io Megaji\nThe Barn Stage \n5:15 No Conflict\n6:45 Haunted Head\n9:00  Cyrano Jones\n10:30 The Messenger Birds\nThe Jungle Room \n6:00 Poor Player\n8:15 Moving Fast in Slow Motion \n9:45  Inkflo Trio\n12:00  Vision Explored", "url": "https://www.facebook.com/events/1418542981807093/", "name": "Ypsiarboroo 2016", "source": "Facebook"}, {"date": "2016-06-09T18:30:00-04:00", "description": "Thursdays through Sundays June 9-26.  Check out Tickets Available link for arb member advance ticket info plus note Summer 2016 construction impacting arboretum area parking & traffic.  Arrive early for tickets and time to walk to location of the first scene.", "url": "https://www.facebook.com/events/235874080125426/", "name": "Shakespeare in the Arb 2016 - Love's Labour's Lost Opening Week", "source": "Facebook"}]