[{"source": "Facebook", "url": "https://www.facebook.com/events/723312037871156/", "description": "Don't miss our holiday display Avant Garden: Weaving Fashion & Nature Together. The exhibit explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs Saturday, November 26, 2016-Sunday, January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "name": "Holiday Exhibit - Avant Garden", "date": "2016-12-02T10:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/958976467569002/", "description": "Beginning November 4th, GameStart will be hosting a six-week series of Open House workshops called GameLab. Each week will feature a FREE to participate class, rotating* between two of GameStarts most popular courses: Game Creation with Unity and Minecraft Python Programming. Students are invited to try out and retake each class as often as they'd like during the six-week term.\n\nGameLab Course Schedule:\nDecember 2nd, 4:00pm - 5:00pm: Game Creation with Unity\nDecember 9th, 4:00pm - 5:00pm: Minecraft Python Programming\nDecember 16th, 4:00pm - 5:00pm: Game Creation with Unity", "name": "GameLab: Game Creation with Unity (4/6)", "date": "2016-12-02T16:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1784751885141397/", "description": "It’s party time in the Main Street Area! Stores stay open late with lots of holiday specials including deals, discounts, sweets and treats. While you shop enjoy the sidewalk entertainment, and say hello to Santa Claus and Miss Washtenaw County, who will be roaming the sidewalks from 7-9pm! Join local business owners as they roll out the red carpet and welcome guests with extra special savings.\n\nFor more information and a full list of participating retailers visit www.mainstreetannarbor.org", "name": "Midnight Madness", "date": "2016-12-02T17:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/345324652488819/", "description": "Known for high caliber art work, the Ann Arbor Potters Guild sale features the work of more than twenty artists and is the perfect \"go to\" for your holiday gifts. It takes place on Saturday and Sunday, December 3 & 4 from 10 am to 5 pm. New this year is an Opening Night party on Friday, December 2 from 5-8 pm.", "name": "A2 Potters Guild Winter SALE", "date": "2016-12-02T17:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1315113695196028/", "description": "We're excited for our 2016 annual KindleFest! We're rearranging the market to make more room to mingle and visit all of your favorite artisans. Check our Facebook page for updates between now and December 2nd.", "name": "2016 Kerrytown KindleFest - A ChristKindlmart", "date": "2016-12-02T18:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/673394486161807/", "description": "We're excited for our 2016 annual KindleFest! We're rearranging the market to make more room to mingle and visit all of your favorite artisans. www.facebook.com/kindlefest or www.kerrytown.org for more information!", "name": "2016 KindleFest - A Christkindlmart", "date": "2016-12-02T18:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1615390588758098/", "description": "Friday, December 2nd from 6:30pm until 7:30pm. Purchase lanterns in the Farmers Market for $10 per lantern (proceeds go to support this event), or bring your own! Lantern sales start as early as 5:45pm in the market. Meet at 6:30pm near the big tent, parade starts at 7pm (look for Lanterns and St. Nicholas!)", "name": "Children's Lantern Parade!", "date": "2016-12-02T18:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/642251302621967/", "description": "Friday, December 2nd from 6:30pm until 7:30pm. Purchase lanterns in the Farmers Market for $10 per lantern (proceeds go to support this event), or bring your own! Lantern sales start as early as 5:45pm in the market. Meet at 6:30pm near the big tent, parade starts at 7pm (look for Lanterns and St. Nicholas!)", "name": "2016 Children's Lantern Parade", "date": "2016-12-02T18:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1149994891774281/", "description": "FEATURING: Vocalist/clarinet Sarah D'Angelo, trumpeter Paul Finkbeiner, vibraphonist Cary Kocher and string bassist Paul Keller. \n\nIt will be a fun night of free-wheeling jazz, familiar songs, Keller's nifty arrangements, and a few original tunes from each of the band members! Jazz students from the Community Music School of Ann Arbor will also perform short sets during the breaks.\n\nGreat food and drinks offered at Zal Gaz Grotto with FREE parking.\n\n$10 at the door. 18 and under FREE.", "name": "JAZZ NIGHT with Paul Keller and friends", "date": "2016-12-02T19:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1694208660853014/", "description": "Back by popular demand! Don White combines heartfelt, serious lyrics with side-splitting laughs to provide an evening not to be forgotten. This Massachusetts comedian/singer/songwriter/author is best-known in these parts for his radio gems, \"Rascal,\" \"Psycho Mom and Dad\" and \"I Know What Love Is.\"  A Don White show promises to delight new audiences and devoted \"repeat offender\" fans, alike.\n\nChristine Lavin’s alternately witty, comical and poignant songs have been earning glowing reviews for more than 35 years, starting in the 1980s with a string of albums that  made her a folk-pop fan favorite. Christine performs concerts all over the US, Canada, and points beyond, and hosts knitting circles backstage prior to each show.  Songs of hers have been performed by artists as diverse as Broadway stars Betty Buckley and Sutton Foster; cabaret diva, Andrea Marcovicci, and the college a cappella group, Dartmouth Decibelles.\nChristine has recently added intermission tutorial activities -- namely, teaching audience members how to fold cloth napkins in the Downton Abbey style.\nTwo longtime friends present an evening of hilarious interaction, contagious laughter, and irrepressible fun. Don't miss it!\ndonwhite.net/don-christine/", "name": "Don White & Christine Lavin at Green Wood Coffee House", "date": "2016-12-02T20:00:00-05:00"}]