[{"source": "Facebook", "date": "2016-07-01T18:00:00-04:00", "description": "Join us on Friday July 1 from 6:00-9:00pm for the Opening Reception of 'Real American'.\n\nWhat is “Real American”? We seek to explore the generational, ethnographic, cultural, and anthropological ideals of what the word American means. From fresh apple pie to Budweiser, the Star Spangled Banner to Party in the USA, what is the modern American experience? Are we entering the sci-fi World of Tomorrow, longing for the Norman Rockwell past, or painting ourselves into an Idiocracy? If our culture is our biggest export, what kind of image are we presenting to the world? \n\nJuror: Peter Baker\nPeter Baker is an Ann Arbor-based photographer who specializes in editorial, travel, and advertising photography. His clients include Herman Miller, The Wall Street Journal, Bloomberg Businessweek, ESPN The Magazine, National Geographic Traveler, and Popular Mechanics. Peter’s work has been featured in numerous exhibitions nationally and internationally, as well as in HOW Magazine, American Photography, and Hemispheres. He also serves as Creative Director at local tech darling Duo Security, and has been involved in creating many arts and culture events in Ann Arbor, MI.\n\nThis event is FREE and open to the public. \n-----------\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC. \n\nCatering generously provided by Laura's Catering (http://laurascatering.com/)", "name": "Real American: Opening Reception", "url": "https://www.facebook.com/events/181519262246520/"}, {"source": "Facebook", "date": "2016-07-01T19:00:00-04:00", "description": "This is Detroit blues with a rockabilly twist. From another place and time come The Boa Constrictors, old school blues musicians who know how to build a tight set. A favorite at blues festivals in Michigan and Canada, they call their Detroit blues “very greasy, grimy, and lowdown”—a sound that arrived from the Delta Blues regions with the northern migration for factory jobs during Detroit's industrial revolution. With a recipe that comes from the legendary harmonica bands of Little Walter, Jerry Portnoy, Junior Wells, Paul Butterfield, and Sonny Boy Williamson (sr. and jr.), this is energetic and spontaneous blues that will get fans at TOP shuffling their feet.\nWebsite: http://www.theboaconstrictors.com/", "name": "The Boa Constrictors", "url": "https://www.facebook.com/events/1019028304840040/"}, {"source": "Facebook", "date": "2016-07-01T20:00:00-04:00", "description": "Singer Mayer Hawthorne has an incredible ear for what makes music soulful. “Flashy but classy” and always stylish in a fine suit, he’s a sensation onstage. A hometown hero, he soaked up Curtis Mayfield, Barry White, Shuggie Otis, Hall and Oates, and hip hop producer J Dilla spinning DJ sets at The Firefly and The Blind Pig. Now this deeply talented, multi-instrumentalist, singer, and producer has moved to LA, sold millions of albums, helped Pharrell win a Grammy for best producer, and become neo-soul royalty. His album out this spring is Man About Town.\n\nSponsored by: bank of ann arbor\nMedia Partner: ann arbor's 107one\n\nWatch video: https://youtu.be/RWkjcq_N2YQ", "name": "Mayer Hawthorne", "url": "https://www.facebook.com/events/1689609494622767/"}, {"source": "Facebook", "date": "2016-07-01T20:00:00-04:00", "description": "Lovely Socialite is a Madison-based six-piece that combines the aesthetics of modern jazz with contemporary classical, driving rock, and hip hop. Lauded for their bold and intricate compositions, the group often draws comparisons to Frank Zappa and the Mothers of Invention. The band’s original music combines strict notation with moments of improvisation and maintains a healthy balance of dark and heavy rock grooves with quirky jazz obscurities. While Lovely Socialite’s unusual mix of strings, traditional Chinese instruments, brass, and a jazz rhythm section suggest that the group might be a contemporary music ensemble, it is their use of stomp boxes, vocal processors, and other electronics that makes the group a suitable fit for any rock, hip-hop, or jazz bill. In fact, Lovely Socialite has been privileged to share the stage with such artists as Dessa, of Minneapolis hip-hop collective Doomtree, as well as performing live on the UW Madison Terrace with Brian Ritchie of the Violent Femmes. \n\nBen Willis, double bass/electronics\nPat Reinholz, electric cello/electronics\nBrian Grimm, pipa/gaohu/guzheng/ cello/electronics\nCorey Murphy, trombone/electronics\nAbe Sorber, vibraphone/drums\nMike Koszewski, drums/percussion\n\nOrnâmatik captivates audiences with an energetic and unique take on Eastern European folk music. With its tight rhythm section and funky horns, the band plays music from all over the Balkans. The result is infectious grooves, often in the odd-time meters of traditional folk dances. \n\nBethanni Grecynski, trombone/voice\nDrew Schmieding, drums\nEric Schweizer, saxophone/clarinet\nBen Rolston, bass\nDerek Worthington, trumpet", "name": "Lovely Socialite and Ornamatik at Kerrytown Concert House", "url": "https://www.facebook.com/events/513475738844906/"}, {"source": "Facebook", "date": "2016-07-01T20:30:00-04:00", "description": "A night of high-energy blues continues to heat up with a dance party led by Ann Arbor’s The Bluescasters! A long-time festival favorite, The Bluescasters bring tight vocal harmonies, a groove oriented rhythm section, and rockin' solos that drive the dance floor. This band has long been the linchpin of the Ann Arbor blues scene, and can frequently be seen at Guy Hollerin’s and Mash. Expect to hear Bluescasters originals, classics by The Allman Brothers, B.B. King, Muddy Waters, and Tommy Castro, as well as some new R&B songs and covers of Johnny Lang and Joe Bonamassa.\nWebsite: http://www.thebluescasters.com", "name": "The Bluescasters", "url": "https://www.facebook.com/events/259454087778364/"}, {"source": "Facebook", "date": "2016-07-01T21:00:00-04:00", "description": "MindFlip Records and Transcendent Tunes present a night of original psy-bass featuring:\n\nAscentient- Live Handsonic Set  (Soundcloud.com/ascentientmusic )\n\nSacral Crown - ( https://soundcloud.com/sacral-crown )\nMynah  ( https://soundcloud.com/mynahmusic )\nThrough Rhythm Is Peace  ( https://soundcloud.com/throughrhythmispeace )\nDancemyth ( https://soundcloud.com/dancemyth )\n\n$7 at the door\n\nSettimes\n9pm - DanceMyth\n10pm - T.R.I.P\n11pm - Mynah\n12pm - Ascentient\n1am - Sacral Crown", "name": "MindFlip Ann Arbor - Psychedelic Bass Showcase", "url": "https://www.facebook.com/events/1767444393486019/"}, {"source": "Facebook", "date": "2016-07-01T22:15:00-04:00", "description": "Fourth of July weekend is about to take off when The Sun Messengers ignite the dance floor! This festival favorite is an eight-piece, horn-driven R&B party band with a hard-hitting style that has made them legendary in southeast Michigan for over 30 years (they say they’ve played over 6,000 gigs!). They have opened for Jay Leno, backed up R&B luminaries Martha Reeves, The Drifters, and Sir Mack Rice, and have been rocking the Palace of Auburn Hills since 1996 as the house band for the Detroit Pistons. Welcome them back for this weekend wind-up!\nWebsite: http://www.sunmessengers.com/", "name": "The Sun Messengers", "url": "https://www.facebook.com/events/1553054854995645/"}, {"source": "Facebook", "date": "2016-07-02T17:00:00-04:00", "description": "Ann Arbor’s Madelyn Grant is a young R&B singer who grew up listening Aretha Franklin, Marvin Gaye, Lauryn Hill, D’Angelo, Erykah Badu, Little Dragon, and Lianne La Havas. Her original lyrics are emotionally driven and empowering, and her sultry voice and smooth tone hypnotize listeners. Though Grant has just started playing clubs and festivals, she has written music and collaborated with ODESZA, FKJ, and Emancipator, with more collaborations and a solo EP in the works. The single “Waiting” from French producer FKJ features her vocals and has over a million plays on SoundCloud. Expect big things from this talented artist.\nWebsite: http://madelynmgrant.wix.com/madelyngrantmusic", "name": "Madelyn Grant", "url": "https://www.facebook.com/events/1722814468006192/"}, {"source": "Facebook", "date": "2016-07-02T17:00:00-04:00", "description": "A series of mind-body sessions at Top of the Park, this alternative happy hour lets you enjoy a relaxing late afternoon workout with classes in Yoga, Tai Chi, Aikido, World Dance, Capoeira, and Hula Hooping.\n\nLed by experienced practitioners, all sessions are free, and take place from 5 to 6 pm every Tuesday through Sunday on the Power Center Lawn.\n\nLearn foundational moves and hoop your way into fantastic shape! Hooping tones your entire body while strengthening and opening your upper back and chest. Hooping also helps increase your balance and get great a cardio workout while having fun!\nDiva Hoops Website: http://www.divahoops.com", "name": "Retreat: Hula Hoop Fitness", "url": "https://www.facebook.com/events/1109573199082114/"}, {"source": "Facebook", "date": "2016-07-02T17:00:00-04:00", "description": "Join Caitlin for 30 minutes of sheer yoga fun!  Kids will get to connect with their surroundings through animal and nature poses, work with a new friend to master a partner pose, and play yoga games.\nAn interactive area for our youngest festival-goers, the KidZone tent provides a fun and safe area for children and their parents to discover and explore a wide variety of hands-on activities with different community partners. From learning karate, creating homemade instruments, or meeting prehistoric critters, KidZone offers different nightly activities for families at Top of the Park.\nLed by community partners, all sessions are free, and take place from 5 to 8 pm every Tuesday through Sunday at the KidZone tent at Top of the Park.\nAnn Arbor YMCA's Website: www.annarborymca.org", "name": "KidZone: Ann Arbor YMCA", "url": "https://www.facebook.com/events/175989329469169/"}]