[{"source": "Facebook", "name": "Acoustic Tuesdays: James Cornelison", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nJames Cornelison\nChicago Native James Cornelison has been working as a multi-instrumentalist in Michigan for 5 years. He has played locally with Theo Katzman, the Macpodz, Tree City, Madelyn Grant, Antwaun Stanley, Anna Ash, Heather Black Project, MC Kadence and Chis Good in addition to a number of jazz groups across Detroit and Ann Arbor.  James grew up playing and singing in the Chicago blues scene and currently works as a producer for Michigan based artists.  James is increasingly stepping out from working behind the scenes and as a sideman to pursue his own projects. Join us for James' LAST Acoustic Tuesday SHOW before he moves to LA!\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/1671418046512529/", "date": "2016-09-20T19:00:00-04:00"}, {"source": "Facebook", "name": "SMTD: Composing a Space", "description": "This program is free and open to the public. Seating is first come, first served.\nArchitect Mira Henry's conceptual drawings offer a new way of seeing architecture and architectural elements, including the historically female domains of interior spaces and decorative elements. U-M Composition faculty members Roshanne Etezady and Kristin Kuster think about the concept of the feminine in music and discuss creating new work with and against the male-dominated grain. Colleagues and SMTD students perform works by Etezady and Kuster.\nThe SMTD@UMMA performance series is generously supported by the Katherine Tuck Enrichment Fund and the Greg Hodes and Heidi Hertel Hodes—Partners in the Arts Endowment Fund.\nLead support for the exhibition Mira Henry: The View Inside is provided by the Herbert W. and Susan L. Johe Endowment.", "url": "https://www.facebook.com/events/505768019612859/", "date": "2016-09-20T19:00:00-04:00"}, {"source": "Facebook", "name": "Skazat! Poetry Series featuring Danez Smith", "description": "We're back! Hope you enjoyed the August break, and really hope that you'll join us at Sweetwaters Coffee & Tea for the return of the poetry series this month. Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Readers\n\nThis month's feature: DANEZ SMITH!\n\nDanez Smith is the author of [insert] boy (YesYes Books, 2014), winner of the Kate Tufts Discovery Award and the Lambda Literary Award for Gay Poetry, and Don’t Call Us Dead (Graywolf Press, 2017). Danez is also the author of two chapbooks, hands on your knees (2013, Penmanship Books) and black movie (2015, Button Poetry), winner of the Button Poetry Prize. They are a 2014 Ruth Lilly - Dorothy Sargent Rosenberg Fellow, a Cave Canem and VONA alum, and recipient of a McKnight Foundation Fellowship. They are a 2-time Individual World Poetry Slam finalist, placing 2nd in 2014, and a 3-time Rustbelt Poetry Slam Champion. Danez is a member of the Dark Noise Collective. They from St. Paul, MN and is an MFA candidate at the University of Michigan.\n\n\nNext month: CITYWIDE POETS!", "url": "https://www.facebook.com/events/184681001943322/", "date": "2016-09-20T19:00:00-04:00"}, {"source": "Facebook", "name": "Leila Chatti & Tracey Knapp", "description": "Literati is pleased to welcome poets Leila Chatti and Tracey Knapp, in support of their recent work. UM Zell Fellow in Poetry Kayla Krut will open for Leila and Tracey.\n\nLeila Chatti is a Tunisian-American poet. She holds a BA from Michigan State University and an MFA from North Carolina State University. The recipient of a fellowship from the Fine Arts Work Center, a scholarship from the Tin House Writers’ Workshop, and prizes from Narrative Magazine’s 30 Below Contest, the Gregory O'Donoghue International Poetry Prize, and the Academy of American Poets, her poems appear in Best New Poets, Narrative, Boston Review, North American Review, The Missouri Review, TriQuarterly, Gulf Coast, and elsewhere. www.leilachatti.com\n\n*\n\nThe poems in Tracey Knapp's Mouth are about the world of the mouth and its many satellites. Words, especially. And when you're lucky, another mouth. The poems address the beautiful failures of language to mean what it says, and to be less than the physical. At the end of the day, you are left with only the words in your head, the mouth on your face.\n\n\"Quotidian, weird, intimate, witty, and skittery, Knapp's poems are refractions through a funhouse mirror. They're self-conscious without being self-important. The wounded heart is everywhere apparent; we of that tribe can be grateful for one more of us to voice it, brilliantly. MOUTH is a charmer of a first book. Read it and weep over your nachos and wine; it will leave you wanting more.\"—Kim Addonizio\n\n\"...part Frank O’Hara, part Robert Herrick ...it’s a book that hurts, and a book that flirts... It’s also part of the least self-important, and therefore the most important, tradition of lyric, the tradition of trying to make the tiny moments, their delights and disappointments, last.\"--Stephen Burt, Slate\n\n\"Deliciously irreverent, Knapp’s poems welcome us into a weird urban landscape full of airports, broken hearts, wine and spilled dog chow. ...[She] delves into the shadow and still finds glimpses of light.\"--San Francisco Chronicle\n\nTracey Knapp's first full-length collection of poems, Mouth, won the 42 Miles Press Poetry Award and was published in 2015. Tracey has received scholarships from the Tin House Writers’ Workshop and the Dorothy Sargent Rosenberg Poetry Fund.  Her work has been anthologized in Best New Poets 2008 and 2010, The Cento: A Collection of Collage Poems (Red Hen Press), and has appeared in Poetry Daily, Five Points, Ink Node (as a featured poet),The National Poetry Review, Red Wheelbarrow Review, The New Ohio Review, The Minnesota Review, and elsewhere.", "url": "https://www.facebook.com/events/739176996220270/", "date": "2016-09-20T19:00:00-04:00"}, {"source": "Facebook", "name": "Bakermat x Sam Feldt ll Necto ll 9.20.16", "description": ">>TICKETS: http://samfeldtnectonightclub.eventbrite.com/?aff=FBE\n\nPrime Social Group presents...\n\nBAKERMAT x SAM FELDT\n=============================\nNECTO NIGHTCLUB\n=============================\nTuesday, September 20 // 9:00 PM doors // 18+\n=============================\n\n>>TICKETS ON SALE: http://samfeldtnectonightclub.eventbrite.com/?aff=FBE\n\n>>>MUSIC: \nhttps://soundcloud.com/bakermatmusic/\nhttps://soundcloud.com/samfeldt\n\nWho is Bakermat?\n\nIt all started in 2012 when 20 year old Lodewijk Fluttert took a semester off of hisstudy Psychology to discover different sides of himself. For two months he danced, filmed, made music, did standup comedy, wrote and much more, untill he found out what he loved doing most: making music. He uploaded a couple of tracks on Youtube and Soundcloud, and Bakermat was born. Since then he stepped in a rollercoaster ride he could have never imagined. First official single ‘Vandaag (One Day)’ became a huge hit all over Europe hitting top 10 spots in almost every country. The early succes got rewarded with platinum records in France, Germany, The Netherlands and Belgium. The succes was largely attributed to the fact that he came with an entirely different and new sound, combining minimal and deep house with jazz and soul. It laid a foundation for the genres we now know as ‘tropical house’ or ‘melodic house’, in which he is still seen as the founder and pioneer. He keeps trying to bring new and refreshing music out, always trying to be as unique and renewing as possible. A huge succes was his record released in 2015 “Teach Me” where he mixedSoul, Gospel and Disco to a record that set a new standard in the ‘melodic house’ genre. \n\nBakermat also became well know because of his innovative performances and stage hostings. He did shows in Paris, London and other big cities with an entire band called ‘The Bakermat Live Band’. In Paris he even played in the legendary L’Olympia with his band, a sold out show. He played at almost every big festival there is over the last 3 years like I Love Techno, Ultra Miami, Sensation White, Mainsquare, Montreux Jazz Festival, Tomorrowland, Mysteryland, South West Four and the list goes on and on. He is also the host of stages at the biggest festivals like the ‘Bakermat & Friends’ stage at Tomorrowland every year, or the “Bakermat’s Gospel Church’ at Kingsday Festival and a lot more. As one of the founders his goal is to bring new talent or fellow colleagues to the stage and that's exactly what he does when he's curating a stage. Artists like Klingande, Thomas Jack, The Avener, Robin Schulz and Oliver Heldens are often guests at one of his stages. Bakermat’s new album ‘Bon Voyage’ is his first studio album and will be released in 2015, it contains a lot of new material and new styles/ production techniques, because according to Bakermat this was an opportunity for him to “ really be free of restrictions and make exactly what I want”. With his album, remixes, releases and confirmed shows at the biggest festivals lined up, it seems 2016 will be a great year for Bakermat once again.\n\n\nWho is Sam Feldt?\n\nDeemed a \"Modern House superstar\" by Billboard, Sam Feldt broke onto the scene in 2013 with remixes including \"On Trees and Birds and Fire\" from I Am Oak. In 2015, he released a remake of \"Show Me Love\" from Robin S. which charted highly across the world. \n\nThe Dutch DJ, born August 1, 1993, is currently signed to Spinnin' Records and most recently released \"Summer On You\", a melodic and deep tropical track with Lucas & Steve featuring Wulf.\n\nwww.PrimeSocial.com\n===============================\nGET INVOLVED: Want to get involved with PSG? Join the team by visiting http://primesocial.com/get-involved/\n===============================", "url": "https://www.facebook.com/events/1033650563369677/", "date": "2016-09-20T21:00:00-04:00"}, {"source": "Facebook", "name": "30% Off Supplements- One Day Only!", "description": "For just one day next Wednesday, all our supplements are 30% off! Stock up on your favortites to keep healthy as we go into cold and flu season, and find some new favorites to try.", "url": "https://www.facebook.com/events/859789944151960/", "date": "2016-09-21T08:00:00-04:00"}, {"source": "Facebook", "name": "Ann Arbor Station Leadership Advisory Group Meeting", "description": "The City of Ann Arbor invites the public to attend and participate in the next round of public meetings in the Ann Arbor Station Environmental Review project to discuss and comment on the Alternatives Analysis Phase II report. \n\nLeadership Advisory Group Meeting\nWednesday, September 21\t\n8:00 a.m. – 9:30 a.m.\nCouncil Chambers, 2nd Floor, Ann Arbor City Hall, 301 E. Huron Street, Ann Arbor\n\nThis Alternatives Analysis is the result of technical and environmental analysis compliant with the National Environmental Policy Act (NEPA) and public input received since February 2014. The Ann Arbor Station planning effort is led by the City of Ann Arbor with the Michigan Department of Transportation (MDOT) and the Federal Railroad Administration (FRA). The Phase II report, along with additional project information and documents, is available online at www.a2gov.org/annarborstation.", "url": "https://www.facebook.com/events/520260811510701/", "date": "2016-09-21T08:00:00-04:00"}, {"source": "Facebook", "name": "Sweetwaters Westgate Grand Opening!", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/", "date": "2016-09-21T09:00:00-04:00"}, {"source": "Facebook", "name": "Ann Arbor Station Citizen Working Group Meeting", "description": "The City of Ann Arbor invites the public to attend and participate in the next round of public meetings in the Ann Arbor Station Environmental Review project to discuss and comment on the Alternatives Analysis Phase II report. \n\nCitizen Working Group Meeting\nWednesday, September 21\t\t\t\n6:30 p.m.-8:30 p.m.\nCouncil Chambers, 2nd Floor, Ann Arbor City Hall, 301 E. Huron Street, Ann Arbor\n\nThis Alternatives Analysis is the result of technical and environmental analysis compliant with the National Environmental Policy Act (NEPA) and public input received since February 2014. The Ann Arbor Station planning effort is led by the City of Ann Arbor with the Michigan Department of Transportation (MDOT) and the Federal Railroad Administration (FRA). The Phase II report, along with additional project information and documents, is available online at www.a2gov.org/annarborstation.", "url": "https://www.facebook.com/events/320953951588714/", "date": "2016-09-21T18:30:00-04:00"}, {"source": "Facebook", "name": "Eileen Pollack", "description": "Literati is thrilled to welcome Eileen Pollack back to the store in support of her latest book, A Perfect Life.\n\nLove and science converge in Eileen Pollack’s luminous new novel, A Perfect Life. With singular insight and narrative grace, Pollack explores the moral complexities of scientific discovery through the story of a brilliant research biologist facing heartrending decisions about her personal life and the fate that genetics may have preordained for her. \n\nJane Weiss is a young post doc at MIT who is obsessed with finding the genetic marker for Valentine’s disease, a neurodegenerative disorder that killed her mother. With the clear vision of a scientist, she knows that she and her sister each stand a fifty percent chance of inheriting the disease, and her research is fueled by a need to discover if they are genetic carriers. Having witnessed the devastating effect that Valentine’s had on her parents’ marriage, Jane has vowed to steer clear of love unless she is sure she is free of the disease, refusing to become a burden on anyone else. But that determination is upended when she meets and falls in love with Willie, whose own father died of Valentine’s. Suddenly, with the very real possibility of their relationship ending in tragedy, her research takes on a new ferocity.\n\n“A Perfect Life probes how we live in the face of uncertainty and the ways risk can both disable and empower us. Eileen Pollack has crafted a tender exploration of family love that is as smart and thought-provoking as it is moving.”--Celeste Ng, author of Everything I Never Told You\n\n“Like Richard Powers’s The Gold Bug Variations and Allegra Goodman’s Intuition, Eileen Pollack’s compelling novel offers an intimate portrait of scientists engaged in research with the potential to change all our lives—and equally engaged in relationships that change their own lives.\"--Andrea Barrett, author of Ship Fever and Servants of the Map\n\n“A tense scientific mystery propels this gripping novel, but what resonates most powerfully are the keenly observed discoveries Jane makes about even deeper mysteries: the risks and pleasures of being human, and the nuances—as well as the costs—of love.”--Kim Edwards, author of The Memory-Keeper's Daughter\n\nWith both an MFA from the Iowa Writers’ Workshop and a BS in physics from Yale, Eileen Pollack is uniquely positioned to have written A Perfect Life, bringing both a fiction-writer’s sensibility and a scientific background to the novel. She is the author of two previous novels, two story collections, and two books of nonfiction, and has received fellowships from the National Endowment for the Arts, the Michener Foundation and the Rona Jaffe Foundation. Her work has been included in both the Best American Short Stories and the Best American Essays series. Pollack has been a professor at the Helen Zell MFA Program at the University of Michigan since 1999, and was a director of the program for five years. She now divides her time between Ann Arbor and Manhattan.", "url": "https://www.facebook.com/events/310581899312138/", "date": "2016-09-21T19:00:00-04:00"}]