[{"description": "We don't know who came up with the idea of chicken and waffles, but let's go ahead and call them a genius. We're going a step further and making it a sandwich. Oh, and we decided it needed some bacon, too :)  $5, and we'll have 'em until we run out!", "date": "2016-07-03T11:00:00-04:00", "name": "Chicken and Waffles!", "source": "Facebook", "url": "https://www.facebook.com/events/815625868573753/"}, {"description": "The Mighty Oak will host Detroit City FC at Pioneer High School’s Hollway Field on July 3rd for the first time in club history.  The match time, originally scheduled for 1pm, has been pushed back to 6pm. \n\nRIDE THE BUS!!! Meet up with AFC Ann Arbor fans at Arbor Brewing Company for the official AFCAA Tailgate event at 4pm!  Enjoy pre-game drinks and ride our FREE shuttle to and from the game.  \n\nShuttles start 1 hour prior to match time.\n\nTickets for the match can be purchased in advance online for $8 ($10 at the gate).", "date": "2016-07-03T16:00:00-04:00", "name": "AFC Ann Arbor Tailgate Bus", "source": "Facebook", "url": "https://www.facebook.com/events/1816189055279731/"}, {"description": "A series of mind-body sessions at Top of the Park, this alternative happy hour lets you enjoy a relaxing late afternoon workout with classes in Yoga, Tai Chi, Aikido, World Dance, Capoeira, and Hula Hooping.\n\nLed by experienced practitioners, all sessions are free, and take place from 5 to 6 pm every Tuesday through Sunday on the Power Center Lawn.\n\nCome stretch, strengthen and flow with this fun, creatively sequenced Vinyasa Flow class!\nSharpen your intuition and connect body and mind. Experience yoga as a work-out and also as a \"work-in\". Strengthen yourself externally AND internally. Take this awareness off the mat and into your life. Class taught by Marty Betts, Certified Yoga Alliance Instructor and NASM Certified Personal Trainer. All levels are welcome! Please bring a mat or beach towel.\nWebsite: http://www.yogaflexmartina.com/", "date": "2016-07-03T17:00:00-04:00", "name": "Retreat: Vinyasa Core Flow with Mary Betts", "source": "Facebook", "url": "https://www.facebook.com/events/606930009483900/"}, {"description": "At this event, kids can make their own jellyfish with flowing tentacles. Parents can learn more about the University of Michigan Conceptual Development Lab, which studies how children learn and think about the world around them through fun, interactive games.\nAn interactive area for our youngest festival-goers, the KidZone tent provides a fun and safe area for children and their parents to discover and explore a wide variety of hands-on activities with different community partners. From learning karate, creating homemade instruments, or meeting prehistoric critters, KidZone offers different nightly activities for families at Top of the Park.\nLed by community partners, all sessions are free, and take place from 5 to 8 pm every Tuesday through Sunday at the KidZone tent at Top of the Park.\nWebsite: http://umconceptlab.com", "date": "2016-07-03T17:00:00-04:00", "name": "KidZone: UM Psychology Department", "source": "Facebook", "url": "https://www.facebook.com/events/889616817851399/"}, {"description": "This brother and sister duo from Northern Michigan covers the music spectrum with entrancing harmonies and ingenious musical arrangements. Live looping of beatboxing, bass, gorgeous vocals, rain stick, and didgeridoo fill out Penny and Rodal Rosins’ unique sound and comes alive with their great chemistry. This is a truly original acoustic duo making their debut in The Grove in support of Oh Brother Big Sister's first album Keeps on Raining.\nWebsite: http://www.ohbrotherbigsister.com/", "date": "2016-07-03T17:00:00-04:00", "name": "Oh Brother Big Sister", "source": "Facebook", "url": "https://www.facebook.com/events/1009397652430391/"}, {"description": "Detroit’s The Whiskey Charmers is the Americana roots, alt-country duo of Carrie Shepard and Lawrence Daversa. Their haunting melodies and twangy guitar duets tell stories of love, heartbreak, the open road, and of course, whiskey. Formed in 2013, they’ve been steadily perfecting a poetic sound that’s like “riding through the Mojave Desert in a convertible with the top down”—a sound that takes a cue, no doubt, from Neko Case and Johnny Cash among others.\nWebsite: https://thewhiskeycharmers.com/", "date": "2016-07-03T18:00:00-04:00", "name": "The Whiskey Charmers", "source": "Facebook", "url": "https://www.facebook.com/events/615065368669640/"}, {"description": "Watch the best poets in the region battle gladiator style in a head to head single round elimination poetry competition. \n\nStarting with eight poets, paired off, two poets will rock-paper-scissors to see who goes first. After both have performed their best, the audience will decided who advances. Eight turn to four, four turn to two, and two yield one winner who takes home CASH. \n\nThere are TWO separate tournaments on this same night starting at 7PM sharp (do not be late!): the head to head haiku battle and the head to head slam (three minutes max per poem). Poets pay $5 to enter the haiku battle and $10 to enter the slam and may enter both if they choose. Half of the entrance will go to support the fundraising efforts of the Ann Arbor Poetry Slam Team going to Nationals in only five weeks! The remaining half goes directly to the winner. \n\nIf up to sixteen poets wish to enter the tournaments, the cash prize will be larger and the tournament will expand to fit. Tell friends! Bring poems. Let's have an awesome night and help the team!", "date": "2016-07-03T18:30:00-04:00", "name": "Ann Arbor Head to Head Cash Prize Poetry Slam & Haiku Battle", "source": "Facebook", "url": "https://www.facebook.com/events/289495518064230/"}, {"description": "Nashville's Whit Hill returns to her Ann Arbor roots and joins her Detroit-based alt-country band The Postcards for a set of story songs and ballads blending twangy country, organ-laced soul, and southern rock reminiscent of Lucinda Williams and Nanci Griffith. Come on down and welcome her back to Top of the Park!\nWebsite: http://whithill.com/", "date": "2016-07-03T19:00:00-04:00", "name": "Whit Hill and The Postcards", "source": "Facebook", "url": "https://www.facebook.com/events/738624219610498/"}, {"description": "In what has become an annual tradition, George Bedard and the Kingpins will close Top of the Park and the Ann Arbor Summer Festival season with their crowd-pleasing, swinging rockabilly and blues. George Bedard has been a key figure on the Michigan roots-rock scene for decades and is a guitar hero’s guitar hero. His energetic guitar playing and gutsy vocals keep him on the short list of the area's most popular performers and he’s been called “a national treasure” by Michael Erlewine, founder of the All-Music Guide. Gather together family, friends, and neighbors and say \"so long\" to another great season at Top of the Park.\nWebsite:  http://www.georgebedard.com", "date": "2016-07-03T20:15:00-04:00", "name": "George Bedard and The Kingpins", "source": "Facebook", "url": "https://www.facebook.com/events/1734135423501478/"}, {"description": "So Long Sunday wraps with an American classic—\nGet pretty, oh so pretty!—and arrive to So Long Sunday dressed as your favorite character from this beloved Leonard Bernstein and Stephen Sondheim musical. When Puerto Rican Maria falls for tough guy Tony in this modern day Romeo and Juliet, their families’ New York City gangs, the Jets and the Sharks, begin a deadly feud. A rumble under the highway unfolds as the young Maria and Tony fall in love despite racial tensions. Practice your snaps and your Jerome Robbins moves, and sing along to America, I Feel Pretty, Officer Krupke, and Somewhere, as the final sun sets on another fantastic season of the best thing about summer in Ann Arbor.\n*Shown with Closed Captioning for hearing impaired *", "date": "2016-07-03T22:00:00-04:00", "name": "West Side Story", "source": "Facebook", "url": "https://www.facebook.com/events/1692642821000404/"}]