[{"source": "Facebook", "url": "https://www.facebook.com/events/166444617096965/", "description": "You are invited to a reception in support of\nGretchen Driskell (MI-07) and Suzanna Shkreli (MI-08)\n\nTuesday, August 23rd, 2016 12:30pm - 2:00 pm\n\nAt Arbor Brewing Company\n114 E. Washington St. \nAnn Arbor, MI 48104\n\nSuggested Contribution Levels:\n$50 Friend\n$100 Guest\n$250 Supporter\n$500 Sponsor\n$1,000 Champion\n\nJoin us for refreshments, conversation, and an update from the campaign trail with Congresswoman Debbie Dingell, Congresswoman Cheri Bustos, and Congresswoman Lois Frankel.\n\nRSVP to Hattie McKinney at 734-707-7150 or gretchen@votegretchen.com or Arianna Kendall at 202-688.8372 or arianna@suzannaforcongress.com or Philip Stein at 202-741-1363 or Stein@dccc.org\nOR online at https://secure.actblue.com/contribute/page/driskellshkreli2016\n\nDonors may choose how much and to whom to contribute.\nChecks will be collected, treated, and reported as conduit contributions by the DCCC.\n\nPlease make checks payable to each campaign. Committee Names are also listed in the disclaimer box.\nPlease mail your check along with this form to: DCCC c/o Philip Stein\n430 South Capitol Street SE, 2nd Floor Washington, DC 20003", "date": "2016-08-23T12:30:00-04:00", "name": "Women LEAD Luncheon with Rep Dingell, Rep Bustos, and Rep Frankel"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1570731196567699/", "description": "Please join us for a special, invitation-only \"Dinner With Circus Sensation David Dimitri\", a benefit for the Ann Arbor Summer Festival. \n\nJoin festival director Amy Nesbitt and select festival donors for a dinner supporting the week-long residency of world-renowned circus performer and high-wire walker David Dimitri.\n\nDavid will be performing his magical \"One Man Circus\" August 24th - 28th in Burns Park. This is a unique opportunity to get to know David personally, hear wonderful stories of his 20+ years of performances worldwide and enjoy charming anecdotes of a globally respected artist before Opening Night.\n\nTickets are Available Now:\n$100  Dinner Only\n$150  Dinner + 1 Ticket to Opening Night performance of One Man Circus on 8/24\n\nFestivities will kick off in the Private Room at Mezzevino on Liberty and 4th Street.\n\n6:15 pm - Join us for socializing over delicious appetizers such as the Mediterranean hummus platter with crisp vegetables and marinated olives, and creative flatbreads. Enjoy a glass of wine, beer, soda, iced tea, or coffee.\n\n6:45 pm - Dinner will include Mezzevino's famed Greek Salad, Braised Beef Tips, and Vegetarian Pasta Primavera.\n\nMany thanks to Ellie Serras and the staff at Mezzevino for their generous assistance with this event. Ticket buyers will receive an acknowledgement letter from the festival detailing the charitable portion of their purchase for tax purposes.\n\nWe look forward to seeing you!\n\nHeather Steenrod\nDonor and Corporate Partnerships Manager\nAnn Arbor Summer Festival\nSteenrod@a2sf.org", "date": "2016-08-23T18:15:00-04:00", "name": "Dinner With Circus Sensation David Dimitri"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1568827103422152/", "description": "Drink and Draw is back just in time for the dog days of summer! This one is for all of you bar-napkin savants, you web-comic-ers, you dabblers, dawdlers and you doodlers alike. An event to unite Ann Arbor artists of all calibers, for drinking, drawing and over-all merriment (and not necessarily in that order). We invite you to join us on August 23rd at Bill's Beer Garden for a night of great company, conversation and collaboration.\n\nSpots are limited so get in touch with us today! To reserve your space, message us on Facebook, shoot us an email, or drop us a line!", "date": "2016-08-23T18:30:00-04:00", "name": "Drink & Draw"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1799556966926824/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nZak Shaffer has an “infectious live performance that can’t be beat”! He is an incredibly talented\nrising star who’s blending of rock, blues, pop, bluegrass & country creates catchy & original sounds on\nthe guitar. He is a soulful vocalist who can growl better than any rocker & can croon with the best in\ncountry music.\nhttp://zakshaffer.com/\n\nNew a cover\nAlways a good time", "date": "2016-08-23T19:00:00-04:00", "name": "Acoustic Tuesdays: Zak Shaffer"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1782620465354744/", "description": "Octopede is on tour from Minneapolis, MN, so we bookended them with Scissor NOW! and Junglefowl. It's an early show so you can still make work on Wednesday or hit the bar after, whatever gets it done for ya!\n\nSCISSOR NOW! \nhttp://scissornow.bandcamp.com\n\nOCTOPEDE \nhttps://octopede.bandcamp.com/\n\nJUNGLEFOWL\nhttps://junglefowl.bandcamp.com/", "date": "2016-08-23T19:00:00-04:00", "name": "Scissor NOW!, Octopede and Junglefowl"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1786654968259362/", "description": "Our adult Jazz band plays a concert of tunes by Horace Silver, Pat Metheny, Thad Jones and more.\n\nTim Kalvaitis trumpet \nArt Solomon trumpet \nJamie Riddell sax\nJohn Dooley drums\nAlon Kahana guitar \nPaul Finkbeiner bass\n\nIt's gonna be fun and free!", "date": "2016-08-23T19:00:00-04:00", "name": "Fun concert!!!"}, {"source": "Facebook", "url": "https://www.facebook.com/events/170729440003602/", "description": "August 9–October 30, 2016\nCorridor Gallery\n\nArtist and poet Ann Holmes first encountered Japanese folk ceramics while living in Tokyo in the late 1960s. Fascinated by the simple aesthetic, the craftsmanship, and the makers’ unassuming personalities and ways of life, Holmes visited many kiln towns to photograph and interview the artists and collect ceramic wares of various shapes and techniques. She donated a significant portion of her collection to UMMA in 2013.\n\nRichly introduced in this presentation are works by ceramic artists emerging in the late 1960s and the early 1970s in the town of Mashiko, two hours north of Tokyo by train. Mashiko became an international mecca of folk ceramics after Hamada Shōji (1894–1978), a major figure of Japan’s Folk Craft (Mingei) Movement, set up his studio there in 1930. Hamada’s idea of ceramic making for a new age, which combined the aesthetic of folk ceramics and the modern concept of the studio artist, attracted many younger artists of unconventional backgrounds, including women.", "date": "2016-08-24T11:00:00-04:00", "name": "In Focus: Modern Japanese Folk Ceramics"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1061706877198813/", "description": "Our August Artists’ Meet & Greet topic is “Life Between the Right and Left Brain”, involving an extensive talk by electrical engineer, lawyer, writer and artist John Posa about his artistic influences, productivity, and legal (primarily copyright) issues. Join us for this free event, connect with other artists, and the Art Center staff.\n\nSpeaker: John Posa (awarded 3rd place for his piece “Untitled”, in our current exhibition Real American)\n\nOur monthly Artists' Meet & Greets held at the 117 Gallery are a perfect opportunity to connect with the Art Center, network with other artists, and attend artist talks by guest speakers.\n\nLearn more about our Artist Meet & Greet Events:\nhttp://www.annarborartcenter.org/artists-meet-greet/", "date": "2016-08-24T18:00:00-04:00", "name": "Life Between the Right and Left Brain"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1060068290701625/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by The New York Times, this world famous high-wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high-wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with a grand flourish, be awestruck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets should be purchased in advance, if any tickets remain, they will be sold at the tent 30 minutes prior the show. The tent is wheelchair accessible with advance notice and tent capacity is limited. For everyone's comfort and safety, please note that the tent has a cooling feature that is used if it is a particularly hot day. Performance parking is available at the Burns Park Elementary lot for a $5 donation to the PTO.\n\n$20 Kids & $30 Adult - General Admission\nParking at the Burns Park Elementary School\n\nSponsored by: Toyota USA\nPresented in part with support from: National Endowment for the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nAugust 24 @ 6:30 pm, Burns Park \nAugust 25 @ 6:30 pm, Burns Park\nAugust 26 @ 6:30 pm, Burns Park \nAugust 27 @ 6:30 pm, Burns Park \nAugust 28 @ 6:30 pm, Burns Park\n\nWatch the videos:\nThe Show: https://youtu.be/TB0Oyl1gSNk\n\nHighwire Stunts: https://www.youtube.com/watch?v=rqCzjvM3_Sc\n\nOn a Treadmill: https://www.youtube.com/watch?v=oxrqksjrMf0", "date": "2016-08-24T18:30:00-04:00", "name": "One-Man Circus (L’homme Cirque)"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1243397985680001/", "description": "Join the Potawatomi Mountain Biking Association at Mt Brighton on Wednesday, August 24th as we present a special screening of ”Ride the Divide”, a feature about the world’s toughest mountain bike race. Movie tickets are $10 and all proceeds benefit the ongoing development of the DTE Energy Foundation Trail in Chelsea, Michigan.\n  \nAt 7:00pm, southeast Michigan’s own Jesse Ramsey will discuss his recent experience in the Tour Divide. Jesse began the trek across the continental divide on June 10th and rode over 2700 miles from Banff, Alberta, Canada to the Mexican border finishing at Antelope Wells, NM. It took him 23 days and 13 hours to complete the 2016 Tour Divide. Jesse is a ”super rad and handsome dude, that likes free pizza”, and his mental and physical strength and perseverance is truly remarkable.\n  \nThe movie, ”Ride the Divide”, will begin after Jesse’s presentation, and he will return after the movie for a brief Q&A session.", "date": "2016-08-24T19:00:00-04:00", "name": "Ride the Divide Movie Screening"}]