[{"source": "Facebook", "url": "https://www.facebook.com/events/1072541709503863/", "name": "Wire in the Wood}:{Brian Tucker}:{The Holy Bungs at A2 Float Fest 2016", "date": "2016-07-16T16:30:00-04:00", "description": "The City Beautification Bureau is proud to present The Floating Concert at A2 Float Fest 2016!!  \n\nDon't forget to bring your swim suit and a tube for front row seating. \n\nThis is an all ages, family friendly event. We will have some outdoor games set up for adults and kids and we will be awarding trophies and prizes to our raft race competitors starting at 4:15pm (Raft Race starts @ 2:30 https://www.facebook.com/events/1115468568491647/).\n\n**Please make sure trash and recyclables are disposed of in their proper places, be discreet if you roll with adult beverages and have fun!**\n\n._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.\n\nWire in the Wood :-: A Bluegrass band based in Ann Arbor MI which includes an upright bass.\n- https://www.reverbnation.com/wireinthewood\n\nBrian Tucker :-: A solo acoustic-rock act featuring our very own Brian Tucker who is very familar with our floating stage\n\nThe Holy Bungs :-: Two band members from Liars & Theives to perform beautiful classical-like peices on the river\n-https://soundcloud.com/theholybungs/charleston\n\n._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.\n\nThe music starts @ 4:30! Be on time for maximum amounts of fun!"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1105994456142704/", "name": "Float Fest 2016 un-OFFICIAL Afterparty w/ Dylan Beckwith \\\\ Harison Zamperla \\\\ Jim Cherewick \\\\ Battery Acid + surprise DJ dance party", "date": "2016-07-16T20:00:00-04:00", "description": "After your sun soaked day of floats and sounds, saunter over to club above and continue the endless summer vibes...\n\ndylan beckwith\nharison zamperla\njim cherewick\nbattery acid\nmichael\n+ surprise DJ dance party following live performances\n\ndoors @ 8pm | $3 to $5 suggested donation | 1/3 proceeds go toward Float Fest fund\n\n215 N Main Street\nDowntown Ann Arbor \nabove the Heidelberg Restaurant"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1764853027133548/", "name": "Pointless Improv with Listen, Stupid and Tony Hawk", "date": "2016-07-16T22:00:00-04:00", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Listen, Stupid\" \n\nGroup 2: \"Tony Hawk\"\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Chris Moody, Mitch Socia, Moni Jones, and Jason Valentini"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1750717858547509/", "name": "Storytime at the Museum", "date": "2016-07-16T23:15:00-04:00", "description": "Children ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. The story on July 16 will highlight the South Asian art in The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink. Meet in front of the UMMA Store.\nStorytime is generously supported by the University of Michigan Credit Union, UMMA's Lead Sponsor for Student and Family Engagement.\n\nLead support for this exhibition is provided by the University of Michigan Office of the Provost. Additional generous support is provided by the University of Michigan Center for South Asian Studies."}, {"source": "Facebook", "url": "https://www.facebook.com/events/1636134010034365/", "name": "Poto Trail Day", "date": "2016-07-17T09:30:00-04:00", "description": "Poto Trail Day \nSun., 7-17-2016\n9:30 AM- 2 PM\n\nWe will be installing check dams/water bars at severely eroded spots on the down hill section of Boy Scout Hill. Hopefully averting a reroute of that section in the future.  Meet at Sliver Lake parking lot as our parking will be limited at the work site.\n\nBring:\n\nWATER\nGood pair of work gloves and boots.\nBug spray \nSnack\n\nPlease let us know if you plan to atten so that we have enough tools to go around.\n\nNOTE:  Parking is PROHIBITED on the private gravel roads by the Boy Scout Hill work site."}, {"source": "Facebook", "url": "https://www.facebook.com/events/635642046590268/", "name": "Aura Cacia Essential Oils 50% Off", "date": "2016-07-17T11:00:00-04:00", "description": "Aura Cacia Aromatherapy essential oils are 50% off through Thursday! Used for everything from making you smell good to massages, from soothing ailments to creating a soothing environment, essential oils have benefits big and small."}, {"source": "Facebook", "url": "https://www.facebook.com/events/1059551254140563/", "name": "Pokémon Go! Pokéstop Meetup", "date": "2016-07-17T13:00:00-04:00", "description": "Pokémon Trainers Actually Needed:\nVault of Midnight is completely overrun with Pokémon. This sounds like it would be cute and funny, but it's serious. Have you ever found a Snorlax napping in your bathroom? It is not cool, it is very invasive. \n\nThus, we would like to offer a 10% discount to any trainers who come visit our shop on Sunday, July 17th from 1:00-3:00p. So we know that you are the real deal (and not a member of Team Rocket) please wear a shirt that corresponds with your Poké team. Represent Team Instinct (yellow), Mystic (blue), or Valor (red) and come mingle with your fellow trainers. See that picture above? Just like those dudes.\n\nAnd if you happen to be around at 2:00p, we'll be taking a big picture of every trainer we can find, both for the memories and also to display openly as a warning to these horrible monsters."}, {"source": "Facebook", "url": "https://www.facebook.com/events/1739702829612808/", "name": "Guided Tour - Manuel Bravo: Mexico's Poet of Light", "date": "2016-07-17T14:00:00-04:00", "description": "Manuel Álvarez Bravo spent nearly his entire career photographing his native Mexico. His style drew upon numerous international influences including, among others, Modernism and Surrealism. Although not strictly Surrealist, many of Álvarez Bravo’s works manifest a similarly fantastical mood. One of the artist’s most arresting qualities is his ability to imbue scenes of everyday life with an otherworldly, metaphysical power. The photographs in the exhibition, from UMMA’s collections, show the artist using motifs drawn from Mexican religious and indigenous works as well as plant forms, in a Modernist approach to image making. UMMA docents will discuss these motifs and the artist’s use of light as a metaphor and revealer of life, animating even the emptiest and most silent of Álvarez Bravo’s scenes."}, {"source": "Facebook", "url": "https://www.facebook.com/events/552831098257555/", "name": "Meet Me at UMMA: Museum Arts Experience for Persons with Mild Memory Loss", "date": "2016-07-17T15:00:00-04:00", "description": "To register for this program, email mdeland@alz.org or call the local Alzheimer’s Association at 800.272.3900 at any time. For more information, please contact UMMA at 734.647.0522 during normal business hours.\n\nMeet Me at UMMA invites people with mild memory loss to enjoy a guided gallery experience along with family members or care partners. This program is designed for people who live at home and their companions.\n\nIf you or someone you care about is experiencing mild memory loss, research has shown that the visual and expressive arts can be good for your mind. In addition, great enjoyment is to be found in seeking out the sights, sounds, textures, and good feelings that come with looking at, learning, and sharing feelings about paintings, music, and other creative arts.\n\nUMMA's trained docents will accompany small groups for a guided tour and provide the opportunity for everyone to experience different kinds of art and share their responses.\nUpcoming Meet Me Sessions: Sunday, October 16.\n\nMeet Me at UMMA is generously supported by the Monroe-Brown Foundation Discretionary Fund for Outreach to the State of Michigan and individual donors."}, {"source": "Facebook", "url": "https://www.facebook.com/events/302561413412634/", "name": "George DeLancey Quintet at Kerrytown Concert House", "date": "2016-07-17T16:00:00-04:00", "description": "Continuing the CD release tour with an all-star lineup at one of the best venues in the country, Kerrytown Concert House in Ann Arbor. Diego Rivera on saxophone, Randy Napoleon on guitar, Rick Roe on piano, Kayvon Gordon on drums."}]