[{"description": "Girls on the Run of Southeastern Michigan provides a 10 week after-school program for girls in 3rd-5th grade, teaching inspiration through physical, emotional, social and mental development. 10% of our sales on this day will go to support girls in Ann Arbor and Ypsilanti", "date": "2016-09-29T08:00:00-04:00", "name": "Impact Day benefiting Girls on the Run", "source": "Facebook", "url": "https://www.facebook.com/events/671611199664649/"}, {"description": "Our taps will be flowing with our new favorite seasonals, we'll have our made in-house sausages, and we heard a rumor Kevin's going to be in lederhosen. Join us!", "date": "2016-09-29T18:00:00-04:00", "name": "Oktoberfest Tap Takeover", "source": "Facebook", "url": "https://www.facebook.com/events/1004381566339871/"}, {"description": "Are you a young NPR nerd? Do you keep that love a secret...\nLest your friends say \"oh, yeah, my Mom loves NPR?\"\nCome, meet your kind, at the Arbor Brewing Company in Ann Arbor.  \n\nWe'll pre-game Arbor Brewing Company's trivia night with our on-air hosts.\n\nThursday night - September 29th - starting at 7. Five bucks gets you  Michigan Radio Pint glass. And your first beer is on us. Trivia starts at 8!\n\nLearn more on our events page: http://michiganradio.org/community-calendar/event/58145", "date": "2016-09-29T19:00:00-04:00", "name": "Trivia Night Pre-Game", "source": "Facebook", "url": "https://www.facebook.com/events/298029700570409/"}, {"description": "Literati is pleased to welcome photographer Jan Banning in support of Bureaucratics and Law & Order, and in conjunction with an exhibition at the University of Michigan Institute for the Humanities Gallery.\n\nBureaucratics is a project consisting of a book and a traveling exhibition that has so far been shown in museums and galleries in some twenty countries on five continents. The book and the exhibition contain 50 photographs and are the product of an anarchist’s heart, a historian’s mind and an artist’s eye. Bureaucratics is a comparative photographic study of the culture, rituals and symbols of state civil administrations and its servants in eight countries on five continents, selected on the basis of political, historical and cultural considerations: Bolivia, China, France, India, Liberia, Russia, the United States, and Yemen. In each country, Jan visited up to hundreds of offices of members of the executive in different services and at different levels. The visits were unannounced and the accompanying writer, Will Tinnemans, by interviewing kept the employees from tidying up or clearing the office. That way, the photos show what a local citizen would be confronted with when entering.\n\nThe photography has a conceptual, typological approach reminding of August Sander’s ‘Menschen des 20 Jahrhunderts’ (‘People of the Twentieth Century’). Each subject is posed behind his or her desk. The photos all have a square format (fitting the subject), are shot from the same height (that of the client), with the desk – its front or side photographed parallel to the horizontal edges of the frame – serving as a bulwark protecting the representative of rule and regulation against the individual citizen, the warm-blooded exception. They are full of telling details that sometimes reveal the way the state proclaims its power or the bureaucrat’s rank and function, sometimes of a more private character and are accompanied by information such as name, age, function and salary. Though there is a high degree of humour and absurdity in these photos, they also show compassion with the inhabitants of the state’s paper labyrinth.\n\nThe project Bureaucratics has been made possible with financial support from the Foundation for Democracy and Media, Stichting Fonds Anna Cornelis, NCDO and SBKU Utrecht (Committee for the Promotion of Visual Arts).\n\n*\n\nLaw & Order is a photo project that compares the criminal justice system in four different countries on four continents: Colombia (South-America), France (Europe), Uganda (Africa) and the United States (North-America). It combines an artistic view with a documentary approach and sheds light on the key institutions within the criminal justice system: the police, the courts and prisons. Thanks to the avoidance of visual clichés – hands gripping prison bars, humbly bowed, seated prisoners and the like – that do little other than confirm the existing image, it can contribute to the international debate on criminal law. It raises questions such as: how do we deal with criminals? What is the relationship between punishment and crime? Is confinement, besides being an instrument of punishment, also effective as a means of correction?\n\nThe choice of the four countries was made in consultation with the Max Planck Institute for Foreign and International Criminal Law (MPI) in Freiburg, Germany, a scientific institute respected worldwide. Criteria were – besides being able to gain access – the diversity of legal systems (civil law and common law), the murder rate and a division between developed and developing countries.\n\nThe police and the judiciary come up frequently in the public debate and are a favorite subject for populist politics. There is rarely sympathy for criminals and politicians’ arguments for harsher penalties “because this cannot continue” find a receptive ear with large parts of the population in many countries. However, statistics show that developments in the field of serious crime are not necessarily unfavorable: murder and violent crimes in large parts of Europe are declining steadily over the past decade or two – and even longer in the US.\n\nLaw & Order is presented in the form of a book and an international traveling exhibition. In addition to the photographs, both contain relevant information and infographics (source: Max Planck Institute); the book also contains an introduction by Dutchman Michiel Scholtes about his experiences as a convict in a French prison.\n\n*\n\nJan Banning is a Dutch autonomous artist/photographer, based in Utrecht, the Netherlands. He was born in Almelo (Netherlands) on May 4, 1954, from Dutch East Indies parents, and he studied social and economic history at the Radbout University of Nijmegen. Banning’s art work has been acquired by museums such as the High Museum of Art, Atlanta, GA; the Museum of Fine Arts, Houston, TX; and the Rijksmuseum, Amsterdam. His photo series have been published in print media such as Days Japan, GEO (France, Germany, and International), l’Espresso, Newsweek (US and Japan), One World, Sunday Times Magazine, The New Yorker, The Guardian Weekend, Time, Vrij Nederland and many others.", "date": "2016-09-29T19:00:00-04:00", "name": "Jan Banning", "source": "Facebook", "url": "https://www.facebook.com/events/117748215350733/"}, {"description": "This Thursday #CandyFam is going to break bread together. And because family looks out for each other, we're going to donate $1 of each guest's cover to the Jim Toy Community Center, providing assistance and services to the local LGBT community\n\nDoors will open at 9:30p, and from then til midnight we'll be setting out a delicious pizza feast, so come early if you want to get it while it's hot!\n\nPlease RSVP if you plan on coming early, so we can get the right amount of food. And come early, it tends to go fast! Spread the word and see you soon, fam. :)\n\n** Doors at 9:30p\n** Just $1 donation for JTCC before 11p\n** $3 21+, $5 18-21 after 11p, and a dollar of each cover will go to JTCC too!\n\n\n** Hosted by Floyd Dellataro\n** Beats by DJ Selina Style", "date": "2016-09-29T21:30:00-04:00", "name": "Candy Bar: Family Dinner!", "source": "Facebook", "url": "https://www.facebook.com/events/195827377512711/"}, {"description": "Necto Nightclub and Southpaw Events proudly present...\n\nCHRISTIAN MARTIN (Dirtybird)\n\nWho is Christian Martin? \nSince 1995, Christian Martin has been exploring electronic music from one end of the earth to the other; from full-moon parties in the deserts of California to the thumping, dark corners of the London club scene. Christian followed his love for spleen-rattling bass to San Francisco in 2000, where he met up with the now legendary Dirtybird crew. The dirtybird BBQ was the brainchild of the four original members – Christian & his brother Justin Martin, and friends Claude VonStroke and Worthy. They had a personal mission to change the landscape of San Francisco house music by throwing an epic free party in the park, based on their new signature sound.\nIn 2003, with nothing to lose and everything to gain, Christian bought a massive yet necessary sound system on his credit card. This set the standard for a new era of die-hard dedicated DIY producers, all with productions based on heavy bass-lines, smiling faces and dance floor delights.\nIn 2006, Christian began releasing a steady stream of tracks, first collaborating with Justin under the “Martin Brothers” alias, as well as Claude VonStroke. The Martin Brothers partnership has produced such hip-hop influenced hits as ‘Duckface’, ‘Stoopit’, & ‘Dum’, as well as remixes for Ed Banger and Fool's Gold. On his own, he's released his own brand of bassy house music on labels such as dirtybird, Trapez, and Anabatic. His low end take on tech house has led to remixes for musical heavyweights such as Chromeo, Underworld, L-Vis 1990, and many more.\nChristian's devotion to large scale bass has allowed him to champion the dirtybird sound out of the park and onto giant soundsystems at clubs and festivals worldwide. From Fusion (Germany) to Shambhala (Canada), to Coachella & Symbiosis (US), there's a constant demand for what he describes as “bass from the ground up.” In San Francisco, Christian is a resident at dirtybird's raucous quarterly party at Mezzanine; and also at Monarch, the newly opened marvel of a club. His new musical alias Leroy Peppers has recently roared to life, offering an even heavier take on hip-hop influenced bass music. Whether it be Leroy or Christian behind the decks, if your hands aren't clapping your ass surely will be. \n\nOpening sets by:\nTwin Cousin\nAdam Westing\n\nAdvance tickets: $10\n4 pack advance tickets: $20\n\nhttps://soundcloud.com/christianmartin\nhttp://dirtybird.wikia.com/wiki/Christian_Martin\nhttps://twitter.com/sfdirtybird\nhttps://www.facebook.com/christianmartinmusic/?fref=ts\nhttps://www.youtube.com/user/dirtybirdrecords", "date": "2016-09-29T22:00:00-04:00", "name": "Christian Martin at Necto", "source": "Facebook", "url": "https://www.facebook.com/events/604867786353472/"}, {"description": "It's happening again! On Friday, September 30th, we're marking Cucuribita Smiles release day by pouring it out of pumpkins with special fruit and spice additions! We'll release more details as we get closer to the event.", "date": "2016-09-30T16:00:00-04:00", "name": "Cucurbita Smiles Pumpkin Pour", "source": "Facebook", "url": "https://www.facebook.com/events/1700416470279803/"}, {"description": "Bird Walk \nFriday, September 30 \nArgo Nature Area \n5:30 to 7:30 p.m.\nJoin City Ornithologist Juliet Berger for a walk through Argo Nature Area and the Argo Cascades in search of southward migrating songbirds and waterfowl! We’ll also observe many birds that stay the winter in the Argo area, and we’ll see the beginnings of autumn color in the trees and shrubs. Meet in the parking area closest to the dam. Bring binoculars if you have them, but they are not necessary. Be prepared for uneven terrain, mosquitoes and rainy or muddy conditions. Free.", "date": "2016-09-30T17:30:00-04:00", "name": "Bird Walk- Argo Nature Area", "source": "Facebook", "url": "https://www.facebook.com/events/1558232137817484/"}, {"description": "You asked for it- Trivia Night is now a regular thing! Every other Friday, our Trivia Master Kevin will be hosting this super fun event, and the winner will receive a $25 gift card. Our taps will be flowing with great beer as always, just $2 a pint. Come see if you really are a know it all!", "date": "2016-09-30T18:00:00-04:00", "name": "Trivia Night", "source": "Facebook", "url": "https://www.facebook.com/events/289096731461751/"}, {"description": "Literati is pleased to welcome poets Raymond McDaniel, Christina Quintana, Sarah Sala, and Keith Taylor for the latest installment of our Poetry at Literati reading series. \n\nRaymond McDaniel is the author of Murder, Saltwater Empire, Special Powers & Abilities, and in 2017 The Cataracts, all from Coffee House Press.\n\nChristina Quintana is a New York-based writer of plays, poetry, and fiction with Cuban and Louisiana roots. Her work has been published or is forthcoming in Raspa Magazine, Saw Palm, and Nimrod International Journal, and her chapbook of poems, The Heart Wants, has been released by Finishing Line Press.\n\nSarah Sala is the former editor-in-chief of the University of Michigan’s literary magazine, Oleander Review. Her poem \"Hydrogen\" was recently featured in the \"Elements\" episode of NPR's hit show Radio Lab in collaboration with Emotive Fruition. The Ghost Assembly Line, a chapbook of her selected poetry, has been published by Finishing Line Press. Her poems appear in Poetry Ireland Review, Atlas Review, and the Stockholm Review of Literature. \n\nKeith Taylor's most recent books are Fidelities and The Ancient Murrelet (published by Alice Greene & Co.), Marginalia for a Natural History (published by Black Lawrence Press), and Ghost Writers: Us Haunting Them, co-edited with Laura Kasischke (published by Wayne State University Press).", "date": "2016-09-30T19:00:00-04:00", "name": "Raymond McDaniel, Sarah Sala, Christina Quintana, Keith Taylor", "source": "Facebook", "url": "https://www.facebook.com/events/298731297167159/"}]