[{"source": "Facebook", "url": "https://www.facebook.com/events/531425863725580/", "description": "Did you know that babo now offers craft cocktails along with craft beer and various varietals of wine?\n\nEvery Monday through Friday we will be offering 20% off our signature cocktails, draft beers, and wine by the glass for Happy Hour.\n\nSo take this time to Treat yo' self!", "name": "Happy Hour at babo", "date": "2016-06-06T15:01:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1418542981807093/", "description": "This is the 5th installment of Intellect Records annual fest! \nHere's the schedule:\n\nFriday June 3rd  Lampshade  206 W Michigan Ave\n4:30 The Vagrant Symphony\n5:15 Doctor Pizza\n6:00 J. Washburn Gardner  \n7:30 Mental Health Day \n8:15 Joanna Ransdell\n\nThe Tap Room    201 W Michigan Ave\n9:00  Mercury Salad Sandwich\n9:45  The Parsnips\n10:30  Las Drogas \n11:15  Gruesome Twosome \n12:00  Old Man\n\nSaturday June 4th  Frog Island Park      699 Rice St  \nAcoustic Open Mic  2:20-4:00       \n\nGood Vibes Glass   15 E Cross St. \n4:15 Kurmudgeon\n5:00  Ada Z \n5:45 Russell Davis\n6:30 Ypsi's Stimulators of Mutiny\n\nCanada House      310 Olive\n8:00  Nina & The Buffalo Riders\n8:45 Modern Lady Fitness \n9:30  Dangerous Pleasure Detroit\n10:15  BaTTery Acid\n11:00  Mellified Man\n\nSunday June 5th Bandemer Park  1352 Lakeshore Dr. \nDisc Golf 4:00- 6:00\nDock Concert/ Swim Fun!\n6:00 Jobin\n6:45  Flycatcher\n7:30 Science for Sociopaths\n  \nClub Above    215 N Main St. \nOpen Mic 8:30-10:30\n10:30 The Cool Birds \n11:15 The Pineapple Army\n12:00  Grizzly Season\n\nMonday June 6th  Prospect Park DIY Skate Park  \n4:30 BSRB\n5:30 Modus Operandi\n\nArbor Brewing Company Microbrewery  720 Norris St. \n7:30  Shelley Catalan\n8:15  Nina Sofia\n9:00  Fangs and Twang\n9:45 Once United\n10:30 The Butts\n\nTuesday June 7th  Lampshade  206 W. Michigan Ave\n6:00 Antonia Moses\n6:45 Dede Alder \n7:30  Stray Talk\n8:15  March of the Ant\n9:00   Abe Maybe\n\nCrossroads  517 W Cross St. \n10:00 Nathanael Paul Romero\n10:45 Barelyon\n11:30 Cig Butts \n12:15 As a Lark\n\nWednesday June 8th  Cultivate  307 N River St. \n2:30  Laura Taylor\n3:15  Rustbelt Angels\n4:00 Lefty Leadfoot\n4:45  Black Sqirl \n\n5:30 Sidetracks Happy Hour!  56 E Cross St. \n\nThursday June 9th Fuller Pool  1519 Fuller Rd. \nSwimming fun! 2:00-5:00\n\nIsland Park  1450 Island Dr. \nOpen Mic/ Bocce Ball/ BBQ  5:00-8:00\n\n8:15 Fuzz Fest 3 at the Blind Pig   https://www.facebook.com/events/557595637741480/\n\nFriday June 10th (33rd Birthday Celebration!) \nDisc Golf  2:00-4:00  Mary Beth Doyle Park\nBirthday BBQ! 4:00-5:00 Clinton Park \nAcoustic Open Mic 5:00-8:00  West Park  215 Chapin St.\n8:30 Ann Arbor Summer Fest with Hullabaloo http://a2sf.org/category/top-of-the-park/\nBirthday Bar Crawl! \n\nSaturday June 11th  The Farmhouse  6580 Park Rd. \nOpen Mic/ Open Stage 4:15-7:45\n\nThe Fire Stage \n7:45 Strchld \n10:00 Antarctique\n12:15 East of Awake\nThe Barn Stage \n9:15 Liars and Thieves  \n10:45 Corridors \n1:00  Bandana Brothers \nThe Jungle Room \n8:30  Slim Pickins \n11:30 Doogatron\n1:45 Fa La Las (Allah Las tribute)\n\nSunday June 12th \nDisc Golf Tourney & BBQ  12:00- 5:00\n\nThe Fire Stage \n4:30 Mike Gentry  \n7:30 Unicorn\n11:15 io Megaji\nThe Barn Stage \n5:15 No Conflict\n6:45 Haunted Head\n9:00  Cyrano Jones\n10:30 The Messenger Birds\nThe Jungle Room \n6:00 Poor Player\n8:15 Moving Fast in Slow Motion \n9:45  Inkflo Trio\n12:00  Vision Explored", "name": "Ypsiarboroo 2016", "date": "2016-06-06T16:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/634061576742858/", "description": "Tom Stanton is author of several nonfiction books, among them the critically acclaimed Tiger Stadium memoir \"The Final Season\" and the Quill Award finalist \"Ty and The Babe.\" A journalist for more than thirty years, he co-founded The Voice Newspapers in suburban Detroit and served as editor for 16 years, winning numerous press awards, including a Knight-Wallace Fellowship at the University of Michigan.\n \nStanton is an associate professor of journalism at the University of Detroit Mercy and a longtime member of the Detroit board of the Society of Professional Journalists. He also edited The Detroit Tigers Reader and is a past recipient of the Michigan Library Association's Author of the Year award.\n \nHe lives in New Baltimore, Michigan, with his wife, Beth, and their four feral cats.\n\n\"Terror in the City of Champions: Murder, Baseball, and the Secret Society That Shocked Depression-Era Detroit' - \n\nIn the mid-1930s, Detroit reigned as the City of Champions. Within a six-month span, the Tigers, Lions, and Red Wings won a World Series, NFL title, and Stanley Cup -- a major-sports trifecta achieved by no other American city before or since -- and it happened as undefeated local boxer Joe Louis was becoming a national sensation. As the successes mounted, the national media made heroes of the city's sports stars, and Detroit grew almost delirious, the string of victories providing a sweet diversion from the Great Depression. \n \nBut beneath the jubilance, a nefarious plague was spreading unchecked. A wave of mysterious crimes had police baffled: bodies dumped along roadsides, suspicious suicides, bombings of homes and halls, flogging victims who refused to speak, assassination plots. All were the work of the Black Legion, a secret terrorist organization that flourished in Detroit until the summer of 1936, when one murder (and the loose lips of a gunman) led to its unraveling.", "name": "Meet Michigan Author & Award Winning Journalist Tom Stanton for a Discussion of 'Terror in the City of Champions'", "date": "2016-06-06T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/254551728239861/", "description": "amateureyes.bandcamp.com\ngr8xpect8ns.bandcamp.com\ncomplainer.bandcamp.com\nhttps://m.facebook.com/naturesgarbage/\n\n$5 cover", "name": "amateur eyes, Complainer, Natures Garbage, and Great Expectations at the Cl", "date": "2016-06-06T23:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/831264297006986/", "description": "Join us for a brew and a book signing with local author, Stephen Johnson, and his new title from Arcadia Publishing & The History Press, Detroit Beer! Have a beer, grab a book, and chat with Steve on June 7th from 6-8pm.\n\nStephen Johnson is the owner and founder of Motor City Brew Tours, a tour company that provides guided tours to Michigan breweries. He is also an adjunct professor of marketing at Macomb Community College and has worked in both sales and marketing for over twenty years. Stephen earned a bachelor’s in business from Western Michigan University and a master’s of business administration from Walsh College of Business. A Michigan native, Stephen loves to share his knowledge and history of Detroit beer scene", "name": "Book Signing: Detroit Beer by Stephen C Johnson", "date": "2016-06-07T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1596196837358933/", "description": "This event is completely and totally full! If you would like to be added to a waitlist in case any spots open up, please contact Vault of Midnight with your name, phone number and email address, and we will add you to the queue. And stay tuned, we may be having another Drink & Draw very soon!\n\nDrink and Draw is coming to Ann Arbor this June. This one is for all of you bar-napkin savants, you web-comic-ers, you dabblers, dawdlers and you doodlers alike. Finally, an event to unite Ann Arbor artists of all calibers, for drinking, drawing and over-all merriment (and not necessarily in that order). We invite you to join us for a night of great company, conversation and collaboration.\n\nThis is a limited space event, so get in touch with us to reserve your space today!", "name": "Drink & Draw [At Capacity]", "date": "2016-06-07T18:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1606436323007032/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n- June 7 James Cornelison \n\nChicago Native James Cornelison has been working as a multi-instrumentalist in Michigan for 5 years. He has played locally with Theo Katzman, the Macpodz, Tree City, Madelyn Grant, Antwaun Stanley, Anna Ash, Heather Black Project, MC Kadence and Chis Good in addition to a number of jazz groups across Detroit and Ann Arbor.  James grew up playing and singing in the Chicago blues scene and currently works as a producer for Michigan based artists.  James is increasingly stepping out from working behind the scenes and as a sideman to pursue his own projects\n\nNever a cover\nAlways a good time", "name": "Acoustic Tuesdays: James Cornelison", "date": "2016-06-07T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1141498692561970/", "description": "Literati is thrilled to host the launch of Julie Lawson Timmer's second novel, Untethered.\n\nPlease note: this event will take place on our main level. \n\nWhen Char Hawthorn’s husband dies unexpectedly, she is left questioning everything she once knew to be true: from the cozy small town life they built together to her relationship with her stepdaughter, who is suddenly not bound to Char in any real way. Untethered explores what bonds truly form a family and how, sometimes, love knows no bounds.\n\nChar Hawthorn, college professor, wife and stepmother to a spirited fifteen-year-old daughter, loves her family and the joyful rhythms of work and parenting. But when her husband dies in a car accident, the “step” in Char’s title suddenly matters a great deal. In the eyes of the law, all rights to daughter Allie belong to Lindy, Allie’s self-absorbed biological mother, who wants to girl to move to her home in California.\n\nWhile Allie begins to struggle in school and tensions mount between her and Char, Allie’s connection to young Morgan, a ten-year-old-girl she tutors, seems to keep her grounded. But then Morgan, who was adopted out of foster care, suddenly disappears, and Char is left to wonder about a possible future without Allie and what to do about Morgan, a child caught up in a terrible crack in the system.\n\nJulie Lawson Timmer grew up in Stratford, Ontario, Canada. She lives in Ann Arbor, Michigan with her husband, their four teenage children and two rescued dogs. By turns, she is a writer, lawyer, mom/stepmom, and dreadful cook. Five Days Left (Putnam 2014) is her first novel. Her second book, Untethered, will be available June 7, 2016.\n\nEvent date: \nTuesday, June 7, 2016 - 7:00pm", "name": "Julie Lawson Timmer", "date": "2016-06-07T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/631220000369326/", "description": "Literati is delighted to welcome Nathan Bomey in support of Detroit Resurrected: To Bankruptcy and Back.\n\nIn Detroit Resurrected, Nathan Bomey delivers the inside story of the fight to save Detroit against impossible odds. Bomey, who covered the bankruptcy for the Detroit Free Press, provides a gripping account of the tremendous clash between lawyers, judges, bankers, union leaders, politicians, philanthropists, and the people of Detroit themselves.\n\nThe battle to rescue this iconic city pulled together those who believed in its future—despite their differences. Help came in the form of Republican governor Rick Snyder, a technocrat who famously called himself “one tough nerd”; emergency manager Kevyn Orr, a sharp-shooting lawyer and “yellow-dog Democrat”; and judges Steven Rhodes and Gerald Rosen, the key architects of the grand bargain that would give the city a second chance at life.\n\nDetroit had a long way to go. Facing a legacy of broken promises, the city had to seek unprecedented sacrifices from retirees and union leaders, who fought for their pensions and benefits. It had to confront the consequences of years of municipal corruption while warding off Wall Street bond insurers who demanded their money back. And it had to consider liquidating the Detroit Institute of Arts, whose world-class collection became an object of desire for the city’s numerous creditors. In a tight, suspenseful narrative, Detroit Resurrected reveals the tricky path to rescuing the city from $18 billion in debt and giving new hope to its citizens.\n\nBased on hundreds of exclusive interviews, insider sources, and thousands of records, Detroit Resurrected gives a sweeping account of financial ruin, backroom intrigue, and political rebirth in the struggle to reinvent one of America’s iconic cities.\n\nNathan Bomey, a journalist at USA Today, was the lead reporter on Detroit’s bankruptcy and General Motors for the Detroit Free Press. He lives in the Washington, DC, area.", "name": "Nathan Bomey: Detroit Resurrected", "date": "2016-06-08T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/138543229893757/", "description": "Your favorite dinner spot just became your favorite lunch spot.\nBringing great food, and quick service to your lunch break. Offering paella for two, Spanish flatbreads, salads, and more!\nCheck out the new menu with the link listed above.", "name": "Aventura Spring Menu Launch", "date": "2016-06-09T11:30:00-04:00"}]