[{"date": "2016-11-08T09:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/198791040547633/", "description": "⇒ The Minecraft Hunger Games pit one contestant against another in the familiar world of Minecraft! This Election Day join us for our full day workshop dedicated to building your own Minecraft Hunger Games Server. Come up with the scenery, plan out the rules and code in the traps to become the gamemaster you want to be!", "name": "Special Election Day Minecraft Modding Course"}, {"date": "2016-11-08T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1258931664166651/", "description": "Literati is pleased to welcome poet Scott Beal and poet and translator Mariela Griffor in support of their recent work. \n\nScott Beal is the author of Wait 'Til You Have Real Problems and the chapbook The Octopus. His poems have appeared in Rattle, Prairie Schooner, Indiana Review, Beloit Poetry Journal, and other journals, and have received awards including a 2014 Pushcart Prize. He serves as writer-in-the-schools for Dzanc Books in Ann Arbor and teaches in the Sweetland Center for Writing at the University of Michigan.\n\nMariela Griffor was born in the city of Concepción in southern Chile and attended the University of Santiago and the Catholic University of Rio de Janeiro. In 1985, she left Chile for an involuntary exile in Sweden, and now lives in the United States, in Washington DC and Michigan, where she is Honorary Consul of Chile. She holds a BA in Journalism from Wayne State University and a MFA in Creative Writing from New England College. She is founder of Marick Press and author of three books of poems, Exiliana, House, and The Psychiatrist.\n\nEvent date: \nTuesday, November 8, 2016 - 7:00pm", "name": "Scott Beal & Mariela Griffor"}, {"date": "2016-11-08T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/629943997194003/", "description": "Tue. November 8 | 9pm | 18+ | $16 Adv./ $18 day of\n\nDIIV wsg: Moon King\n\nDIIV is the nom-de-plume of Z. Cole Smith, musical provocateur and front-man of an atmospheric and autumnally-charged new Brooklyn four-piece.\n\nRecently inked to the uber-reliable Captured Tracks imprint, DIIV created instant vibrations in the blog-world with their impressionistic debut Sometime; finding it’s way onto the esteemed pages of Pitchfork and Altered Zones a mere matter of weeks after the group’s formation.", "name": "DIIV w/ Moon King 11/8/16 at Blind Pig - Ann Arbor"}, {"date": "2016-11-09T08:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/324709987912141/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network"}, {"date": "2016-11-09T11:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/573236139529306/", "description": "Learn the Value of Branding, for both business and personal with Jim Berline, Chairman, Berline | Advertising, Marketing & Digital Communications in Royal Oak.", "name": "The Value of Branding - Jim Berline"}, {"date": "2016-11-09T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/676414982523008/", "description": "On November 9th, 2016, Zingerman’s Roadhouse will be welcoming back Glenn Roberts for our Anson Mills Special Dinner #202. Glenn is not only nationally recognized as an artisan stone-miller, but he has devoted his life to rescuing endangered seeds we believe are crucial to preserving agricultural systems and full-flavored foods. Chef Alex and Glenn have put together a menu this year that will draw attention to the character of some of these reserved, land-raised grains and their regional histories. Don’t miss out on Anson Mill's return to Zingerman’s Roadhouse and the bountiful stories he’ll tell with his grains!", "name": "Anson Mills Special Dinner, #202"}, {"date": "2016-11-09T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1690192754642162/", "description": "Literati is pleased to welcome Maya Barzilai and Rachel Seelig in support of their most recent works. \n\nIn the twentieth century the golem became a figure of war. It represented the chaos of warfare, the automation of war technologies, and the devastation wrought upon soldiers bodies and psyches. Golem: Modern Wars and Their Monstersdraws on some of the most popular and significant renditions of this story in order to unravel the paradoxical coincidence of wartime destruction and the fantasy of artificial creation. Due to its aggressive and rebellious sides, the golem became a means for reflection about how technological progress has altered human lives, as well as an avenue for experimentation with the media and art forms capable of expressing the monstrosity of war.\n\nMaya Barzilai is assistant professor of Hebrew literature and Jewish culture at the University of Michigan. She received her PhD in Comparative Literature from the University of California, Berkeley, in 2009. Her new book, Golem: Modern Wars and Their Monsters (NYU Press), explores how the infamous monster of clay became a metaphor of war and its destructive technologies across German, Israeli, and American cultures. Barzilai also researches Hebrew-German translation, Hebrew writing on World War I, and Jewish comics. \n\n*\n\nBerlin in the 1920s was a cosmopolitan hub where for a brief, vibrant moment German-Jewish writers crossed paths with Hebrew and Yiddish migrant writers. Working against the prevailing tendency to view German and East European Jewish cultures as separate fields of study, Strangers in Berlin is the first book to present Jewish literature in the Weimar Republic as the product of the dynamic encounter between East and West. Whether they were native to Germany or sojourners from abroad, Jewish writers responded to their exclusion from rising nationalist movements by cultivating their own images of homeland in verse, and they did so in three languages: German, Hebrew, and Yiddish. Author Rachel Seelig portrays Berlin during the Weimar Republic as a threshold between exile and homeland in which national and artistic commitments were reexamined, reclaimed, and rebuilt. In the pulsating yet precarious capital of Germany s first fledgling democracy, the collision of East and West engendered a broad spectrum of poetic styles and Jewish national identities. \n\nRachel Seelig is a fellow at the Frankel Institute for Advanced Judaic Studies at the University of Michigan. A native of Vancouver, Canada, she received her PhD from the University of Chicago in 2011 and has taught German Studies and Comparative Literature at the University of Toronto and the Hebrew University of Jerusalem. Her articles have appeared in various journals, including Prooftexts, Modern Language Notes, and The Jewish Quarterly Review. Rachel is currently co-editing a volume with Amir Eshel entitled The German-Hebrew Dialogue: Studies of Encounter and Exchange, which will be published by De Gruyter in 2017. Strangers in Berlin is her first book. \n\nEvent date: \nWednesday, November 9, 2016 - 7:00pm", "name": "Maya Barzilai & Rachel Seelig"}, {"date": "2016-11-09T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1254743334545390/", "description": "TICKETS ON SALE NOW: http://bit.ly/1XZq5zj\n\nNecto & React Detroit presents...\n\nLemaitre\nwww.lemaitremusic.com\n\nsupport from\nChet Porter & Coucheron\n\nwww.necto.com\nwww.reactpresents.com\n\nDoors at 9pm | 18 & over welcome with proper ID \n\nNecto located at 516 E Liberty Street, Ann Arbor, MI 48104\nFor VIP services contact info@necto.com", "name": "Lemaitre at Necto"}, {"date": "2016-11-10T08:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/324709987912141/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network"}, {"date": "2016-11-10T12:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1759819450937369/", "description": "Literati is thrilled to welcome Dave Eggers back to Ann Arbor for a book signing! Please note the special time for this event: Dave will be available to chat and sign books from noon until 1:30pm. All of Dave's books, including the recently published Heroes of the Frontier, will be available for sale and signing.\n\nDave Eggers grew up near Chicago and graduated from the University of Illinois at Urbana-Champaign. He is the founder of McSweeney’s, an independent publishing house in San Francisco that produces books, a quarterly journal of new writing (McSweeney’s Quarterly Concern), and a monthly magazine, The Believer. McSweeney’s publishes Voice of Witness, a nonprofit book series that uses oral history to illuminate human rights crises around the world. In 2002, he cofounded 826 Valencia, a nonprofit youth writing and tutoring center in San Francisco’s Mission District. Sister centers have since opened in seven other American cities under the umbrella of 826 National, and like-minded centers have opened in Dublin, London, Copenhagen, Stockholm, and Birmingham, Alabama, among other locations. His work has been nominated for the National Book Award, the Pulitzer Prize, and the National Book Critics Circle Award, and has won the Dayton Literary Peace Prize, France’s Prix Médicis, Germany’s Albatross Prize, the National Magazine Award, and the American Book Award. Eggers lives in Northern California with his family.  \n\nEvent date: \nThursday, November 10, 2016 - 12:00pm to 1:30pm", "name": "Dave Eggers"}]