[{"description": "This class covers the operation of pedestal grinders, angle grinders and belt/disc sander. You will learn basic operation with an emphasis on safety. With the successful completion of this class you will be certified to use these tools on your own at Maker Works.\n\nRegister by calling 734-222-4911 or visiting http://www.supersaas.com/schedule/makerworks/CheckOut?day=29&month=10&year=2016&view=day\n\nNo prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.", "date": "2016-10-30T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/169455303513447/", "name": "Metal Abrasives - $25 - 1 Hr"}, {"description": "A hackerspace in Brazil, Garoa Hacker Clube, is hosting a kicad hackathon this weekend. Nick (member of AHA) will be streaming the hack-a-thon from AHA on Sunday afternoon. If you'd like to participate, stop by AHA and lend a hand with the development of KiCad.\n\nOfficial invite on the kicad dev mailing list: \nhttps://lists.launchpad.net/kicad-developers/msg26617.html\n\nLinks from the invite: \nhttps://e-hal.org.br/ (Portuguese) \nhttp://www.ohwr.org/projects/cern-kicad/wiki/Hackathon-ehal \nhttps://garoa.net.br/wiki/P%C3%A1gina_principal (Portuguese)\n\nSome info on the hackerspace itself: \nhttps://wiki.hackerspaces.org/Garoa_Hacker_Clube\n\nThey will be meeting on freenode at #kicad or #garoa . Plans are to include a PCB stackup editor, eagle schematic import, svg import, add an object selector and improve the selection filter in the gui.", "date": "2016-10-30T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1841102966119794/", "name": "KiCad Hackathon"}, {"description": "Sunday, October 30, 2–3:30 p.m.\n\rA. Alfred Taubman Gallery. \rSpace is limited and registration is required. Please email umma-program- registration@umich.edu\n\n\rExhibition co-curators Natsu Oyobe and Mariko Okada will lead an in-depth exploration of Kabuki prints in conjunction with the UMMA exhibition Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art. This workshop is designed for a general audience. Participants will become familiar with Kabuki prints and theater, as well as the popular culture and society of the late Edo period.\rKabuki prints are filled with information on the popular culture and human experience of \rthe late Edo Period. Kabuki attracted enormous attention and developed a huge following in the late Edo Period—a phenomenon comparable to contemporary movie and television stars. The prints’ enormous popularity contributed to advances in print technology, facilitating an unprecedented speed of production and a sophisticated system of distribution and circulation.\r\n\nThis workshop is for generalists. Another workshop requiring a reading fluency of Japanese and a basic knowledge of Kabuki theater will be offered on Friday, November 4, 10:00 a.m.-12:00 p.m. Registration is required for both workshops. Email umma-program-registration@umich.edu.\n\n\rLead support for the exhibition Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art is provided by the University of Michigan Office of the Provost, the National Endowment for the Arts, the William T. and Dora G. Hunter Endowment, AISIN, and the E. Rhodes and Leona B. Carpenter Foundation. Additional generous support is provided by the Japan Foundation and the University of Michigan Center for Japanese Studies.", "date": "2016-10-30T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1581997335438040/", "name": "An Intimate Look: Images of Kabuki Theaters and Actors"}, {"description": "Sunday, October 30, 2–3 p.m.\n\nThe exhibition Traces focuses on one artwork from UMMA’s African holdings: a Chokwe mask that was collected in 1905 near the Angolan city of Dundo by the German explorer Leo Frobenius. Its presence at UMMA today—almost 7,500 miles away from the context in which it was originally created, used, and valued—is the result of a long and tumultuous journey, spanning a hundred years, three continents, and numerous people whose lives are forever connected to the artifact that passed through their hands. Drawing on the Museum’s African collection and national loans, Traces tells the stories of some of these individuals as it reconstructs the “biography” of the mask. Explore some of the historical complexity of this mask with UMMA docents.", "date": "2016-10-30T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/200733183682795/", "name": "Guided Tour: Reconstructing the History of a Chokwe Mask"}, {"description": "Ann Arbor Civic Theatre presents Othello, Shakespeare’s iconic tragedy, directed by David Widmayer October 27-30 at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org.  \nThe archetypal villain, Iago, plots against his commander, the moor, Othello, using Othello’s beautiful (and secret) wife, Desdemona, as the linchpin in his scheme. Shakespeare’s tale of jealousy, revenge, and betrayal asks the question, what happens to the boundaries of good and evil as men and women are pushed to desperation in the midst of war?\nA2CT’s upcoming production sets this tale of treachery and revenge against the backdrop of the Vietnam War, with its newly integrated armed services. Says director David Widmayer, “[This setting] has helped me bring this show to life in a way I'm not sure I otherwise could. It's helpful both for the actors and for the audience to understand the context surrounding the play, and that's a very tall order when we're talking about an early seventeenth century English translation of a sixteenth century Italian story.” He approaches the well-known classic with an eye toward the parallels to today, and the larger questions of nature versus nurture. “Iago and Othello don't do terrible things because they're terrible people, but because they've been deeply immersed in a culture which expects men to resort to violence first to solve their problems. The fact that we're still grappling with these issues as a culture centuries after Othello was written is staggering.”\nThe talented cast is led by Justin Gordon as Othello, Ann Dilworth as Desdemona, Sean Sabo as Iago, and Carol Gray as Emilia. Joshua Kay, Greg Kovas, Trevor Maher, Matthew Miller, Maegan Murphy, Kaela Parnicky, Amanda Photenhauer, Russell Schwartz, Megan Shiplett, Tom Underwood, and Cierra Wollack round out a superbly strong ensemble", "date": "2016-10-30T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/604827976308937/", "name": "Othello"}, {"description": "react presents\n\n:: Feed Me ::\n\nDoors at 8:00pm\n18+ Welcome\n\nNecto\n516 E. Liberty\nAnn Arbor, MI\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet", "date": "2016-10-30T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/198556387246509/", "name": "Feed Me at Necto"}, {"description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "date": "2016-10-31T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1090878344334512/", "name": "Sweetwaters Westgate Grand Opening!"}, {"description": "Get your costumes ready. The 4th Annual Literati Book-Themed Halloween Costume Contest is coming!\n\nOn Halloween, stop by the store wearing your best book-themed costume. Saying hello qualifies as your \"entry\" into the contest. Here are the prizes:\n\n1st = $100 gift card to Literati!\n\n2nd = $50 gift card!\n\n3rd = $25 gift card!\n\nSo stop by on Halloween dressed as a character, theme, title, setting, strange alien, concept, author, quotes from your favorite book, WHATEVER YOU WANT AS LONG AS IT IS BOOK THEMED, and win! Kids, adults, dogs all welcome to enter! \n\nEvent date: \nMonday, October 31, 2016 - 10:00am to 9:00pm\nEvent address: \n124 E. Washington\nAnn Arbor, MI 48104", "date": "2016-10-31T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/2141146659443921/", "name": "Book-Themed Costume Contest"}, {"description": "It’s our sixteenth annual Treat Parade in downtown Ann Arbor! Area merchants welcome your little costumed characters to the neighborhood with greets and treats. Black and orange balloons will fly from participating businesses. Join the fun from 11am to 5pm.\n\nGet an early start and head to the Ann Arbor District Library on S. Fifth Ave. for a Halloween Party in the first floor lobby. This year you can choose to attend from 10:30 to 11am or from noon to 12:30. Come in costume for stories, puppets and trick-or-treats.\n\nStop by 306 S. Main, where our friends at the Ann Arbor Police Department will be handing out police badges from 11am – 3pm, and Safe Kids Huron Valley will be handing out glow in the dark bracelets for evening trick-or-treating safety. Also visit the Community Dental Center - UM School of Dentistry at 314 S. Main (just north of Conor O'Neills Ann Arbor) where Mr. Tooth will be handing out toothpaste and treats, and you will have an opportunity to snap a photograph at the Pokemon Photo Board!\n\nYou will find participating businesses on Main, Liberty, Washington, Ashley, Fourth, and Fifth.\n\nThis event is intended for children aged 5 and under.\n\nFor more information visit www.mainstreetannarbor.org", "date": "2016-10-31T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/436614696508773/", "name": "Halloween Treat Parade!"}, {"description": "Literati welcomes Bill Ayers to Ann Arbor as part of a national tour to celebrate the release of his latest book, Demand the Impossible!: A Radical Manifesto.\n\nDemand the Impossible! is a manifesto for movement-makers. In an era defined by mass incarceration, endless war, economic crisis, catastrophic environmental destruction, and a political system offering more of the same, radical social transformation has never been more urgent. Demand the Impossible! urges us to imagine a world beyond what this rotten system would have us believe is possible. In critiquing the world around us, insurgent educator and activist Bill Ayers uncovers cracks in the system, raising our sights for radical change, and envisioning strategies for building a movement to create a more humane, balanced, and peaceful world.\n\n\"For Bill Ayers, it is the freedom of our collective imagination that links the contemporary world—ensconced as it is in pervasive militarism, racist violence, and environmental devastation—to the flourishing of our planet. This is a manifesto that should be read by everyone who wants to believe that “another world is possible.”—Angela Y. Davis, author of Abolition Democracy and Freedom is a Constant Struggle\n\n\"With huge numbers of us recognizing the need for transformative change, this ambitious and exuberant book perfectly matches its historical moment. Ayers fearlessly confronts the intersecting crises of our age—endless war, surging inequality, unchecked white supremacy and perilous planetary warming—while mapping emancipatory new possibilities. From the first page, his courage is contagious.\"—Naomi Klein, author of This Changes Everything and The Shock Doctrine\n\n\"Demand the Impossible is more than a book, more than a manifesto. It is a torch. Bill Ayers’ vision for a humane future is incendiary—fire that incinerates old logics and illuminates new paths. If we do not end the violence of militarism, materialism, caging, dispossession, debt, want, ignorance, and global warming, our very survival is impossible. Read aloud.\"—Robin D. G. Kelley, author of Freedom Dreams\n\nBill Ayers is a social justice activist, teacher, Distinguished Professor of Education (retired) at the University of Illinois at Chicago, and author of two memoirs, Fugitive Days and Public Enemy.\n\nEvent date: \nMonday, October 31, 2016 - 7:00pm", "date": "2016-10-31T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1085363878179621/", "name": "Bill Ayers"}]