[{"description": "Back to School Scavenger Hunt! If you find it, you can keep it*. We'll have our scavenger hunt clue list at our front entrance- figure out our riddles to have some fun througout the store! Some clues even have multiple answers- see if you or your kids can figure them out.\n\nKids of all ages welcome ♥\n\n*Grown-ups, please limit your kiddos to 1 of what they find- thank you!", "date": "2016-09-11T09:00:00-04:00", "url": "https://www.facebook.com/events/847197395380414/", "name": "Back to School Scavenger Hunt", "source": "Facebook"}, {"description": "Stewardship Workday-National Day of Service\nSunday, September 11\nKuebler Langford Nature Area\n9 a.m. to noon\nDespite some parts of the park being used as a staging area for the construction of M-14, the majority of Kuebler Langford was fortunately left in good ecological condition. The north side of the wooded ravine hosts the park’s greatest biological diversity with wild ginger, maiden-hair fern and doll’s eyes decorating the slopes. The park also features a prairie remnant, but invasive shrubs are encroaching on this beautiful habitat. Come out to help us remove these harmful species and help this prairie thrive! Please meet at the park entrance on Beechwood Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "date": "2016-09-11T09:00:00-04:00", "url": "https://www.facebook.com/events/1654574404862037/", "name": "Stewardship Workday- National Day of Service- Kuebler Langford Nature Area", "source": "Facebook"}, {"description": "http://bit.ly/14Wkytl\n\nNicola's Books is a major sponsor of the Kerrytown BookFest and will have a booth as well as selling books at some of the author panels.  Hope to see lots of you there!\n \nSCHEDULE OF EVENTS PER VENUE - \n\nMain Tent\n\n10:30 – 11 a.m. 9th Annual Community Book Award Presentation to Washtenaw Literacy. Director Amy Goodman will accept the award, presented by board member Dallas Moore. Free coffee and donuts will be served in the Main Tent to help celebrate Washtenaw Literacy and kick off the day.\n\n11:00 a.m.- Noon Under the Radar Michigan’s Tom Daldin talks about Michigan’s undiscovered gems.\n\n12:15 – 1:15 p.m. The Quest for Identity Writers Desiree Cooper (Know the Mother), Kelly Fordon (Garden of the Blind), and Andrew Mozina (Contrary Motion) discuss their work with moderator and author Donald Lystra (Something That Feels Like Truth).\n\n1:30 – 2:30 p.m. A Mysterious Sense of Place Mystery writers William Kent Krueger (Manitou Canyon), Hank Phillippi Ryan (What You See) and Patricia Abbott (Shot in Detroit) discuss the sense of place in their novels with author and moderator Carrie Smith (Silent City).\n\n2:45 – 3:45 p.m. Travel through Time with author B.A. Shapiro, who discusses her novels The Art Forger and The Muralist with art historian Ellen Longsworth.\n\n4 p.m. Travel North with John Smolens as he discusses his writing and his latest novel Wolf’s Mouth with writer and moderator Benjamin Busch (Dust to Dust).\n\nKerrytown Concert House\n\n11:00 a.m. – Noon Writing for Hire Join writers Casey Daniels (Irish Stewed), Vicky Delany (Reading up a Storm) and Sarah Zettel (A Familiar Tail) as they discuss the many ways to make a living writing. All of them have written books “for hire” from science fiction to cozy mysteries to flashcards to Goosebumps installments. They’ll discuss the state of publishing today with writer and moderator Barbara Gregorich (Guide to Writing the Mystery Novel: Lots of Examples, Plus Dead Bodies).\n\n12:15 – 1:15 p.m. Stride’s Duluth Thriller writer Brian Freeman illustrates with photos taken on photo safari in Duluth, Minnesota, how he uses the setting to inform his Jonathan Stride novels. He’ll read a passage from one of them to show how his setting influences his writing.\n\n1:30 – 2:30 p.m. Eating Wildly with Ava Chin, who discusses her book on urban foraging with bookseller and moderator Rachel Pastiva, the manager of Crazy Wisdom.\n\n2:45 – 3:45 p.m. Travel the Lakes with Loreen Niewenhuis, who has written a trilogy about her 1,000-Mile Great Lakes Adventures, and Maureen Dunphy, who visited 136 Great Lakes Basin islands and wrote the travel guide and travelogue Great Lakes Island Escape: Ferries and Bridges to Adventure. They’ll present a dynamic slideshow and engage in a lively discussion about their favorite Great Lakes islands.\n\n4 p.m. The ABCs of Washtenaw Literacy, an informative tour of the agency’s highly effective programs including a video and a presentation from learners.\n\nChildren’s Tent\n\n11-11:45 a.m. the beloved Mother Goose shares nursery rhymes with the littlest BookFest visitors\n\n11:45 a.m. – 12:15 p.m. Shanda Trent reads her new book Giddy-Up, Buckaroos\n\n12:15 – 1 p.m. Writer Kristen Remenar and illustrator Matt Faulkner read their latest collaboration Groundhog’s Dilemma\n\n1 – 1:45 p.m. author Kelly DiPuccio shares Dragon was Terrible and Everyone Loves Cupcakes.\n\n2 – 3;30 p.m. Storytellers Laura Pershin Raynor and Kayla Coughlin present fall stories.  Create your own autumn adornment for cruising through the festival! This event is intended for pre-school-grade 3.\n\n3:30 – 5 p.m. writer & illustrator Ruth McNally Barshaw (Ellie McDoodle) leads a drawing workshop – “How to make a Lion from a 5″\n\nWriter in Residence R.J. Fox, ongoing through the day.  Mr. Fox will critique the first twenty pages of your manuscript. For information and to reserve a slot, contact Hart Johnson at hartjohnson23@gmail.com.", "date": "2016-09-11T10:30:00-04:00", "url": "https://www.facebook.com/events/1721427041453987/", "name": "14th Annual Kerrytown BookFest", "source": "Facebook"}, {"description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.", "date": "2016-09-11T13:00:00-04:00", "url": "https://www.facebook.com/events/514188362104937/", "name": "Guided Tour Engaging with Art", "source": "Facebook"}, {"description": "This exhibition presents new and recent work by Los Angeles-based artist Catherine Opie, one of the essential figures in contemporary photography. Beginning in 2010, Opie spent six months taking photographs at the residence of Elizabeth Taylor (1932–2011), capturing the essence of the Hollywood legend through her personal objects and mementos. She portrays Taylor’s life experience and eccentricity as an illusory subject, one that cannot be specifically designated or precisely described. UMMA docents will explore Taylor’s celebrity and humanity through these images.", "date": "2016-09-11T14:00:00-04:00", "url": "https://www.facebook.com/events/1001944953254261/", "name": "Guided Tour - Catherine Opie: 700 Nimes Road", "source": "Facebook"}, {"description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "date": "2016-09-11T16:00:00-04:00", "url": "https://www.facebook.com/events/182553475489986/", "name": "Beer and Board Games", "source": "Facebook"}, {"description": "Enjoy hilarious video shorts created by some of our very own improvisers and also by professional, amateur and even wannabe film makers in and around the community!!\n\nHere’s how it works: Each month we’ll get a new suggestion from the audience to use as inspiration for the next month’s “Pointless 730 Hour Video Challenge.\" Next, get to work creating your prerecorded masterpiece. Submissions can be no longer than two minutes in length.\n\nAnd the coolest part - We will be taking your video and using it as the suggestion for an improv scene!!! IT'S A FREAKING VIDEO NIGHT/IMPROV JAM!!! People will LITERALLY be DISSECTING your video in the name of improvised comedy. What will they do with it??? Show up to find out.\n\nSend your finished product to pointlessvideoshorts@gmail.com no later than the Saturday before the video night. And finally, come and watch the crowd go wild over your creative and hysterical work of digital media art.\n\nNot into making vids but love watching them? Submit your favorite one from YouTube related to that month’s “suggestion” and we might play it on that Sunday! That’s right, you can share with the world that video you accidentally stumbled upon late one night while browsing the interwebs that made you cry with laughter.\n\nOf course, you are not required to participate in any way. Simply come, enjoy a microbrew, sit back and laugh with some fellow funny people. Admission is pay-what-you-can.\n\nLet’s get ROLLIN’!.", "date": "2016-09-11T19:00:00-04:00", "url": "https://www.facebook.com/events/579076205584933/", "name": "Pointless 730 Hour Video Challenge - September's Theme \"Growth\"", "source": "Facebook"}, {"description": "Ann Arbor Civic Theatre opens their 2016-2017 season with the musical comedy The 25th Annual Putnam County Spelling Bee, directed by Wendy Sielaff, September 8-11, 2016, at UM’s Lydia Mendelssohn Theatre, 911 N. University, Ann Arbor, 48109.  Performances are Thursday at 7:30 pm, Friday and Saturday at 8pm, with a 2pm matinee on Sunday.  Friday, Saturday and Sunday tickets are $26, with tickets at $23 for seniors and $14 for students. On Thursday only, all seats are $20, with $14 tickets for students. Tickets and information are available online at www.a2ct.org, through the A2CT office at 734-971-2228, or at the door of the theater before each performance.\n\nWinner of a Tony and a Drama Desk Award for Best Book, The 25th Annual Putnam County Spelling Bee sees six contestants in a high school gym vie for the title of Spelling Bee Champion. It’s a fast-paced, uproariously funny and wild ride, complete with audience participation.  Says director, Wendy Sielaff, “Don't be fooled by the age of our spellers - each of them comes with their own quirks. In a very funny score, creative dancing, and of course some spelling we see each speller truly trying to win the trophy.” With its terrific book and score and impressive cast, Spelling Bee is a witty and touching production that is sure to spell F-U-N. \n\nThe show does contain some mature content, and is recommended for those 16 and up.\n\nMusic direction for The 25th Annual Putnam County Spelling Bee is by Debra Nichols, with choreography by Reilly Conlon. The talented cast includes Allison Ackerman as Rona Lisa Peretti, Brandon Cave as Douglas Panch, Emily Fishman as Olive Ostrovsky, Hallie Fox as Marcy Park,Nick Rapson as Mitch Mahoney, Nathan King as Leaf Coneybear, Keshia Oliver as Logainne Schwartzandgrubenierre,Bob Cox as Chip Tolentino, and Connor Rhoades as William Barfee.", "date": "2016-09-11T19:30:00-04:00", "url": "https://www.facebook.com/events/1364500856898234/", "name": "The 25th Annual Putnam County Spelling Bee", "source": "Facebook"}, {"description": "COMICS and PERFORMERS: Please click \"See More\" below for spot request instructions for 9/11/16.\n\nWe're baaaack! And now we're in The Madhouse! Not only are we back, but we'll be there every Sunday night.\n\nPlease refrain from bringing alcohol. Beer and wine will be available for purchase. You will need to buy a membership to drink, $2 for the day, or $10 for the whole year. Layout will be basically what we had before in Ypsi, boxes and cans with a container for money. \nOK, so here's the spiel:\n\n\nWatch old comics develop new bits and new comics just develop at the UNclub (TM) at The Madhouse in Ypsilanti, MI.\n\nFor non-performers, a $5 suggested donation at the door to cover overhead.\n\nComics and performers, please follow these procedures for stage time:\n\n- Click \"Going\" on this Facebook Event. Even if you are thinking about it, you can click \"Interested\" so you can get updates on this page. Do this by 4:00pm, the day of the show. This does not guarantee you a spot, but not doing it puts you at the bottom of the list.\n\n- After 4:00pm Sunday, \"show ups\" can \"go up\" only if spots are available.\n- The line-up will be created just before showtime.\n- Those arriving after the line-up is finalized will be given spots as time permits.\n- Length of stage time will depend largely on the turn out, performer's experience, and the show-runner's discretion.\n- As always, if you show up and do not get a spot, you will be put at the top of the list for the next show.\n\n--- Want to increase your odds of getting a spot? Here's some DO's and DON'T's\nDO . . . . Share this event page with your fans on your fan page, your facebook page, your website, or your tweets, or any other social media.\nDO . . . . Volunteer for less time. If you are willing to do 3 rather than 5, or 4 rather than 7, then you are more likely to get a spot.\nDO . . . . Come to the paid shows.\nDO . . . . Stay for \"meet and greet\" after shows.\nDO . . . . Answer poll questions whenever they appear on the event page.\nDO . . . . Bring people. This is not, I repeat NOT, a \"bringer.\" But if somebody has come to see you, it will be very hard to deny you a spot. In the past, we've had shows where we've added a minute of time for every person the comic brought as a non-performing audience member. Bring three people and a five minute spot becomes an eight minute spot.\n\nContact Mark at: www.facebook.com/marksweetman\n\nChili Challis, former staff writer for The Tonight Show with Jay Leno and nationally known comedian, writer and teacher says about The UNclub,\n\n\"The ... UNclub IS as close to a pure artist's way of pursuing, grasping and understanding comedy as I have ever known; not to mention it's open and fair to every talent, EVERY talent, even ones right off the street. Comics are allowed to go 'out there' and they're permitted to fail and still be welcomed back. It doesn't get any better than that as far as I'm concerned, and I've been known to be a bit fussy. This special venue is poised for the big wave, it is so ready and worthy of being discovered by an audience...and when they do it will be pure addiction.\"﻿", "date": "2016-09-11T20:30:00-04:00", "url": "https://www.facebook.com/events/289346698113111/", "name": "The UNclub at the Madhouse, September 11, 2016", "source": "Facebook"}, {"description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "date": "2016-09-12T09:00:00-04:00", "url": "https://www.facebook.com/events/1090878344334512/", "name": "Sweetwaters Westgate Grand Opening!", "source": "Facebook"}]