[{"date": "2017-02-12T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/230775294023258/", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "name": "Exhibit: Avant Garden-Fashion & Plants Together!"}, {"date": "2017-02-12T11:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/378782775824427/", "description": "Free. Registration is required: email umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11:00 a.m. session or the 2:00 p.m. session and how many adults and children are in your group.\n\nCreate your own art project inspired by the animals and creatures in UMMA's collections. Designed for families with children ages 6 and up to experience art together. UMMA docents will lead a tour of the galleries to look at different creatures both mythical and real followed by a hands-on workshop led by local artist Lilik Aprilianto. Designed for families with children ages six and up to experience art together. Parents must accompany children.\n\nFamily Art Studio is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "name": "Family Art Studio: Creatures in the Collections"}, {"date": "2017-02-12T12:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1262824860470291/", "description": "Roses are $9.98 a dozen this Saturday and Sunday, and we'll even wrap them for you for free!\n\n.", "name": "Free Flower Wrapping"}, {"date": "2017-02-12T14:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/754498548030879/", "description": "Since they officially opened in 1919 and 1929, respectively, the Union and League have been destinations for generations of Wolverines yet few know the rich history of the buildings’ origins or about the architects who brought them both to life: brothers and U-M alums Irving K. and Allen Pond. This exhibition, organized in celebration of the University of Michigan’s bicentennial in 2017, reveals how the buildings were conceived, constructed, and first occupied by students and alumni. Guest curated by Nancy Bartlett of the Bentley Historical Library, the exhibition reveals how the Ponds meticulously conceived of the two clubs—one for men, one for women—by weaving ideas about gender and society into the very fabric of the buildings themselves.", "name": "Guided Tour: Constructing Gender"}, {"date": "2017-02-12T15:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/372269613138169/", "description": "This program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.\n\nIn early twentieth-century New York, a group of like-minded photographers founded the Photo-Secession movement in an effort to legitimize photography as a fine art in the United States. The Photo-Secessionists, with Alfred Stieglitz at the helm, employed a diverse range of formal strategies, techniques, and subjects in order to achieve the movement’s lofty and ambitious goal. Join Assistant Curator of Photography, Jennifer Friess, for a discussion of the efforts of Stieglitz and his peers to carve out a place for photography in the art world.\n\nLead support for The Aesthetic Movement in America: Artists of the Photo-Secession is provided by the Herbert W. and Susan L. Johe Endowment.", "name": "In Conversation: Alfred Stieglitz and the Struggle"}, {"date": "2017-02-12T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1925985464296034/", "description": "It's Chili Cookoff time! Join Wolverine, local chili connoisseurs, and your favorite stage players in the Tap Room for chili samples, beer, and some friendly competition to benefit the A2 Civic Theatre! Each ticket is $20 and is good for 10 chili samples and three beer samples. All the fixin's will be provided. Just want chili? That's cool too! Chili-only tickets are available for $10. Watch as local judges crown the winner! Tickets and info here: http://www.a2ct.org/events/annual-chili-cook-off", "name": "A2 Civic Theatre Annual Chili Cookoff"}, {"date": "2017-02-12T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1832607166998206/", "description": "Let’s celebrate Valentine’s Day All Week Long!\nSaturday, February 11 – Tuesday, February 14, 2017\nDinner Available Each Day 4pm – Close\n\n3- COURSE DINNER MENU FOR TWO\n\nFIRST COURSE\nPlease select one of the following:\nSoup, Bleu Cheese Cole Slaw, House Salad or Caesar Salad\n\nSECOND COURSE\nLobster Stuffed Filet Mignon\nTopped with hollandaise sauce then served with grilled asparagus and Duchess potatoes\n\nTHIRD COURSE\nDessert to share\nChocolate Molten Cake\nwith a warm creamy center and a scoop of vanilla ice cream\n\nReservations Recommended\n(888) 456-3463 (DINE)\nCall to reserve your spot!\n$69.95 for two, tax/gratuity not included.\nLimited time offer. \nhttp://carsonsamericanbistro.com/valentines-dinner-for-two/\n___________________________________\n\nDRINK SPECIALS \n(Not included in price of the Dinner for Two)\n\n“Amore Martini” \nMalibu, Peach Schnapps, Citrus Vodka, Cranberry Juice $10.95\n\n“Kir Royale”\nLaMarca Prosecco, Crème de Cassis $11.95\n\n____________________________________", "name": "Valentine’s Dinner for Two, 2/11 – 2/14"}, {"date": "2017-02-12T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/239349533177947/", "description": "Ann Arbor Civic Theatre announces its Eighth Annual Chili Cook-Off/Beer Tasting on Sunday, February 12 from 4-7 pm at The Wolverine State Brewing Company at 2019 West Stadium Blvd, A2, MI, 48103.  Tickets are $20 and include ten chili tastings and three beer samples. Chili-only tickets are $10, with $5 tickets for children ages 5-10.  Kids under 5 attend free of charge.  Tickets for the event are available in advance at the A2CT office (734) 971-2228, or at the door of the Chili Cook-off.  Additional information is available at www.a2ct.org.\n \nThe Ann Arbor Civic Theatre Chili Cook-Off has become an event that patrons really look forward to, according to Executive Director Alexandra Berneis. “People start calling as soon as our season starts (in September) to ask about the chili cook-off!” she says. This is the eighth continuous year that A2CT has hosted the event, and the past several have been in collaboration with Wolverine State Brewing. Once again, the event will also include a 50/50 raffle, and a silent auction with items including tickets to sporting events, designer bags, and local goodies.\n \nThe Annual Chili Cook-off/Beer Tasting is a fundraiser for Ann Arbor Civic Theatre. A2CT provides opportunities for everyone in the community—regardless of experience or income—to participate in and experience live theater.", "name": "A2CT's 8th Annual Chili Cook-Off"}, {"date": "2017-02-12T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/156812758147275/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games"}, {"date": "2017-02-12T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1562793857070259/", "description": "Caleb Curtis, saxophone\nMarta Sánchez, piano\n\nAnn Arbor native, and fixture on the New York jazz scene, Caleb Curtis performs with pianist Marta Sanchez whose latest album Partenika was one of the New York Times top 10 albums of 2015 in all genres. A variety of original compositions and selections from the vast repertoire of jazz will showcase their ability to create a unique sonic landscape of intriguing, evocative, and compelling music.\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nCaleb Curtis\n\nNew York based, Ann Arbor (MI) born, musician Caleb Curtis has shown himself to be an engaging and entertaining saxophonist and composer. His original compositions are informed by a wide swath of the jazz tradition, at times introspective, brash and melodic. Legendary pianist Mulgrew Miller said “Caleb has a wonderful, singing, projecting sound. To me, that’s the ultimate for a horn player.” Neighborhood (Ropeadope Records), the recently released debut album from the Brooklyn based collective Walking Distance, has been met with critical acclaim.\n\nAfter studying music at Michigan State University and William Paterson University Caleb has become an active member of the New York City jazz and creative music scene. He can be seen with Walking Distance, Manner Effect, Orrin Evans and the Captain Black Big Band, the George Gee Swing Orchestra, the Fat Cat Big Band, the Gregorio Uribe Big Band, and the Mike Sailors Swing Orchestra. He has performed at the Blue Note, Jazz Standard, Smalls, Smoke, Zinc Bar, and many other NYC clubs. Caleb has developed an individualistic approach to improvisation and sound, reflected in his “urgent and wailing saxophone.” (All About Jazz)\n\nMarta Sánchez\n\nBorn and raised in Madrid, Spain, pianist and composer Marta Sánchez is actively working in the contemporary creative music scene in New York City and around the globe. Charting a significant path through her innovative and original music, she has reached an international audience, gaining significant global recognition.\nAfter finishing her classical training at the Conservatory, she began her academic training in jazz and contemporary music at School of Music Populart, earning a grant from A.I.E. (Spanish Association of Musicians) for being one of the best students there. The first band she created, Zafari Project,was selected by the Spanish agency for youth (INJUVE) as one of the most promising on the Spanish scene, giving them the opportunity to tour around Spain playing in different Jazz Festivals. This band also won the first price at the international jazz contest Debajazz, which is not the only jazz contest Ms. Sánchez won, since she also obtained the first prize at the Jazzargia International Jazz Contest with Javier Moreno Trio and the first prize at San Martin de la Vega Jazz contest with Natalia Calderon Quartet. She is the only musician in Spain who has been selected on three occasions by AECID (government agency for international development cooperation) to represent Spain at jazz festivals in different countries around South America, Central America and Europe; with her own band on two occasions (2009, 2012) and with Natalia Calderon Quartet (2009). In 2010, she received the “A.I.E en Ruta” Touring Grant from the Spanish Association of Musicians. In 2011, she was awarded a Fulbright Scholarship, which allowed her to continue her studies at New York University (M.M.). During her time there, she to an international tour in Costa Rica, where her group represented NYU at the famed Costa Rica Jazz Festival.\n\nAs a bandleader, she is currently working with her New York-based Quintet with respected saxophonists Jerome Sabbagh and Roman Filiu, her sextet featuring singer Camila Meza, and with the collaborative band “Snackasaurus Flex”, featuring Michael Attias. She is involved in many other music projects as a collaborator, performer, and/or studio musician, in the United States and abroad.\nShe has recently released a new album for Fresh Sound Records: Partenika (2015), Ben Ratliff reviewed it for the NY Times stating that -“It’s an ambitious record by a strong new group” and included it as one of his top 10 recordings of the year, including all genres- Downbeat gave the recording 4 starts and included it on their list of the best recordings of 2015. Dan Bilawsky wrote for All About Jazz that the album”it’s like waking up to a whole new and wondrous world.” and Peter Margasak for Chicago Reader: “Spanish pianist Marta Sánchez finds a new voice in New York”. All Music and the Jazz Journalist Association also listed Partenika as one of the best jazz Recordings of 2015.\n\nShe also released for Errabal Records: La Espiral Amarilla (2011) and Lunas, Soles y Elefantes (2008) and the work 49 Riiiing with D’Free Qi thanks to a grant by “Caja de Burgos”. As a sideman she has collaborated in many other Cds like Mediterraciones and Satierismos, both with the Afrodisian Orchestra, Lineas Paralelas with the Talento Big Band, Songs from my heart, with Doris Cales, Matterhorn with John Blevins, or Flor Azul with Natalia Calderon Quartet among others.\n\nShe has touring the United States, Europe, South America and Central America, performing as a leader or as a sideman at prestigious venues and prominent festivals such as North Sea Jazz Festival in the Netherlands, Eurojazz in Mexico City, Eurojazz in Athens, Jazz Festival Vitoria Gasteiz, and Madrid Jazz Festival.", "name": "Caleb Curtis, saxophone & Marta Sánchez, piano"}]