[{"description": "One of our very favorite sales of the year! Our whole bulk department is 30% off for one day only- Thursday, October 27. Why buy in bulk? More value, good for the planet, and you get to decide how much you're going to buy. Also, did we mention? 30% off on Wednesday!", "date": "2016-10-27T08:00:00-04:00", "name": "Bulk 30% Off- One Day Sale", "source": "Facebook", "url": "https://www.facebook.com/events/256624908072927/"}, {"description": "Children and their families are welcome for tea and cookies served by real fairies!\nCelebrate with our enchanting fairies as they serve tea, treats, and magic.\nThere will be story time with books available from Crazy Wisdom Bookstore.\nFairy attire is encouraged.\nBe creative!\n$11 per person.\n(Adults accompanying children must purchase tickets also!)\nBabies 18 months and younger are free.\nTickets must be purchased online prior to the event.\nLet us know of any food allergies while checking out.\nFor information call, 665-2757 or email fairytea@crazywisdom.net\nScroll down for a list of FAQs\nAutumn Tea, Oct. 27, 1 p.m. and 4 p.m. seatings", "date": "2016-10-27T13:00:00-04:00", "name": "Fairy Teas at Crazy Wisdom", "source": "Facebook", "url": "https://www.facebook.com/events/1807140782837872/"}, {"description": "Children and their families are welcome for tea and cookies served by real fairies!\nCelebrate with our enchanting fairies as they serve tea, treats, and magic.\nThere will be story time with books available from Crazy Wisdom Bookstore.\nFairy attire is encouraged.\nBe creative!\n$11 per person.\n(Adults accompanying children must purchase tickets also!)\nBabies 18 months and younger are free.\nTickets must be purchased online prior to the event.\nLet us know of any food allergies while checking out.\nFor information call, 665-2757 or email fairytea@crazywisdom.net\nScroll down for a list of FAQs\nAutumn Tea, Oct. 27, 1 p.m. and 4 p.m. seatings", "date": "2016-10-27T16:00:00-04:00", "name": "4 P.M. SOLD OUT! Fairy Tea", "source": "Facebook", "url": "https://www.facebook.com/events/1754772414783278/"}, {"description": "Is your costume not ready and you're freaking out a little? Don’t worry, Maker Works can help. Come to a two hour workshop with YOUR costume and we will help you with any problems that you are having. We will have two experts on-hand that have skills in sewing, pattern reading, and light fabrication. We won’t make it for you, but we will make sure you make it right. Price includes a day pass and time with instructors. Patrons are encouraged to bring all of their materials.\n\nCall 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=27&month=10&year=2016&view=day to sign up.", "date": "2016-10-27T17:00:00-04:00", "name": "Halloween Workshop", "source": "Facebook", "url": "https://www.facebook.com/events/326520911046790/"}, {"description": "Ken Kozora, multi-instrumentalist\nPiotr Michalowski, reeds\nAbby Alwin, cello\nBen Willis, bass\n\nThis performance is a part of the Fringe at the Edge series, celebrating the spirit of Edgefest through free public performances throughout downtown Ann Arbor.", "date": "2016-10-27T17:00:00-04:00", "name": "Ken Kozora Group at Amadeus Restaurant | Fringe at the Edge", "source": "Facebook", "url": "https://www.facebook.com/events/310252762682778/"}, {"description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Will McEvoy's Third Coast Quartet, Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation: A Tribute to Connie Crothers, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, MoTreetown Collective, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest website: \nwww.edgefestannarbor.com", "date": "2016-10-27T17:00:00-04:00", "name": "Edgefest 20: 20 Years At The Edge!", "source": "Facebook", "url": "https://www.facebook.com/events/1606056323056977/"}, {"description": "Please bring dry dog or cat food to this event to donate to the HSHV’s Bountiful Bowls Program to help families in financial difficulties be able to keep their pets instead of having to surrender them to the shelter.  If you cannot come to the event you can still donate food at the store through the month of October.  \n\nCartoonist Dave Coverly - \n\nThe BarkBox doodles are everywhere- on the box, in our newsletter, and on our Facebook page. And while we affectionately call these pup drawings “doodles,” the artist behind them is a full-blown cartoonist.\n\nThey’re by Dave Coverly, one of the top cartoonists in the country. (Seriously.) His “Speed Bump” comic strip is syndicated in more than 400 newspapers and websites, including the Washington Post, Torontopr Globe & Mail, Detroit Free Press, Chicago Tribune, and the Indianapolis Star. In 2009 he was given the prestigious Reuben Award for Outstanding Cartoonist of the Year—the highest honor awarded by the National Cartoonists Society.\n\nDave lives with his wife and two daughters in Ann Arbor, Michigan, and he took a few moments to chat with us about dogs, cartoons, dogs, BarkBox, and more dogs. (courtesy of BarkPost)\n\nClick on the link to read BarkPost’s interview of Dave Coverly http://bit.ly/2bzZ6Es\n\nHumane Society of Huron Valley Bountiful Bowls Program -\nFor decades, \"Meals on Wheels\" programs have provided millions of elderly, disabled and at-risk people with meals, so that they can remain healthier in their homes.\n\nAnd for nearly a decade, HSHV's \"Bountiful Bowls\" program has provided families who've fallen on hard times with pet food, so that they can keep their pets in their homes.\n\nLast year, HSHV distributed nearly 40,000 pounds of pet food through the Bountiful Bowls safety net program. This year, we've already distributed over 16,000 pounds-- and that's just through May! The donated food is given to pre-approved families both through a weekly program at the shelter and with community partnerships, like YMOW.", "date": "2016-10-27T19:00:00-04:00", "name": "BarkBox Cartoonist Dave Coverly & HSHV Fundraiser", "source": "Facebook", "url": "https://www.facebook.com/events/1781501162113597/"}, {"description": "when: every other Thursday \nwhere: 7PM-10PM at 327 Braun Court downstairs space \nwho: anyone 21+ \nwhat: board games library, GREAT FOOD, silly hijinks\nhow: see YOU @ 7ish\ncost: nothing!", "date": "2016-10-27T19:00:00-04:00", "name": "Board+Brew at Bar Braun Court !!! !", "source": "Facebook", "url": "https://www.facebook.com/events/538889712982289/"}, {"description": "Ann Arbor Civic Theatre presents Othello, Shakespeare’s iconic tragedy, directed by David Widmayer October 27-30 at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org.  \nThe archetypal villain, Iago, plots against his commander, the moor, Othello, using Othello’s beautiful (and secret) wife, Desdemona, as the linchpin in his scheme. Shakespeare’s tale of jealousy, revenge, and betrayal asks the question, what happens to the boundaries of good and evil as men and women are pushed to desperation in the midst of war?\nA2CT’s upcoming production sets this tale of treachery and revenge against the backdrop of the Vietnam War, with its newly integrated armed services. Says director David Widmayer, “[This setting] has helped me bring this show to life in a way I'm not sure I otherwise could. It's helpful both for the actors and for the audience to understand the context surrounding the play, and that's a very tall order when we're talking about an early seventeenth century English translation of a sixteenth century Italian story.” He approaches the well-known classic with an eye toward the parallels to today, and the larger questions of nature versus nurture. “Iago and Othello don't do terrible things because they're terrible people, but because they've been deeply immersed in a culture which expects men to resort to violence first to solve their problems. The fact that we're still grappling with these issues as a culture centuries after Othello was written is staggering.”\nThe talented cast is led by Justin Gordon as Othello, Ann Dilworth as Desdemona, Sean Sabo as Iago, and Carol Gray as Emilia. Joshua Kay, Greg Kovas, Trevor Maher, Matthew Miller, Maegan Murphy, Kaela Parnicky, Amanda Photenhauer, Russell Schwartz, Megan Shiplett, Tom Underwood, and Cierra Wollack round out a superbly strong ensemble", "date": "2016-10-27T19:30:00-04:00", "name": "Othello", "source": "Facebook", "url": "https://www.facebook.com/events/604827976308937/"}, {"description": "Thu. October 27 | 8pm | All Ages | $25 Cover\n\nann arbor's 107one Presents:\nBrett Dennen wsg: Lily & Madeleine\n\nAs common and simple as it is, \"por favor\" is such an evocative expression. From Spanish, it translates to \"please,\" a word that suggests a need for something, a desire to make a change. \"Por favor' was something I kept saying every day in the studio, and I got the other musicians saying it,\" says Brett Dennen. \"We were goofing around, and Dave Cobb, my producer, said it should be the title of my new record. I laughed it off at first, but then I really thought about it.\"\n\n\"When you say please, you're asking something to come into your life,\" Dennen adds. \"It might mean that you're weak and need something to make you strong. But you're admitting to some sort of weakness or some form of humility.\"\n\nThat notion is at the heart of Por Favor, Dennen's intimate and revealing new album that Elektra Records will release on May 20. Produced by Cobb, fresh from his Grammywinning work with Chris Stapleton and Jason Isbell, the record strips Dennen to his core as a songwriter with nothing to hide.\n\n\"All these songs came from a time of sadness for lots of different reasons. They came at a point when I wasn't feeling confident about myself,\" he says. \"When I'm not feeling confident, I'm not a nice person to be around. I don't take care of my health, my relationships, my stuff, and it all cycles into a miserable place. And I have a really hard time admitting that I'm in that place.\"\n\nA followup to 2013's Smoke and Mirrors, his sixth studio album dives deep into loneliness, loss, and love and all its side effects. It's the sound of an artist working through his insecurities in song, and thereby letting go of them. But it's by no means a sad affair, nor is it the \"rainyday record\" Dennen initially thought he was making.\n\nOften framed by uplifting choruses and bright acoustic arrangements, these songs brim with optimism, the palpable sense that the tide is turning. \"And I want to love you for the way you are/ Not the way I am/ So let's go now/ Back to the bonfire where we began,\" he sings over a chugging groove on \"Bonfire.\"\n\nOn \"Where We Left Off,\" the album's emotional powder keg, Dennen lays himself bare over the slack strum of guitar and one of his most unvarnished vocals ever recorded. The opening lines go straight for the jugular: \"Everyone knows I'm a happy man/ But I haven't been right.\"\n\n\"Vulnerable was another word that kept coming up when I was making this record,\" Dennen admits. \"Is there something I'm scared to say? Can I dig a little deeper, reveal a little bit more? How far can I go That was my direction, and once I got that in place, I started shooting down things that weren't in that zone.\"\n\n\"I kept telling myself that all I have to do is be authentic and make the songs about the lyrics and how they interact with my guitar,\" he continues. \"I don't have to worry about whether they'll be on the radio or if they're different from my previous stuff.\"\n\nHoled up at Cobb's Nashville studio, with musicians the producer assembled, Dennen and Cobb worked fast and kept the songs rough around the edges. Dennen appreciated Cobb's insistence on capturing them in just a few takes. \"We recorded it the way people made records in the '60s - really fast, all on analog gear, very few rehearsals,\" he says. \"We didn't do anything more than five times. We didn't secondguess ourselves - we just went with it. It's not sloppy, but it's in that right place between loose and tight and feelgood but not labored.\"\n\nCobb adds, \"I worked with Brett because of his beautiful balance of wit and melody. He's very timeless in his writing and you really can hear his personality in every note he sings. The record was made totally live and we recorded all the vocals live with the band. It really was produced as stopped down as possible - we tried to make every note matter.\"\n\nMore than a decade after his selftitled debut catapulted him to stardom, Dennen was once again attracted to how he made his earliest recordings. \"My whole approach was that I wanted to write and sing the songs from the same place that I wrote the first record, which was a place of trying to discover who I am,\" he says.\n\nThat marked a detour from his most recent releases. With those he felt like he was exercising his craftsmanship - \"being a songwriter for the sake of being a songwriter,\" as he puts it. \"I really wanted this new album to come across as a whole piece,\" Dennen says. \"I consider it to be a batch of songs that all live together and complement each other.\"\n\nWhich brings us back to the album title. Please.\n\n\"What was I asking for with this album\" Dennen says. \"I wanted to be a good person and feel good about myself again, but in a way that I knew it was OK to be sad. That's part of life, the ups and downs. But with these songs, I want to make people feel good about themselves and about life through the good and bad.\"\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/718", "date": "2016-10-27T20:00:00-04:00", "name": "Brett Dennen w/ Lily and Madeleine 10/27/16 at Blind Pig - Ann Arbor", "source": "Facebook", "url": "https://www.facebook.com/events/1735261526750729/"}]