[{"date": "2016-07-24T10:00:00-04:00", "name": "The 2016 Ann Arbor Art Fair", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/", "source": "Facebook"}, {"date": "2016-07-24T10:00:00-04:00", "name": "State Street Art Fair", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "url": "https://www.facebook.com/events/487403974717996/", "source": "Facebook"}, {"date": "2016-07-24T12:00:00-04:00", "name": "Baby Back Ribs!", "description": "We're firing up grill this weekend and serving up our all natural baby-back ribs. Half-rack of ribs and our made in-house cole slaw, just $5. Oh, yes!", "url": "https://www.facebook.com/events/318864108456634/", "source": "Facebook"}, {"date": "2016-07-24T14:00:00-04:00", "name": "Guided Tour: Engaging with Art", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.\nEngaging with Art tours are generously supported by the Berkowitz Family Endowed Fund.", "url": "https://www.facebook.com/events/211191845942511/", "source": "Facebook"}, {"date": "2016-07-24T15:00:00-04:00", "name": "In Conversation: Pomp, Privacy, and Portraiture at 700 Nimes Road", "description": "This program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.\n\nIn 700 Nimes Road, photographer Catherine Opie creates a portrait of the icon Elizabeth Taylor by capturing the intimate spaces and personal treasures that make up the actress’s home in Bel Air, California. Join Assistant Curator of Photography, Jennifer Friess, for an exploration of how Opie’s images reveal facets of Taylor’s identity from the humble to the glamorous.\n\nCatherine Opie: 700 Nimes Road is organized by The Museum of Contemporary Art, Los Angeles. This exhibition is made possible with lead support provided by J.P. Morgan Private Bank and major support from Jamie McCourt, and Gilena Simons.\n\nLead support for UMMA’s installation is provided by the University of Michigan Health System, Bank of America and Merrill Lynch, and Alan Hergott and Curt Shepard. Additional generous support is provided by the University of Michigan Department of the History of Art, Department of Screen Arts and Cultures, and Department of American Culture.", "url": "https://www.facebook.com/events/1630667003917227/", "source": "Facebook"}, {"date": "2016-07-24T16:00:00-04:00", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "url": "https://www.facebook.com/events/243670042686210/", "source": "Facebook"}, {"date": "2016-07-24T19:00:00-04:00", "name": "Xanadu", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "url": "https://www.facebook.com/events/986732351446617/", "source": "Facebook"}, {"date": "2016-07-24T19:00:00-04:00", "name": "Open Stage", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/587266381434863/", "source": "Facebook"}, {"date": "2016-07-25T19:00:00-04:00", "name": "Peter Geye - Award Winning Author", "description": "Peter Geye received his MFA from the University of New Orleans and his PhD from Western Michigan University, where he was editor of Third Coast. He was born and raised in Minneapolis and still lives there with his wife and children. He is the author of multiple award-winning novels.\n\nA highly acclaimed novelist now gives us a true epic: a love story that spans sixty years, generations worth of feuds, and secrets withheld and revealed. \n\nThe two principal stories at play in \"Wintering \"are bound together when the elderly, demented Harry Eide escapes his sickbed and vanishes into the forbidding, northernmost wilderness that surrounds the town of Gunflint, Minnesota instantly changing the Eide family, and many other lives, forever. He d done this once before, more than thirty years earlier in 1963, fleeing a crumbling marriage and bringing along Gustav, his eighteen-year-old son, pitching this audacious, potentially fatal scheme winter already coming on, in these woods, on these waters as a reenactment of the ancient voyageurs journeys of discovery. \n\nIt's certainly something Gus has never forgotten, nor the Devil's Maw of a river, a variety of beloved (possibly fantastical) maps, the ice floes and waterfalls (neither especially appealing from a canoe), a magnificent bear, the endless portages, a magical abandoned shack, Thanksgiving and Christmas improvised at the far end of the earth, the brutal cold and sheer beauty of it all. And men hunting other men. \n\nNow with his father pronounced dead Gus relates their adventure in vivid detail to Berit Lovig, who d spent much of her life waiting for Harry, her passionate conviction finally fulfilled over the last two decades. So, a middle-aged man rectifying his personal history, an aging lady wrestling with her own, and with the entire saga of a town and region they d helped to form and were in turn formed by, relentlessly and unforgettably.", "url": "https://www.facebook.com/events/247351522324237/", "source": "Facebook"}, {"date": "2016-07-26T19:00:00-04:00", "name": "Acoustic Tuesdays: Heather Schwartz", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nHeather Schwartz \nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/259400431102202/", "source": "Facebook"}]