[{"name": "10% For Good for Community Action Network", "date": "2016-11-09T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "source": "Facebook", "url": "https://www.facebook.com/events/324709987912141/"}, {"name": "The Value of Branding - Jim Berline", "date": "2016-11-09T11:30:00-05:00", "description": "Learn the Value of Branding, for both business and personal with Jim Berline, Chairman, Berline | Advertising, Marketing & Digital Communications in Royal Oak.", "source": "Facebook", "url": "https://www.facebook.com/events/573236139529306/"}, {"name": "Anson Mills Special Dinner, #202", "date": "2016-11-09T19:00:00-05:00", "description": "On November 9th, 2016, Zingerman’s Roadhouse will be welcoming back Glenn Roberts for our Anson Mills Special Dinner #202. Glenn is not only nationally recognized as an artisan stone-miller, but he has devoted his life to rescuing endangered seeds we believe are crucial to preserving agricultural systems and full-flavored foods. Chef Alex and Glenn have put together a menu this year that will draw attention to the character of some of these reserved, land-raised grains and their regional histories. Don’t miss out on Anson Mill's return to Zingerman’s Roadhouse and the bountiful stories he’ll tell with his grains!", "source": "Facebook", "url": "https://www.facebook.com/events/676414982523008/"}, {"name": "Maya Barzilai & Rachel Seelig", "date": "2016-11-09T19:00:00-05:00", "description": "Literati is pleased to welcome Maya Barzilai and Rachel Seelig in support of their most recent works. \n\nIn the twentieth century the golem became a figure of war. It represented the chaos of warfare, the automation of war technologies, and the devastation wrought upon soldiers bodies and psyches. Golem: Modern Wars and Their Monstersdraws on some of the most popular and significant renditions of this story in order to unravel the paradoxical coincidence of wartime destruction and the fantasy of artificial creation. Due to its aggressive and rebellious sides, the golem became a means for reflection about how technological progress has altered human lives, as well as an avenue for experimentation with the media and art forms capable of expressing the monstrosity of war.\n\nMaya Barzilai is assistant professor of Hebrew literature and Jewish culture at the University of Michigan. She received her PhD in Comparative Literature from the University of California, Berkeley, in 2009. Her new book, Golem: Modern Wars and Their Monsters (NYU Press), explores how the infamous monster of clay became a metaphor of war and its destructive technologies across German, Israeli, and American cultures. Barzilai also researches Hebrew-German translation, Hebrew writing on World War I, and Jewish comics. \n\n*\n\nBerlin in the 1920s was a cosmopolitan hub where for a brief, vibrant moment German-Jewish writers crossed paths with Hebrew and Yiddish migrant writers. Working against the prevailing tendency to view German and East European Jewish cultures as separate fields of study, Strangers in Berlin is the first book to present Jewish literature in the Weimar Republic as the product of the dynamic encounter between East and West. Whether they were native to Germany or sojourners from abroad, Jewish writers responded to their exclusion from rising nationalist movements by cultivating their own images of homeland in verse, and they did so in three languages: German, Hebrew, and Yiddish. Author Rachel Seelig portrays Berlin during the Weimar Republic as a threshold between exile and homeland in which national and artistic commitments were reexamined, reclaimed, and rebuilt. In the pulsating yet precarious capital of Germany s first fledgling democracy, the collision of East and West engendered a broad spectrum of poetic styles and Jewish national identities. \n\nRachel Seelig is a fellow at the Frankel Institute for Advanced Judaic Studies at the University of Michigan. A native of Vancouver, Canada, she received her PhD from the University of Chicago in 2011 and has taught German Studies and Comparative Literature at the University of Toronto and the Hebrew University of Jerusalem. Her articles have appeared in various journals, including Prooftexts, Modern Language Notes, and The Jewish Quarterly Review. Rachel is currently co-editing a volume with Amir Eshel entitled The German-Hebrew Dialogue: Studies of Encounter and Exchange, which will be published by De Gruyter in 2017. Strangers in Berlin is her first book. \n\nEvent date: \nWednesday, November 9, 2016 - 7:00pm", "source": "Facebook", "url": "https://www.facebook.com/events/1690192754642162/"}, {"name": "Lemaitre at Necto", "date": "2016-11-09T21:00:00-05:00", "description": "TICKETS ON SALE NOW: http://bit.ly/1XZq5zj\n\nNecto & React Detroit presents...\n\nLemaitre\nwww.lemaitremusic.com\n\nsupport from\nChet Porter & Coucheron\n\nwww.necto.com\nwww.reactpresents.com\n\nDoors at 9pm | 18 & over welcome with proper ID \n\nNecto located at 516 E Liberty Street, Ann Arbor, MI 48104\nFor VIP services contact info@necto.com", "source": "Facebook", "url": "https://www.facebook.com/events/1254743334545390/"}, {"name": "10% For Good for Community Action Network", "date": "2016-11-10T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "source": "Facebook", "url": "https://www.facebook.com/events/324709987912141/"}, {"name": "Dave Eggers", "date": "2016-11-10T12:00:00-05:00", "description": "Literati is thrilled to welcome Dave Eggers back to Ann Arbor for a book signing! Please note the special time for this event: Dave will be available to chat and sign books from noon until 1:30pm. All of Dave's books, including the recently published Heroes of the Frontier, will be available for sale and signing.\n\nDave Eggers grew up near Chicago and graduated from the University of Illinois at Urbana-Champaign. He is the founder of McSweeney’s, an independent publishing house in San Francisco that produces books, a quarterly journal of new writing (McSweeney’s Quarterly Concern), and a monthly magazine, The Believer. McSweeney’s publishes Voice of Witness, a nonprofit book series that uses oral history to illuminate human rights crises around the world. In 2002, he cofounded 826 Valencia, a nonprofit youth writing and tutoring center in San Francisco’s Mission District. Sister centers have since opened in seven other American cities under the umbrella of 826 National, and like-minded centers have opened in Dublin, London, Copenhagen, Stockholm, and Birmingham, Alabama, among other locations. His work has been nominated for the National Book Award, the Pulitzer Prize, and the National Book Critics Circle Award, and has won the Dayton Literary Peace Prize, France’s Prix Médicis, Germany’s Albatross Prize, the National Magazine Award, and the American Book Award. Eggers lives in Northern California with his family.  \n\nEvent date: \nThursday, November 10, 2016 - 12:00pm to 1:30pm", "source": "Facebook", "url": "https://www.facebook.com/events/1759819450937369/"}, {"name": "Zell Visiting Writers Series: Celeste Ng", "date": "2016-11-10T17:30:00-05:00", "description": "Free and open to the public. Seating is first come, first served.\nCeleste Ng is the author of the novel Everything I Never Told You, which was a New York Times bestseller, a New York Times Notable Book of 2014, Amazon’s #1 Best Book of 2014, and named a best book of the year by over a dozen publications. Everything I Never Told You was also the winner of the Massachusetts Book Award, the Asian/Pacific American Award for Literature, the ALA’s Alex Award, and the Medici Book Club Prize. Her fiction and essays have appeared in One Story, TriQuarterly, Bellevue Literary Review, the Kenyon Review Online, and elsewhere, and she is a recipient of the Pushcart Prize. \n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64).", "source": "Facebook", "url": "https://www.facebook.com/events/970521929720288/"}, {"name": "Open Mic & Share feat The Remembrance Project", "date": "2016-11-10T19:00:00-05:00", "description": "Join us for the Ann Arbor launch of The Remembrance Project,  a centennial print, digital, and musical tribute to the Harlem Hellfighters. Told through letters, poetry, music, legends, and historical documents, REMEMBRANCE reveals the hearts and minds of people from different walks of life drawn into the “War to End All Wars.” It’s also a rare glimpse into the souls of black soldiers who fought for a higher ideal: Equality. \n\n Writer and multimedia producer H Buchanan will be accompanied by award-winning musician and composer Tracy Kash.  Signing to follow.\n\nThe event begins with an Open Mic session when area poets can read their own work or share a favorite poem by another author in a welcoming atmosphere. This is a monthly poetry series held on the second Thursday of most months at 7pm in partnership with Les Go Social Media Marketing and Training. \n\n“[The Remembrance Project] is vital to African American letters - the literary imagining of unspoken history about black lives that mattered but have not been visualized.\"  – Reginald Flood\n\nLearn more: http://www.remembranceproject.net/", "source": "Facebook", "url": "https://www.facebook.com/events/1578517672456559/"}, {"name": "CNC Router Class", "date": "2016-11-10T19:45:00-05:00", "description": "Stop by All Hands Active and learn how to use our Fireball CNC milling machine. With this machine you can have a computer cut and route specific designs into wood, pcbs, plastic, metal, and many more materials!\n\nFind more information about our machine here: http://www.allhandsactive.org/cnc-router/\n\nWe'll demonstrate the machine, teach basic safety, and give instruction on how to use 3 pieces of software to create designs for the machine.\n\nTaking this class certifies you to use the machine during public hours or during member only hours without supervision. 1) RSVP for this meetup. \n2) Bring the following form with you, signed - Liability - http://goo.gl/QXG5l \n3) Pay $15 Public/$10 members/free shift volunteers. Cash at the door or credit via Paypal. \n4) Optional: Bring scrap material to use on the router after the class (we're open till 10pm!)\n\nPaypal link: https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=KEQF3RMU5RPG4\n\nPlease include a note that you are signing up for the CNC class.", "source": "Facebook", "url": "https://www.facebook.com/events/1273308769375667/"}]