[{"description": "All week, all Garden of Life products are 35% off! That includes plant-based protein supplements, vitamins, and even special products just for kids. Stop in to chat with our friendly and knowledgable Natural Living team, and stock up on wellness!", "url": "https://www.facebook.com/events/144098819397112/", "source": "Facebook", "name": "35% Off Garden of Life", "date": "2016-11-10T08:00:00-05:00"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/324709987912141/", "source": "Facebook", "name": "10% For Good for Community Action Network", "date": "2016-11-10T08:00:00-05:00"}, {"description": "Literati is thrilled to welcome Dave Eggers back to Ann Arbor for a book signing! Please note the special time for this event: Dave will be available to chat and sign books from noon until 1:30pm. All of Dave's books, including the recently published Heroes of the Frontier, will be available for sale and signing.\n\nDave Eggers grew up near Chicago and graduated from the University of Illinois at Urbana-Champaign. He is the founder of McSweeney’s, an independent publishing house in San Francisco that produces books, a quarterly journal of new writing (McSweeney’s Quarterly Concern), and a monthly magazine, The Believer. McSweeney’s publishes Voice of Witness, a nonprofit book series that uses oral history to illuminate human rights crises around the world. In 2002, he cofounded 826 Valencia, a nonprofit youth writing and tutoring center in San Francisco’s Mission District. Sister centers have since opened in seven other American cities under the umbrella of 826 National, and like-minded centers have opened in Dublin, London, Copenhagen, Stockholm, and Birmingham, Alabama, among other locations. His work has been nominated for the National Book Award, the Pulitzer Prize, and the National Book Critics Circle Award, and has won the Dayton Literary Peace Prize, France’s Prix Médicis, Germany’s Albatross Prize, the National Magazine Award, and the American Book Award. Eggers lives in Northern California with his family.  \n\nEvent date: \nThursday, November 10, 2016 - 12:00pm to 1:30pm", "url": "https://www.facebook.com/events/1759819450937369/", "source": "Facebook", "name": "Dave Eggers", "date": "2016-11-10T12:00:00-05:00"}, {"description": "Free and open to the public. Seating is first come, first served.\nCeleste Ng is the author of the novel Everything I Never Told You, which was a New York Times bestseller, a New York Times Notable Book of 2014, Amazon’s #1 Best Book of 2014, and named a best book of the year by over a dozen publications. Everything I Never Told You was also the winner of the Massachusetts Book Award, the Asian/Pacific American Award for Literature, the ALA’s Alex Award, and the Medici Book Club Prize. Her fiction and essays have appeared in One Story, TriQuarterly, Bellevue Literary Review, the Kenyon Review Online, and elsewhere, and she is a recipient of the Pushcart Prize. \n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64).", "url": "https://www.facebook.com/events/970521929720288/", "source": "Facebook", "name": "Zell Visiting Writers Series: Celeste Ng", "date": "2016-11-10T17:30:00-05:00"}, {"description": "Join us for the Ann Arbor launch of The Remembrance Project,  a centennial print, digital, and musical tribute to the Harlem Hellfighters. Told through letters, poetry, music, legends, and historical documents, REMEMBRANCE reveals the hearts and minds of people from different walks of life drawn into the “War to End All Wars.” It’s also a rare glimpse into the souls of black soldiers who fought for a higher ideal: Equality. \n\n Writer and multimedia producer H Buchanan will be accompanied by award-winning musician and composer Tracy Kash.  Signing to follow.\n\nThe event begins with an Open Mic session when area poets can read their own work or share a favorite poem by another author in a welcoming atmosphere. This is a monthly poetry series held on the second Thursday of most months at 7pm in partnership with Les Go Social Media Marketing and Training. \n\n“[The Remembrance Project] is vital to African American letters - the literary imagining of unspoken history about black lives that mattered but have not been visualized.\"  – Reginald Flood\n\nLearn more: http://www.remembranceproject.net/", "url": "https://www.facebook.com/events/1578517672456559/", "source": "Facebook", "name": "Open Mic & Share feat The Remembrance Project", "date": "2016-11-10T19:00:00-05:00"}, {"description": "Stop by All Hands Active and learn how to use our Fireball CNC milling machine. With this machine you can have a computer cut and route specific designs into wood, pcbs, plastic, metal, and many more materials!\n\nFind more information about our machine here: http://www.allhandsactive.org/cnc-router/\n\nWe'll demonstrate the machine, teach basic safety, and give instruction on how to use 3 pieces of software to create designs for the machine.\n\nTaking this class certifies you to use the machine during public hours or during member only hours without supervision. 1) RSVP for this meetup. \n2) Bring the following form with you, signed - Liability - http://goo.gl/QXG5l \n3) Pay $15 Public/$10 members/free shift volunteers. Cash at the door or credit via Paypal. \n4) Optional: Bring scrap material to use on the router after the class (we're open till 10pm!)\n\nPaypal link: https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=KEQF3RMU5RPG4\n\nPlease include a note that you are signing up for the CNC class.", "url": "https://www.facebook.com/events/1273308769375667/", "source": "Facebook", "name": "CNC Router Class", "date": "2016-11-10T19:45:00-05:00"}, {"description": "Thu. November 10 | 18+ | $15 Cover\n\nTucker Beathard  wsg: Aubrie Sellers\nPresented by: 102.9 W4 Country\n\nTucker Beathard - Growing up in a family that excelled at both music and sports — his father is a hit songwriter; his brothers, star quarterbacks — Big Machine Label Group recording artist Tucker Beathard has an unrelenting competitive spirit: He wakes up every day trying to write the perfect song. For Tucker, a self-taught guitarist and drummer, there's no such thing as \"good enough.\"   \"I love anything with great melodies and I'm drawn to the little things,\" Tucker says, rattling off his influences with an artist's attention to detail. \"When I listen to Led Zeppelin, I focus on John Bonham's drums. Or Joe Walsh's guitar licks in the Eagles. And Hank Williams Jr.'s 'Family Tradition' is as country songwriting as it gets.\"  Tucker certainly knows something about family tradition, taking cues from dad Casey Beathard, who wrote Kenny Chesney's \"Don't Blink\" and Eric Church's \"Homeboy.\" The latter, in fact, was inspired by Tucker, who admits to going through his own rebellious phase.  Giving up a college baseball scholarship to dive headlong into songwriting, Tucker came out better for his diverse experiences and documented those wild times in the wise-beyond-its-years \"Momma and Jesus.\" The track is one of many in contention for his debut album, being overseen by producer Angelo Petraglia (Kings Of Leon).   With a rhythmic way of playing guitar, influenced by his innate drumming ability, Tucker has created some of contemporary country music's most progressive songs. \"Rock On,\" a song about regretting the girl that got away, is taut in its delivery, with clever turns of phrase. Likewise, \"20-10 Tennessee,\" a standout, uses a football game as metaphor for a relationship and “Better Than Me” puts a unique spin on an arena-ready breakup anthem, ultimately wishing the best for someone after parting ways.   \"I've always been a huge fan of deep songs, and I've always liked poems,\" he says. \"I'm an introvert, but writing songs that go beneath the surface allows me the chance to open up a piece of myself.\"   As does his engaging live show.  Having played with artists like Dierks Bentley, Keith Urban and Miranda Lambert, Tucker regularly bares his soul in front of a crowd. Despite his reserved demeanor, the stage is where he is most free — it's his canvas to paint an honest picture of who he is, as both a songwriter and an artist.   \"Expressing yourself onstage and putting your emotion into each song is a feeling that is tough to match. It's your way of letting the world know who you are,\" says Tucker, who has one main goal when performing. \"Whether it's 'My heart is broken' or 'Let's party tonight,' I want people to feel this is a real dude who knows who he is — and who says it like it is.\"", "url": "https://www.facebook.com/events/309962236060767/", "source": "Facebook", "name": "Tucker Beathard 11/10/16 at Blind Pig - Ann Arbor", "date": "2016-11-10T20:00:00-05:00"}, {"description": "react presents\n\n:: Klingande ::\n\nDoors at 9:00pm\n18+ Welcome\n\nNecto\n516 E. Liberty\nAnn Arbor, MI\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet", "url": "https://www.facebook.com/events/194317207644560/", "source": "Facebook", "name": "Klingande at Necto: Nov. 10th", "date": "2016-11-10T21:00:00-05:00"}, {"description": "All week, all Garden of Life products are 35% off! That includes plant-based protein supplements, vitamins, and even special products just for kids. Stop in to chat with our friendly and knowledgable Natural Living team, and stock up on wellness!", "url": "https://www.facebook.com/events/144098819397112/", "source": "Facebook", "name": "35% Off Garden of Life", "date": "2016-11-11T08:00:00-05:00"}, {"description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/", "source": "Facebook", "name": "Sweetwaters Westgate Grand Opening!", "date": "2016-11-11T08:00:00-05:00"}]