[{"date": "2016-10-19T18:00:00-04:00", "description": "This class will introduce you to MIG and TIG welding. You will learn the basic operations with an emphasis on safety. Maker Works has welding jackets and face shields for you to borrow. If you have a welding jacket, please bring it. With successful completion of this class, you will be certified to use the TIG and MIG welder.\n\nPlease arrive 10 minutes early if visiting Maker Works for the first time. $70\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=19&month=10&year=2016&view=day to sign up.", "url": "https://www.facebook.com/events/1760094844245246/", "name": "MIG / TIG Welding", "source": "Facebook"}, {"date": "2016-10-19T18:00:00-04:00", "description": "You've come to your local theatre/brewery to see the premiere of \"Happy Hour,\" a brand new play, only to find that you've stepped right into a space-time anomaly. The actors are all missing and the oblivious bartender doesn't know he's caught in a time loop - but he'll still serve you drinks! You and your team have one hour to find clues and solve puzzles in order to repair the timeline and, more importantly, escape the room. \n\nAdventure Lab is a new business specializing in escape rooms and other live-action puzzle games. If you enjoy puzzles, fun, adventures, games, or improving your small group communication skills, then you won't want to miss this unique event at Pointless!\n\nSelect the time and date you would like to attend. Each time slot is limited to 3-6 people.\n\nAdventures are:​\nWednesday, October 19 @ 6 pm\nWednesday, October 19 @ 8 pm\nWednesday, October 19 @ 10 pm", "url": "https://www.facebook.com/events/333437037006239/", "name": "Trappy Hour - an escape room adventure with a Halloween twist", "source": "Facebook"}, {"date": "2016-10-19T19:00:00-04:00", "description": "Literati is pleased to welcome Christine Sneed and Grace Tiffany, reading from their latest work. \n\nChristine Sneed is the author, most recently, of The Virginity of Famous Men. Her story collection Portraits of a Few of the People I've Made Cry won the Grace Paley Prize, Ploughshares’ John C. Zacharis Prize, and was a Los Angeles Times Book Prize finalist. Her debut novel Little Known Facts won the Society of Midland Authors award for best adult fiction and was named a top ten debut novel of 2013 by Booklist. Her latest novel is Paris, He Said. Sneed teaches at Northwestern University and DePaul University and lives in Evanston, Illinois.\n\nGrace Tiffany is the author of six historical novels set in the Renaissance or Middle Ages, including Will (Berkley 2004), My Father Had a Daughter (Berkley 2003), Ariel (HarperCollins 2005), The Turquoise Ring (Berkley 2005), Paint (Bagwyn Books 2013), and Gunpowder Percy (ACMRS 2016). A Shakespeare scholar and editor, a professor of English at Western Michigan University, and the author of two nonfiction works on Renaissance literature and culture, Grace Tiffany uses fiction as an additional medium for exploring the early modern world", "url": "https://www.facebook.com/events/1284592874904358/", "name": "Christine Sneed & Grace Tiffany", "source": "Facebook"}, {"date": "2016-10-19T19:00:00-04:00", "description": "Two nights of dark delights!\n\nWednesday October 19, and Wednesday, October 26!\n\nThis annual event will be one of your favorite events this fall!  Please call 734.222.9841 for reservations.  Seats are very limited.", "url": "https://www.facebook.com/events/1769515709996649/", "name": "Black Wine Night", "source": "Facebook"}, {"date": "2016-10-19T21:00:00-04:00", "description": "Wednesday, Oct. 19 | 9pm | 18+ | $10 Cover\n\nSeamlessly blending Funk, Soul, and Rock n’ Roll, THE MAIN SQUEEZE promises to keep your body moving with their infectious feel-good musical gumbo.\n\nThe energetic five-piece found its roots in Bloomington Indiana’s surprisingly vibrant live music scene, and they have been leaving audiences “Freshly Squozen” since 2010.\n\nTheir ability to fluidly blend and bend genres is unparalleled, and creates for an unforgettable live experience. Every performance is different from the last, showcasing each member’s virtuosic talent with soulful vocals, intricate jams, tight grooves and powerful solos.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/765", "url": "https://www.facebook.com/events/200433560358995/", "name": "The Main Squeeze 10/19/16 at Blind Pig - Ann Arbor", "source": "Facebook"}, {"date": "2016-10-20T12:00:00-04:00", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/", "name": "POP-X", "source": "Facebook"}, {"date": "2016-10-20T18:30:00-04:00", "description": "Come help us celebrate the difference you've made this year! Friends and family welcome. There will be a potluck dinner accompanied by fun games, presentations by NAP staff, and social time! This year's theme is Roaring 20's; costumes are encouraged! Let us thank you for all you've done for Ann Arbor's natural areas this year.  Please email us at NAP@a2gov.org or call 734.794.6627 to RSVP.", "url": "https://www.facebook.com/events/1775309142707137/", "name": "Volunteer Appreciation Potluck", "source": "Facebook"}, {"date": "2016-10-20T18:30:00-04:00", "description": "Volunteer Appreciation Potluck\nThursday, October 20\nCobblestone Farm, 2781 Packard Road\n6:30 to 9:30 p.m.\nCome help us celebrate the difference you've made this year! Friends and family welcome. There will be a potluck dinner accompanied by fun games, presentations by NAP staff, and social time! This year's theme is Roaring 20's; costumes are encouraged! Let us thank you for all you've done for Ann Arbor's natural areas this year. Please email us at NAP@a2gov.org or call 734.794.6627 to RSVP.", "url": "https://www.facebook.com/events/856469357818387/", "name": "Volunteer Appreciation Potluck", "source": "Facebook"}, {"date": "2016-10-20T19:00:00-04:00", "description": "NNA2 edition #39 is coming at you in all its vaguely Halloween-y glory! Filmmaker Jen Proctor will explore the paranormal communication and hear voiiiiiices from beyond - or at least, what believers claim are voices from beyond. Sara Wedell, who has read Laura Ingalls Wilder’s Little House books more times than you have, will reveal the sinister side on the prairie - a family of serial killers preying on pioneers. And superHERoes Chelsea Liddy and Amanda Reyes Aquino of Comique Con will talk about the evolving roles of women in the world of comics. So put on your smarty-pants glasses and come on out to raise a few beer glasses!\n \nWhen: Thursday, October 20, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: Free, thanks to your friendly neighborhood AADL!\n\n\nJen Proctor: Talking to the Dead: A History of Spirit Communication Technologies - Jen Proctor\n\nFrom the telegraph to mobile apps, from Poltergeist's televisual ghouls toUnfriended's possessed Skype sessions, from EVPs to spirit photography, this talk will explore the history of attempts to communicate with the dead using electric and electronic technologies. We'll see and hear terrifying and not-so-terrifying evidence of spectral messages, and examine what exactly constitutes evidence for investigators of the paranormal. GHOSTLY CAT VIDEOS WILL BE INCLUDED!\n\nAbout Jen: Proctor is a filmmaker, media artist, and Associate Professor of Journalism and Screen Studies at UM-Dearborn. She is currently working on a documentary about the relationship between technology, the paranormal, and spiritual belief. In her spare time, she studies abnormal feline behavior.\n\n\nSara Wedell: Little Slaughterhouse on the Prairie\n\nFrontier life in the 1870s was hard and the massive prairie held endless dangers - aside from the harsh elements, the grueling work, and the salt pork-heavy diet. This is the sinister side of Little House on the Prairie - the true story of a family of serial killers targeting pioneers on their way out West.\n\nAbout Sara: Sara Wedell is a production librarian at the Ann Arbor District Library and a Nerd Nite Ann Arbor Co-Boss. She knows it’s not cool to love Laura Ingalls Wilder, BUT SHE DOES IT ANYWAY. #sunbonnetsquad\n\n\nChelsea Liddy and Amanda Reyes Aquino: A History of Women in Comics\n\nWe'll discuss how women's roles in and in creating comic books have evolved over the past 100 or so years, as well as how things are changing and the future that Comique Con is helping to create.\n\nAbout Chelsea, Amanda, and Comique Con: ComiqueCon is a one-day celebration of the contributions of women to the sequential arts. Launched in 2015 in Metro Detroit, the event brings together comics all-stars and their fans for a wicked awesome day of comics and cosplay! Prior year featured guests have included Alex de Campi, Mikki Kendall, Marguerite Sauvage, Carey Pietsch, Nancy A. Collins and Mairghread Scott. In an industry that consistently under-solicits women, we’re spotlighting the work of women in comics and encouraging representation and inclusiveness.", "url": "https://www.facebook.com/events/1254549271243059/", "name": "Specters, Serial Killers, & SuperHERos", "source": "Facebook"}, {"date": "2016-10-20T19:00:00-04:00", "description": "This event will take place on our main floor.\n\nLiterati and the University of Michigan Rackham Graduate School are pleased to welcome Rackham alumna Melanie Sinche to discuss her latest book, Next Gen PhD: A Guide to Career Paths in Science.\n\nFor decades, top scientists in colleges and universities pursued a clear path to success: enroll in a prestigious graduate program, conduct research, publish papers, complete the PhD, pursue postdoctoral work. With perseverance and a bit of luck, a tenure-track professorship awaited at the end. In today’s academic job market, this scenario represents the exception. As the number of newly conferred science PhDs keeps rising, the number of tenured professorships remains stubbornly stagnant. Only 14 percent of those with PhDs in science occupy tenure-track positions five years after completing their degree.\n\nNext Gen PhD provides a frank and up-to-date assessment of the current career landscape facing science PhDs. Nonfaculty careers once considered Plan B are now preferred by the majority of degree holders, says Melanie Sinche. An upper-level science degree is a prized asset in the eyes of many employers, and a majority of science PhDs build rewarding careers both inside and outside the university. A certified career counselor with extensive experience working with graduate students and postdocs, Sinche offers step-by-step guidance through the career development process: identifying personal strengths and interests, building work experience and effective networks, assembling job applications, and learning tactics for interviewing and negotiating—all the essentials for making a successful career transition.\n\nSinche profiles science PhDs across a wide range of disciplines who share proven strategies for landing the right occupation. Current graduate students, postdoctoral scholars, mentors, and students considering doctoral and postdoctoral training in the sciences will find Next Gen PhD an empowering resource.\n\nMelanie V. Sinche is Director of Education at the Jackson Laboratory for Genomic Medicine.", "url": "https://www.facebook.com/events/1141271379301130/", "name": "Melanie V Sinche", "source": "Facebook"}]