[{"source": "Facebook", "date": "2016-04-30T10:00:00-04:00", "name": "Independent Bookstore Day!", "description": "Join us April 30th for Independent Bookstore Day! This is a free, all-day celebration of the bookstore. We will have one-of-a-kind items from authors such as Neil Gaimen (and many others) exclusively produced for Bookstore Day! Also:\n\n-Raffles\n-EXCLUSIVE Bookstore Day items\n-Photo booth (take a picture with a \"book you'd take to a deserted island!) provided by Photo Booth Plus Michigan!\n-First 50 people to buy a book get a free cafe drink! (Coffee, tea, or espresso) from The Espresso Bar!\n-Story time with children's author Diana Wege (11am)\n-Signed first editions\n-Displays featuring local and Michigan authors\n\nThis is a nationwide event involving over 400 bookstores around the country. We're proud to take part and thrilled to have your support. Join us!\n\nMore info: http://www.indiebookstoreday.com", "url": "https://www.facebook.com/events/599092686924913/"}, {"source": "Facebook", "date": "2016-04-30T10:30:00-04:00", "name": "Little Peeps PlayGround - \"Pirates\"", "description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "url": "https://www.facebook.com/events/1702271433391072/"}, {"source": "Facebook", "date": "2016-04-30T11:00:00-04:00", "name": "Meet NYT Bestselling Children's Author Andy Griffiths for a Discussion & Signing of His New Book, 'The 52- Story Treehouse'", "description": "Nicola's Books is THRILLED to be hosting a store event for NYT bestselling children's author Andy Griffiths. \n\nAndy Griffiths is one of Australia’s most popular children’s authors. Andy is best known for The Treehouse series, the JUST! books and The Day My Bum Went Psycho. Over the last 20 years Andy’s books have been New York Times bestsellers, adapted for the stage and television and won more than 50 Australian children’s choice awards. Andy, a passionate advocate for literacy, is an ambassador for The Indigenous Literacy Foundation and The Pyjama Foundation.\n\nAndy and Terry live in a 52-Story treehouse. (It used to be a 39-story treehouse, but they keep expanding.) It has a chainsaw-juggling level, a make-your-own-pizza parlor, a rocket-powered carrot-launcher, a life-size snakes and ladders game, a remembering booth, a Ninja Snail Training Academy and a high-tech detective agency, with all the latest high-tech detective technology, including the Disguise-o-Matic 5000!\nSomething that is sure to come in handy as they try to solve the mystery of: What happened to Mr. Big Nose? After all, it's hard to turn in your next book when your publisher has vanished!\nJoin \"New York Times-\"bestselling author Andy Griffiths and illustrator Terry Denton on another wild storytelling adventure in a series \"Publishers Weekly\" described as \"Anarchic absurdity at its best.\" Welcome to \"The 52-Story Treehouse...\"What are you waiting for? Come on up!", "url": "https://www.facebook.com/events/1697126153910182/"}, {"source": "Facebook", "date": "2016-04-30T12:00:00-04:00", "name": "International Tabletop Day 2016", "description": "International Tabletop Day is back and this year Vault of Midnight is going to make it better than ever. Founded in 2013 by Geek & Sundry, International Tabletop Day is a worldwide celebration of board-gaming awesomeness. Join your local community of board gamers and play the latest heavy hitters or revisit a classic.\n\nInternational Tabletop Day is a free, family friendly event for both tabletop enthusiasts and curious noobs alike. Join Vault of Midnight's staff and a small army of gaming experts at The Beer Grotto - we'll teach you all the rules and make recommendations on some new games that you might want to add to your game collection.\n\nExcelsior!", "url": "https://www.facebook.com/events/1711823135728044/"}, {"source": "Facebook", "date": "2016-04-30T12:00:00-04:00", "name": "Fresh + Fit!", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 12 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 12, in store or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse = 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "url": "https://www.facebook.com/events/110005266066559/"}, {"source": "Facebook", "date": "2016-04-30T13:00:00-04:00", "name": "Workshop: \"You're Such a Character\"", "description": "3-hour intensive character workshop, taught by League of Pointless Improvisers member Moni Jones! She's learned from some of Detroit's best character improvisers and she's excited to share the goods with YOU! She'll show videos, run excersizes to help you create strong characters, assist you in creating your own personal and detailed character bio and most all other things character related. Did we mention this is gonna be an absolute RIOT?! Sign up today:)", "url": "https://www.facebook.com/events/602716503227709/"}, {"source": "Facebook", "date": "2016-04-30T20:00:00-04:00", "name": "Pointless Improv with CSI and Question Marky Mark", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"CSI\"\n\nGroup 2: \"Question Marky Mark\" starring Aaron Johnstone, Erik Heilner, Amber Hunt, RJ Cach, and Travis Pelto\n\nGroup 3: \"The League of Pointless Improvisers\" starring Corene Ford, Jason Valentini, Julia Schroeder, Moni Jones, and Jake Russell", "url": "https://www.facebook.com/events/1691887031028215/"}, {"source": "Facebook", "date": "2016-04-30T21:30:00-04:00", "name": "Queens of Cups Burlesque Variety 4/30/16 at Blind Pig - Ann Arbor", "description": "Saturday, April 30 | 9:30pm | 18+ | $10 / under 21 $13\n\nQueen of Cups started with an ambitious show at the Michigan Theater in Ann Arbor MI. Pick a Card: a Burlesque Exploration of Tarot, was a successful, crowd founded, endeavor headed by Gala Delicious and co produced by Cruel Valentine. Gala Delicious has continued to produce theme shows, variety shows, Thrill Life figure drawing, and in costume live readings wit hThe Get Up Vintage. Favorite returning performers are Bunny Valentine, Red Rum (Chicago,) Dahlia Fatale (Chicago,) Mylitta La Fae, and many others!", "url": "https://www.facebook.com/events/811867332280940/"}, {"source": "Facebook", "date": "2016-04-30T22:00:00-04:00", "name": "Pointless Improv with Question Marky Mark and Love Handles", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Question Marky Mark\" starring Aaron Johnstone, Erik Heilner, Amber Hunt, RJ Cach, and Travis Pelto\n\nGroup 2: \"Love Handles\" starring James Quesada and Travis Pelto\n\nGroup 3: \"The League of Pointless Improvisers\" starring Corene Ford, Jason Valentini, Julia Schroeder, Moni Jones, and Jake Russell", "url": "https://www.facebook.com/events/215969065457384/"}, {"source": "Facebook", "date": "2016-05-01T13:00:00-04:00", "name": "Stewardship Workday - Arbor Day", "description": "Arbor Day in Michigan is the last Friday in April. We’re joining folks across the country in planting native shrubs and trees this weekend. As you can see from the photo, we do this work rain or shine (though not in thunderstorms). Meet at the park entrance on the west side of the park, at the end of Birch Hollow Drive, off Stone School Road. \nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "url": "https://www.facebook.com/events/246460939074982/"}]