[{"date": "2017-08-19T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/129495377658159/", "name": "Power Contained: The Art of Authority in Central and West Africa", "description": "Before colonization, complex hierarchical societies flourished in Central and West Africa. At their summits were a select few—kings and chiefs whose authority was derived from their direct connection to powerful ancestors and predecessors. These rulers were wrapped in expensive textiles or costly furs, and covered in beads and precious metals, materials that not only signaled their extraordinary status, but were also intended to safely contain the great power they wielded. The famous minkisi (meaning “power figure”) sculptures of Central Africa were similarly activated through the addition of charged materials. Textiles, animal skin, metal, and beads allowed the lifeless wooden carvings to be activated by local spiritual leaders in order to communicate with the realm of the ancestors and spirits. This exhibition explores the parallels between the adornment of the king’s physical body and minkisi. Drawing on works from UMMA’s collection and several loans, the exhibition demonstrates how authority was expressed and power contained across a range of historical cultures in Nigeria, Ghana, the Democratic Republic of the Congo and Cameroon.\n\nLead support for Power Contained: The Art of Authority in Central and West Africa is provided by the University of Michigan Office of the Provost and the African Studies Center."}, {"date": "2017-08-19T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/117418778916099/", "name": "Hatch Chile Bacon Havarti Burger Pop-up", "description": "It's Hatch Chile season, and they've found their way into our all natural burgers, along with Havarti cheese and our famous bacon. $5 a burger- grab one to go, or enjoy with a beer outside on our patio."}, {"date": "2017-08-19T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/154904088382130/", "name": "Ann Arbor Blues Festival", "description": "In 1969, the Blues threw a party, and everybody came.  This Summer, we're doing it again.  \n\nThe Ann Arbor Blues Festival\nMaking Ann Arbor Gyrate Again.  \n\nTickets On Sale Now!\n\nThe Official Lineup:\n\nBenny Turner & Real Blues with special guest Brandon \"Taz\" Niederaurer\nThe Nick Moss Band\nEliza Neals and the Narcotics \nThe Chris Canas Band\nThe Norman Jackson Band\nHank Mowery & the Hawktones featuring Kate Moss\nAlabama Slim\nTino G's Dumpster Machine\n\nWith acoustic sets by Blair Miller"}, {"date": "2017-08-19T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1247890135333943/", "name": "Icebreakers^2", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor."}, {"date": "2017-08-19T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/259726821210331/", "name": "Josh Rose, Judy Banker, and Ed Dupas", "description": "Josh Rose, guitar/singer/songwriter\nJudy Banker, guitar/singer/songwriter\nEd Dupas, guitar/singer/songwriter\n\nTrio – an evening of songwriters-in-the-round with acclaimed Michigan artists Josh Rose, Judy Banker and Ed Dupas. \n\n$25 Assigned Rows 1-2\n$15 Assigned Rows 3-5\n$10 General Admission\n$5 Student\n\nJOSH ROSE\n\n“Josh Rose’s songs come wrapped in brown paper with an old twine ribbon. These songs come from the soul and etch themselves into your fabric.”\n\nA songwriter’s songwriter, Josh Rose, grew up in the northern woodlands and fine tuned his songwriting in the borderlands. He has spent the past ten years touring the midwest, teaching, writing, and building a rich body of highly respected work. Josh is the type of writer who labors over every word, creating songs that get injected into the listener's permanent being. After his two previous studio albums, Firework Letdown and Slow Bloom, Josh is more than pleased to bring you his latest work, Old Laminate, featuring 12 well-crafted poignant songs that forge much, much deeper than the saccharine fare that completely dominates the automatic, entitled-consumer, popular music world of our day. \n\nThis music is much like a memorable meal: mood-evoking, fresh, and necessary. \n\nJUDY BANKER\n\n “Judy Banker is emerging as a premier songwriter with universal appeal. A singular unique talent and stage presence, her music is organic and soul-driven.” - Michael G. Nastos, Pulp Magazine Online, 88.3 WCBN-FM Ann Arbor\n\n“A monster singer/songwriter talent.” - John Bayerl, SeMiBluegrass.com\n\nRooted in 60’s folk and vintage country, Ann Arbor songwriter, singer, and acoustic guitarist Judy Banker explores familiar musical territory and delicately makes it her own. With a voice WXOU’s “The Old Front Porch Radio Show” host Maggie Ferguson describes as “tangy and bright as fall cider”, Judy takes cues from artists like Loretta Lynn to Gillian Welch, with intensely personal songwriting, sharing warm love songs, lamentations, and narratives reflecting on universal themes drawn from her own deep and rich life experiences. Though new to recording, with 2014’s debut Without You and 2016’s Devils Never Cry, Judy has long been a part of the Ann Arbor music scene.\n\nED DUPAS\n\n“Ed Dupas….(is) a worthy addition to those troubadours of truth and decay whose songs both resonate and reward.” - Lonesome Highway\n\n“…Straightforward blue-collar Country-Folk songs that could or should have come from the pens of Springsteen, Kristofferson or more recently Sturgill Simpson... “ - No Depression\n\n\nAmericana singer-songwriter Ed Dupas’ lived-in melodies unwind with reflective lyrics and speak to the current state of the human condition, soothing where possible, agitating where necessary, and seeking change where appropriate. Crafted from the heart, Ed’s music flows from an array of broad social themes to more personal narratives of love and loss. Rooted in both realism and idealism, Ed's musical goal is deeper inquiry and exploration for himself and his listeners. With comparisons ranging from Steve Earle to Bruce Springsteen, Ed creates and shares well worn wide awake music. Critics are already heaping on praise for Ed’s recently released his sophomore album, Tennessee Night."}, {"date": "2017-08-19T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1090618007737548/", "name": "Pointless Improv with Mysterious Puppy and Boxfan", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Mysterious Puppy \nGroup 2: Boxfan\nGroup 3: The League of Pointless Improvisers"}, {"date": "2017-08-19T22:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/434814980252389/", "name": "Pointless Improv with Boxfan and Mysterious Puppy", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Boxfan\nGroup 2: Mysterious Puppy \nGroup 3: The League of Pointless Improvisers"}, {"date": "2017-08-20T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1593428957342212/", "name": "Pedal to Pollinators Garden Bike Tour", "description": "Get ready for fun and inspiration at our first annual Pedal to Pollinators Garden Bike Tour. Native plant gardens at County Farm Park will be buzzing with activities.  Colorful wildflowers and their diverse insect visitors will be abundant.  Drop by the Project Grow Garden for a Heirloom Tomato Tasting, and learn about the Ark of Taste Garden. Stop by the UM Natural History Museum Pollinator Garden (temporarily relocated to County Farm Park) for kids activities.  This event is free and kid-friendly!  \n \nAt 2 PM and 3 PM, guided tours will leave County Farm Park by bicycle for a leisurely ride on side streets to Buhr Park. Along the way, bicyclists will visit several home gardens that feature native plants and wildlife habitat. Volunteers at Buhr Park will point out flowers and wildlife at the Children's Wet Meadows and the Edible Food Forest. \n \nAt 1:30, 2:30 and 3:30, UM Bee researchers will lead walking tours at County Farm Park to safely observe wild bees in action.\n\nTravel and Parking:  If traveling from a distance, please be aware that parking is limited. Both sites are on AATA bus routes. If coming by car, you may want to park in the neighborhood and walk or bike from there. \n\nEVENT HOSTS: Washtenaw County Parks, BeeSafe Ann Arbor, Slow Food Huron Valley, City of Ann Arbor Natural Areas Preservation, UM Department of Ecology and Evolutionary Biology, University of Michigan Museum of Natural History, Sierra Club Huron Valley Group, and Project Grow."}, {"date": "2017-08-20T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/311898775915568/", "name": "Stewardship Workday", "description": "Walk along Malletts Creek, watch the birds at the pond, play a game of disc golf, or ride your bike on the paved path – no matter what you’re doing in this park, you’re sure to see the effects of ongoing restoration work. Mary Beth Doyle Park has been transformed by volunteers! Help continue the effort by removing invasive weeds in the open areas of this park. Meet us on Verle Ave, off of Platt Road. Please wear long pants and closed-toe shoes. Every participant must present a completed release form, and all minors should be accompanied by a guardian. Tools, snacks, and know-how provided."}, {"date": "2017-08-20T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/108453579818656/", "name": "Guided Tour - Ernestine Ruben at Willow Run: Mobilizing Memory", "description": "In 2013, artist Ernestine Ruben (BSDEs ’53) photographed the once-famed industrial complex Willow Run in Washtenaw County, Michigan. Designed by her grandfather, Detroit architect Albert Kahn, for the Ford Motor Company, Willow Run was an exemplar of American defense manufacturing because of its efficient mass-production of B-24 Liberators during World War II. For this exhibition, Ruben overlaid interior views of the now-dormant factory with imagined glimpses into her body’s interior landscape. The resulting compositions seem to breathe energy and light into the stagnant and cavernous spaces of Willow Run and suggest a longing for a productive existence undeterred by mortality for both Willow Run and the artist.\n\nLead support for Ernestine Ruben at Willow Run: Mobilizing Memory is provided by the University of Michigan Office of the Provost and the Herbert W. and Susan L. Johe Endowment."}, {"date": "2017-08-20T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/116665038980187/", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor."}, {"date": "2017-08-20T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/765590783644457/", "name": "Last Open Mic of the Summer", "description": "One last open mic before the students get here and our regular season and schedule start.  Come on out and share some poems!"}, {"date": "2017-08-20T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/424839734576278/", "name": "Auditions for Cabaret", "description": "Ann Arbor Civic Theatre announces auditions for its main stage production of Cabaret, directed by Kat Walsh, with musical direction by Jennifer Goltz-Taylor, and choreography by Tyler Stickel. Auditions will take place Sunday and Monday, August 20 and 21, at 7:00 PM at Studio 3 Performing Arts Center, located at 6885 Jackson Rd., Ann Arbor, MI 48103. PLEASE NOTE: GENERAL AUDITION SESSIONS ARE OFFSITE. A map of the location may be found HERE. Callbacks will be Tuesday, August 22, at 7:00 at the A2CT Studio (322 W. Ann Street, Ann Arbor, MI 48104). Actors need only attend one of the general sessions (Sunday or Monday), and should plan to arrive just before 7:00 to fill out audition paperwork. Actors should be available for callbacks.\n \n\nIn a Berlin nightclub, as the 1920’s draw to a close, a garish Master of Ceremonies welcomes the audience and assures them they will forget all their troubles at the CABARET. With the Emcee’s bawdy songs as wry commentary, CABARET explores the dark, heady, and tumultuous life of Berlin’s natives and expatriates as Germany slowly yields to the emerging Third Reich. Cliff, a young American writer newly arrived in Berlin, is immediately taken by English singer Sally Bowles. Meanwhile, Fräulein Schneider, proprietor of Cliff and Sally’s boardinghouse, tentatively begins a romance with Herr Schultz, a mild-mannered fruit seller who happens to be Jewish.\n\n \nAUDITIONS are open to those 18 and older, due to the adult nature of the show. Auditions will begin promptly at 7:00 PM, so please plan to arrive a few minutes early to fill out audition information, most importantly a conflict calendar. Make sure you are prepared to note all your conflicts during the rehearsal period.\n\nVOCAL: Those auditioning should prepare 32 bars of a song that best demonstrates your range - please do NOT audition with songs from the show. Auditioners must provide sheet music, with cuts and necessary key clearly marked, for the accompanist.\n\nDANCE: You will learn four to eight 8-counts of a dance. Please be warmed up, ready to move when audition begins. Please wear clothing that you'll be able to move in. Preferably form fitting clothing that shows off your silhouette, or in style of the show. (Note: Form fitting clothing allows us to see the execution of the choreography better)\n\n\nWomen: Character shoes are preferred. No sneakers.\nMen: Jazz flats or Character shoes. No sneakers.\n*If you have neither, we will ask you to dance barefoot.\n\nPlease plan to stay for the duration of the general audition session.\n\nREHEARSALS will be Sunday-Thursday from 6:30-9:30 and will begin on August 31, with no rehearsal labor day weekend. \n\nThere will be a MANDATORY workshop for all those cast on Saturday, September 9 from 12-6 PM - actors MUST be available for this in order to be cast. Please note: no conflicts will be allowed from October 15 – October 29. NO EXCEPTIONS.\n\nPERFORMANCES are Thursday, October 26 – Sunday, October 29 at the Arthur Miller Theatre on UM’s North Campus.\n\nMORE INFO AND CHARACTER DESCRIPTIONS AT www.a2ct.org/audition"}, {"date": "2017-08-20T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/347458969021218/", "name": "The Arcade - A Pointless Improv Jam", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play, pay-what-you-can."}, {"date": "2017-08-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/430017790726815/", "name": "Danya Kukafka", "description": "Literati is pleased to welcome Danya Kukafka in celebration of her debut novel, Girl in Snow, named a Best Beach Read of 2017 by Elle, Yahoo, and Refinery 29. \n\nWhen a beloved high schooler named Lucinda Hayes is found murdered, no one in her sleepy Colorado suburb is untouched—not the boy who loved her too much; not the girl who wanted her perfect life; not the officer assigned to investigate her murder. In the aftermath of the tragedy, these three indelible characters—Cameron, Jade, and Russ—must each confront their darkest secrets in an effort to find solace, the truth, or both. In crystalline prose, Danya Kukafka offers a brilliant exploration of identity and of the razor-sharp line between love and obsession, between watching and seeing, between truth and memory.\n\nCompulsively readable and powerfully moving, Girl in Snow offers an unforgettable reading experience and introduces a singular new talent in Danya Kukafka.\n\n“From its startling opening line right through to its stunning conclusion, Girl in Snow is a perfectly paced and tautly plotted thriller. Danya Kukafka’s misfit characters are richly drawn, her prose is both elegant and eerie—this is an incredibly accomplished debut.”—Paula Hawkins, #1 New York Times bestselling author of The Girl on the Train and Into the Water \n\nDanya Kukafka is a graduate of New York University’s Gallatin School of Individualized Study. She currently works as an assistant editor at Riverhead books. Girl in Snow is her first novel."}, {"date": "2017-08-22T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1149522798527907/", "name": "Atlas Genius at the Blind Pig - Ann Arbor 8/22/17", "description": "Tue. August 22 | 7pm | All Ages | Tickets: $18\n\nThe Blind Pig Presents: Atlas Genius\n\nTickets: https://goo.gl/na34LY"}, {"date": "2017-08-22T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1173756839395687/", "name": "Thomas J. Kitson", "description": "Literati is delighted to welcome Thomas J. Kitson, translator for the novel Rapture by Iliazd\n\nAbout Rapture\nThe draft dodger Laurence yearns to take control of his destiny. Having fled to the highlands, he asserts his independence by committing a string of robberies and murders. Then he happens upon Ivlita, a beautiful young woman trapped in an intricately carved mahogany house. Laurence does not hesitate to take her as well. Determined to drape his young bride in jewels, he plots ever more daring heists. Yet when Laurence finds himself casting bombs alongside members of a revolutionary cell, he must again ask: is he a free man or a pawn of history?\n\nRapture is a fast-paced adventure-romance and a literary treat of the highest order. The author, Iliazd, entertains, with a deceptively light hand, questions that James Joyce, Virginia Woolf, and Thomas Mann once faced. How does the individual balance freedom and necessity, love and death, creativity and sterility? What is the role of violence in human history and culture? How does language both comfort and fail us in our postwar, post-Christian world?\n\nCensored for decades in the Soviet Union, Rapture was a novel nearly lost to Russian and Western audiences. This English-language translation rescues Laurence's surreal journey from the oblivion he, too, faces as he as he tries to outrun fate.\n\nThomas J. Kitson is a freelance translator in New York City."}, {"date": "2017-08-23T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/463502237354809/", "name": "BYOBG - Bring your own Board Game!", "description": "Bring a game! Bring your friends! \n\nPlay board games with your friends at Glasshouse Brewing on Wednesday, get happy hour while you play! That means $1 off pints. What a deal!"}, {"date": "2017-08-24T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/240568093086414/", "name": "Sonic Lunch / Joshua Davis - August 24th / Free 12PM", "description": "Bank of Ann Arbor's Sonic Lunch is an awesome outdoor summer concert series that rocks Ann Arbor's Liberty Plaza Thursdays at lunch time each summer. Look for news and announcements year-round and concerts to kick off in June 1, 2017. Sonic Lunch is free and open to all ages! Lawn chairs and furry friends are welcome.\nTell all your friends about one of the events that make summer in Ann Arbor super cool! \nBank of Ann Arbor appreciates the support of Ann Arbor’s 107one fm and Perich Advertising + Design.\n\n8/24 Joshua Davis \nJoshua Davis was raised in the folk tradition: the music, the social movements, the land. He writes songs that blend the roots of American music with gritty rock n’ roll and vintage soul. Performing Songwriter Magazine called the result, \"Some of the liveliest and most rocking roots music around. \nFor over 15 years Joshua has made his living sharing his songs, stories and knowledge across the US and Canada at festivals, concert halls, coffeehouses and dives – as a solo act, front man for roots ensemble \"Steppin’ In It\", classic swing band \"Shout Sister Shout\", songwriter showcase band \"The Starlight Six\" and frequently as a workshop facilitator, presenter or instructor. \nHis music is steeped in ragtime blues, sweet jazz and real country but Davis’s broad schooling in the cultural, political and musical roots of American tradition has resulted in more than a simple retelling of universal themes. Dubbed, \"the Michigan version of the Great American Songscape\" (Chris Reitz, Elderly Instruments), his catalog is a seamless snapshot of American past and present. Joshua has shared stages with a diverse list of luminaries, such as Tim O’Brien, Greg Brown, The Indigo Girls, Leftover Salmon, The Dixie Hummingbirds, Corey Harris, John Gorka, Jeff Daniels, Ellis Paul, The Blind Boys of Alabama, Jimmy LaFave, Ray Bonneville, Arlo Guthrie, Abigail Washburn, Larry McCray, Sunny Wilkinson, Catie Curtis, Bill Kirchen, Peter \"Madcat\" Ruth, Bernie Leadon, Wayne Hancock, The Verve Pipe, John Hammond, Pete Seeger and Preservation Hall Jazz Band.  Davis has released three critically acclaimed solo albums, five albums with Steppin’ In It, a record of jazz standards with Shout Sister Shout, and has appeared on too many albums to count. His most recent album, \"A Miracle of Birds\" is inspired by his travels in the Palestinian West Bank with non-profit organization On the Ground. About the album, Revue magazine says, \"His heartfelt documentation of 'people as people' offers up compassionate songs of hope, darkness and perseverance.\" \n\nJoshua has performed live on the internationally syndicated programs Mountain Stage, Woodsongs Old-Time Radio Hour and Backstage Pass. His songs have been featured on NPR’s All Songs Considered, Folk Alley and The Mix and he has played scores of prestigious festivals and venues not to mention every festival Michigan has to offer."}, {"date": "2017-08-24T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/106525593380891/", "name": "Wine Tasting", "description": "August is Old World Wine Month for our Wine Club, and we're opening up this wine tasting to the public!\n\nWe are featuring back to the future Italy, old wine varietals that you should drink today. Seating is limited and reservations are required, so call us today."}, {"date": "2017-08-24T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/154052318488192/", "name": "Sherry Stanfa-Stanley: Finding My Badass Self", "description": "Literati is pleased to welcome Sherry Stanfa-Stanley in support of her memoir, Finding My Badass Self: A Year of Truths and Dares.\n\nFighting midlife inertia, Sherry Stanfa-Stanley chose to stare down fear through The 52/52 Project: a year of weekly new experiences designed to push her far outside her comfort zone. These ranged from visiting a nude beach with her seventy-five-year-old mother in tow to taking a road trip with her ex-husband--and then another one with his girlfriend. She also went on a raid with a vice squad and SWAT team, exfoliated a rhinoceros (inadvertently giving him an erection), and crashed a wedding (where she accidentally caught the bouquet). While finding her courage in the most unlikely of circumstances, Sherry ultimately found herself. \n\nFor midlifers, fatigued parents, and anyone who may be discontent with their life and looking to shake things up, try new things, or just escape, Finding My Badass Self is proof it's never too late to reinvent yourself--and that the best bucket list of all may be an unbucket list.\n\nSherry Stanfa-Stanley is a writer, humorist, and squeamish adventurer. She writes about her midlife escapades and other topics on Facebook (The 52 at 52 Project) and also blogs at www.sherrystanfa-stanley.com. By day, Sherry attempts to respectably represent her alma mater as a communication director at The University of Toledo. An empty nester after raising Son #1 and Son #2, she now indulges a menagerie of badly behaved pets."}, {"date": "2017-08-24T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/121863461765070/", "name": "Grown Folks Story Time", "description": "***NOT FOR CHILDREN!!***\n\nThere may be PROFANITY, WRY HUMOR, AND PSEUDO-INTELLECTUAL BANTER!\n\nRemember being cozy under a blanket or cuddled up in your favorite library corner, listening while your teacher or librarian or parent read a book to you? We never really outgrow our love of hearing a good story read aloud. Some local authors want to bring that feeling back with GROWN FOLKS STORY TIME! \n\nLocal authors will read from books they enjoyed as kids (or whatever other books they feel like reading from) while you hunker down in your blanket (we'll keep the A/C humming!) and enjoy some snacks. \n\nPatti Smith, Ken MacGregor and David Pratt will choose books based on the theme of CHILDHOOD. And since this is Ann Arbor, maybe we will have a discussion too. Come join us and see what happens – your guess is as good as ours!"}, {"date": "2017-08-24T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/766479213523337/", "name": "Test Batch", "description": "Test Batch features the newest crop of improv groups in our community. Come and watch these troupes test their chops on the Pointless stage. When they are all inevitably famous, you can say \"I saw them way back when….\"\n\nHey improvisers - here's the link to sign up. The first 6 groups to sign up will get a 15 minute performance slot.\n\nhttps://goo.gl/forms/jAePm3GzZGg7bOO52"}, {"date": "2017-08-24T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/117304308899892/", "name": "107one Presents Current Swell at the Blind Pig", "description": "Current Swell's latest album released May 12th, 2017, produced Grammy-winning producer Jacquire King (Kings of Leon, Tom Waits, Norah Jones, Cold War Kids, Of Monsters and Men, James Bay) produced the album over four weeks in two vastly different locales: Nashville and Vancouver. Includes songs \"It Ain't Right\", \"Use Me Like You Do\" and \"When To Talk and When To Listen\" \n\nWSG: Timothy Monger\n\nDoors 8pm | 18+ | Tickets: http://www.ticketweb.com/t3/sale/SaleEventDetail?eventId=7587485&pl=blindpig&dispatch=loadSelectionData"}, {"date": "2017-08-24T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/597932630330992/", "name": "Gigamesh at Necto", "description": "React Detroit presents...\n\n:: Gigamesh ::\n\nSupport:\nRoman Martinez\nJonny Sum\n\nNecto Nightclub\n516 E. Liberty Street\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-08-25T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/118841612089162/", "name": "The Revolutionists by Lauren Gunderson - Michigan premiere", "description": "Four beautiful, bad-ass women lose their heads in this irreverent, girl-powered comedy set during the French Revolution. At the height of the Reign of Terror, activist playwright Olympe de Gouges, young assassin Charlotte Corday, revolutionary Caribbean spy Marianne Angelle and former queen Marie Antoinette hang out, plot murder and try to beat back extremist insanity in Paris. This political fantasia by the author of I and You considers how far we should go to keep society from sliding off of the rails.\n\n“The Revolutionists” by Lauren Gunderson - Playwright features Diane Hill, Melissa Beckwith, Kalyse Edmondson, and Sara S-Rose and is directed by David Wolber. The design team includes Forrest Hejkal (scenic and costume design), Carla Milarch (sound design), and Daniel C. Walker (lighting design).\n\nThis grand and dream-tweaked comedy is about violence and legacy, art and activism, feminism and terrorism, compatriots and chosen sisters, and how we actually go about changing the world. It is a true story. Or total fiction. Or a play about a play. Or a raucous resurrection… that ends with a song and a scaffold."}, {"date": "2017-08-25T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/242312606278651/", "name": "Drink & Draw / Imbibe & Inscribe", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor."}, {"date": "2017-08-25T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1770315653005057/", "name": "Stormy Chromer WSG Biomassive and Liquid Thickness", "description": "Stormy Chromer returns to the Blind Pig in downtown Ann Arbor for a hometown throwdown with special guests Biomassive (Traverse City) and Liquid Thickness (Ypsilanti).\n\nBring your dancin' pants and your boogy socks because this is a night that's sure to rock!\n\nDoors: 8:00 pm\nMusic: 9:00 pm\nCover: $10\n\nSet times TBA"}, {"date": "2017-08-25T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/488053438215900/", "name": "Acoustic Music Night feat. James Henes", "description": "Welcome James Henes as he performs a 2 hour acosutic performance for our guests!\n\nFrom metal head to singer/ songwriter James Henes has had a musical journey that has crossed vast genres of the world’s one universal language....\n\nArmed with an open book policy on lyrics, James Henes, wearing his heart on his sleeve shows honesty that counters the contrived songs of the day. James Henes believes in one rule when it comes to writing a song…whatever will make a song better will become part of the song."}, {"date": "2017-08-25T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/305677719900096/", "name": "Pointless Improv with Cocky But Affordable and Brenda", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Cocky But Affordable \nGroup 2: BRENDA (FKA Shadow League)\nGroup 3: The League of Pointless Improvisers"}, {"date": "2017-08-25T22:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/181297945743991/", "name": "A Pointless Display of Improvised Feats", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\nNo two shows are the same!\nTickets are $10."}, {"date": "2017-08-26T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/481059208910653/", "name": "Stewardship Workday", "description": "A patch of dry prairie lines the Border-To-Border Trail in this park along the river, with many plants that are uncommon in our area. Help maintain this patch of special habitat by hand-pulling exotic weeds. We will meet at the main parking area off Barton Drive. Please wear long pants and closed-toe shoes. Every participant must present a completed release form, and all minors should be accompanied by a guardian. Tools, snacks, and know-how provided."}, {"date": "2017-08-26T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/663682193830268/", "name": "Ann Arbor Bonsai Society Show & Sale", "description": "The art of bonsai is more popular than ever. For a look at the bonsai world and its plants and people, check out this popular annual show presented by the Ann Arbor Bonsai Socety. Event includes a display of over 100 bonsai, demos in the bonsai and penjing garden at Matthaei, bonsai accessories and materials for sale, Peoples’ Choice awards, and more. $3 admission per adult (12 and under free) payable at the door."}, {"date": "2017-08-26T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/2149780635248617/", "name": "Gloss: Modeling Beauty", "description": "Focusing on the prominent role of women as the subject of photography, GLOSS: Modeling Beauty explores the shifting ideals of female beauty that pervade European and American visual culture from the 1920s to today. The exhibition features images of sleek and poised female models and celebrities destined for the glossy pages of fashion magazines and catalogs by leading photographers such as Edward Steichen, Philippe Halsman, Helmut Newton, Andy Warhol, and Guy Bourdin. Outside of commercial advertising practice, documentary photographers Elliott Erwitt, Joel Meyerowitz, and Ralph Gibson portray candid images of fashionable women on city streets and mannequins in shop windows, resulting in intriguing juxtapositions of haute couture and everyday life. And artists James Van Der Zee, Eduardo Paolozzi, and Nikki S. Lee employ the visual strategies of traditional fashion photography, while offering alternative narratives to mainstream notions of female beauty.\n\nLead support for Gloss: Modeling Beauty is provided by Bank of America and Merrill Lynch. Additional generous support is provided by the University of Michigan Institute for Research on Women and Gender."}, {"date": "2017-08-26T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1980680418844656/", "name": "Intermural: Family Day Activities", "description": "Join us for an interactive Family Day of fun! Help the Intermural artists complete their murals on the second floor and then create your own Mural Monsters in our 3rd floor studios. All supplies will be provided for this free all-ages event!\n\nLearn more about Intermural: https://goo.gl/4aPS4A"}, {"date": "2017-08-26T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/444506292602224/", "name": "Improv Workshop: Get Out of Your F***ing Head!", "description": "This mega fun workshop is centered on quieting the mind, relieving anxiety, and learning how to relax while improvising. We'll focus less on the practice of improv and more on dealing with that nagging voice in your head. You'll have a blast as you explore simple tools and exercises to combat show stress and stay more focused on stage. I'll teach you how to push aside nerves to get the most out of your performance. Great for newbies as well as seasoned improv veterans!\n\nInstructor: Cara Trautman\nPrerequisite: All levels welcome\nWorkshop Length: 3 Hours\nWorkshop Size: Maximum of 16 students\nCost: $30"}, {"date": "2017-08-26T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1970650846545005/", "name": "LezRead: August - Roxane Gay's Hunger: A Memoir of (My) Body", "description": "For August, we'll be reading Hunger: A Memoir of (My) Body by Roxane Gay. Roxane, who also authored Bad Feminist, provides \"[a]n intense, unsparingly honest portrait of childhood crisis and its enduring aftermath.\" http://www.roxanegay.com/hunger/  \n\nAnnouncements:\n- Save the Date for OUTFest and Pride Picnic, August 4-6, https://www.a2outfest.com/\n---\nPublisher's Description:\nHunger: A Memoir of (My) Body, Roxane Gay, https://www.harpercollins.com/9780062362599/hunger\n \nFrom the New York Times best-selling author of Bad Feminist, a searingly honest memoir of food, weight, self-image, and learning how to feed your hunger while taking care of yourself. \n \n“I ate and ate and ate in the hopes that if I made myself big, my body would be safe. I buried the girl I was because she ran into all kinds of trouble. I tried to erase every memory of her, but she is still there, somewhere. . . . I was trapped in my body, one that I barely recognized or understood, but at least I was safe.” \n \nNew York Times bestselling author Roxane Gay has written with intimacy and sensitivity about food and bodies, using her own emotional and psychological struggles as a means of exploring our shared anxieties over pleasure, consumption, appearance, and health. As a woman who describes her own body as “wildly undisciplined,” Roxane understands the tension between desire and denial, between self-comfort and self-care. In Hunger, she casts an insightful and critical eye on her childhood, teens, and twenties—including the devastating act of violence that acted as a turning point in her young life—and brings readers into the present and the realities, pains, and joys of her daily life. \n \nWith the bracing candor, vulnerability, and authority that have made her one of the most admired voices of her generation, Roxane explores what it means to be overweight in a time when the bigger you are, the less you are seen. Hunger is a deeply personal memoir from one of our finest writers, and tells a story that hasn’t yet been told but needs to be.  \n---\nAbout LezRead\nLezRead is Ann Arbor's premier book club for lesbians.  We meet on the fourth Saturday of the month from 4-6PM at the Jim Toy Community Center.\n* As always, we'll spend the first hour talking literature at JTCC, and the second hour having drinks/snacks at the the Aut Bar.\n* Don't forget that we take up a small collection for use of the Community Center. If you can, please bring a small cash donation.\n* New members welcome! Email kerenem@jimtoycenter.org to join the private Facebook group."}, {"date": "2017-08-26T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/124441241508081/", "name": "Icebreakers^2", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor."}, {"date": "2017-08-26T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/101972240525097/", "name": "August Picnic", "description": "It's time for the last picnic of the year at German Park! Looking forward to a great August. Enzian will be the band this month. Please go to germanpark.org for more information, or email or message us with questions! \n\nFor your convenience, I have copied from our website some of the front gate rules. Please reach out with any questions!\n\nGerman Park is committed to a tradition of hospitality. \nWe want everyone to have a good time and \nto ensure their safety.\nOur gatehouse team is responsible for enforcing these requirements and may refuse entry to any individual if necessary.\nAdmission gate closes at 9 pm\n$5 per person (12 and under are free)\nNo re-entry\nActive military service free admission with ID\nNO ONE UNDER 21 ADMITTED without parent/guardian\nPhoto ID required\nNo credit/debit cards or checks accepted\nPicnic baskets, coolers, food or beverages may not be brought in\nPets are not allowed at the park\nSmoking prohibited except in designated smoking area"}, {"date": "2017-08-26T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1414303055330003/", "name": "Ann Arbor Film Festival Walk Right-In 2017", "description": "Ann Arbor Film Festival OUTDOOR WALK-IN THEATER @ Water Hill\n\nSaturday August 26, 2017\n\n7:30pm-11:30pm\n\nFood, Drinks, and Film. \n\nFeaturing\nHighlights from the 55th AAFF Tour with a few surprises\n\nBYO blanket or chair and bug spary.\n\nSuggeted donation $5\n\nSee you there!"}, {"date": "2017-08-26T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1951760325060212/", "name": "Donald Sinta Quartet", "description": "$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nDan Graser, soprano saxophone\nZach Stern, alto saxophone\nJoe Girard, tenor saxophone\nDanny Hawthorne-Foss, baritone saxophone\n\n\nSince forming in November of 2010, The Donald Sinta Quartet (DSQ) has quickly achieved international renown for their recitals, concerto performances, completely memorized presentation, and championing of the very latest repertoire from emerging young composers. Hailing from across the country, DSQ is named for legendary University of Michigan Saxophone Professor Donald Sinta, the group's mentor. \n\nDSQ have distinguished themselves on the competition circuit, making history by being the first saxophone quartet ever to win the Elmaleh 1st Prize in the Concert Artists Guild International Competition in NYC, having been chosen by a unanimous vote of the jury. The group also received the Alice Coleman Grand Prize at the 2013 Coleman International Competition in Los Angeles, and 1st Prize at the North American Alliance Saxophone Quartet Competition in Arizona. Upcoming performances include recitals at Market Square Concerts, Chamber Music Society of Detroit, University of Delaware, Kravis Center in West Palm Beach, St. Bonaventure University, a concerto performance in Strasbourg, France with the Paris Garde Républicaine Band as well as multiple performances with the Reno Philharmonic in 2016.\n\nDSQ were the featured soloists with the University of Michigan Symphony Band during the historic 2011 tour through Beijing, Shanghai, Tianjin, Shenyang, Xian, Hangzhou, and Los Angeles. The group performed in some of the most prestigious concert halls in the world including the National Center for the Performing Arts in Beijing and Walt Disney Concert Hall in Los Angeles. Tour performances also featured DSQ at the Shanghai Conservatory, Hanban Headquarters, as well as a performance for the students of the Youth Orchestras of Los Angeles. Their concerto performances featured the world premiere of Pulitzer Prize winning composer William Bolcom’s Concerto Grosso for Saxophone Quartet and Band. In addition to their China tour performances, DSQ have also performed this work with the Dallas Wind Symphony in Texas. They can be heard performing this work on the Michigan Symphony Band’s recording Artifacts. Recent reviews of the recording praised the quartet as, “Immensely entertaining..Really superb musicians! (Audiophile Audition),” and, “The highlight of the album…(American Record Guide).”\n\nFollowing their performances in China, DSQ maintained a national and international touring schedule with recitals at the 16th World Saxophone Congress in St. Andrews, Scotland; Thessaloniki, Greece for the 2012 International Society for Music Education Conference; a 2013 tour through Paris with recital/clinics at the Paris Conservatory, Versailles Conservatory, and Selmer Paris showroom; and performances in Geneva and Montreux, Switzerland at CERN and the Montreux International Jazz Festival. Other recent recital performances include Carnegie Hall, the Greene Space, and Merkin Hall in NYC, Corpus Christi Chamber Music Society, Purdue Convocations, Chamber Music North, Princeton Summer Concerts, Rockport Chamber Music, the Chautauqua Institution, the Great Lakes Chamber Music Festival, Music from Angel Fire, and the Detroit Institute of the Arts. DSQ have also made radio appearances on New York’s WQXR and Interlochen Public Radio, and have been featured frequently on American Public Media’s Performance Today.\n\nEqually committed to education and community engagement, the quartet has presented clinics and performances at numerous colleges and universities including the University of Michigan, Michigan State University, the University of Massachusetts at Amherst, SUNY-Potsdam’s Crane School of Music, as well as a residency at Grand Valley State University. DSQ have also presented workshops and performances at Saline High School (MI), public schools and universities in Dallas as part of a residency with the Dallas Wind Symphony (TX), and two tours through the Wappingers Central School District (NY).\n\nDSQ’s repertoire spans centuries and encompasses the great string quartet repertoire of Dvorak, Schubert, and Shostakovich, as well as numerous saxophone standards and several new commissions and premieres by today’s emerging young composers. To this end, DSQ has initiated an annual National Saxophone Quartet Composition Competition for new music from student composers. DSQ are managed by Concert Artists Guild (www.concertartists.org) and are Selmer-Paris Artists, performing on Selmer Paris Saxophones exclusively."}, {"date": "2017-08-26T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/127297771213779/", "name": "Pointless Improv with Poppin' Buttons and Lady Parts", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Mysterious Puppy \nGroup 2: Lady Parts\nGroup 3: The League of Pointless Improvisers"}, {"date": "2017-08-26T21:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/163400304225737/", "name": "The Macpodz at the Blind Pig ", "description": "Celebrating birthdays and our favorite rock club the Blind Pig and celebrating things which we're not even allowed to tell you about yet."}, {"date": "2017-08-26T22:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/148220382424787/", "name": "Pointless Improv with Lady Parts and Poppin' Buttons", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Lady Parts\nGroup 2: Mysterious Puppy \nGroup 3: The League of Pointless Improvisers"}, {"date": "2017-08-27T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/655522174654073/", "name": "Victors for Art: Michigan’s Alumni Collectors—Part II", "description": "Guided Tour\nCommemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni on the global art world. This exhibition features works collected by a diverse group of alumni and the artworks themselves span 3,500 years of art making. Victors for Art offers visitors an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not together. Presented in two parts—Figuration (February 18-June 11, 2017) and Abstraction (July 1-October 29, 2017), this second part, Abstraction, invites visitors to explore the pleasures of abstraction across a wide range of media, eras, and\ngenres. UMMA docents will explore the work of artists such as Pablo Picasso, Alberto Giacometti, Louise Nevelson, Christo, Lorna Simpson, José Parlá, Kenojuak Ashevak, and Do Ho Su, as well as other treasures such as a fifth-century Korean roof end tile, and an Amish quilt.\n\nLead support for Victors for Art: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, Michigan Medicine, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office."}, {"date": "2017-08-27T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/135487643709920/", "name": "An Afternoon with Susan Chastain", "description": "Susan Chastain, vocals\nPaul Keller, bass\nOther Artists TBA\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nKCH is proud to welcome home Susan Chastain, celebrated jazz vocalist and owner/impressaria of the Firefly Club of many years.\n\nSusan Chastain made her public debut at age three, performing in her mother's bar in Oklawaha, Florida, singing along with Patti Page records on the jukebox. Susan has sung with Paul Keller's big band since 1991 when she was a waitress at the Bird of Paradise jazz club. Susan went on to do extraordinary things for the jazz community as owner of Ann Arbor's famous Firefly Club. For ten years, the Firefly Club presented top-quality jazz and blues seven nights a week. Susan's vision, dedication and tireless efforts made the Firefly Club a well-loved destination for jazz musicians and jazz fans alike. The Firefly Club hosted a myriad of jazz and blues talent including Benny Golson, Monty Alexander, Jeff Hamiton, David \"Fathead\" Newman, Mulgrew Miller, Danilo Perez, Mose Allison, Greg Osby, Dave Liebman, Mose Allison, Patricia Barber, Janis Siegel, Big Bill Morganfield, Elmore James, Jr., Alvin Youngblood Heart, Tim Ries, Barbara Morrison, Kermit Ruffins, Mark Elf, Roseanna Vitro, The Clayton Brothers, Eric Reed, Maria Muldaur, Brian Auger, Johnny Varro, David Sanchez, Tierney Sutton, and Karrin Allyson. Even more importantly, Susan and the Firefly Club provided a home for the many local jazz musicians to who thrived there thanks to her generosity and nurturing. Sadly, the Firefly Club closed its doors permanently in August of 2009.\n\nNow, Susan splits her time between Ann Arbor, MI and St. Augustine, FL where she can be near her grandson Atreyu. Susan Chastain remains a valued member of the Paul Keller Orchestra (which plays every Monday night at Zal Gaz Grotto), and Paul Klinger's Easy Street Jazz Band (which plays every Tuesday from 5:30 till 8:30 at Zal Gaz Grotto in Ann Arbor for the popular Dixieland Happy Hour). She has accompanied the PKO on their two European tours and appears on five of their CDs (www.pkorecords.com), and she appears on all four of the Easy Street Jazz Band CDs. Susan has performed at all of the Michigan-area jazz festivals. Susan is featured prominently on her 2005 CD “Steady Gig” with the Paul Keller Ensemble. On “Steady Gig,” Susan sings 11 of her favorite standards with memorable musical arrangements by Keller. Susan's rich alto voice, relaxed style and personal warmth shine throughout this recording. Her newest venture is a non-profit organization called The Jazz Greenhouse, which focuses on jazz education for young musicians, and presenting jazz in non-traditional venues for the benefit of the community, with special emphasis on children and senior citizens."}, {"date": "2017-08-27T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/256786084839722/", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor."}, {"date": "2017-08-27T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/149997122211288/", "name": "God Module : Does this Stuff Freak You Out? US Tour- ANN ARBOR", "description": "Factory presents...\n\nGOD MODULE : Does this Stuff Freak You Out? US Tour\n\nwith Blakk Glass, Midnight Myth & Visions in Black\n\nGod Module combines elements of harsh Techno, Darkwave, Goth and Industrial. Pounding beats mix with hypnotic synth hooks, deranged film samples and psychotically-effected vocals to make up a sound that is as disturbing as it is danceable.\n\nWatch: https://www.youtube.com/channel/UCqb8c0OWuMAMIzIaLcv1w6A\nListen: https://soundcloud.com/god-module\nTalk: https://twitter.com/God__Module\nMeet: https://www.facebook.com/godmodule/\nPeek: https://imgrum.me/user/Godmodule\n\nDoors at 7pm • 18 & over welcome with valid proper ID • VIP services available, contact: VIP@necto.com"}, {"date": "2017-08-27T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/2025017901059523/", "name": "Open Stage", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 8 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters.\n\nSpace is limited, so the first 12 to sign up get a spot!\n\n​Sign up here: https://goo.gl/forms/wi2xBVkQ8eFSa8RD3\n\nFree for performers, pay-what-you-can for spectators."}, {"date": "2017-08-28T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1699072953727875/", "name": "Harvest Special Dinner #213: An Evening with Joan Nathan", "description": "Cookbook author Joan Nathan sows seeds of tradition, right here at Zingerman’s Roadhouse!\n\nJoan is a James Beard Award-winning cookbook author (and a University of Michigan grad), and with her 11 books has gathered timeless and delicious experiences from the far corners of the world. She will share the bounty of her latest collection with us as we recreate several recipes from her latest book, King Solomon's Table: A Culinary Exploration of Jewish Cooking from Around the World. Inside, readers will find more than 170 recipes, from Israel to Italy to India and beyond.\n\nWe will not only taste recipes that have planted the seeds for Jewish cuisine, but the “queen of American Jewish cooking” (Houston Chronicle), will weave rich stories from across the ages as we explore the treasure that is King Solomon's Table. Don’t miss out on this incredible dinner, and a one-of-a-kind opportunity to purchase a signed copy of Joan’s nationally acclaimed new  book!"}, {"date": "2017-08-28T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/2189039111322369/", "name": "Chuck Carlise and Susanna Lang", "description": "Literati is pleased to welcome Chuck Carlise and Susanna Lang for the latest installment of Poetry at Literati.\n\nChuck Carlise is the author of the brand new collection, In One Version of the Story (New Issues Press 2016), as well as the chapbooks, A Broken Escalator Still Isn’t the Stairs (winner of the Concrete Wolf Poetry Series 2011) and Casual Insomniac (Bateau, winner of the Boom Chapbook Prize 2011). His poems and essays appear in numerous journals and anthologies, including Best New Poets in both 2012 and 2014. He is currently a Lecturer in writing, rhetoric, and cultural studies at the University of California, Santa Cruz.\n\nIn One Version of the Story is a lyric exploration of the ways human beings confront desire, loss and absence by creating stories. Its narrative situation begins with from the French folk legend of “l’Inconnue de la Seine”—the unidentified young woman who drowned herself in Paris in the 1880s, and whose (unauthorized) death mask was eventually cast as the face of Resusci-Anne CPR training dummies—but eventually the book encompasses a chronicle of personal loss, a history of photography, a study of the mechanics of breathing, and a solo climb to the rim of a Mediterranean volcano.\n\nThe book is a hybrid of narrative history, lyric meditation, and journalistic investigation, often implicating the speaker (and reader) in the act of mythmaking itself. It is story-making itself which is interrogated here, however the book seeks not to recreate narratives, but rather to understand why they matter—why and how we give them the meaning that we do.\n\n*\n\nSusanna Lang was born in New York and raised in college towns where her father taught in Kansas, Michigan and Connecticut. Her first collection of poems, Even Now, was published by The Backwaters Press in 2008, and her chapbook, Two by Two, came out with Finishing Line Press in 2011. A full-length collection, Tracing the Lines, was published by Brick Road Poetry Press in spring 2013. Words in Stone, her translation of poems by Yves Bonnefoy, was published by the University of Massachusetts Press in 1976; The Origin of Language, prose poems by Yves Bonnefoy, was published by George Nama in 1979. She won a 1999 Illinois Arts Council Award and the Inkwell Poetry Competition in 2009, was a 2010 and 2015 Hambidge Fellow, and received an 2011 Emerging Writer Fellowship from The Writer’s Center in Bethesda, MD. A longtime educator in the Chicago area, she has taught literacy and literature in grades 5-12, and led adult poetry workshops in public libraries and for organizations such as the Illinois Writing Project, Northwest Cultural Council, and others. Her most recent book is Travel Notes from the River Styx (Terrapin, 2017). \n\nIn the earnest and beautiful Travel Notes from the River Styx, Susanna Lang peers into the tiny mirrors of a river’s current, the mirror her father cannot see himself in, the rearview mirror in which she spies sandhill cranes on an afternoon drive as she interrogates the natural and, at times, unnatural world. The result is a collection of double images: the moon a “copper coin with the sheen worn off,” “the flag [that] slips down the pole,” the country where her grandmother was born once called Russia, now Ukraine. As clear in its language as it is rich in argument, there’s something for everyone in Travel Notes, for travelers are exactly what this poet proclaims we are. It’s impossible to read this collection without wondering what doubles wait/lurk/reside beneath the skin of our bodies and of our world.\n             —Andrew McFadyen-Ketchum"}, {"date": "2017-08-28T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1414498181967708/", "name": "Straight Up | Featuring Natalie Berry & Trevor Stone", "description": "After Intermural's Happy Hour at the Art Center (5 to 7pm) come join us at Alley Bar for August's Straight Up! We will be having a one night only, pop-up art show and sale featuring work by Intermural artists Natalie Berry & Trevor Stone. Enjoy art, music & drink specials all night.\n\nSee more of the artists' work: https://goo.gl/pzwsce"}, {"date": "2017-08-30T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/845015678984644/", "name": "BYOBG - Bring your own Board Game!", "description": "Bring a game! Bring your friends! \n\nPlay board games with your friends at Glasshouse Brewing on Wednesday, get happy hour while you play! That means $1 off pints. What a deal!"}, {"date": "2017-08-30T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/197689040769309/", "name": "Artists Meet & Greet: Intermural", "description": "Join the artists of Intermural for a Gallery Talk during our August Artists Meet & Greet. Each artist will talk about creating murals in the gallery as well as their individual creative practices.\n\nLearn more: https://goo.gl/4a4u1V"}, {"date": "2017-08-30T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/128340701111030/", "name": "And Here: 100 Years of Upper Peninsula Writing", "description": "We are thrilled to host a panel discussion of contributors for the new collection And Here: 100 Years of Upper Peninsula Writing, 1917-2017 \n\nAbout And Here:\nUpper Peninsula literature has traditionally been suppressed or minimized in Michigan anthologies and Michigan literature as a whole. Even the Upper Peninsula itself has been omitted from maps, creating a people and a place that have become in many ways “ungeographic.” These people and this place are strongly made up of traditionally marginalized groups such as the working class, the rural poor, and Native Americans, which adds even more insult to the exclusion and forced oppressive silence. And Here: 100 Years of Upper Peninsula Writing, 1917–2017, gives voice to Upper Peninsula writers, ensuring that they are included in Michigan’s rich literary history. Ambitiously, And Here includes great U.P. writing from every decade spanning from the 1910s to the 2010s, starting with Lew R. Sarett’s (a.k.a. Lone Caribou) “The Blue Duck: A Chippewa Medicine Dance” and ending with Margaret Noodin’s “Babejianjisemigad” and Sally Brunk’s “KBIC.” Taken as a whole, the anthology forcefully insists on the geographic and literary inclusion of the U.P.—on both the map and the page.\n\nRonald Riekki is an award-winning poet, novelist, and playwright. Since 2010, he has headed the U.P./MI Book Tour, which has scheduled literary events throughout the state of Michigan, particularly in rural communities.\n\nSue Harrison is the author of six critically acclaimed bestselling novels. Mother Earth Father Sky, My Sister the Moon, and Brother Wind make up The Ivory Carver Trilogy, an epic adventure set in prehistoric Alaska. Song of the River, Cry of the Wind, and Call Down the Stars comprise The Storyteller Trilogy. Sue has also written a young adult book, SISU, released by Thunder Bay Press.\n\nGordon Henry is an Anishinabe poet and novelist, and an enrolled member of the White Earth Chippewa Tribe of Minnesota. His poetry has been published in anthologies such as Songs From This Earth On Turtle's Back: Contemporary American Indian Poetry (1983) and Returning the Gift: Poetry and Prose from the First Native American Writers (1994). His novel, The Light People (1994), was awarded The American Book Award in 1995. He has also co-authored the textbook, The Ojibway (2004), to which he contributed a number of essays on Native American culture. He currently teaches at Michigan State University.\n\nM.L. Liebler is an award-winning poet, literary arts activist, and professor. He is the author of several books of poetry, including I Want to Be Once (Wayne State University Press, 2016), and editor of the anthology Working Words: Punching the Clock and Kicking Out the Jams(Coffee House Press, 2010). He is also co-editor of Bob Seger's House and Other Stories (Wayne State University Press, 2016). He has taught at Wayne State University since 1980.\n\nWilliam Olsen is the author of six poetry collections, four of them published by Northwestern University Press: Sand Theory(2011), Avenue of Vanishing (2007), Trouble Lights (2002), and Vision of a Storm Cloud (1996). Olsen teaches at Western Michigan University and Vermont College. He lives in Kalamazoo, Michigan.\n\nPhillip Sterling is the author of Mutual Shores and three chapbook-length series of poems: Abeyance (winner of the Frank Cat Press Chapbook Award 2007), Quatrains, and Significant Others. The recipient of an NEA Fellowship, two Fulbright Lectureships, and a P.E.N. Syndicated Fiction Award, he is also the editor of Imported Breads: Literature of Cultural Exchange and founding coordinator of the Literature in Person (LIP) Reading Series at Ferris State University, where he has taught writing and literature since 1987. His new collection of poems, And Then Snow, is now available from Main Street Rag Publishing.\n\nKeith Taylor teaches at the University of Michigan. He has published many books over the years: collections of poetry, a collection of very short stories, co-edited volumes of essays and fiction, and a volume of poetry translated from Modern Greek.\n\nEvent date: \nWednesday, August 30, 2017 - 7:00pm"}, {"date": "2017-08-31T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/809120869256993/", "name": "Sonic Lunch / Joe Hertler & The Rainbow Seekers August 27th", "description": "Bank of Ann Arbor's Sonic Lunch is an awesome outdoor summer concert series that rocks Ann Arbor's Liberty Plaza Thursdays at lunch time each summer. Look for news and announcements year-round and concerts to kick off in June 1, 2017. Sonic Lunch is free and open to all ages! Lawn chairs and furry friends are welcome.\nTell all your friends about one of the events that make summer in Ann Arbor super cool! \nBank of Ann Arbor appreciates the support of Ann Arbor’s 107one fm and Perich Advertising + Design.\n\n8/31 Joe Hertler & The Rainbow Seekers\nhttp://www.joehertler.com \nJoe Hertler & The Rainbow Seekers will make a sprightly young groove doctor out of anyone. With spectacular energy pulsating from every member of the band, the Rainbow Seekers could illuminate the very chambers of Heaven. Lead singer Joe Hertler splashes through lyrical puddles of golden rain, leaving his audience wearing flowery headdresses and bubbling smiles. A ride on the Rainbow will take you across the mountains of Motown, through the fjords of folk, over the archipelagos of Americana, and—at last—into a funky firth, where only the fiercest of friendships can be found.\n\nThe Rainbow Seekers began their quest beneath the fingertips of songwriter Joe Hertler. Bassist and producer Kevin Pritchard, recently thawed from an extremely rare prehistoric groove glacier, discovered the forlorn Hertler in a twinkling, mysteriously fortuitous place called The Quilted Attic. Alongside legendary glacier-hunter Rick Hale—who would later spend decades forging a drumset from pure, white-hot, ancient stardust to mark the occasion—Pritchard changed the world: He wrangled Hertler into musical collaboration. And the lonely little songsmith, it turned out, was not quite as alone as he seemed: With him came the irresistibly sexy blues guitar prodigy who is now known to the world as Ryan Hoger.\n\nThe core of the Rainbow was thereby established, and it didn’t take long for the Rainbow Seekers to continue their expansion. Multi-instrumentalist and notable auxiliary percussion maestro Micah Bracken journeyed from the bowels of Atlantis when he heard tell of the Rainbow, and the earth trembled as saxophonist and all-around bad ass Aaron Stinson descended from Olympus on a golden rainbow of his own. Then came Stinson's little-known winged companion from the Far East, the debonair violist Joshua Barber Holcomb—When he saw the pure, unadulterated joy the Rainbow Seekers sprinkled on every crowd they happened upon, he had no choice but to join them on their quest. As you'll know if you've seen the band, seeking the proverbial Rainbow is all about the live performance. \"The live show is the purpose of the band. This is why we make music. Playing music is a symbiotic process, and without a crowd it is just a bunch of guys jamming,\" says Hertler. \"We believe that performance is not a High Art operation, and that you should do anything you can to ensure that the crowd is having a good time. From piñatas to confetti, to fog, to flowers, to drum solos, to strobe lights, to Thor, to sword battles—literally anything goes.\"  If you're still reading this, at least one thing is true: The Rainbow Seekers have been waiting for you. If you'll only let them, they will shake the dust from your wildest expectations. They will roar into your life with rapturous frequencies, exuberant tone, and a joyfulness of purpose that has truly become a rare sight on stage. Join them in their celebration, and they will take you on a never-ending journey to a place you'll never be able to describe in words."}, {"date": "2017-08-31T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/118227762130905/", "name": "Ghastly at Necto", "description": "React Detroit presents...\n\n:: Ghastly ::\nWelcome Week Bash\n\nSupport by:\nMielo\n\nNecto Nightclub\n516 E. Liberty St.\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-09-02T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1462914917090451/", "name": "Ultraviolet // Paint Party", "description": "We're having a huge UV Paint Party to kick off the season - wear white to really make it pop! You can also watch (paint-free) from the balcony and bar.\n\n• HOW IT WORKS. We'll have paint cannons splashing you with water-based, kid-safe, and washable paint + black lights all over to make the colors stand out. \n\n• DRINK SPECIALS. Happy Hour is from 9pm - 11pm with\n50% off all drinks, shots & bottled beers. $2 Miller Lites and 3 for $10 Jager / 3 olives Vodka Bombs all night.\n\n• MUSIC. DJ Hardy spins the best Top 40, Dance & House with host MC Yoda.\n\n• FREE PICTURES with your friends by a professional photographer.\n\n• COVER. $5 for 21+ & $10 for 18 to 20.\n\nCome play in the paint!"}, {"date": "2017-09-03T17:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1201050600040610/", "name": "Paddy Keenan - In Concert", "description": "Strayaway Child Concert Series presents legendary uilleann piper Paddy Keenan in concert!\n<><><><><>\n\nThe Celtic Room at Conor O'Neill's Pub\n318 South Main St, Ann Arbor, MI 48104\nShow starts at 5:30pm - Doors at 5:00pm\nGeneral: $18 | Students: $16 | Kids under 10 free \nTickets at door only\n\n<><><><><>\nGenerally acknowledged as the most accomplished uilleann piper performing today and a living legend, Paddy is one of the most brilliant musicians of his generation. Born in Trim, Co. Meath, to John Keenan, Sr. of Westmeath and the former Mary Bravender of Co. Cavan. The Keenans were a Travelling family steeped in traditional music; both Paddy's father and grandfather were uilleann pipers. Paddy himself took up the pipes at the age of ten, playing his first major concert at the Gaiety Theatre, Dublin, when he was 14. He later played with the rest of his family in a group called The Pavees. At 17, having fallen in love with the blues, Paddy left Ireland for England and Europe, where he played blues and rock. Returning to Ireland after a few years, he began playing around Dublin with singer/keyboardist Triona Ni Dhomhnaill and singer/guitarist Micheal O Dhomhnaill. Fiddler Paddy Glackin joined the three, then flute player Matt Molloy, accordionist Tony MacMahon, and guitarist Donal Lunny. Thus was born one of the most influential bands of the 1970s, The Bothy Band. Paddy was one of the band's founding members, and his virtuosity on the pipes combined with the ferocity of his playing made him, in the opinion of many, its driving force. Bothy Band-mate Donal Lunny once described Paddy as \"the Jimi Hendrix of the pipes\".\n\nSince the breakup of The Bothy Band in 1979, Paddy has toured as a soloist, bringing the finest example of traditional Irish music and uilleann piping to audiences around the globe, performing in Japan, Malaysia, Mali, Australia, across Europe, Russia, and of course America.\n\nVisit Paddy on the web here: http://www.paddykeenan.com/"}, {"date": "2017-09-03T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/2029026593999967/", "name": "Open Mic and Feature: Marlin Jenkins and Monica Rico", "description": "Marlin M. Jenkins was born and raised in Detroit and studied poetry in University of Michigan's MFA program. His writings have been given homes by The Collagist, Four Way Review, The Journal, and Bennington Review, among others. A former teaching artist in Detroit Public Schools through the Inside Out Literary Arts program and current editor for HEArt Online, he is also a dancer.\n\nMonica Rico is a second generation Mexican American feminist who writes at www.slowdownandeat.com.  Her poetry has recently appeared/is forthcoming in SiDEKiCK LIT, Dunes Review, The Ilanot Review, Rogue Agent, Concīs, and Up the Staircase Quarterly.  She grew up in Saginaw, Michigan and has a BA in Women’s Studies and Creative Writing from Western Michigan University and a MA in Creative Writing from The City College of New York. Her chapbook “Twisted Mouth of the Tulip” is available from Red Paint Hill."}, {"date": "2017-09-05T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/109899706335407/", "name": "Rasa Festival: Multi-Arts Inspired by India", "description": "Geetha Raghu, Khayal vocals\nRishabh Iyer, sitar\nSreyashi Dey, Odissi dance\nMaralas , ensemble\n\n$20 General Admission\n$10 Student\n\nThe Rasa festival is designed to promote a deeper awareness and appreciation for the effulgent richness and abundance of cultural heritage that stems from India. It is multi-arts and multi-disciplinary, presenting traditional as well as cutting edge work in performing, visual, literary, and media/films and culinary arts, in partnership with prominent Ann Arbor arts organizations. In Indian aesthetics, a rasa (Sanskrit: रस lit. ‘juice’ or ‘essence’) denotes an essential mental state and is the dominant emotional theme of a work of art, or the primary aesthetic feeling that is evoked in the person that views, reads or hears such a work.\n\nParticipating artists in the festival will be local, national and international Indo-American artists, artists from India as well as those who are highly inspired by Indian culture. It is a collaborative initiative, working through partnerships with key local organizations such as the Ann Arbor Art Center, the Riverside Art Center, the Michigan Theater, the Neutral Zone, the Ann Arbor Visitors and Convention Bureau, The FLY Children’s Art Center, Literati Bookstore, etc., and chef, food visionary, research scientist and founder of two Ann Arbor restaurants, Dr. Swaroop Bhojani."}, {"date": "2017-09-06T16:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1644683012229162/", "name": "Volunteers: Family Fun Day", "description": "The Food Truck Rally at the Farmers Market provides local food, beverages, and music the first Wednesday of every month! We provide family fun for kids of all ages. Volunteers are needed for set up, take down, GIVE365 kid's activity area, a water station, and Zero Waste stations. Two shifts are available: 4:30 p.m.-6:30 p.m. and 6 p.m.- 9 p.m."}, {"date": "2017-09-06T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/152763591970870/", "name": "Ann Arbor Roller Derby 2017 BOOT CAMP", "description": "Ann Arbor Roller Derby kicks off our 2017 boot camp on Wednesday, September 6th at our winter home in Ypsilanti! Come lace up your skates with trainers Skim Milf, Michelle O'Bombya, and Bear-a-Cuda and start learning how to skate like a derby all-star!. \n\nFor more information, visit http://a2derbydimes.org/fresh-meat/ or  email recruitment@a2derbydimes.org\n\n*** Credit for header art goes to Slamuel L. Jackson. ***"}, {"date": "2017-09-06T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1886755251642654/", "name": "Rasa Festival: Ashwini Bhasi, Tarfia Faizullah, Ambalila Hemsell", "description": "Literati is excited to be a part of Rasa Festival! We are hosting readings from poets Ashwini Bhasi, Tarfia Faizullah, and Ambalila Hemsell.\n\nAshwini Bhasi is from Kerala, India and lives in Ann Arbor, Michigan. She writes poems to make sense of the mind-body connection of trauma and chronic pain, and the duality of her experiences as a genomic data analyst and poet. Her poems have appeared in Room Magazine, Rogue Agent, Bear River Review, Yellow Chair Review, The Feminist Wire, and Driftwood Press among others. She was nominated for a Pushcart prize for a poem she wrote about the 2016 presidential election.\n\nTarfia Faizullah is a poet, editor, and educator from Brooklyn, NY and raised in West Texas. She received an MFA in poetry from Virginia Commonwealth University and is the author of Seam (SIU 2014), which US poet laureate Natasha Trethewey calls “beautiful and necessary,” as well as Registers of Illuminated Villages, (forthcoming from Graywolf 2017).\n\nAmbalila Hemsell is a writer, educator, and musician from Colorado. She holds an MFA from the Helen Zell Wrtiers’ Program at the University of Michigan, where she is currently a Zell Fellow. She was a 2015/2016 Writer-in-Residence at InsideOut Literary Arts in Detroit. Her poetry can be found in Riprap and is forthcoming in The American Literary Review."}, {"date": "2017-09-06T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1453175954726093/", "name": "Pigeons Playing Ping Pong with Flamingosis at Blind Pig", "description": "Pigeons Playing Ping Pong\n\nwith Special Guest Flamingosis\n\nWed. 09.06.15 @ Blind Pig - Ann Arbor, MI\n\n$14 Adv.// $16 Day of \n\n18+\n\nDoors 9pm / Show 10pm\n\n “Somethin For Ya” Pro-Shot Live Video: https://www.youtube.com/watch?v=fIGTyR-iD-w\n\nPigeons Playing Ping Pong brings end-of-the-world enthusiasm to their high-energy psychedelic funk. Their infectious electro-funk grooves, undeniable live energy and contagious smiles have their rabid fanbase “The Flock” growing exponentially. Based out of Baltimore, MD, this animated quartet has been scorching up the country with their explosive performances and danceable peaks… and they’re loving every minute of it."}, {"date": "2017-09-07T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/697766840417775/", "name": "David Daley", "description": "Literati is excited to welcome David Daley and his new book Ratf**cked\n\nThe explosive account of how Republican legislators and political operatives fundamentally rigged our American democracy through redistricting. \n\nWith Barack Obama’s historic election in 2008, pundits proclaimed the Republicans as dead as the Whigs of yesteryear. Yet even as Democrats swooned, a small cadre of Republican operatives, including Karl Rove, Ed Gillespie, and Chris Jankowski began plotting their comeback with a simple yet ingenious plan. These men had devised a way to take a tradition of dirty tricks—known to political insiders as “ratf**king”—to a whole new, unprecedented level. Flooding state races with a gold rush of dark money made possible by Citizens United, the Republicans reshaped state legislatures, where the power to redistrict is held. Reconstructing this never- told-before story, David Daley examines the far-reaching effects of this so-called REDMAP program, which has radically altered America’s electoral map and created a firewall in the House, insulating the party and its wealthy donors from popular democracy. Ratf**ked pulls back the curtain on one of the greatest heists in American political history.\n\n“Daley’s book provides a blow-by-blow account of how this happened. He draws on investigative reports, interviews and court documents to give readers an eye-opening tour of a process that many Americans never see….What Daley makes clear is that ruthless partisan gerrymandering is not good for democracy and makes it that much more difficult to wrestle control of the House away from the GOP. Democrats should read this book.” - Julian E. Zelizer, Washington Post\n\n“The way dark money was translated into congressional majorities is one of the great, sinister stories of our time. But in David Daley the shadow figures have finally met their match.” - Thomas Frank, author of What’s the Matter with Kansas\n\nDavid Daley is the editor in chief of Salon and the Digital Media Fellow for the Wilson Center for Humanities and the Arts and the Grady School of Journalism at the University of Georgia. He lives in Brooklyn, New York."}, {"date": "2017-09-07T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/160812731157599/", "name": "Seussical the Musical", "description": "Ann Arbor Civic Theatre opens their 2017-2018 season with Seussical™, the Musical, directed by Denyse Clayton, September 7-10, 2017, at UM’s Lydia Mendelssohn Theatre, 911 N. University, Ann Arbor, 48109.  Performances are Thursday 7:30 pm, Friday and Saturday 8pm, with a 2pm matinee on Sunday.  Friday, Saturday and Sunday tickets are $26, with tickets at $23 for seniors and $14 for students. On Thursday only, all seats are $20, with $14 tickets for students. Tickets and information are available online at www.a2ct.org, through the A2CT office at 734-971-2228, or at the door of the theater before each performance.\n\n\"Seussical is fun and whimsical.  But at the very core of this silly show is a most important truth:  that what all of us really need, the young and the young at heart, is one true friend in the universe that believes in us.\" With book, music, and lyrics by Tony winners Lynn Ahrens and Stephen Flaherty, and co-conceived by Eric Idle of Monty Python fame, Seussical is a magical, musical extravaganza that is fun for the whole family. \n\nThe Cat in the Hat tells the story of Horton, an elephant who discovers a speck of dust that contains the Whos, including Jojo, a Who child sent off to military school for thinking too many \"thinks.\" Horton faces a double challenge: not only must he protect the Whos from a world of naysayers and dangers, but he must guard an abandoned egg, left in his care by the irresponsible Mayzie La Bird. Although Horton faces ridicule, danger, kidnapping and a trial, the intrepid Gertrude McFuzz never loses faith in him. Ultimately, the powers of friendship, loyalty, family and community are challenged and emerge triumphant.\n\nMusic direction for Seussical is by Joseph D. Daniel, with choreography by Rachel Francisco. The talented cast includes Roby Roy as The Cat in the Hat, Chloe Lee as Jojo, Eric VanWasshnova as Horton the Elephant, Stacy Buck as Gertrude McFuzz, Mary Ridder as Mayzie Lazybird, Keshia Oliver as the Sour Kangaroo, and Jason Matley as General Gengus Khan Schmitz. The fantastic ensemble also includes Ellen Kettler, Isolte Beal, Kimberly Lock, Aaron Gruenke, Brittany Davenport, Lily Gechter, Matthew Praschan, Gabrielle Vuylsteke, Alaina Pellar-Kosbar, Jada Green, Naomi Cotner, Maura Doyle, Kathryn McIntyre, and John Tramp."}, {"date": "2017-09-07T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/116990472277228/", "name": "Kap Slap at Necto", "description": "React Detroit presents...\n\n:: Kap Slap ::\n\nSupport:\nMax Grasso\nMiller Guth\n\nNecto Nightclub\n516 E. Liberty St.\nAnn Arbor, MI 48104\n18+"}, {"date": "2017-09-08T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/252095385299923/", "name": "Game Night at Glasshouse Brewing", "description": "Game Night is headed to Glasshouse Brewing on Friday September 8th from 7:00pm to 9:00pm! Our expert Game Masters will be on hand and ready to introduce you to a stack of the best board games available at Vault of Midnight! Whether you are a first time gamer or a seasoned mage, Vault of Midnight's Game Night is a great way to discover new games! A ticket for the event not only reserves your space at Game Night, it also gets you 10% off any game in the store through Sunday, September 10. Act fast because space is limited and will sell out! Bring a friend or come alone, Game Night is a fun way to meet new people!"}, {"date": "2017-09-08T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/705564909651365/", "name": "Kathryn Remlinger: Yooper Talk", "description": "Literati is excited to welcome Kathryn Remlinger and her new book Yooper Talk: Dialect as Identity in Michigan's Upper Penisula\n\nAbout Yooper Talk:\nYooper Talk is a fresh and significant contribution to understanding regional language and culture in North America. The Upper Peninsula of Michigan—known as \"the UP\"—is historically, geographically, and culturally distinct. Struggles over land, labor, and language during the last 150 years have shaped the variety of English spoken by resident Yoopers, as well as how they are viewed by outsiders.\n\nDrawing on sixteen years of fieldwork, including interviews with seventy-five lifelong residents of the UP, Kathryn Remlinger examines how the idea of a unique Yooper dialect emerged. Considering UP English in relation to other regional dialects and their speakers, she looks at local identity, literacy practices, media representations, language attitudes, notions of authenticity, economic factors, tourism, and contact with immigrant and Native American languages. The book also explores how a dialect becomes a recognizable and valuable commodity: Yooper talk (or \"Yoopanese\") is emblazoned on t-shirts, flags, postcards, coffee mugs, and bumper stickers.\n\nYooper Talk explains linguistic concepts with entertaining examples for general readers and also contributes to interdisciplinary discussions of dialect and identity in sociolinguistics, anthropology, dialectology, and folklore.\n\n\"Although humorous songs poke fun at Yoopers' words and customs, Remlinger takes this place and its people very seriously. She explains how history, ethnicity, environment, economic changes, tourism, and especially language have created a colorful and distinctive regional dialect and identity.\" —Larry Lankton,Hollowed Ground: Copper Mining and Community Building on Lake Superior\n\nKathryn A. Remlinger is a professor of linguistics in the Department of English at Grand Valley State University in Allendale, Michigan."}, {"date": "2017-09-08T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1498114890261208/", "name": "Season Opening Event! Butler, Bernstein & The Hot 9", "description": "UMS brings the Big Easy to Downtown Home & Garden with a season-opening event featuring Butler, Bernstein & The Hot 9.\n\nRetro-futurist brass man Steven Bernstein has a soft spot for early jazz, so his hookup with New Orleans pianist and singer Henry Butler is bound to deliver big fun. A virtuoso who has been blind since birth and channels sounds as diverse as his Louisiana birthplace, Butler’s technical ability and expansive repertoire are legendary. The two first worked together in the Kansas City All Stars, a touring big band led by Bernstein that came out of the Robert Altman film Kansas City. They use New Orleans tradition and early 20th-century blues as a launching point toward exploration that is “both historically aware and fully prepared to cut loose.” (New York Times)\n\nMore info: http://ums.org/performance/butler-bernstein-the-hot-9/\n\nSupported by Old National Bank"}, {"date": "2017-09-08T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/109373686396492/", "name": "Pauline Martin, David Cooper and Alexander Kerr", "description": "Pauline Martin, piano\nDavid Cooper, horn\nAlexander Kerr, violin\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nPianist Pauline Martin from Chamber Soloists of Detroit is joined by french horn player David Cooper, newly appointed Principal Horn of the Berlin Philmarmonic and Lansing native, and violinist Alexander Kerr, former Concertmaster of Concertgebouw Orchestra, for an evening concert.\n\nPauline Martin's Washington debut captured the Washington Post headline, Pauline Martin's Dazzling Debut. The Canadian born pianist continues to earn international recognition for her solo and chamber music performances, recordings and national broadcasts in Canada, the U.S. and Europe. Martin has been a featured performer and teacher at such festivals as the Sarasota (Florida), Summer Serenades (Maryland), Scandinavian Winter Days (Reykjavik) and Aria International Festivals and Michigan’s Ann Arbor, Mackinac Island, Grove and Irving S. Gilmore Festivals. As concerto soloist, she has appeared with the Detroit Symphony Orchestra, the New American Chamber Orchestra and Orchestra London Canada, among others. She has recorded for the Naxos, Koch and CRS labels and, as founding member of the St. Clair Trio, is a recipient of the prestigious Chamber Music America/WQXR-FM award for its outstanding CD, “Old Acquaintances” (Koch) as well as a first-round Grammy nomination for “Hobson’s Choice”(Koch). Recent releases include “A Postcard from Europe” with clarinetist George Stoffan and the Naxos CD: “Imaginary Creatures” (works by James Hartway). She currently serves as Artistic Director of Chamber Soloist\n\nDavid Cooper started his career as acting Principal Horn with the Victoria Symphony in British Columbia and Associate Principal Horn of the Fort Worth Symphony. He has been guest Principal Horn of the London Symphony Orchestra, Hong Kong Philharmonic, Philadelphia Orchestra, and Los Angeles Philharmonic. This December, David won the position of solo horn with the Berlin Philharmonic and will join the orchestra for the 2017-2018 season. David is an active chamber musician and is Music Director of the Avant Chamber Ballet in Dallas, TX.\n\nAlexander Kerr’s expressive and charismatic style has made him one of the most accomplished and versatile violinists on the international music scene today. In 1996 at the age of 26, Mr. Kerr was appointed to the prestigious position of Concertmaster of the Royal Concertgebouw Orchestra in Amsterdam, the Netherlands. After nine successful years at that post, he left in June, 2006 to assume the endowed Linda and Jack Gill Chair in Music as Professor of Violin at the Indiana University Jacobs School of Music. In addition to his teaching responsibilities in Bloomington, he maintains a busy concert schedule appearing with orchestras and in recital and chamber music performances throughout the U.S., Asia and Europe. In 2008 he began his tenure as Principal Guest Concertmaster of the Indianapolis Symphony Orchestra and in September 2011, he assumed his role as Concertmaster of the Dallas Symphony Orchestra.\nRegarded by the press as a masterful virtuoso with an elegant, old-world sound, Mr. Kerr has appeared as soloist with major orchestras throughout the United States and Europe, working with such renowned conductors as Mariss Jansons, Riccardo Chailly, Peter Oundjian, Robert Spano, Alan Gilbert, Jaap van Zweden and David Zinman."}, {"date": "2017-09-08T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/305214543225261/", "name": "The Ron Coden Show at Green Wood Coffee House", "description": "Ron Coden has been an entertainer for over fifty years.  His music encompasses a wide variety of styles. He is a singer, comedian, actor, storyteller and guitarist. Whether performing a rousing folk song, a heartfelt ballad or a popular Broadway show tune, Ron Coden is always a delight.  Ron is accompanied by three fine musicians: Ron Blight on guitar, Danny Ballas on drums and Todd McIntosh on bass.  Come experience the Ron Coden Show's hand-clapping, foot-stomping fun as we open our Fall 2017 season! Bring a friend!  www.facebook.com/theroncodenshow/"}, {"date": "2017-09-08T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1720945301542509/", "name": "THE NORTH 41 LIVE AT BLIND PIG W/ Paddlebots & Pajamas ", "description": "The North 41 is ready to crush it in Ann Arbor with our michigan friends Paddlebots & Pajamas"}, {"date": "2017-09-09T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1953794074893768/", "name": "The Timbre of Cedar + All is Well at The Blind Pig 9/9/17", "description": "Saturday, September 9th\nBlind Pig Presents:\n\nTHE TIMBRE OF CEDAR\nhttp://www.thetimbreofcedar.com/\n\nwith special guests:\n\nAll is Well\nhttps://www.alliswellmusic.com/\n\nThe True Blue\nhttps://www.facebook.com/inwiththeblue/?ref=br_rs\n\nThe Lowercase\nhttps://www.thelowercasemusic.com/\n\n$7 / Under 21 $10 - 18+ - Doors 9:30 p.m."}, {"date": "2017-09-10T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1836514399922522/", "name": "Kerrytown BookFest Thriller Panel", "description": "Elizabeth Heiter moderates a panel with David Bell, Stepehen Mack Jones and Karen Dionne."}, {"date": "2017-09-10T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1684268335206846/", "name": "Kerrytown BookFest Historical Suspense Panel", "description": "Nancy Herriman moderates an historical suspense panel with Deanna Raybourne, Anna Lee Huber and James Benn,"}, {"date": "2017-09-10T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1914510812171118/", "name": "Monarch Migration Festival", "description": "Each year, waves of Monarch butterflies travel over mountains, forests, and plains in the United States to reach their southern wintering grounds in Mexico. Join LSNC in preserving butterfly habitats and releasing Monarchs to support national conservation efforts. Learn how butterflies are tagged, get your face painted, and meet local experts and vendors supporting butterfly conservation efforts.  Read more about this effort: http://www.lesliesnc.org/monarch-migration-festival and register today:"}, {"date": "2017-09-11T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/273383076401739/", "name": "Amos N. Guiora: The Crime of Complicity", "description": "Literati is excited to welcome Amos N. Guiora and his new book The Crime of Complicity\n\nComplicity is a ground-breaking examination of the legal culpability of the bystander told through the lens of the author’s family experiences in the Holocaust. It provides an exploration of three distinct events: the death marches; the German occupation of Holland; and the German occupation of Hungary, all of which allow an in-depth discussion of the role of the bystander in varied circumstances. Through a narrative of his parents’ stories, Amos Guiora, Professor of Law at the S.J. Quinney College of Law at the University of Utah, author, and former Lieutenant Colonel in the Israel Defense Force, poses the question of whether there can and should be legal liability in deciding not to act to aid another person in distress. It draws upon a wide range of historical, psychological, sociological and archival material in an effort to determine the legal and moral responsibility of the bystander. \n\nAmos N. Guiora is Professor of Law at the S.J. Quinney College of Law, the University of Utah and Lieutenant Colonel (Ret.) in the Israel Defense Force. He is actively involved in the effort to legislate Holocaust-Genocide education in Utah public schools. He is the author of several books, including Freedom from Religion: Rights and National Security (2009) and Tolerating Intolerance: The Price of Protecting Extremism (2014)."}, {"date": "2017-09-12T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/139203520013093/", "name": "Witches' Night Out - New Time!", "description": "Witches’ Night Out • Second Tuesdays, Sept. 12, Oct. 10, Nov. 14, Dec. 12, 6:30-8:30 p.m. in the Crazy Wisdom Tea Room • These gatherings involve drinking Witch Brew tea and networking with like-minded others. No cover. $3.50 for a pot of tea with free refills. For more information call 665-2757; info@crazywisdom.net or crazywisdom.net."}, {"date": "2017-09-12T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1702724586703966/", "name": "Tomato Special Dinner #214: Featuring Cara Mangini", "description": "Cara Mangini will slice, dice, and bring cutting-edge vegetable cookery to Zingerman’s Roadhouse!\n\nWe can’t wait for  our first ever vegetarian Tomato Special Dinner with Cara Mangini! One of Mario Batali's first vegetable butchers at  Eataly in New York City, she’s on a mission to put vegetables at the center of the American plate—and our Special Dinner!  \n\nCara has traveled and cooked extensively throughout France, Italy and Turkey to study produce-centered cuisines. She’s the chef and founder of the produce-inspired Little Eater restaurants and farm stand in Columbus, Ohio and the author of The Vegetable Butcher: How to Select, Prep, Slice, Dice, and Masterfully Cook Vegetables from Artichokes to Zucchini, which was nominated for a James Beard Award and honored with two International Association of Culinary Professionals cookbook awards. \n\nIn 2017, her restaurant Little Eater was named one of the top 50 vegetable restaurants in the world by The Culinary Institute of America and EAT, an international organization dedicated to reforming the global food system.\n\nThe juicy tomatoes we’ve been growing this season at the Roadhouse Farm will indeed be the center of the plate for our Tomato Special Dinner #214. Don’t miss out on this opportunity to taste over 20 varieties of heirloom tomatoes as Cara unearths their flavors in the Roadhouse kitchen. Not only will we be able to savor the recipes in Cara’s new book at this dinner, but her book will be available for purchase and signing."}, {"date": "2017-09-12T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/508025879536529/", "name": "Oliver Uberti: Where the Animals Go", "description": "Literati is thrilled to welcome designer and author Oliver Uberti for the launch event of his new book, Where the Animals Go.\n\nFor thousands of years, tracking animals meant following footprints. Now satellites, drones, camera traps, cellphone networks, and accelerometers reveal the natural world as never before. Where the Animals Go is the first book to offer a comprehensive, data-driven portrait of how creatures like ants, otters, owls, turtles, and sharks navigate the world. Based on pioneering research by scientists at the forefront of the animal-tracking revolution, James Cheshire and Oliver Uberti’s stunning, four-color charts and maps tell fascinating stories of animal behavior. These astonishing infographics explain how warblers detect incoming storms using sonic vibrations, how baboons make decisions, and why storks prefer garbage dumps to wild forage; they follow pythons racing through the Everglades, a lovelorn wolf traversing the Alps, and humpback whales visiting undersea mountains. Where the Animals Go is a triumph of technology, data science, and design, bringing broad perspective and intimate detail to our understanding of the animal kingdom\n\n“Where the Animals Go is beautiful and thrilling, a combination of the best in science and exposition, and a joy to study cover to cover.”—Edward O. Wilson, University Research Professor Emeritus, Harvard University\n\n“This book is beautiful as well as informative and inspiring. There is no doubt it will help in our fight to save wildlife and wild habitats.” - Jane Goodall\n\nOliver Uberti is an award-winning designer and visual journalist and was previously senior design editor at National Geographic. He lives in Los Angeles, California."}, {"date": "2017-09-13T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/479810495710953/", "name": "10 Blocks on the Camino Real | National Theatre of Ghana", "description": "\"A big-hearted Williams one-act about love and heroism, staged with West African flair in a performance full of vibrant song and dance, perfectly suited to the outdoor marketplace.\"\n\nAnn Arbor Farmer's Market\nWednesday, September 13 at 12pm\nFREE & OPEN TO THE PUBLIC\n\nThe University of Michigan Center for World Performance Studies (CWPS) partners with Ann ARbor Farmer's Market to present the National Theatre of Ghana, in an open air performance of 10 Blocks on the Camino Real, written by Tennessee Williams. In this one-act play, song, dialogue and dance are used to tell the story of how the American hero Kilroy enters the pantheon of heroes by losing his innocence. The plaza of Ten Blocks on the Camino Real is a crossroads of world theater, drawing on Williams’ experiences in Mexico, and inspired by German theater, Chinese opera and commedia del’arte. Ghana is the source and setting for this new production, directed by David Kaplan, curator of the Provincetown Tennessee Williams Theater Festival. While the spoken English text is performed as written by Williams, Spanish songs and Spanish words have been translated to Ghanaian songs and Ghanaian languages. Don Quixote has become Okomfo Okokye, the founder of the Ashanti line of kings, who finds his sidekick, Osei-tutu. Other Spanish details are exchanged for Ghanaian specifics: pesos for pesewas, fiesta for jubilee. The presiding musician plays two blue djembe drums, rather than a blue guitar.\n\nEstablished in 1983 at the University of Ghana at Legon, the professional theater company once known as “Abibigromma” became the resident troupe of the National Theatre of Ghana in 1991. The focus of the company is to develop a rich blend of music, dance, mime, movement, and dialogue with a strong social, spiritual and folkloric base. \n\nCWPS aims to recreate the atmosphere of the Ghanaian outdoor productions here in Michigan, staging performances in four outdoor venues through the week. Other performances include:\n\nThe Diag\nUniversity of Michigan\nFriday, September 15 at 12pm\n\nYpsilanti Farmers Market Depot Town\n100 Rice Street, Ypsilanti MI\nSaturday, September 16 at 11am\n\nCMAP Detroit\n2221 Carpenter, Detroit MI\nSunday, September 17 at 2pm\n\nAll performances are free and open to the public."}, {"date": "2017-09-13T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/314491705682035/", "name": "The Poetry of Aimé Césaire & the Art of Translation", "description": "Literati is thrilled to host author and translator Clayton Eshleman in conversation with Keith Taylor on the work of Aimé Césaire\n\nThe Complete Poetry of Aimé Césaire gathers all of Cesaire’s celebrated verse into one bilingual edition. The French portion is comprised of newly established first editions of Césaire’s poetic œuvre made available in French in 2014 under the title Poésie, Théâtre, Essais et Discours, edited by A. J. Arnold and an international team of specialists. To prepare the English translations, the translators started afresh from this French edition. Included here are translations of first editions of the poet’s early work, prior to political interventions in the texts after 1955, revealing a new understanding of Cesaire’s aesthetic and political trajectory. A truly comprehensive picture of Cesaire’s poetry and poetics is made possible thanks to a thorough set of notes covering variants, historical and cultural references, and recurring figures and structures, a scholarly introduction and a glossary. This book provides a new cornerstone for readers and scholars in 20th century poetry, African diasporic literature, and postcolonial studies.\n\n Clayton Eshleman is the author of over one hundred books, and the major American translator of Césaire\n\nKeith Taylor teaches at the University of Michigan. He has published many books over the years: collections of poetry, a collection of very short stories, co-edited volumes of essays and fiction, and a volume of poetry translated from Modern Greek.\n\nEvent date: \nWednesday, September 13, 2017 - 7:00pm"}, {"date": "2017-09-13T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1935500866728403/", "name": "Overcoats at Blind Pig 9/13/17", "description": "Overcoats is the New York-based female duo of Hana Elion and JJ Mitchell. Their debut album YOUNG captures a sound rich in minimalism and melody: songs of connection and tension, on the depths of love and challenges of family.\nWSG: YOKE LORE\n\nWed. September 13 | 18+ | 8pm | Tix: https://goo.gl/Q5L1Cq"}, {"date": "2017-09-14T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/258392958006801/", "name": "John U. Bacon: Playing Hurt", "description": "Literati is excited to welcome John U. Bacon in support of the new book about the life of legendary sports broadcaster John Saunders, Playing Hurt: My Journey from Despair to Hope.\n\nAbout Playing Hurt:\nDuring his three decades on ESPN and ABC, John Saunders became one of the nation's most respected and beloved sportscasters. In this moving, jarring, and ultimately inspiring memoir, Saunders discusses his troubled childhood, the traumatic brain injury he suffered in 2011, and the severe depression that nearly cost him his life. As Saunders writes,\n\nPlaying Hurt is not an autobiography of a sports celebrity but a memoir of a man facing his own mental illness, and emerging better off for the effort. I will take you into the heart of my struggle with depression, including insights into some of its causes, its consequences, and its treatments.\n\nI invite you behind the facade of my apparently \"perfect\" life as a sportscaster, with a wonderful wife and two healthy, happy adult daughters. I have a lot to be thankful for, and I am truly grateful. But none of these things can protect me or anyone else from the disease of depression and its potentially lethal effects.\n\nMine is a rare story: that of a black man in the sports industry openly grappling with depression. I will share the good, the bad, and the ugly, including the lengths I've gone to to conceal my private life from the public.\n\nSo why write a book? Because I want to end the pain and heartache that comes from leading a double life. I also want to reach out to the millions of people, especially men, who think they're alone and can't ask for help.\n\nJohn Saunders died suddenly on August 10 ,2016, from an enlarged heart, diabetes, and other complications. This book is his ultimate act of generosity to help those who suffer from mental illness, and those who love them.\n\nJohn U Bacon is the New York Times bestselling author of, among other titles, Three and Out, Fourth and Long, and Endzone."}, {"date": "2017-09-14T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/665890496945024/", "name": "90s DANCE PARTY at Blind Pig w/ Fool House", "description": "Fool House is bringing the '90s to Ann Arbor! Make sure you wear your best track suits and fanny packs! \n\nWe'll be playing all of the bangerzzzz from NSYNC, Blink 182, Britney Spears, all the way to Ricky Martin ;)\n\n$5 ADV // $8 DOS\nDoors // 8pm\nShow // 10pm\n\nHope you're ready to party!!!\n\nwww.FoolHouseBand.com"}, {"date": "2017-09-14T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1874558196199787/", "name": "Henry Fong x Bad Royale at Necto", "description": "React Detroit presents...\n\n:: Henry Fong x Bad Royale ::\n\nSupport:\nTwo Can Win\n\nNecto Nightclub\n516 E. Liberty St.\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-09-15T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/683609165158072/", "name": "Tumbao Bravo", "description": "Paul Vornhagen, saxophones, flute, piccolo, guiro/claves\nBrian Di Blassio, piano\nPatrick Prouty, bass\nGregory \"Greco\" Freeman, congas\nMichael Gutierrez, timbales\nPaul Finkbeiner, trumpet/flugelhorn\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nTumbao Bravo is a six-piece ensemble that performs the authentic rhythms of Cuba with original jazz harmonies. Winner of the 2005 and 2007 Detroit Music Awards for best jazz and world music recording categories, Tumbao Bravo was formed in 2003 by reedman Paul VornHagen and conga player Alberto Nacif. Their latest recording was featured in Latin Beat Magazine in Los Angeles, the most respected Latin music periodical in the world. They have performed at all the major jazz festivals in Michigan and their recordings have been featured on all the major Latin jazz radio programs nationwide."}, {"date": "2017-09-15T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/462461930773054/", "name": "Suzzy Roche and Lucy Wainwright Roche at Green Wood Coffee House", "description": "Suzzy Roche is a founding member of the singing group, The Roches.  In addition to recording numerous albums with The Roches, Suzzy has released two solo albums and, with sister, Maggie, an unusual collection of musical prayers, Zero Church.  She has written two books: the novel, \"Wayward Saints,\" and a children's book, \"Want To Be in a Band?\"  Suzzy is currently performing in The Wooster Group's \"Early Shaker Spirituals,\" \"Cry Trojans!,\" based on Shakespeare's \"Troilus and Cressida,\" and \"The Room,\" by Harold Pinter.  www.suzzyroche.com\n\nSinger/songwriter Lucy Wainwright Roche grew up in an impressive musical family. She is the daughter of Loudon Wainwright III and Suzzy Roche, and half-sister of Rufus and Martha Wainwright.  Lucy spent years traveling with her large musical family. After college, she began teaching second and third grade. In 2005 she joined brother Rufus on tour to sing backup, and after releasing an eight-song, debut CD, Lucy became a full-time touring musician. Recent tours have included solo appearances; double bills with Suzzy; and ensemble shows with Suzzy, Loudon, Rufus, Martha, and Sloan Wainwright. Lucy's recent CDs include solo release There's A Last Time For Everything. lucywainwrightroche.com\n\nLucy & Suzzy recorded their first duo CD, Fairytale and Myth in 2014.  Their newest release is 2016's Mud & Apples."}, {"date": "2017-09-16T17:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1844848182499428/", "name": "Ann Arbor Roller Derby presents: Derby Double-Header, Bout 5", "description": "Join Ann Arbor Roller Derby at Buhr Park on September 16th for our final Roller Derby Double Header of the year! Two great roller derby mash ups for one low price! \n\n6:00 - Arbor Bruising Co. vs. Downriver Roller Dolls: Doll Starz. The Bruisers havent beat Downriver since 2013. Both teams have claimed the title of Mitten Kitten Division 1 champions in the past two years. Who will take home the win between these two Michigan derby powerhouse teams? \n\n7:30 - Ypsilanti Vigilantes vs. Downriver Roller Dolls: Muscle. These teams are even for wins and losses against each other. Come see who will grab best of three! \n\nBouts include kid-friendly activities, half-time entertainment, sponsored concessions, and merchandise from both teams. Enjoy locally-brewed beer and cider from the Ypsi Alehouse while you watch the games! \n\nDoors open at 5:30, first whistle at 6:00!\n\nAdmission \n$12 pre-sale (see link below)\n\nAt the door\n$12 for students/seniors/military with I.D.\n$15 at the door \nKids under 12 get in FREE with paid admission (2 for each paying adult).\n\nJoin us for the after party at McShane's new location in Ypsi! \n2203 Ellsworth Rd\nhttp://mcshanespub.com/"}, {"date": "2017-09-17T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/252195118625953/", "name": "A2DC: Artistic ARBOR Drink Competition", "description": "Join us in the Terrace Ballroom for the first ever A2DC: Artistic ARBOR Drink Competition! Brought to you by Ann Arbor Distilling Company and Graduate Ann Arbor with all the proceeds going to the Ann Arbor Art Center.\n\nTen Ann Arbor bartenders will prepare and present a unique signature cocktail featuring Ann Arbor Distilling Company's ARBOR line of spirits. A panel of local judges will pick Ann Arbor's Best Bartender based on three criteria: taste, technique, and presentation. Plus, a Fan Favorite Bartender will be chosen based on your votes. The winning bartender will be announced at the end of the evening, so stick around to see the area's most talented mixologists show off their skills.\n\nTickets include a tasting of all ten drinks, a voting ticket, appetizers, and the chance to win great giveaways!\n\nPlease contact afredline@graduateannarbor with any questions.\n\nBartenders interested in competing can request the official rules by contacting a2dcjudges@gmail.com"}, {"date": "2017-09-19T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/297038780705110/", "name": "Pints and Poses: Fall Equinox Edition", "description": "Join us and celebrate the changing seasons with Pints and Poses: Fall Equinox Edition! This is an hour-long, all-levels vinyasa class. Tickets are $20 apiece and include the yoga session and a pint of your choice at the end of class. \r\n\r\nClass will be led by Robin Schultz-Purves, a local yoga instructor who has led several Pints and Poses classes at Wolverine! These classes do sell out pretty quickly, so make sure to grab your tickets while they're available."}, {"date": "2017-09-20T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/755238804656105/", "name": "Com Truise + Nosaj Thing at the Blind Pig 9/20/17", "description": ":: Com Truise + Nosaj Thing ::\n\nWed. September 20 | 9pm | 18+ | Tix: https://goo.gl/TfUbBh"}, {"date": "2017-09-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/254885721697292/", "name": "The Captain Class- reading", "description": "Join me for a reading and book signing in my hometown of Ann Arbor. #goblue"}, {"date": "2017-09-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/280675165703011/", "name": "Barbara Fradkin & Vicki Delany", "description": "Barbara Fradkin signs hernew Amanda Doucette book, THE TRICKSTER'S LULLABY and Vicki Delany signs BODY ON BAKER STREET"}, {"date": "2017-09-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/104647503547823/", "name": "John Keyse-Walker", "description": "John Keyse-Walker signs his second Teddy Creque myster, Beach, Breeze, Bloodhsed."}, {"date": "2017-09-21T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/249409948903026/", "name": "Wild Belle w/ Fred Thomas at the Blind Pig", "description": "Wild Belle live at the Blind Pig\nwsg: Fred Thomas\n\nDoors 8pm / Show 9pm / 18+ | Tix: https://goo.gl/GPbjbQ"}, {"date": "2017-09-21T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1878374215761529/", "name": "DJ Jazzy Jeff at Necto", "description": "Necto proudly presents....\nThe Magnificent... DJ JAZZY JEFF\n\nwith opening sets by\nERNO THE INFERNO\nMichael Fotias\nTwo Can Win!\n\nNow this is a story all about how My life got flipped - turned upside down... \n\nDJ Jazzy Jeff was born in West Philadelphia and developed a love of music at an early age. Jeff was just 10 years old when he started spinning records at parties using his family’s basement as a training ground for his expert mixing. Since 1985, DJ Jazzy Jeff has wowed us with his flawless turn- table skills, innovative production and musical versatility.\n\nFrom the success of “DJ Jazzy Jeff and the Fresh Prince” with partner Will Smith, to the critical acclaim of his production company “A Touch of Jazz”, Jeff proved time and time again that he would always be a force to be reckoned with. And he continues to represent with his solo projects, collaborations, mixtapes and live shows. His love of music shines through in everything he does.\n\nOver the course of his career, DJ Jazzy Jeff has achieved many accomplishments including a DMC Championship and multiple GRAMMY and American Music Awards and nominations. But he is a humble man who is still doing it as his 2002 hit said: “For Da Love of Da Game.”\n\nWatch: https://www.youtube.com/user/jefftownes\nListen: https://soundcloud.com/djjazzyjeff\nTalk: https://twitter.com/djjazzyjeff215\nMeet: https://www.facebook.com/djjazzyjeff/\nPeek: https://www.instagram.com/djjazzyjeff/\n\nDoors at 9pm. 18 + welcome with proper ID. \nVIP Services available. Contact VIP@necto.com"}, {"date": "2017-09-22T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/217245968802454/", "name": "The Get Up Kids at the Blind Pig 9/22/17", "description": "The Get Up Kids live at the Blind Pig\nwsg: Pet Symmetry\n\nDoors 7pm | All Ages | Tix: https://goo.gl/3j2SgG"}, {"date": "2017-09-22T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/161992391041848/", "name": "Rob Crozier Jazz Ensemble", "description": "Rob Crozier, bass, didgeridoo, thumb piano\nPaul Vornhagen, saxophone\nBrian Brill, piano\nRodney Rich, guitar\nDavid Alvarez, drums\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nRob Crozier is a professional musician, educator, composer/arranger and entrepreneur living in the Southeastern Michigan area. Mr. Crozier holds a BFA for Jazz and Contemporary Improvisation in Double Bass from University of Michigan.\nOn his latest release, \"Tall Trees,\" Crozier stretches his music to explore the world of sound adding color, adventure, and newness through re-imagining standards, the use of electronics, and ethnic instruments. His work with the Celtic fusion band Nessa can be heard on both of their CDs and the latest single \"The Grey Selkie.\" Rob's business, Eventjazz, provides live music to weddings and parties throughout Southeastern Michigan."}, {"date": "2017-09-22T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/168844286987290/", "name": "Pop Punk in Ann Arbor", "description": "On The Way Booking:  Pop Punk in Ann Arbor, MI\n\nPlans (IN):  https://weareplans.bandcamp.com/\nTelegraf:  https://telegrafmi.bandcamp.com\nThe Major Minor:  https://themajorminormusic.bandcamp.com/\nGet Stoked:  https://getstokedmi.bandcamp.com/\nTranquility:  https://soundcloud.com/tranquility-band\nSo Called Ghost:  https://socalledghost.bandcamp.com/\n\nDoors:  9pm\nTickets:  $10\nDoors:  $10"}, {"date": "2017-09-22T22:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/189172538288839/", "name": "Undesirable People / Fallow Land / Seaholm at Blind Pig", "description": "Undesirable People.\nwsg: Fallow Land & Seaholm\n\nThe Get Up Kids after party.\n\nLive at the Blind Pig - Ann Arbor\n\n10pm Late show | 18+ | No Cover!"}, {"date": "2017-09-23T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/314029212393013/", "name": "Parisian Soirée", "description": "Deanna Relyea, mezzo-soprano\nMonica Swartout-Bebow, mezzo-soprano\nJane Schoonmaker Rodgers, soprano\nEmily Benner, soprano\nJoan Morris, soprano\nKathleen Kelly, piano\nKevin Bylsma, piano\nWilliam Bolcom, piano\nKathryn Goodson, piano/voice\nAlvin Waddles, piano\nTimothy McAllister, saxophone\n\n$50 Assigned Rows 1-2\n$35 Assigned Rows 3-5\n$25 General Admission\n$10 Student\n\n“To hear a number of Ann Arbor's top-notch talent perform together in a fun, laid-back atmosphere for an evening was certainly a real treat. Or, as the French would say, magnifique!” – Ann Arbor Journal\n\nThis annual event is fun, full of surprises, includes champagne and features a program that focuses on repertoire with a connection to all things Parisian - from classical, jazz, cabaret, to anything goes!\n\nThis performance is support in part by an award from the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts. Art Works."}, {"date": "2017-09-23T20:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1442545592449165/", "name": "Chirp wsg Wire in the Wood and Bigfoot Buffalo, Blind Pig 9/23", "description": "Chirp makes its return to the Blind Pig with support from Wire in the Wood (Ann Arbor) and Bigfoot Buffalo (Grand Rapids)! Lots of musical variety among these three groups, the common thread being they'll all leave you no choice but to boogie down. \n\nDoors @ 8:30\n$8/$11 under 21\nSet times TBA\n\nChirp (Proggy Funky Fusion)\nhttps://youtu.be/-ZncqMuKn84\n\nWire in the Wood (psychoacoustidelicstringjams)\nhttps://www.wireinthewood.com\n\nBigfoot Buffalo (Psychedelic Roots Rock)\nhttps://bigfootbuffalo.bandcamp.com/"}, {"date": "2017-09-23T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1028260597316992/", "name": "Chirp @ Blind Pig"}, {"date": "2017-09-24T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/725506710963319/", "name": "Webers Inn Ann Arbor Whimsical Occasions Wedding Event Show", "description": "Metro Detroit's best of the best Vendors presenting their finest wedding related products and services.\n\nCLICK ON TICKETS ABOVE for 2 FREE ADMISSIONS (a $20 value)\n\nShowcased Wedding Vendors\n\nPrize Drawings every 15 minutes.\n\nFashion Shows\n\nLive Entertainment\n\nFREE PARKING\n\nPlan your Wedding in One Day.\n\nWedding Discounts & Free Samples\n\nSave thousands on your wedding with exclusive show specials.\n\nEnjoy a fun filled afternoon filled with wedding exhibits, planning ideas, fashions and fun! Win Great Gifts and Prizes.\n\nMany exhibitors will be offering money-saving show specials this day only as well as demonstrating their products and services, offer samples and more.\n\nDon't miss the opportunity to meet some of the most sought after leading wedding professionals and learn creative ideas for your wedding day."}, {"date": "2017-09-24T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/483732111962088/", "name": "ModernLadyFitness, North by North, Gruesome Twosome at Blind Pig", "description": "Modern Lady Fitness\nhttps://modernladyfitness.bandcamp.com/\n\nNorth By North (Chicago, IL)\nwww.northbynorth.bandcamp.com\nhttps://open.spotify.com/artist/5IoXcA5DIDSG0QlNNoqQdZ\n\nThe Gruesome Twosome\nhttps://gruesometwosomeypsi.bandcamp.com/releases"}, {"date": "2017-09-27T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/623137087881736/", "name": "Poto Chapter Meeting - Brighton Rec", "description": "Join us at Brighton Recreation Area for a Poto Chapter meeting. Social ride 5:00 – 7:00pm. Casual chapter meeting from 7:00pm - 7:30pm followed by a pot luck (bring something to throw on the grill and something to share). Please contact info@potomba.org with any questions.\n\nThis event is being brought to you by the Potawatomi Mountain Biking Association."}, {"date": "2017-09-27T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1875491562692086/", "name": "That 1 Guy at the Blind Pig 9/27/17", "description": "Imagine the brainchild of Dr. Seuss, Captain Beefheart, Frank Zappa, Stanley Kubrick and Rube Goldberg, and you begin to understand the spectacle of a That 1 Guy performance by Berkeley, CA-based, classically trained musician Mike Silverman. As inventor and player of The Magic Pipe, That 1 Guy’s show has to be seen to be believed, as he single-handedly (and foot-edly) plays his amazing instrument, made out of miked steel pipes with a single, thick bass string wired from top to bottom, not to mention an Appalachian handsaw, an electric cowboy boot and belching smoke.\n\n9pm | 18+ | Tix: https://goo.gl/ZjQNDh"}, {"date": "2017-09-28T17:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1876999832517021/", "name": "A2 Art & Brew", "description": "Join us for this year’s A2 Art & Brew, a fundraiser benefiting the Ann Arbor Art Center! This year each participating venue will feature three different pairings (beer tasting and one-bite snack); try all three at a few locations or try one at each location. Guests will visit participating establishments and taste these well-crafted pairings to see how different beers and food work together.\n\nIn connection with the exhibition, In Transit, guests will have the chance to view select pieces of art from the exhibition in the restaurants.\n\nA2 Art & Brew guests have the opportunity to choose the Best Brew, Best Bite, and Best Pairing during the event and the winner(s) will be announced following the event!\n\nAttendees must be 21 or older by 9/28/2017.\n\n#a2artandbrew #a2artcenter\n\nLear more: https://goo.gl/Y2V4Wx"}, {"date": "2017-09-28T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1866456523676680/", "name": "Grieves at the Blind Pig - September 28th", "description": "GRIEVES\nRUNNING WILD TOUR 2017\nw/ Dem Atlas\n\n$15\nDoors 9:00pm\n18+\n\n\nhttp://grievesmusic.com\nhttps://facebook.com/Grievesmusic\nhttps://twitter.com/grievesmusic\nhttps://instagram.com/grieves/"}, {"date": "2017-09-28T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1570984809621394/", "name": "Grieves at the Blind Pig 9/28/17", "description": "Grieves just announced his new album, Running Wild, is set for release on August 25th, and just dropped the first single, \"RX\"!\n\nIt's been over three years since his last album, Winter & The Wolves, but Grieves has re-emerged with a modernized sound that is lush and intoxicating, pairing punchy drums with thick layers of synths and warm bass lines. Whether dark and moody, or bright and upbeat, Grieves smoothly navigates the new soundscape, penning verses that range from confessional to carefree.\n\nWSG: Dem Atlas &  James Gardin\n\n9pm | 18+ | Tix: https://goo.gl/hFoQ8S"}, {"date": "2017-09-28T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/664957517040960/", "name": "Claptone at Necto", "description": "React Detroit presents...\n\n:: Claptone ::\n\nSupport by:\nSonya Alvarez\nIota\n\nNecto Nightclub\n516 E. Liberty Street\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-09-29T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1126347097471880/", "name": "Reggie Harris and David Roth at Green Wood Coffee House", "description": "Reggie Harris combines spirituals and roots music, historic inspiration, and moving original songs, often in the themes of unity and social justice: “Songs of Joy, Hope, and Freedom.”  Known for over 40 years as one half of the duo, Kim & Reggie Harris, Reggie continues to crisscross the country, carrying the message of joy, unity, and peace through the powerful medium of live music.  A songwriter of great depth and passion, Reggie writes from a personal sense of mission filled with possibility and hope. His songs are about life and love and deep aspects of the human experience.  He is a vocalist, arranger, and guitarist whose open spirit and wide smile invite us to share in an inspirational evening of music and stories. www.reggieharrismusic.com\n\nDavid Roth strikes many chords, hearts, and minds with his unique songs, offbeat observations, moving stories, sense of the hilarious, and powerful singing and subject matter. As singer, songwriter, recording artist, keynote speaker, workshop leader, and instructor, David has earned top honors at premier songwriter competitions and taken his music, experience, and expertise to a wide variety of venues in this and other countries full-time for more than two decades.  David’s songs have found their way to Carnegie Hall; the United Nations; several \"Chicken Soup for the Soul\" books; the Kennedy Center; Peter, Paul, & Mary’s Discovered; the Kingston Trio’s Born at the Right Time; the classic folk song book, “Rise Up Singing,\" and 13 CDs. \n\nCome enjoy this collaboration of music and friendship as Reggie and David share the stage on a fine September evening!\n\nIf there's room: With great sadness and heavy hearts, we said goodbye to Michael Johnson on July 26, as he passed away at home after a lengthy illness. Michael graced our stage with annual visits over the last dozen years or so, and we will miss him terribly. Condolences may be shared on the message board at www.mjblue.com."}, {"date": "2017-09-30T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/348791458890011/", "name": "Dave Rempis’s Ballister : Warming up the Edge!", "description": "Dave Rempis, alto/tenor/baritone saxophone\nFred Lonberg-Holm, cello\nPaal Nilssen-Love, drums\n\n$25 Assigned Rows 1-2\n$15 Assigned Rows 3-5\n$10 General Admission\n$5 Student\n\n\n\nBallister is named after a crossbow, and they put a premium on aggression. There’s a freshness and sense of discovery in their wide-ranging music. But there’s also a deep and hard-earned understanding between these players which enables them to build tension to the point of shattering, and then surf gracefully upon the shards. -Bill Meyer DOWNBEAT MAGAZINE\n\nLet’s hope that those who were at the Hideout in Chicago on June 16th of last year have sufficiently recovered in the meantime, because based on this live recording, they must at least have had their eyebrows scorched off. -Guy Peters FREEJAZZ.ORG\n\nAs with all excellent improvisation, the process is seamless, whether the trio is intertwining the cellist’s electronics with the drummer’s ride cymbal or whether they are burning up the stage to some old school energy jazz. The illusion created here is of controlled chaos where themes emerge from the wall of energy and the band directs the current. -Mark Corrotto ALLABOUTJAZZ\n\nBallister might start with the question,” what do we do with all this energy?” Rage, yes; but there is more…. The trio burns, but not for the sake of combustion. In between the uproar is the meat, the viscera, and the heart of sound. This trio finds beauty in the maelstrom. -The New York City Jazz Record"}, {"date": "2017-09-30T21:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1972930246297771/", "name": "What Happened? - After Hours Radio EP Release Show", "description": "After Hours Radio's new album, 'What Happened?', is coming out on September 30th. Come celebrate with us and some of our favorite bands at the Blind Pig - Ann Arbor, MI. \n\n18+ | 9:30 PM \n$7 / Under 21 $10\n\nalso featuring: \n\nSummer Like The Season | indie electronic/art rock\nsoundcloud.com/summerliketheseason\n\ncig butts | eclectic blues/garage rock \nsoundcloud.com/cig-butts\n--------------------------------------------------------------\nAfter Hours Radio's past releases:\nafterhoursradi-o.bandcamp.com\n\nAlbum Artwork by GSW Art & Design\n\nStay Tuned for Updates"}, {"date": "2017-10-03T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1964652950436740/", "name": "Quinn XCII - The Story of Us Tour - Blind Pig", "description": "Quinn XCII live at the Blind Pig\nWith Special Guest: shallou\n\nDoors 9pm / 18+ / Tix: https://goo.gl/BJcyzn\n\n2017 continues to be a breakout year for the newcomer Detroit singer/songwriter, Quinn XCII.  With his ability to seamlessly blur the lines between pop, electronic, hip-hop, and soul music, he has quickly paved his own lane with his unique sound."}, {"date": "2017-10-04T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1791802354412879/", "name": "Audien – Euphoria at Necto", "description": "React Detroit presents...\n\n:: Audien ::\n\nDay, 10/04/17 @ Necto Nightclub (Ann Arbor, MI)\n$15 // $20\n18+\n9pm\n\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-10-05T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1794662000862849/", "name": "Matthew Dear (DJ Set) : Homecoming", "description": "Necto presents...\n\nMATTHEW DEAR (DJ Set) \n\nwith opening artist... TBA\n\nWe can't believe that it's been over 15 years since Matthew Dear was a resident here at Necto. Since then he has gone on to create amazing music & play all over the world. Please join us as we welcome Matthew back to Necto with a Very Special Homecoming! \nhttp://dj-kicks.com/matthewdear/\n\nWatch: https://www.youtube.com/channel/UCwrOfciTBb4zSninHNwQ-6Q\nListen: https://soundcloud.com/matthewdear\nTalk: https://twitter.com/matthewdear\nMeet: https://www.facebook.com/matthewdear/\nPeek: https://www.instagram.com/matthewdear/?hl=en\n\nDoors at 9pm • 18 & over welcome with valid proper ID • VIP services available, contact: VIP@necto.com"}, {"date": "2017-10-06T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/178735225989510/", "name": "Jonathan Edwards at Green Wood Coffee House", "description": "Warm as summer sunshine, real as the truth, intimate as a long overdue visit between old friends … such is a Jonathan Edwards concert. Four decades into a stellar career of uncompromising musical integrity, the man simply delivers, night after night – songs of passion, songs of isight, songs of humor, all rendered in that pure and powerful tenor which, like fine wine, has only grown sweeter with age.\nThis is one veteran performer who is neither grizzled nor nostalgic.\nJonathan's highly respected repertoire includes such classics as, “Sometimes,” “One Day Closer,” “Don’t Cry Blue,” “Emma,” “Everybody Knows Her,” “Athens County,” and everyone’s favorite ode to putting a good buzz on, “Shanty.” And then, of course, there’s the anthemic “Sunshine (Go Away Today),” that fierce proclamation of protest and independence that resonated with thousands and thousands of frustrated and angry young men and women when it was first released in 1971. Almost 40 years later, at show after show, the song continues to be embraced by faithful followers and new fans alike.\nSince 1971, Jonathan has released 15 albums, including \"Blue Ridge,\" his standard-setting collaboration with bluegrass favorites the Seldom Scene, and \"Little Hands,\" his collection of children’s songs, which was honored with a National Library Association award. His brand new album is, \"Tomorrow's Child.\"\nwww.jonathanedwards.net"}, {"date": "2017-10-06T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/240852009759343/", "name": "Mitski w/ Stef Chura at the Blind Pig 10/6/17", "description": "Mitski warmly recalls a quote from sculptor El Anatsui, “Art grows out of eachparticular situation, and I believe that artists are better off working with whatever their environment throws up.”\n\nWith this nerve exposed lyrically, and having dived into her new\nbeginning, Mitski chooses her 2014 breakthrough album Bury Me at Makeout Creek to explore uncharted sonic territory, trading in large string arrangements for guitar and bass. \n\nWSG: Stef Chura\n\nDoors 9pm | 18+ | Tix: https://goo.gl/mUHQqf"}, {"date": "2017-10-08T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/333084993810227/", "name": "Tamir Hendelman Trio", "description": "Tamir Hendelman, piano\nPaul Keller, bass\nSean Dobbins, drums\n\n$35 Assigned Rows 1-2\n$25 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nAward-winning jazz pianist Tamir Hendelman has toured the US and Europe and recorded with the Jeff Hamilton Trio, James Moody, Tierney Sutton, Clayton-Hamilton Jazz Orchestra, Roberta Gambarini, Barbra Streisand, Natalie Cole and more. Michigan jazz all-stars Paul Keller and Sean Dobbins join him in this concert."}, {"date": "2017-10-10T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1900503113504697/", "name": "Crywolf at Necto", "description": "React Detroit presents...\n\n:: Crywolf ::\n\nNecto Nightclub\n516 E. Liberty St.\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-10-12T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1435756079834055/", "name": "Elephante at Necto", "description": "React Detroit presents...\n\n:: Elephante ::\n\nSupport TBD\n\nNecto Nightclub\n516 E. Liberty Street\nAnn Arbor, 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-10-13T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/136754983554255/", "name": "Batman Ride", "description": "Ride the Poto, backwards, at night on October 13th!  The Batman Ride will be staging at the Silver Lake Parking lot. Arrive at 7:00pm and ride at 7:30pm. We will have a first group of faster riders doing the full loop, and a second group of “normal” riders doing part of the trail. After the ride, we will have a campfire and typically riders bring food to share. Come out and ride the Poto backwards with lights!\n\nWhat you should bring:\n 1. light\n 2. back-up light\n 3. cell phone\n 4. trail map, tools, survival gear (just kidding – no man left behind!)\n 5. food/beverages/change of clothes for post ride"}, {"date": "2017-10-13T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1862343670748575/", "name": "Bob Sweet Quartet", "description": "Bob Sweet, drums\nTad Weed, piano\nAndrew Bishop, saxophone, flute, clarinet\nKurt Krahnke, bass\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nThis is a powerful quartet featuring Bob Sweet on drums, Tad Weed on piano, Andrew Bishop on saxophones,flute, and clarinet, and Kurt Krahnke on bass. Expect high energy, unpredictable improvisation, and a diverse and eclectic mix of compositions."}, {"date": "2017-10-13T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1397564270332697/", "name": "Jeremy Horn at Green Wood Coffee House", "description": "Jeremy Horn grew up in Memphis -- \"Home of the Blues\" and \"Birthplace of Rock and Roll\" -- but his music sounds more like the Beatles than B.B. King or Elvis.  He writes songs for the church and songs for the radio, yet his songs are more complex than either has traditionally allowed.  He lives in a city that is known as much for its racial unrest and inner-city violence as it is for being the place Elvis called home, yet he leads worship at one of the largest multicultural churches in the South, where half the congregation is African-American. When you meet Jeremy, he looks and sounds just like the \"guy next door\" -- if the guy next door has a traditional southern drawl.  Making music has preoccupied  Jeremy Horn ever since he received his first guitar at age fifteen. Growing up on the sounds of James Taylor and the Beatles, Jeremy spent most of his early years emulating the sounds and songwriting styles of the popular culture. \"I used to write songs about social injustices in the world,\" says Horn. After a few years and conversations with a wise, older friend, Jeremy realized he could also write songs that aspired to give people hope, and not just write what everybody else was writing. Says Horn, \"That progressed into writing songs for Jesus, and that was the process that unexpectedly led me to become a worship leader.\" That progression started Jeremy Horn on the path of continued discovery --listening to artists both Christian and not -- to figure out how to express feelings and concepts that came from within, rather than from the evening news.  Jeremy's music is a fixture on Michigan's 17 Smile-FM Contemporary Christian music stations; his \"I Will See Angels 'Round Your Throne\" and \"First Love\" are two of his popular hits. Jeremy's new CD is No Other Love. This is a rare opportunity to see Jeremy Horn in a small venue setting. Bring a friend!\nwww.jeremyhornmusic.com"}, {"date": "2017-10-14T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/245145345996001/", "name": "5th FALL Holistic & Psychic Expo - Oct. 14-15, 2017", "description": "Join us for Intuitives Interactive's 5th Annual FALL HOLISTIC & PSYCHIC EXPO! One of the largest events of its kind in Michigan! Saturday-Sunday, October 14-15, 2017\n\nLOCATION: \nThe beautiful EMU Student Center\nEastern Michigan University in Ypsilanti (next-door to Ann Arbor)\n900 Oakwood Street, 2nd floor Ballroom and Auditorium \n(ground floor as you enter from the parking lot, with elevator)\nYpsilanti, MI 48197\n~ TONS of FREE PARKING ~ \n(on Oakwood Street and N. Huron River Drive)\n\nSPONSORED BY: Body Mind Spirit Guide & Body Mind Spirit Radio, Crazy Wisdom Bookstore & Tea Room, and the Enlightened Soul Center\n\n- SATURDAY, OCTOBER 14, 2017 - 10:00 am - 6:00 pm\nDoors open 9:30 am for registration on Saturday\n\n- SUNDAY, OCTOBER 15, 2017 - 11:00 am - 5:00 pm\nDoors open 10:30 am for registration on Sunday\n\n**FIRST 50 PAID ATTENDEES during the first hour EACH DAY**\nGET A GIFT BAG valued at $20!\n\nTO APPLY FOR A BOOTH as a bodyworker, reader, or vendor: https://www.holisticpsychicexpo.com/apply\nWE ARE HALF FULL with participants from the last Expo who pre-registered; DON'T DELAY WHEN WE ANNOUNCE ONLINE REGISTRATION IS OPEN! (late July)\n\nAPPLICATION DEADLINE: TBA\nLate applications will be accepted until we are full, but may not be included in the promotions or handouts.\n\nADMISSION: \n$10 Daily Adult Ticket / $8 Online in advance by October 10\n$15 Adult Weekend Pass / $12 Online in advance by October 10\n$8 College students (daily) / $7 Online in advance by October 10\n$5 Kids 12-17 yrs / Under 12 free \nPAID ADMISSION includes FREE presentations both days! \n\nADVANCE DISCOUNTED TICKETS ONLINE (thru Oct. 10):\nSave $2 per adult ticket or $3 for a weekend pass!\nhttps://www.holisticpsychicexpo.com/purchase-tickets\n\nSCHEDULE of PRESENTATIONS - FREE with Expo admisison:\nhttp://www.holisticpsychicexpo.com/presentation-schedule\n\n\nREADINGS: BOTH IN OUR PRIVATE READER ROOMS (with Concierge Service and no interruptions) & AROUND THE VENDOR BALLROOM! \nThere will be Mediums, Psychics, Tarot & Angel Card Readers, and Intuitive & Channeled Readings...and more! \nhttp://www.holisticpsychicexpo.com/reader-room/\nhttp://www.holisticpsychicexpo.com/vendors/\n\nBODYWORK & ENERGY WORK from healers of all types:\nhttp://www.holisticpsychicexpo.com/bodyworkers/\n\nOTHER GREAT OFFERINGS INCLUDE: Aura Photography, Pyramids, Body & Energy Workers, Essential Oils, Vendors of Holistic & Metaphysical Products, Crystals & Stones, Jewelry, and More! http://www.holisticpsychicexpo.com/vendors/\n\nVOLUNTEERS NEEDED! Volunteers get special perks in exchange for their dedicated service. REGISTRATION AVAILABLE SOON at:\nhttp://www.holisticpsychicexpo.com/volunteer/\nor contact Ellie at volunteers@intuitivesinteractive.com to inquire\n\nMAILING LIST: Join our mailing list by filling out the form at:\nhttp://holisticpsychicexpo.com/\n\nThanks and we look forward to seeing YOU and your friends at this transformative event!!!"}, {"date": "2017-10-14T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1956825434554746/", "name": "Spafford (2 Sets) Hayley Jane & The Primates at Blind Pig", "description": "Spafford fall tour is coming to Blind Pig - Ann Arbor, MI on 10.14.17. \nwsg: Hayley Jane and the Primates\n \nTickets available here - http://bit.ly/2rWwhxb\n\nMore info can be found at www.spafford.net"}, {"date": "2017-10-14T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1970285193239380/", "name": "Petra van Nuis, vocalist & Andy Brown, guitar", "description": "Petra van Nuis, vocals\nAndy Brown, guitar\nJim Dapogny, piano\nPaul Keller, bass\nPete Siers, drums\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nHigh school sweethearts and husband-and-wife duo Petra van Nuis and Andy Brown return to the Kerrytown stage alongside some of Michigan’s best for an evening of swing. Described by the Midwest Record as “one of the most ripping good new duos to come along”, this Chicago-based duo’s classic jazz interpretations are bursting with skill and imagination.\n\nThis performance is made possible through the generous support of the Don Chisholm Friends of Jazz at the Kerrytown Concert House.\n\n\"Petra van Nuis' voice is at once alluring and robust...her tone alternates between delicate playfulness and declarative strength, perfectly suiting the hot jazz...\" - Jack Huntley, All About Jazz\n\n\"The voice, the timing, the phrasing, the look, and everything else was all working and she was hitting the musical equivalent of a grand slam home run in baseball right there in front of me...\" - Randy Freedman, Chicago Jazz Magazine"}, {"date": "2017-10-15T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/140912223163382/", "name": "The difficulty of crossing a field by David Lang and Mac Wellman", "description": "Kathleen Kelly, coach/conductor\nMadison Montambault, mezzo-soprano (Mrs. Williamson)\nMeredith Kelly, soprano (Willamson Girl)\nGoitsemang Lehobye, soprano (Virginia Creeper)\nRehanna Thelwell, mezzo-soprano (Old Woman)\nWestley Montgomery, tenor (Boy Sam)\nMarty Gray, tenor (Mr. Williamson/Magistrate)\nMatthew Fleisher, bass (Armor Wren/Andrew)\n\n$35 Assigned Rows 1-2\n$25 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nBased on a one-page story by Ambrose Bierce, the difficulty of crossing a field is a joint collaboration in musical theater between composer David Lang and playwright Mac Wellman. It recounts a strange disappearance through the explanations and impressions of the bystanders - or are they the perpetrators? Mixing arias with spoken text and emotional melodies with tense drama, the story takes place in 1854 near Selma, Alabama, where a planter named Williamson has vanished without a trace while crossing a field."}, {"date": "2017-10-17T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/805061756330555/", "name": "Gryffin at the Blind Pig 10/17/17", "description": ":: GRYFFIN :: \nLive at the Blind Pig\nwsg: Autograf (DJ Set) & ayokay\n\nDoors 8pm | all ages | Tix: https://goo.gl/zEbTQf\n\nLast year, L.A.-based producer Gryffin delivered two heavy-hitting singles that showcased his deeply melodic take on dance music. With both tracks built on a graceful fusion of indie and electronic elements, “Heading Home (ft. Josef Salvat)” shot to #1 on Spotify’s US and Global Viral charts, while “Whole Heart” (a collaboration with Bipolar Sunshine) hit #2 on Spotify’s New Music Friday playlist. Also known for turning out several of the biggest remixes in recent years—including his masterly reworkings of Tove Lo’s “Talking Body,” CHVRCHES’ “Clearest Blue,” and Years & Years’ “Desire”—Gryffin is now offering up his latest original track and bringing his boundary-shattering artistry to bold new heights."}, {"date": "2017-10-19T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1036622406444168/", "name": "William Kent Krueger & 25th Anniversary Celbration", "description": "Mr. Krueger will sign his new Cork O'Connor novel and help Aunt Agatha's celebrate their 25th Anniversary.  Saty tuned for more details!"}, {"date": "2017-10-19T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/309183172833727/", "name": "Julia Keller joins our 25th Anniversary Celebration", "description": "Julia Keller joins William Kent Krueger for a conversation about her books, including her new Bell Elkins novel FAST FALLS THE NIGHT."}, {"date": "2017-10-19T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/444438482605744/", "name": "Golf Clap : Level Up Tour at Necto", "description": "Necto presents...\n\nGolf Clap : Level Up Tour\n\nwith opening sets by...\nSonya Alvarez\nPressed & Proper\n\n\nDJs; producers; club headliners; after-party enthusiasts: Golf Clap are Hugh Cleal and Bryan Jones, a Detroit duo with an unmatched passion for house music and a seemingly endless supply of studio and club-focussed creativity. And with releases on some of the world’s most influential house labels already under their belts, along with a lauded Boiler Room session and beyond, they’re only just getting started. \n\nWatch: https://www.youtube.com/user/GolfClapDET\nListen: https://soundcloud.com/golfclapdet\nTalk: https://twitter.com/golfclapdet\nMeet: https://www.facebook.com/golfclapdet/\nPeek: https://www.instagram.com/golfclapdet/\n\nDoors at 9pm. 18 + welcome with proper ID. \nVIP Services available. Contact VIP@necto.com"}, {"date": "2017-10-20T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/639471626252429/", "name": "Chuck Brodsky at Green Wood Coffee House"}, {"date": "2017-10-23T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1633141923420124/", "name": "Brian Charette and Jordan Young: A Circuit Bent Organ Duo", "description": "Brian Charette, organ/piano\nJordan Young, drums\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nNew York City organist/pianist Brian Charette has established himself as a leading voice in modern jazz. Charette is a Grammy-nominated, Hammond-endorsed artist who was the winner of the 2014 Downbeat Critics’ Poll in the \"Rising Star: Organ\" category and has climbed to 4th place in The 2015 Critic's Poll in the main Organ category. This year Brian also won The Hot House Magazine Fan's Decision Jazz Award for Best Organist in New York and had three releases on the Jazz Week Top 20.\n\nIn the last 10 years drummer Jordan Young has been making a name for himself as one of the premier jazz drummers in New York City. He has performed and recorded as sideman for many top jazz artists such as Javon Jackson, Steve Wilson, Steve Nelson and Peter Bernstein to name a few. Jordan has recorded two albums as a leader. His debut recording aptly named \"The Jordan Young Group\" was self released in 2010, and \"Cymbal Melodies\" released on the Posi-Tone label in 2013. Both recordings met with critical acclaim. In addition, Jordan recently completed the Artist Diploma program at the prestigous Juilliard School. Currently, Jordan leads a successful organ trio that has toured internationally and performs steadily in and around the New York City area. He also continues to work as a sideman performing in some of New York City's most prestigious jazz venues such as Dizzy's Club Coca-Cola, 55 Bar, Smoke Jazz and Supper Club and Smalls, for example. He also maintains an active private teaching studio."}, {"date": "2017-10-26T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1852026231754422/", "name": "Gorgon City presents Kingdom at Necto", "description": "React Detroit presents...\n\n:: Gorgon City ::\n\nSupport from Detlef\nLocal support: Adam Westing & Food Fight\n\nNecto Nightclub\n516 E. Liberty\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-10-27T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1197738583685448/", "name": "Michael Stanley signs the new Detective Kubu novel", "description": "Michael Stanley - a.k.a. Stan Trollip and Michael Sears - visit us to discuss their new Detectove Kubu book, DYING TO LIVE."}, {"date": "2017-10-27T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1947918605489635/", "name": "Mary Gauthier at Green Wood Coffee House", "description": "Her songs? They’re about as idiosyncratic as anything in the wide world of “popular music.” They’re painfully personal, yet they somehow infiltrate the souls of her listeners, no matter how different the paths they’ve followed through their lives.\nSongs aren’t so much written as harvested by Gauthier. Though she lives not far from the hit-making mills of Music Row, she admits to knowing nothing about how to write on command.  She says, “I have to be called to write. The call comes from somewhere I don’t understand, but I know it when I hear it.”\nThat call first came to her a long time ago. Her life to that point had led her to extremes, plenty of negatives and a few brilliant bright spots. An adopted child who became a teenage runaway, she found her first shelter among addicts and drag queens. Eventually she achieved renown as a chef even while balancing her restaurant responsibilities with the demands of addiction to heroin.\nTwo more successful restaurants, an escalating addiction, and a subsequent arrest led her into sobriety. It was rehearsal for what was to follow, when she wrote her first song in her mid-thirties. From that point, Gauthier channeled a long line of eloquent works, including the achingly beautiful, \"Mercy Now.\" She says of her new CD, Trouble and Love, “I started the process in a lot of grief. I’d lost a lot. So the first batch of songs was just too sad. It was like walking too close to the fire. I had to back off from it. The truth is that when you’re in the amount of grief I was in, it’s an altered state. Life is not that. You go through that. We human beings have this built-in healing mechanism that’s always pushing us toward life. I didn’t want to write just darkness, because that’s not the truth. I had to write through the darkness to get to the truth. Writing helped me back onto my feet again. This record is about getting to a new normal. It’s a transformation record.” We are so pleased to welcome Mary Gauthier into our Series.\nmarygauthier.com"}, {"date": "2017-10-28T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/333454157089137/", "name": "Poto Singlespeed World Championship", "description": "The PSSWC is an unsupported group ride around the Potawatomi Trail. This is not a race."}, {"date": "2017-11-02T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/669511516573680/", "name": "Dopapod at the Blind Pig 11/2/17", "description": "Dopapod live at the Blind Pig!\n\nDoors 8pm / 18+ | Tickets: https://goo.gl/4zLUfp\n\nThe Boston born, now generally Northeast based, but ever on-the-go Dopapod has come a long way from their college basement, DIY party roots. While maintaining to be as grassroots as their humble beginnings, the group has earned praise from taste making critics like Huffington Post, Jambase, and Relix, all the while tending to their ever expanding community of devoted listeners. The past 4 years have individually held the weight of about 150 shows, and included numerous festival appearances like Wakarusa, Summer Camp, Electric Forest, Camp Bisco, Peach Fest, & Gathering Of the Vibes."}, {"date": "2017-11-03T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1863433740573875/", "name": "Danny Schmidt at Green Wood Coffee House", "description": "Danny Schmidt has amassed a cult following for his poetic, poignant imagery. With lyrical depth drawing comparisons to Leonard Cohen, Townes Van Zandt, and Dave Carter, Schmidt is an artist whose earthy poetry conjures magic from the mundane.\n\nArmed with voice, acoustic guitar, and acute commentary, Schmidt is an authentic timeless troubadour, one man sharing his truth in song unadorned and intimate. Danny's writing is diverse, from deeply-rooted Appalachian mountain gospel to haunted English balladry; from syncopated Piedmont country blues to vagabond 60's protest folk.  Danny tackles themes of love, loss, and longing; restless discontent; and grateful joy. He captures the sorrow and the beauty inherent in our everyday lives with the wisdom of a perceptive, compassionate elder and the innocent awe and tenderness of a child. \n\nFollowing his self-released Parables & Primes, Schmidt's 2007 release, Little Grey Sheep, began a streak of albums that charted at #1 on the folk radio charts internationally. After receiving a Kerrville New Folk award, Schmidt won the notice of venerable Americana roots label, Red House Records, which began releasing his albums in 2009.\n\nSchmidt released three albums on Red House, including Instead The Forest Rose To Sing; the spare and intimate Man Of Many Moons; and,  with his partner, Carrie Elkin, the amorous duo album, For Keeps. Schmidt's latest release is Owls, a mystical collection of ethereal allegories.  www.dannyschmidt.com"}, {"date": "2017-11-05T11:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/823808571129109/", "name": "2017 Michigan Tri-Chapter Ultimate Trail Challenge", "description": "Did you know there are over 30 different mountain bike trails in the metro Detroit area? \n\nThe Clinton River Area Mountain Biking Association (CRAMBA), Motor City Mountain Biking Association (MCMBA), and the Potawatomi Mountain Biking Association (Poto MBA) are teaming up this year to present the 2nd Annual 2017 Michigan Tri-Chapter Trail Challenge! The challenge involves riding all of the Metro Detroit IMBA chapter trails at least once during the 2017 season.\n\nWhat is the Tri-Chapter Trail Challenge?\n•\tThe Tri-Chapter Challenge: Complete a ride on all Metro Detroit IMBA trails (1 will be optional)\n\nCount me in! How do I participate?\n•\tJoin or renew your local IMBA chapter membership (CRAMBA, MCMBA or Poto MBA)\n•\tNot a member? Check out these websites:\n      o\tCRAMBA http://www.cramba.org/\n      o\tMCMBA http://site.mcmba.org/\n      o\tPoto MBA http://www.potomba.org/\n•\tRegister on BikeReg (https://www.BikeReg.com/michigan-tri-chapter-ultimate-trail-challenge ). Cost is $20\n•\tGo ride your bike! Ride the trails between January 1st and November 5th. Save a trailhead bike-selfie picture, Strava activity or other record from each ride.\n•\tTo accommodate all skill levels, it is not required to ride the entire trail network.  For example, blue loop at island lake, highland A loop, etc would all be acceptable.\n•\tSubmit your challenge summary by November 5th (Information will be emailed to you on how to track this, a template will be provided).\n\nChallenge riders unite!\n•\tJoin the Facebook group 2017 Michigan Tri-Chapter Ultimate Trail Challenge, link up with other Challenge participants and share pictures of your adventures.\n•\tWatch for group rides on the Tri-Chapter Challenge Facebook group and chapter Facebook groups. Join a ride that has been posted and meet other Challenge participants.\n•\tExercise your self-reliance and organize your own trail outing and invite others to join.\n•\tGet creative and combine multiple trails for some excellent endurance training rides (shut up, legs!)\n•\tJoin us at multi-trail ride events for a great opportunity to ride unique routes and check many trails off your list:\n      o\tMilford Trail Challenge Bike Fest (MCMBA) – June 3, 2017\n      o\tTriple Trail Challenge (Poto MBA) – September 16, 2017\n      o\tMassive Fallout (CRAMBA) –  September 30, 2017\n\nThis summer got busy, what if I can’t complete the whole thing?\n\n•\tWe will also recognize riders who complete all of the trails in their designated chapter.  You won’t be eligible for a shirt, but you can still claim a seat at the end of year gathering.\n\nClaim your Rewards!\n•\tStylish long-sleeve shirts are awarded for participants who complete the Tri-Chapter Challenge. (links to sizing at end of description)\n•\tJoin us for an exclusive post-season afterparty for participants who complete The Tri-Chapter Challenge or a Single Chapter Challenge (location and details to be announced later) with a chance for more swag!\n\nPlease contact Sarah Vano with any questions about the challenge (svano17@gmail.com).\n\nThe Details: List of Trails\n\nCRAMBA Chapter Challenge (14 trails - 1 optional)\n•\tAddison Oaks County Park (Leonard)\n•\tBald Mountain Recreation Area (Lake Orion)\n•\tBloomer Park (Rochester Hills)\n•\tClinton River Park Trails (Sterling Heights)\n•\tHolly-Holdridge Mountain Bike Trail (Holly)\n•\tHolly High School (Holly)\n•\tOrion Oaks County Park (Lake Orion)\n•\tOrtonville Recreation Area (Ortonville)\n•\tPontiac Lake Recreation Area (Waterford)\n•\tRiver Bends Park (Shelby Township)\n•\tRuby Campground (Avoca)\n•\tSeven Lakes State Park (Holly)\n•\tStony Creek Metropark (Shelby Township)\n•\tOptional - Stony Creek Trolley Trails and Skills Park (Shelby Township)\n\nMCMBA Chapter Challenge (11 trails):\n•\tHickory Glen Park (Commerce Township)\n•\tHighland Recreation Area (Highland Township)\n•\tHines Park (Plymouth Township)\n•\tIsland Lake Recreation Area (Brighton)\n•\tKensington to Proud Lake Connector (Milford Township)\n•\tLakeshore Park (Novi)\n•\tMaybury State Park (Northville)\n•\tMilford Trail (Milford)\n•\tMunson Park (Monroe)\n•\tProud Lake Recreation Area (Commerce Township)\n•\tRouge Park (Detroit)\n\nPotowatomi MBA Chapter Challenge (9 trails):\n•\tBrighton Recreation Area (Brighton)\n•\tDTE Energy Foundation Trail (Chelsea)\n•       Heritage Park (Adrian)\n•\tHewen’s Creek (Ypsilanti)\n•\tMorton – Taylor (Canton)\n•\tOlson Park (Ann Arbor)\n•\tPotawatomi (Pinckney)\n•\tRolling Hills (Ypsilanti)\n•\tSharon Mills (Manchester)\n\nshirt sizing:\nWomen's\nhttps://www.alphabroder.com/cgi-bin/online/webshr/prod-labeldtl.w?sr=B6500&currentColor=#tabs1-specs\nMen's\nhttps://www.alphabroder.com/cgi-bin/online/webshr/prod-labeldtl.w?sr=3501&currentColor=#tabs1-specs\n\n-----------------------------------------------------------------\n\n\n******UPDATED TRACKING INFO******\n\nWant to check your progress as you toil to complete the Tri-Chapter Ultimate Trail Challenge?  Want to see how you stack up across the competition?\n\nThen make sure to head over to the TCUTC Summary sheet to see how the field stacks up:\nhttps://docs.google.com/spreadsheets/d/1nyfd7CNDQ-kyRNqXrD0Fz_1_D1A7XUbPKgNMPVuapLE/edit#gid=143425007\n\nTo submit a trail, click on the link in the top left corner that says “CLICK HERE TO LOG A TRAIL!”.  Use this form to submit your progress as you ride; it’s mobile-friendly so that you can submit directly from the trailhead:  \nhttps://docs.google.com/forms/d/e/1FAIpQLSf53zYkjlquduiJALwCXWHAVfcS7Bty5ZRnNpPKUKNKYmYWJQ/viewform?c=0&w=1\n\nAfter you log a trail, you will see the status update on the summary sheet, provided two things are true: (1) you are registered for the challenge, and (2) you used the same email you used when you registered.  A copy of your submission will head to your inbox for your records.  Made a mistake when you hit “submit”?  Put the wrong trail name down, or need to update the completion evidence?  You can make edits to your submission using the email confirmation.\n\nDon’t see your ride show up?  Don’t worry, we will manually update the summary throughout the summer.  If you don’t see your progress logged within a few days, send us a gentle note and we’ll look into it.  Like you, we would rather be out riding our bikes than updating spreadsheets. . .\n\nOf course, this isn’t a race.  The challenge is to attempt all 33 trails listed across the 3 local chapters.  But whoever finishes first will sure have bragging rights over the rest of us!"}, {"date": "2017-11-07T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1371555482894314/", "name": "Zoe Speaks", "description": "Wonderful roots sounds and traditional songs from Kentucky"}, {"date": "2017-11-08T08:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/457860671225825/", "name": "The CGP & Dawg Tour: Tommy Emmanuel & David Grisman", "description": "Certified instrumental mastery!"}, {"date": "2017-11-08T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1208423229286648/", "name": "Steve Poltz", "description": "\"A master of darkly comic songwriting\" in a unique show"}, {"date": "2017-11-09T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/311070769323143/", "name": "Nora Jane Struthers", "description": "New music from one of Americana's most creative figures"}, {"date": "2017-11-09T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1370979892997690/", "name": "Christian Martin x Desert Hearts at Necto", "description": "Necto presents...\n\nChristian Martin x Desert Hearts [Mikey Lion | Lee Reynolds | Marbs | Porkchop]\n\nwith opening sets tba\n\nChristian Martin's love affair with electronic music began in 1995, as an early attendee at Southern California's legendary Moontribe full moon desert parties. After absorbing late 90's club life in New York, London, and Los Angeles, Christian settled in San Francisco in the spring of 2000. He started playing records in 2002 under the tutelage of his brother, Justin Martin, armed with a stack of Justin's old vinyl and used Technics 1200's from Sammy D.\n\nIn 2003, inspired by the massive desert soundsystems of old, Christian founded the dirtybird soundsystem. Along with co-founders Justin Martin, Worthy, and Claude VonStroke, dirtybird's Sunday afternoon BBQ's have quickly become a Golden Gate Park institution.\n____________________________________________________________________\n\nDesert Hearts was manifested from an abundance of positive energy in November of 2012. Starting as a 200 person renegade gathering in the Mojave, we have grown tremendously, refining our abilities to produce world class house and techno gatherings. Home of Desert Hearts Records and our roaming City Hearts party series, we aim to spread as much love as humanly possible through music and art.\n\nDesert Hearts started as a collaboration of San Diego based DJs Mikey Lion, Lee Reynolds, Marbs, Porkchop, and Deep Jesus alongside social influencer Christopher Kristoff. Together we put in all our love dedicating endless hours of our time to creating a beautiful place where we can gather and celebrate life through music and community.\n\nDoors open at 9pm. 18 & over welcome with proper ID.\nVIP services available. Contact: VIP@necto.com"}, {"date": "2017-11-10T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/144832839404479/", "name": "The Subdudes", "description": "The original New Orleans roots rockers"}, {"date": "2017-11-10T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1375065105913766/", "name": "Melanie at Green Wood Coffee House", "description": "At Woodstock, as a New York kid barely known outside the coffeehouse circuit in Greenwich Village, she sang her song, \"Beautiful People\" and inspired the first panorama of candles and cigarette lighters ever raised at a concert event. That, in turn, moved the young singer to write \"Lay Down (Candles in the Rain\"), which sold more than one million copies in 1970 and prompted Billboard, Cashbox, Melody Maker, Record World, and Bravo to anoint her as female vocalist of the year. Her single, \"Brand New Key,\" topped the charts in 1971.\nWith guitar in hand and a combination of amazing vocal talent, disarming humor, and a vibrant engagement with life, she was booked as the first solo pop/rock artist ever to appear at the Royal Albert Hall, Carnegie Hall, and the Metropolitan Opera House, and later opened the New Metropolitan Opera House in New York, the Sydney Opera House, and in the General Assembly of the United Nations, where she was invited to perform on many occasions as delegates greeted her performances with standing ovations.\nThe top television hosts of all time -- Ed Sullivan, Johnny Carson, and Dick Cavett -- battled to book her.\nUNICEF made her its spokesperson; Jimi Hendrix's father introduced her to the multitude assembled for the twentieth anniversary of Woodstock. Her records continued to sell -- more than eighty million to date. She's had her songs covered by singers as diverse as Cher, Dolly Parton, and Macy Gray. She's raised a family, won an Emmy, opened a restaurant, and written a musical about Wild Bill Hickok and Calamity Jane.\nThis is a rare opportunity to experience Melanie live and in person in an intimate venue. Don't miss it!\nwww.melaniesafka.com"}, {"date": "2017-11-11T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/430739813974178/", "name": "Joshua Davis", "description": "\"Some of the liveliest and most rocking roots music around\"—Performing Songwriter"}, {"date": "2017-11-12T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/465364813813526/", "name": "Dar Williams", "description": "In concert including a reading and discussion from her new book, What I Found In A Thousand Towns”"}, {"date": "2017-11-13T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/206311416562029/", "name": "Adrian Legg", "description": "A nonpareil guitar master"}, {"date": "2017-11-15T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1009126095943405/", "name": "Riders in the Sky", "description": "Get tickets early—it's the cowboy way!"}, {"date": "2017-11-16T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/345275675889853/", "name": "Loudon Wainwright III", "description": "\"In my head, Loudon Wainwright is Bono.\"—Judd Apatow"}, {"date": "2017-11-17T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/253675135089540/", "name": "Bruce Cockburn", "description": "A musical thinker and seeker"}, {"date": "2017-11-17T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/291030208004321/", "name": "Small Potatoes at Green Wood Coffee House", "description": "Small Potatoes is Jacquie Manning and Rich Prezioso. They describe their music as \"Celtic to cowboy,\" and say it's taken them \"years of careful indecision\" to develop a mix of music ranging from country, blues and swing to Irish ballads. You'll hear two great voices, fine guitar playing and a touch of tin whistle, flute, mandolin and bodhran. Small Potatoes' award-winning songwriting, close harmony and warm rapport with the audience makes for a wonderful evening. Their latest album is Christmas In The Cabin.\nwww.smallpotatoesmusic.com"}, {"date": "2017-11-18T14:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/114858145717244/", "name": "Maureen Jennings signs Let Darkness Bury the Dead", "description": "Ms. Jennings signs her new Inspector Murdoch mystery, the first book since 2010!"}, {"date": "2017-11-18T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/237495930092984/", "name": "Cheryl Wheeler w/Kenny White", "description": "Singer, songwriter, and comedienne extraordinaire"}, {"date": "2017-11-24T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1396121547124326/", "name": "Black-Friday MTB Ride", "description": "Join the POTO Chapter as they lead a fun group ride on black friday. After the ride Wheels In Motion will provide pizza and beer! Please meet at 9:30 as the ride will leave promptly."}, {"date": "2017-11-24T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1518710338192200/", "name": "Matt Watroba", "description": "An Ark holiday weekend tradition. Dinner-show tickets available!"}, {"date": "2017-11-25T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/292015981259744/", "name": "Jeff Daniels", "description": "In 1976, Jeff Daniels bought a Guild D-40 from Herb David’s Guitar Studio in Ann Arbor, threw it in the back of his old Buick, and moved to New York City. That guitar led to a creative outlet, became a solace, a road into the artist that he didn’t know existed. Now, over 40 years later, he releases his 8th record, Simple Truths.\n\nSince 2000, Jeff has played venues such as The Barn at Wolf Trap in VA, New York City’s 54 Below, City Winery in Chicago, New York and Nashville, Austin’s Cactus Cafe, the Ram’s Head Tavern in Annapolis, MD, Mucky Duck’s in Houston, The Ark in Ann Arbor, MI, Chicago’s Old School of Folk Music, Seattle’s Third Door, Alaska’s Blue Loon in Fairbanks, as well as numerous opera houses and PACs throughout the country.\n\nHe has toured both coasts with his son’s band, the Ben Daniels Band, and has shared the stage with Lyle Lovett, John Hiatt, Joe Ely, Guy Clark, Keb' Mo’, and Bruce Hornsby."}, {"date": "2017-11-25T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/139215620005581/", "name": "Mr. B", "description": "Boogie the holiday weekend away"}, {"date": "2017-11-26T13:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1798907333469776/", "name": "Gemini", "description": "Wonderful songs for the family—a Michigan family tradition"}, {"date": "2017-11-30T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1487171348018472/", "name": "Cold Tone Harvest", "description": "\"The real deal\"—WNMC, Traverse City"}, {"date": "2017-11-30T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/125059571442781/", "name": "Figure & Midnight Tyrannosaurus at Necto", "description": "React Detroit presents...\n\n:: FIGURE ::\n\nwsg Midnight Tyrannosaurus\n\nNecto Nightclub\n516 E. Liberty\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-12-01T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/245006222671456/", "name": "Kris Delmhorst (\"The Wild\" CD Release) & Jeffrey Foucault", "description": "Love and marriage and songwriting, with new music from Kris"}, {"date": "2017-12-01T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/228071984350090/", "name": "Don White at Green Wood Coffee House", "description": "Back by popular demand! Don White combines heartfelt, serious lyrics with side-splitting laughs to provide an evening not to be forgotten. This Massachusetts comedian/singer/songwriter/author is best-known in these parts for his radio gems, \"Rascal,\" \"Psycho Mom and Dad\" and \"I Know What Love Is.\"  A Don White show promises to delight new audiences and devoted \"repeat offender\" fans, alike.\nwww.donwhite.net"}, {"date": "2017-12-05T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1874864086169155/", "name": "This Wonderful Life", "description": "A one-man play starring Jeremy Kendall, based on the 1946 Jimmy Stewart film. Student tickets $10 at Michigan Union Ticket Office and Ark box office in person only."}, {"date": "2017-12-07T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1705154979788647/", "name": "Two Friends at Necto", "description": "React Presents...\n\n:: Two Friends ::\n\nSupport:\nEvix\nZephure\n\nNecto Nightclub\n516 E. Liberty St.\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-12-09T12:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/440123889658934/", "name": "2017 Abominable Snowman Ride", "description": "Join us at the 2017 Abominable Snowman Ride at HIGH NOON on Saturday, December 9th at the Glenbrook Yurt in Pinckney Recreation Area. Ride as much or as little of the Poto trail as you would like. There are many options! Woody will have chili ready for the riders and he’ll have the fire going. The griddle will be ready as well for any hot dogs you’d like to bring. Cold temps and snow have been ordered for the weekend. Please bring wood to help keep the fire burning into the evening.\n\nThis event is being brought to you by the Potawatomi Mountain Biking Association."}, {"date": "2017-12-10T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1840537026263975/", "name": "An Evening with George Winston", "description": "A solo piano legend. Photo by Steve Lankford"}, {"date": "2017-12-16T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/342193202881483/", "name": "Blackthorn", "description": "A musical ramble across Ireland—in Michigan"}, {"date": "2017-12-28T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/519917991672623/", "name": "Seth Glier", "description": "New music!"}, {"date": "2017-12-29T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/641902759532109/", "name": "Mick Gavin's Crossroads Ceili", "description": "Celtic music and dance to chase the winter away. Two nights! Dinner-show tickets available."}, {"date": "2017-12-30T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1484866661581318/", "name": "Mick Gavin's Crossroads Ceili", "description": "Celtic music and dance to chase the winter away. Two nights! Dinner-show tickets available."}, {"date": "2018-01-28T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1071623319604830/", "name": "Maxim Vengerov, violin and Roustem Saïtkoulov, piano", "description": "Universally hailed as one of the world’s finest musicians, Maxim Vengerov made his public debut at age 5 and performed the Mendelssohn Concerto at age 7.\n\nVengerov is inspired by many different styles of music and brings his tireless search for new means of creative expression to his first UMS recital appearance in nearly 20 years.\n\nMore info: http://ums.org/performance/maxim-vengerov-violin-roustem-saitkoulov-piano/"}, {"date": "2018-01-31T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1409405905765276/", "name": "Janai Brugger, soprano and Martin Katz, piano", "description": "Winner of Placido Domingo’s prestigious Operalia competition in 2012 and a true standout in the What’s in a Song event that launched the UMS Song Biennial two years ago, soprano Janai Brugger has quickly become one of the Metropolitan Opera’s go-to singers, with four roles this past season.\n\nThe U-M alumna, who studied with the late Shirley Verrett, also won the Kennedy Center’s 2016 Marian Anderson Vocal Award and was identified by Opera News as one of their top 25 “brilliant young artists” in 2015. At the Metropolitan Opera competition in 2012, the New York Times wrote, “Only one singer inspired me to look forward to a full performance. Janai Brugger sang with poise and style, quiet intensity, and superb phrasing…The emotion was in her sound, which projected, with silvery ease, relaxed but focused bliss and then haunting melancholy.” Brugger, joined by pianist Martin Katz, makes her UMS recital debut with this performance.\n\nMore info: http://ums.org/performance/janai-brugger-soprano-martin-katz-piano/"}, {"date": "2018-02-02T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/456875417998907/", "name": "Gabriel Kahane’s Book of Travelers", "description": "The morning after the 2016 presidential election, singer-songwriter Gabriel Kahane packed a suitcase and set out, with no cell phone or internet connection, on a 9,000-mile railway journey around the US, in an attempt to better understand his country.\n\nOver the course of two weeks spent talking to strangers in Amtrak dining cars, he encountered an array of fellow citizens — cowboys, postmasters, religious luddites, national park conservationists, drifters, and seasteading software engineers — who, taken together, amount to nothing less than an American mosaic. At a distance from his daily routine, Kahane meditated on the intimacy and immediacy of train culture, and the ways in which it offers a stark contrast to — and relief from — the fragmentation, polarization, and obsession with efficiency that have come to embody contemporary American society. The highly anticipated follow-up to his acclaimed stage piece, The Ambassador, Gabriel Kahane’s Book of Travelers offers an expansive exploration of American history, regionalism, and the history of travel itself, all couched in a collection of songs as personal as any Kahane has written.\n\nMore info: http://ums.org/performance/gabriel-kahanes-book-of-travelers/"}, {"date": "2018-02-03T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1591991634186745/", "name": "Estonian National Symphony Orchestra", "description": "Former Detroit Symphony Orchestra music director Neeme Järvi returns to Southeast Michigan with the Estonian National Symphony Orchestra.\n\nJärvi leads the ensemble in its UMS debut with a program steeped in the music of Estonian composers, including the beautiful fifth symphony of Eduard Tubin, who fled to Stockholm in 1944 when the Soviet Union occupied Estonia. Garrick Ohlsson, a musician of magisterial interpretive and technical prowess, joins the orchestra for Brahms’s first piano concerto.\n\nMore info: http://ums.org/performance/estonian-national-symphony-orchestra/"}, {"date": "2018-02-04T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/817007715141905/", "name": "Ian Bostridge, tenor and Julius Drake, piano", "description": "Schubert’s Winterreise\nIan Bostridge, tenor\nJulius Drake, piano\n\n“Even as a child, I was unnaturally obsessed with love and death,” says celebrated English tenor Ian Bostridge. “So in that sense, I really was born to sing lieder.”\n\nBostridge’s fascination with Schubert’s Winterreise extends beyond the hundreds of performances he has given of the 24 song cycle; the former historian has also written a book, Schubert’s Winter Journey: Anatomy of an Obsession. The book is an engrossing read, but the live performance of a winter journey across a landscape of lost love is not to be missed. Of recent performances in England, the Financial Times observed that “Bostridge gets inside the very soul of Schubert’s tortured winter traveler.” The Telegraph raved, “This was without doubt the most extraordinary, riveting, uncanny performance of Schubert’s great song-cycle I have ever witnessed.”\n\nMore info: http://ums.org/performance/schuberts-winterreise/"}, {"date": "2018-02-08T19:00:00-06:00", "source": "Facebook", "url": "https://www.facebook.com/events/426467187725959/", "name": "American Ballet Theatre: Romeo and Juliet", "description": "Kenneth MacMillan’s masterful interpretation of Shakespeare’s enduring romantic tragedy has become one of ABT’s signature productions.\n\nThe story of Verona’s tragic star-crossed lovers is woven throughout a dance tapestry rich in character nuance and sensuality, with Renaissance Italy providing a sumptuous and period-perfect background. Sergei Prokofiev’s instantly recognizable music underscores the lyric beauty and passion of this beloved ballet. UMS and Michigan Opera Theatre co-present American Ballet Theatre as part of an extended partnership to bring dance to southeastern Michigan. Casting to be announced.\n\nMore info: http://ums.org/performance/american-ballet-theatre/"}, {"date": "2018-02-10T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/283934428684734/", "name": "Joshua Bell, violin and Sam Haywood, piano", "description": "Joshua Bell enchants audiences with his breathtaking virtuosity and charismatic stage presence.\n\nHis restless curiosity, passion, and multi-faceted musical interests have developed and deepened since he was first spotted plucking tunes with rubber bands stretched around the handles of his dresser drawers at age four. Though unrecognized during a morning rush-hour performance in the DC Metro documented by the Washington Post, his concerts regularly draw rock-concert enthusiasm from audiences, despite — or perhaps because of — his down-to-earth personality.\n\nMore info: http://ums.org/performance/joshua-bell-violin-sam-haywood-piano/"}, {"date": "2018-02-11T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/340740429699948/", "name": "NT Live in HD: Stephen Sondheim’s Follies", "description": "High-Definition Broadcasts from National Theatre, London. Presented in partnership with the Michigan Theater.\n\nNational Theatre Live in HD: Stephen Sondheim’s Follies\n\nNew York, 1971. There’s a party on the stage of the Weismann Theatre. Tomorrow, the iconic building will be demolished.\n\nThirty years after their final performance, the Follies girls gather to have a few drinks, sing a few songs, and lie about themselves. This dazzling production features a cast of 37 and an orchestra of 21, with Tracie Bennett, Janie Dee, and Imelda Stanton starring as the magnificent Follies."}, {"date": "2018-02-14T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1892469594343329/", "name": "Emmanuel Pahud, flute and Alessio Bax, piano", "description": "A star flutist only comes around once or twice in a generation — and it’s fair to say that this generation’s strongest candidate is the Swiss-born Emmanuel Pahud.\n\nOne of today’s most adventurous musicians, Pahud joined the Berlin Philharmonic as principal flute under Claudio Abbado at age 22, a position he still holds today. For this debut recital, he performs arrangements of sonatas written for other instruments, allowing audiences to experience the works from a completely different soundscape.\n\nMore info: http://ums.org/performance/emmanuel-pahud-flute/"}, {"date": "2018-02-17T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1657971264511574/", "name": "Opera in Concert: The Gershwins’ Porgy and Bess", "description": "UMS and the U-M School of Music, Theatre & Dance (SMTD) present  U-M Gershwin Initiative’s research discoveries into this landmark score.\n\nPorgy and Bess is without rival as the most famous 20th-century American opera. Since its 1935 debut, this story of a disabled beggar transformed by the unexpected love of Bess has been performed worldwide and features such well-known songs as “I Got Plenty o’ Nuttin’,” “My Man’s Gone Now,” “Summertime,” and “It Ain’t Necessarily So.” In addition to the concert, UMS and SMTD will host related symposia and other educational activities as part of an ongoing scholarly examination of the art of George and Ira Gershwin.\n\nMore info: http://ums.org/performance/george-gershwins-porgy-and-bess/"}, {"date": "2018-03-09T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/798070050351249/", "name": "Company Wang Ramirez: Borderline", "description": "A couple both onstage and in real life, Sébastien Ramirez, a Frenchman with Spanish parents, and Honji Wang, a German woman with a Korean mother, make their UMS debut with Borderline.\n\nTheir dance backgrounds could hardly be more different — Ramirez was a B-boy while Wang was classically trained — but they share a love of other dance styles and an interest in experimentation. In Borderline, the six dancers toy with the forces of gravity through a subtle and sophisticated use of rigging, creating a powerful evening of breathtaking movement, physical energy, and spiritual serenity. “The contemporary dance revolution is taking place. And dancers like Sébastien Ramirez and Honji Wang are on the frontlines.” (L’Indépendant)\n\nMore info: http://ums.org/performance/company-wang-ramirez/"}, {"date": "2018-03-11T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1710470309252752/", "name": "Elias Quartet", "description": "After a three-year project exploring all of Beethoven’s string quartets, the Elias Quartet decided to consider how composers after Beethoven lived up to his monumental legacy.\n\nSome of them approached their string quartets by expanding his musical language; others took a more poetic and imaginative turn of phrase. This particular program focuses on the freshness and fluidity of the music of Schubert and Dvořák, both of whom had a particular gift for writing melodies that seemed to spring from an endless well of inspiration.\n\nMore info: http://ums.org/performance/elias-quartet/"}, {"date": "2018-03-13T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1796401707355462/", "name": "Tenebrae: Path of Miracles", "description": "Joby Talbot’s Path of Miracles was the first major work commissioned by the professional vocal ensemble Tenebrae, a group that was founded by former King’s Singers member Nigel Short in 2000 and includes members drawn from the choirs of Westminster Abbey, King’s College Cambridge, and Britain’s two major opera houses.\n\nThe work was supposed to premiere in London on July 7, 2005, but was delayed because of the London bombings that day, which killed over 50 people and injured more than 700. Ten days later, Path of Miracles received its premiere as part of the City of London Festival. Talbot’s composition is based on the most enduring route of Catholic pilgrimage, the great Pilgramage to Santiago, and the four movement titles are the four main posts along the route (Roncevalles, Burgos, León, and Santiago). Path of Miracles incorporates medieval texts and Roman Catholic liturgy and is sung in Greek, Latin, Spanish, Basque, French, English, and German. Candlelight and an imaginative use of the St. Francis of Assisi space guarantee a dramatic evening.\n\nMore info: http://ums.org/performance/tenebrae-path-of-miracles/"}, {"date": "2018-03-14T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1923056544607027/", "name": "Piedmont Blues: A Search for Salvation", "description": "Ragtime rhythms, a unique finger-picking guitar style, and understated vocals are the hallmarks of the folk music style found in the Piedmont region, the area between the Atlantic Coastal Plain and the Appalachian Mountains covering central Georgia to central Virginia.\n\nJazz pianist and composer Gerald Clayton (who also holds down the piano chair in the Charles Lloyd Quartet) has captured the essence of this celebrated land, home to a unique culture and rapidly vanishing folkloric history, and preserved it in a multimedia project. This music-theater experience features a nine-piece band led by Clayton and combines music with projected film, new and archival photography, and the stories of those few musical elders who are still keeping the tradition alive. It makes a testimony of the struggle endured by African Americans in the Southeast during Jim Crow and chronicles the efficacy of the Piedmont Blues as a salve for suffering.\n\nMore info: http://ums.org/performance/piedmont-blues-a-search-for-salvation/"}, {"date": "2018-03-17T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/138402956702506/", "name": "Steve Lehman & Sélébéyone", "description": "Though hip-hop and jazz are clearly no strangers to one another, Sélébéyone takes the conversation between jazz and hip-hop to “feverish new heights” (The WIRE), drawing from Senegalese rap, modern jazz, live electronics, and underground hip-hop to create a unique form of urban experimentalism.\n\nComposer and saxophonist Steve Lehman, a “quietly dazzling saxophonist” (New York Times), has built a career creating innovative new music that packs a visceral wallop. He leads this international ensemble, which includes rappers HPrizm, a legend of New York’s underground hip-hop scene, and Gaston Bandimic, one of Senegal’s most distinctive young rap stars, in a unique hybrid that juxtaposes English and Wolof against changing meters and asymmetrical rhythms, giving rise to the development of a whole new musical universe. In Wolof, “sélébéyone” refers to an intersection, where two fixed entities meet and transform themselves into something previously unknown. “The international jazz-rap project Sélébéyone is a rare case of two genres mixing at their most far-out, abstract corners.” (Pitchfork)\n\nMore info: http://ums.org/performance/steve-lehman-selebeyone/"}, {"date": "2018-03-22T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1164904813638590/", "name": "Bubble Schmeisis", "description": "Welcome to the steam baths! The word bubbemeises is a Yiddish term meaning “a grandmother’s story” or “an old wives’ tale.”\n\nWriter and street performer Nick Cassenbaum, along with his klezmer musicians, invite you into the warmth of the Schvitz in Detroit, one of the country’s few remaining traditional bath houses, which has been in operation for over 85 years. Among the steam and the ritual, Nick will take you on a journey of discovery to find the place where he belongs. Bubble Schmeisis is full of intimate and personal true stories about identity, home, and getting schmeised (washed) by old men. “It is by far the funniest thing I have seen in Edinburgh so far… Bubble Schmeisis is also beautiful in its depiction of male friendship and shared routines.” (Exeunt)\n\nPlease note: Due to the historical nature of the venue, the Schvitz is not fully-accessible; audiences must descend stairs to get into the space, and there is no elevator. UMS makes every effort to hold its events in accessible spaces, but the unique nature of this work, which must be presented in a real bath house, limited the options available.\n\nMore info: http://ums.org/performance/bubble-schmeisis/"}, {"date": "2018-03-23T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1882767398637595/", "name": "Nederlands Dans Theater", "description": "Widely considered the Berlin Philharmonic of the dance world, Nederlands Dans Theater has forged a path between classical ballet and American modern dance, creating a modern ballet style that is widely admired across the world.\n\nMany NDT members have gone on to found companies around the world, including Nacho Duato, Ohad Naharin, and Crystal Pite. Pite’s 2016 work, “The Statement,” features two men and two women dealing with a conflict in a boardroom setting, with Jonathan Young (from the 2016-17 season’s Betroffenheit) providing the script/score. “Shoot the Moon” is a heartbreaking view of three different love stories deteriorating behind closed doors in a revolving set of three rooms, set to music by Philip Glass. “Think ballet line and virtuosity fused with modern dance weight and power. Think a commitment to the deepest European art-making traditions with no pandering to pop culture. Above all, think a super-ensemble: dancers who can form a superb corps one moment and perform just as superbly as principals the next.” (Los Angeles Times)\n\nMore info: http://ums.org/performance/nederlands-dans-theater/"}, {"date": "2018-03-27T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/836335063198525/", "name": "Altan", "description": "Get tickets early! A rare Michigan appearance"}, {"date": "2018-03-31T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/276664639461191/", "name": "Jazz at Lincoln Center Orchestra with Chick Corea", "description": "The Music of Chick Corea\n\nSurprise! This perennial favorite is back, but this time with jazz pianist Chick Corea at the helm. Corea’s staggering career, spanning more than 50 years, is a torrent of creative and professional highlights.\n\nHis last UMS appearance, with Herbie Hancock, was a sellout, and demonstrated why the New York Times called him “a luminary, ebullient and eternally youthful.” Corea’s fearless creative spirit has earned him a slew of accolades along the way, including the country’s highest honor for a jazz artist when he was named an NEA Jazz Master in 2006. “The Jazz at Lincoln Center Orchestra is ridiculously tight, executing tricky maneuvers like a fighter jet.” (DownBeat)\n\nMore info: http://ums.org/performance/jazz-at-lincoln-center-orchestra-with-chick-corea/"}, {"date": "2018-04-08T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1437444286325815/", "name": "Artemis Quartet", "description": "Named after the Greek goddess of hunt and wilderness, the Artemis Quartet was founded in 1989 but took a full 10 years before it performed its first concerts for a live audience.\n\nThis dedication to excellence has not wavered, and their playing is known for its “apparently effortless grace and effervescent athleticism.” (BBC) Based in Berlin, it programs its own series at the Berlin Philharmonie and the Vienna Konzerthaus, as well as in Munich and Amsterdam.\n\nMore info: http://ums.org/performance/artemis-quartet/"}, {"date": "2018-04-13T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/137157083493985/", "name": "The Jazz Epistles featuring Abdullah Ibrahim and Hugh Masekela", "description": "The two iconic South African jazz legends Abdullah Ibrahim and Hugh Masekela reunite and perform as part of a tour that puts them on the same stage for the first time in 56 years.\n\nThey come together for a historic concert to tell the story of The Jazz Epistles, the first all-black jazz group in South Africa and arguably the most important jazz (bebop) recording in the country’s history. This music was almost lost forever — only 500 copies were pressed in 1959, buried, and rediscovered decades later after the tyranny of apartheid. These giants of South African jazz perform music from the seminal Jazz Epistles recording alongside music from both of their illustrious careers. “[Ibrahim] glowed with a sound reminiscent of that of [his] most famous patron, Duke Ellington.” (Guardian) “Hugh Masekela creates an instant party, leading from vocals and flugelhorn like a South African Louis Armstrong.” (Guardian)\n\nMore info: http://ums.org/performance/the-jazz-epistles-featuring-abdullah-ibrahim-and-hugh-masekela/"}, {"date": "2018-04-14T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/136496643560270/", "name": "Colin Stetson", "description": "Sorrow: A Reimagining of Górecki’s Third Symphony\n\nHenryk Górecki’s iconic third symphony, often called “Symphony of Sorrowful Songs,” made a huge impact on listeners in the early 1990s and was a musical touchstone for virtuoso saxophonist Colin Stetson.\n\nThe original work’s three movements centered around three laments, each focused in some way about a child being taken away from a mother. Celebrated for the way he “demolishes clichés to unleash fresh, unexpected energies,” (Pitchfork) Stetson takes on the mammoth task of reimagining Górecki’s symphony for an expansive and contemporary sonic palate. Sorrow, his imaginative new interpretation of the heartbreaking work, is “timeless and of the moment,” (PopMatters) drawing on a uniquely constructed 12-member ensemble that employs electric guitars, synthesizers, drums, strings, woodwinds, and soprano to create transformative extensions of the emotional core of the piece.\n\nMore info: http://ums.org/performance/colin-stetson-sorrow/"}, {"date": "2018-04-15T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/319354431816493/", "name": "Opera in Concert: Monteverdi’s L’Orfeo", "description": "Apollo’s Fire / The Cleveland Baroque Orchestra\n\n“It’s hard to say who wrote the very first opera, but there’s little doubt about the first, truly great one — it’s Monteverdi’s 1607 masterpiece, L’Orfeo.” (National Public Radio)\n\nAs one of the earliest examples of the form, and certainly the earliest that still has a place in the present repertoire 400 years later, L’Orfeo sets to music the famous myth of Orpheus and Eurydice, whose long-awaited wedding night ends in tragedy when Eurydice is bitten by a poisonous snake and Orfeo storms the gates of hell to rescue her. Jeannette Sorrell leads a company of 40 performers in this semi-staged production with period dancers. Performed in Italian with English supertitles.\n\nMore info: http://ums.org/performance/monteverdis-lorfeo-apollos-fire-baroque-orchestra-and-chorus/"}, {"date": "2018-04-19T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/988108387991369/", "name": "Charleroi Danses: Cold Blood", "description": "After the resounding success of Kiss & Cry (2014-15 season), the magnificent creative team of Charleroi Danses in Belgium brings Cold Blood, a poetic journey that is filmed before your very eyes.\n\nThe performance explores the miniscule, surveying the worlds where life is viewed through a kaleidoscope, with fingers cavorting in a delightful miniature setting. In a hypnotic story laced with offbeat humor, Cold Blood explores the uncertain, yet inevitable, last moments we experience before we die. Cold Blood is neither a sequel nor an epilogue to Kiss & Cry but utilizes the same storytelling techniques, combining film, dancing fingers, music, and theater in brilliant and surprising ways. “If the team came back to Quebec ten times, we would rush to see them ten times. And would encourage you to do the same. Because their work is absolutely masterful.” (Le Devoir, Montreal)\n\nMore info: http://ums.org/performance/cold-blood/"}, {"date": "2018-04-22T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1997818657105976/", "name": "Murray Perahia, piano", "description": "Murray Perahia’s place in the pantheon of great musicians is indisputable.\n\nWith 12 UMS appearances since his debut over 40 years ago, he is one of the most treasured artists to appear on our series and consistently delivers performances that audiences remember years, or even decades, later. With his particular kind of magic, each and every performance is a revelation.\n\nMore info: http://ums.org/performance/murray-perahia-piano/"}, {"date": "2018-05-06T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/121718015134900/", "name": "NT Live in HD: Shakespeare’s Julius Caesar", "description": "High-Definition Broadcasts from National Theatre, London. Presented in partnership with the Michigan Theater.\n\nNational Theatre Live in HD: Shakespeare’s Julius Caesar\n\nCaesar returns in triumph to Rome, and the people pour out of their homes to celebrate. Alarmed by the autocrat’s popularity, the educated elite conspire to bring him down. After his assassination, civil war erupts on the streets of the capital.\n\nNicholas Hytner’s production thrusts the audience into the street party that greets Caesar’s return, the congress that witnesses his murder, the rally that assembles for his funeral, and the chaos that explodes in its wake. Starring Ben Whishaw (The Danish Girl, Skyfall) as Brutus; Michelle Fairley (Game of Thrones) as Cassius; David Calder (The Lost City of Z) as Caesar; and David Morrissey (Hangman, The Walking Dead)."}]