[{"date": "2016-05-14T07:00:00-04:00", "source": "Facebook", "description": "Saturday only, our whooooole Body Care section is 30% off! Stock up on your faveorite sunscreen, lotion, shampoo, conditioner, soap, lip balm, and more. Don't forget deodorant- summer's coming :)", "url": "https://www.facebook.com/events/1033774330022584/", "name": "30% Off All Body Care- One Day Only!"}, {"date": "2016-05-14T09:00:00-04:00", "source": "Facebook", "description": "This park on the west edge of the city contains a woodland with a glorious flowering dogwood (among other fine trees) and a pond with a surprising number of turtles. There is a lovely display of spring wildflowers here that is threatened by invasive exotic species. Invite your friends and family to come and help remove them.\nMeet us in the Grace Bible Church parking lot (1300 South Maple Road), 1/3 mile south of West Liberty.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "url": "https://www.facebook.com/events/1105035972885938/", "name": "Park Stewardship Workday"}, {"date": "2016-05-14T09:00:00-04:00", "source": "Facebook", "description": "Help weed and maintain the Native Garden, one of the gems of Furstenberg Nature Area. It is a demonstration garden, a living identification guide and display of the beauty of our native flora. The garden is maintained by volunteers from the Michigan Master Gardener program. The 38 acres here contain just about as much plant diversity as anywhere in Ann Arbor. Plus, you're certain to learn a lot about native plants, particularly spring wildflowers, from Park Steward and Master Gardener Aunita Erskine. Please meet in the parking lot off Fuller Road, across from Huron High School.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "url": "https://www.facebook.com/events/1028979287183851/", "name": "Native Plant Gardening"}, {"date": "2016-05-14T10:30:00-04:00", "source": "Facebook", "description": "Pointless is thrilled to welcome Rhyta Musik, Michigan’s premier Balkan Brass Band. This group fuses together cultural traditions with modern sensibilities to perform Eastern European folk melodies and original compositions.\n\nPrepare yourself for live energetic music and interactive activities, including instrument presentations and dance instruction!\n\n$10 for adults, $5 for children", "url": "https://www.facebook.com/events/226345257741648/", "name": "Rhyta Musik presents for Little Peeps!"}, {"date": "2016-05-14T11:00:00-04:00", "source": "Facebook", "description": "We're hitting the open road in search of Michigan beer! Each $40 ticket guarantees a seat on the bus, round-trip transportation, breakfast at the brewery, lunch at stop #2, stops at three Metro Detroit breweries, a tour, and your first round at each stop. Tickets available in the Tap Room or at the link above. \n\nStops: \n1. Griffin Claw\n2. River Rouge BC\n3. Roak Brewing Co", "url": "https://www.facebook.com/events/530384080466995/", "name": "Brewery Bus Tour"}, {"date": "2016-05-14T13:00:00-04:00", "source": "Facebook", "description": "The woods here have a wonderful spring wildflower display, with bloodroot, trillium, trout lily and may-apple. They need protection from invasive garlic mustard and other exotic species. You (and your family and friends) can help! Join us to spend a few hours removing these invasives and enjoying the natural beauty of the park.\nMeet us at the Lakewood Elementary School parking lot off Gralake Avenue (three blocks south of Jackson Avenue).", "url": "https://www.facebook.com/events/126120084465071/", "name": "Park Stewardship Workday"}, {"date": "2016-05-14T15:00:00-04:00", "source": "Facebook", "description": "Celebrate spring at the CMSa2 Spring Showcase Concert featuring the CMSa2 Youth Ensembles, Brandenburg Project and the New Horizons Senior Strings Orchestra.\n\nTickets are $5 and children under 10 are free!", "url": "https://www.facebook.com/events/223304704727702/", "name": "CMSa2 Spring Showcase Concert"}, {"date": "2016-05-14T15:00:00-04:00", "source": "Facebook", "description": "Gina Luttrell is an Associate Professor of Public Relations and Social Media at Eastern Michigan University with over 15 years of experience in the communications field. Her extensive background includes strategic development and implementation of public relations and social media, advertising, marketing, crisis and corporate communications.\n\nKaren McGrath, PhD, is Professor of Communications at the College of Saint Rose in Albany, NY where she has been teaching for almost 20 years. She has a passion for learning and enjoys working with students to help them achieve their personal and professional goals. Her interests include pop culture, media, gender, and race, with her most recent publication focused on The Big Bang Theory’s Sheldon Cooper.\n\nWe’ve all heard that Millennials are smarter than everyone else, unique in every way possible, that they have probably been millionaires since age seven, and that they are poised to take over the world. We’ve also heard that they are lazy, unmotivated, entitled, and condescending know-it-alls. How can this generation have such opposing characteristics? What is the truth about this generation?\n\nSocial Media: How to Engage, Share, and Connect is a step-by-step resource to better understand, create, and develop sound social media strategies. Written in a relaxed and pragmatic tone this book concentrates on both the operational and practical aspects of this ever evolving subject. Rich with concrete advice and examples from some of the most preeminent authorities in the fields of social media, public relations, and marketing this book has something for everyone.", "url": "https://www.facebook.com/events/1060164970720196/", "name": "Meet Authors Gina Luttrell & Karen McGrath for a Discussion & Signing of 'The Millennial Mindset: Unraveling Fact From Fiction'"}, {"date": "2016-05-14T17:00:00-04:00", "source": "Facebook", "description": "Ann Arbor Roller Derby invites you to our exciting Triple Header Season Opener! Three games for one low price!\n\n5:30- Wave 11 Debut Bout. Watch our newest \"freshmeat\" bootcamp graduates have their first public match! \n\n6:20- Ann Arbor Brawlstars vs. Chicago Outfit Syndicate. The Brawlstars were beaten last May in Chicago when they played the Outfit, but they have had a year to plot their revenge! Come see what the Brawlstars can do on their home turf.\n\n7:45- Ypsilanti Vigilantes vs. East Lansing Roller Derby Broadbarians. Our Vigis are ready to VIGI SMASH their way to success!!!\n\nBouts include kid-friendly activities, half-time entertainment, sponsored concessions, and giveaways! \n\nDoors open at 5:00, first whistle at 5:30!\n\nAdmission $12 pre-sale, $15 at the door. Kids under 12 FREE with paid admission (2 for each paying adult).\n\nAfter party location *Aubree's Pizzeria & Grill* 39 E Cross st, Ypsilanti, Mi", "url": "https://www.facebook.com/events/471847609672850/", "name": "Ann Arbor Roller Derby Home Opener"}, {"date": "2016-05-14T17:00:00-04:00", "source": "Facebook", "description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nBUY JUNE 11 TICKETS: http://bpt.me/2538000\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule", "url": "https://www.facebook.com/events/192972824428594/", "name": "Ann Arbor Derby Dimes 2016 season"}]