[{"source": "Facebook", "name": "Icebreakers^2", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/882484321863214/", "date": "2016-07-23T16:00:00-04:00"}, {"source": "Facebook", "name": "Pointless Improv with Lady Parts and Presto Change-O", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Lady Parts\" starring Sara Constantakis, Corene Ford, Amy Oprean, Amy Phillips, and Anne Marie Sumner.\n\nGroup 2: \"Presto Change-O\" starring Chris DiAngelo, Matt Naas, Erik Heilner, Tim Kay, and James Quesada\n\nGroup 3: \"The League of Pointless Improvisers\" starring Andy Reid, Steve Oliver, Corene Ford, Matthew Flickinger, and Gary Lehman", "url": "https://www.facebook.com/events/284018695285506/", "date": "2016-07-23T20:00:00-04:00"}, {"source": "Facebook", "name": "Pointless Improv with Presto Change-O and Lady Parts", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Presto Change-O\" starring Chris DiAngelo, Matt Naas, Erik Heilner, Tim Kay, and James Quesada\n\nGroup 2: \"Lady Parts\" starring Sara Constantakis, Corene Ford, Amy Oprean, Amy Phillips, and Anne Marie Sumner.\n\nGroup 3: \"The League of Pointless Improvisers\" starring Andy Reid, Steve Oliver, Corene Ford, Matthew Flickinger, and Gary Lehman", "url": "https://www.facebook.com/events/1805428946359627/", "date": "2016-07-23T22:00:00-04:00"}, {"source": "Facebook", "name": "The 2016 Ann Arbor Art Fair", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/", "date": "2016-07-24T10:00:00-04:00"}, {"source": "Facebook", "name": "State Street Art Fair", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "url": "https://www.facebook.com/events/487403974717996/", "date": "2016-07-24T10:00:00-04:00"}, {"source": "Facebook", "name": "Baby Back Ribs!", "description": "We're firing up grill this weekend and serving up our all natural baby-back ribs. Half-rack of ribs and our made in-house cole slaw, just $5. Oh, yes!", "url": "https://www.facebook.com/events/318864108456634/", "date": "2016-07-24T12:00:00-04:00"}, {"source": "Facebook", "name": "Guided Tour: Engaging with Art", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.\nEngaging with Art tours are generously supported by the Berkowitz Family Endowed Fund.", "url": "https://www.facebook.com/events/211191845942511/", "date": "2016-07-24T14:00:00-04:00"}, {"source": "Facebook", "name": "In Conversation: Pomp, Privacy, and Portraiture at 700 Nimes Road", "description": "This program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.\n\nIn 700 Nimes Road, photographer Catherine Opie creates a portrait of the icon Elizabeth Taylor by capturing the intimate spaces and personal treasures that make up the actress’s home in Bel Air, California. Join Assistant Curator of Photography, Jennifer Friess, for an exploration of how Opie’s images reveal facets of Taylor’s identity from the humble to the glamorous.\n\nCatherine Opie: 700 Nimes Road is organized by The Museum of Contemporary Art, Los Angeles. This exhibition is made possible with lead support provided by J.P. Morgan Private Bank and major support from Jamie McCourt, and Gilena Simons.\n\nLead support for UMMA’s installation is provided by the University of Michigan Health System, Bank of America and Merrill Lynch, and Alan Hergott and Curt Shepard. Additional generous support is provided by the University of Michigan Department of the History of Art, Department of Screen Arts and Cultures, and Department of American Culture.", "url": "https://www.facebook.com/events/1630667003917227/", "date": "2016-07-24T15:00:00-04:00"}, {"source": "Facebook", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "url": "https://www.facebook.com/events/243670042686210/", "date": "2016-07-24T16:00:00-04:00"}, {"source": "Facebook", "name": "Xanadu", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "url": "https://www.facebook.com/events/986732351446617/", "date": "2016-07-24T19:00:00-04:00"}]