[{"name": "20% Off Local Beer- One Day Only", "date": "2016-08-19T08:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/225290911201940/"}, {"description": "August 9–October 30, 2016\nCorridor Gallery\n\nArtist and poet Ann Holmes first encountered Japanese folk ceramics while living in Tokyo in the late 1960s. Fascinated by the simple aesthetic, the craftsmanship, and the makers’ unassuming personalities and ways of life, Holmes visited many kiln towns to photograph and interview the artists and collect ceramic wares of various shapes and techniques. She donated a significant portion of her collection to UMMA in 2013.\n\nRichly introduced in this presentation are works by ceramic artists emerging in the late 1960s and the early 1970s in the town of Mashiko, two hours north of Tokyo by train. Mashiko became an international mecca of folk ceramics after Hamada Shōji (1894–1978), a major figure of Japan’s Folk Craft (Mingei) Movement, set up his studio there in 1930. Hamada’s idea of ceramic making for a new age, which combined the aesthetic of folk ceramics and the modern concept of the studio artist, attracted many younger artists of unconventional backgrounds, including women.", "date": "2016-08-19T11:00:00-04:00", "name": "In Focus: Modern Japanese Folk Ceramics", "source": "Facebook", "url": "https://www.facebook.com/events/170729440003602/"}, {"description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "date": "2016-08-19T15:00:00-04:00", "name": "Drink & Draw / Imbibe & Inscribe", "source": "Facebook", "url": "https://www.facebook.com/events/161265737615035/"}, {"description": "Bring your well-worn items that could use a tune up, and we'll take a look at them! \n\nOr, make someone else's day by volunteering at Fix-It Friday and repairing their items.\n\nFix-It Friday:\nThink of this as the last chance before you get rid of something; Free, but no Guarantee.\n\nWe will:\n- try to diagnose what is wrong\n- tell you if we think we may be able to fix it today\n- tell you if you'll need a part, and where you might be able to get it\n- try to fix it to the best of our ability, but in the limited time we have\n\nHowever, we may not be able to fix it. Many products are not designed to be fixed, and just opening them up may damage them. Furthermore, we may not have someone on hand with the expertise to do a proper repair. Also, it may require a special part, tools, information, or materials to repair, or it may just require more time than we have.\n\nWe may end up damaging your item even more. Please let the repairer know how comfortable you are at each stage of diagnosis and repair.\n\nItems that are often easier to repair: lamps, types of toys, broken wires, things that need epoxy/wood glue\n\nItems that are often very difficult to repair: consumer electronics such as CD/Cassette boom boxes, TVs, radios, CD players, VCRs, and DVD players", "date": "2016-08-19T16:00:00-04:00", "name": "August Fix-It Friday", "source": "Facebook", "url": "https://www.facebook.com/events/1103426413072801/"}, {"description": "Join us on Friday, August 19, from 6:00 PM to 9:00 PM for the opening reception of Ultimate Stars—a pop-up exhibition curated by Doug Coombe—with live music from DJs Chuck Sipperley and Michael Dykehouse, along with a live shadow puppet performance by Patrick Elkins and portriats by Jim Cherewick. Ultimate Stars is a two-week showcase of local artists who explore creativity through visual art and music.\n\nThis event is FREE and open to the public. \n\nAbout Doug Coombe: \n\nDoug Coombe is— an Ann Arbor and Detroit based music/editorial photographer; documenter of the world's best music scene for 20 years; photographer for Detroit's Metro Times since 1999; photographer for Detroit-based Concentrate Media and Urban Innovation Exchange. His clients include— Rolling Stone, Spin, Billboard, NME, Mojo, Wax Poetics, The Wire, Sub Pop Records, Ghostly Records and Michigan Radio.\n\nFeatured Artists: Scott Allen | Misty Lyn Bergeron | Sarah Campbell | Jim Cherewick | Michael Dykehouse | Patrick Elkins | Tadd Mullinix | Zach Nichols | Chris Pottinger | Fred Thomas | Matthew Milia\n\nFor more information about Ultimate Stars, go here: http://goo.gl/ZO6mNe\n-----------\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC.\n\nCatering generously provided by Laura's Catering (http://laurascatering.com/)", "date": "2016-08-19T18:00:00-04:00", "name": "Ultimate Stars: Opening Reception", "source": "Facebook", "url": "https://www.facebook.com/events/287368754959456/"}, {"description": "Are you a big know it all? Come see if you've got what it takes to win a $25 gift card in our Trivia Night! You can enjoy beer and wine in our cafe, too ;)", "date": "2016-08-19T19:00:00-04:00", "name": "Trivia Night!", "source": "Facebook", "url": "https://www.facebook.com/events/1003638856420336/"}, {"description": "Outdoor Screening Featureing Selections from the AAFF Touring Program.\nBYO Blanket or Chair, Please RSVP to rsvp@aafilmfest.org.\n$5 Cover Charge (Includes Beer, Wine,Hors d'oeuvres) \nFree to AAFF Members.", "date": "2016-08-19T19:30:00-04:00", "name": "Walk Right In-Outdoor Walk-In Theater at Water Hill", "source": "Facebook", "url": "https://www.facebook.com/events/314365718897284/"}, {"description": "Midwest Fest at the Blind Pig for the first time ever!\nDoors 8pm | 18+ | Tix $10 / $20 for all three days (limited availability)  Visit www.blindpigmusic.com for tickets\n\nTHURS 8/18\nThe Go Rounds - https://thegorounds.bandcamp.com/\nMinihorse - https://www.facebook.com/minihorseband/\nThe Antivillians - www.theantivillains.com\nSteven Leaf & the Ex Pats - https://www.facebook.com/steveleafandtheexpats/\nMichigander - https://www.facebook.com/michiganderband\n\nFRI 8/19\nThe Soil & the Sun - www.thesoilandthesun.com/\nMike Adams At His Honest Weight - www.mikeadams.info/\nBig Sherb - https://www.facebook.com/bigsherb/\nBoudoir Noir - https://boudoirnoir.bandcamp.com/\nAncient Language - https://www.facebook.com/AncientLanguageMusic\n \nSAT 8/20\nGuilty Simpson - http://rapraprapraprap.com/\nMister - http://rapraprapraprap.com/\nRed Pill - https://www.facebook.com/redpillrap\nLast Gasp - https://www.facebook.com/LastGaspCollective/?fref=ts\nAlexander Lynch - https://soundcloud.com/alexanderlynch", "date": "2016-08-19T20:00:00-04:00", "name": "Midwest Fest IX August 18-20 at Blind Pig - Ann Arbor", "source": "Facebook", "url": "https://www.facebook.com/events/564009510445180/"}, {"description": "Shakespeare is back at Pointless Brewery & Theatre this August!  \n\nAfter May's sellout performance of MUCH ADRINK ABOUT NOTHING, Ann Arbor's original Shakespeare performance/drinking game is back this time with four performances, over two weekends, with entirely new shows.  Not above taking on low-hanging fruit, we're presenting two of the Bard's most popular and most overdone plays with A MIDSUMMER NIGHT'S DRINK and THE LAMENTABLE DRINK OF ROMEO & JULIET.  \n\nShakespeare at Pointless looks to revive a bit of vibrant raucous nature of Shakespeare's early modern theater. Honoring the in-house brewery, the actors will and audience can partake in a drinking game over the course of the plays with specific rules for each play.\n\nAll shows are at 8 pm.\n\nFriday, August 19th: The Lamentable DRINK of Romeo & Juliet\nSaturday, August 20th: A Midsummer Night's DRINK\n\nFriday, August 26th: A Midsummer Night's DRINK\nSaturday, August 27th: The Lamentable DRINK of Romeo & Juliet", "date": "2016-08-19T20:00:00-04:00", "name": "Shakespeare & Beer: The Lamentable DRINK of Romeo & Juliet", "source": "Facebook", "url": "https://www.facebook.com/events/309415539404433/"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Listen, Stupid\" \n\nGroup 2: \"50 Shades of Cray Cray\"\n\nGroup 3: \"The League of Pointless Improvisers\" starring Matt Swartz, Erik Heilner, Chris Moody, Matthew Flickinger, and Andy Reid", "date": "2016-08-19T22:00:00-04:00", "name": "Pointless Improv with Listen, Stupid and 50 Shades of Cray Cray", "source": "Facebook", "url": "https://www.facebook.com/events/564954853689599/"}]