[{"date": "2017-03-23T18:30:00-04:00", "source": "Facebook", "description": "Ah, Nerd Nite! A time for nerds of all kinds to come together and talk of many things. This time around, we’re talking about what medical diagnostic tests can (and cannot) tell us, sustainable living in a solar-powered house made of straw, and how time is dumb - we’re looking at you, Daylight Saving Time!\n\nTesting, testing! NNA2 alum and PhD/MD student Carl Engelke is here to talk about medical testing - the how, the why, and the reality of what some of these common screening exams can and can’t tell us. Science!\n\nHay is for houses! Professor, designer, and farmer Joe Trumpey built his house out of straw and field rocks and determination and ingenuity, and he’s here to tell you the practical side of transitioning to an off-the-grid, sustainable lifestyle.\n\n(H)our third speaker is engineer Matt Carpenter - he’ll take a moment to explain the stories behind leap years and the agony and ecstasy that is falling back and springing forward with Daylight Saving Time. \n\nSo text the friend you’ve been meaning to hang out with and come see us for Tests, Transition, & Time: How to save lives, energy, and daylight at LIVE on First St, Thursday, 3/23, doors at 6:30 pm.", "url": "https://www.facebook.com/events/209961842816480/", "name": "NNA2 #43: Tests, Transition, & Time"}, {"date": "2017-03-23T19:00:00-04:00", "source": "Facebook", "description": "Literati is thrilled to welcome Lindy West in celebration of the paperback release of her memoir, Shrill: Notes from a Loud Woman, a New York Times bestseller, winner of the 2016 Stranger Genius Award for Literature, and a staff pick here at Literati.\n\nShrill is an uproarious memoir, a feminist rallying cry in a world that thinks gender politics are tedious and that women, especially feminists, can't be funny. Coming of age in a culture that demands women be as small, quiet, and compliant as possible--like a porcelain dove that will also have sex with you--writer and humorist Lindy West quickly discovered that she was anything but. From a painfully shy childhood in which she tried, unsuccessfully, to hide her big body and even bigger opinions; to her public war with stand-up comedians over rape jokes; to her struggle to convince herself, and then the world, that fat people have value; to her accidental activism and never-ending battle royale with Internet trolls, Lindy narrates her life with a blend of humor and pathos that manages to make a trip to the abortion clinic funny and wring tears out of a story about diarrhea.\n\nWith inimitable good humor, vulnerability, and boundless charm, Lindy boldly shares how to survive in a world where not all stories are created equal and not all bodies are treated with equal respect, and how to weather hatred, loneliness, harassment, and loss, and walk away laughing. Shrill provocatively dissects what it means to become self-aware the hard way, to go from wanting to be silent and invisible to earning a living defending the silenced in all caps.\n\nLindy West is a Seattle-based writer, editor, and performer whose work focuses on pop culture, social justice, humor, and body image. She's currently a culture writer for GQ magazine and GQ.com and a weekly columnist at The Guardian, as well as the founder and editor of I Believe You | It's Not Your Fault, an advice blog for teens. In 2015 she wrote and recorded a story for This American Life about confronting an Internet troll who impersonated her dead father. She also was listed as \"Internet's Most Fascinating of 2015\" by Cosmopolitan.com, and helped launch the viral #ShoutYourAbortion hashtag in defense of women's reproductive rights.\n \n\nEvent date: \nThursday, March 23, 2017 - 7:00pm\nEvent address: \nLiterati Bookstore\n124 E. Washington St.\nAnn Arbor, MI 48104", "url": "https://www.facebook.com/events/1820736668190406/", "name": "Lindy West"}, {"date": "2017-03-23T20:00:00-04:00", "source": "Facebook", "description": "Alley Bar is once again partnering with A2CT for their Give Back Thursdays program!  Here's how it works: Alley Bar donates 10% of their sales each Thursday in March to A2CT.  So come on out., hang out with friends, support a great local bar AND your favorite theatre! Hope to see you there.", "url": "https://www.facebook.com/events/340989426297521/", "name": "Give Back Thursdays"}, {"date": "2017-03-23T21:00:00-04:00", "source": "Facebook", "description": "React Detroit presents...\n\n:: Breathe Carolina ::\n\nNecto Nightclub\n516 E. Liberty St.\nAnn Arbor, MI 48103\n18+ are welcome\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet", "url": "https://www.facebook.com/events/647347778790781/", "name": "Breathe Carolina at Necto"}, {"date": "2017-03-24T14:00:00-04:00", "source": "Facebook", "description": "The Ann Arbor Film Festival has been around for over 50 years, fascinating, challenging, enchanting, even appalling and often surprising tens of thousands of viewers - some who have been attending for decades. The AAFF is a highlight of Michigan's cultural year. The majority of screenings will take place at the Michigan Theater (603 E Liberty St, Ann Arbor, MI 48104) with additional events and exhibitions at other venues around downtown Ann Arbor. Tickets and passes are available for purchase on our website.\n\nFind out more info on our website:\nhttp://aafilmfest.org", "url": "https://www.facebook.com/events/1821291198093435/", "name": "The 55th Ann Arbor Film Festival"}, {"date": "2017-03-24T15:00:00-04:00", "source": "Facebook", "description": "Join us for the closing reception for Off The Screen! This exhibiton is an intermedia series featuring expanded cinema performances, installations, and educational salon sessions held during the 55th Ann Arbor Film Festival. The series aims to present alternative cinematic forms and to create an environment for meaningful conversation about the culture of the moving image.\n\nThis event this event will have  refreshments from White Lotus Farms.\n\nThe 117 Gallery 2016/2017 season is supported by Vintage Financial Services LLC", "url": "https://www.facebook.com/events/766692010150811/", "name": "Off The Screen! Closing Reception"}, {"date": "2017-03-24T17:00:00-04:00", "source": "Facebook", "description": "Free to attend; for students 3rd through 8th grade.\n\nStudents learn to experiment with the basics in Computer Aided Design (CAD) by creating miniature Minecraft character keepsakes.\n\nNote: sessions must have at least 4 students registered to attend in order to be held. Registration deadline is 48 hours before scheduled time.", "url": "https://www.facebook.com/events/261691150932592/", "name": "3D Printing & Design (Week 4 of 6)"}, {"date": "2017-03-24T18:00:00-04:00", "source": "Facebook", "description": "Drink & Draw is back again, but this time we're taking it out of beta. We are sending out a beacon to you bar-drawers, you napkin-doodlers, you zine-queens and illustrator extraordinares. Join us at the Pretzel Bell for a Friday night of drinking and deteriorating doodles. \n\nBring your favorite pencils, pens, watercolors or whatever you like to use and a sketchbook. We will have open draw, as well as games and prompts to get things rolling. \n\nThis time, for the first time ever, we are announcing a brand new, first ever Vault of Midnight Zine comprised of YOUR artwork and submissions created at Drink & Draw. Ask an employee for more information. \n\nTickets are a mere $3, and are available for purchase right this moment at Vault of Midnight Ann Arbor. What are you waiting for? Seats are limited, so you'd better get yours fast!", "url": "https://www.facebook.com/events/977416252389606/", "name": "Drink & Draw"}, {"date": "2017-03-24T19:00:00-04:00", "source": "Facebook", "description": "Literati is pleased to welcome Kevin Davis in support of his latest work, The Brain Defense: Murder in Manhattan and the Dawn of Neuroscience in America's Courtrooms.\n\nCalled “the best kind of nonfiction” by Michael Connelly, this riveting new book combines true crime, brain science, and courtroom drama: In 1991, the police were called to East 72nd St. in Manhattan, where a woman’s body had fallen from a twelfth-story window. The woman’s husband, Herbert Weinstein, soon confessed to having hit and strangled his wife after an argument, then dropping her body out of their apartment window to make it look like a suicide. The 65-year-old Weinstein, a quiet, unassuming retired advertising executive, had no criminal record, no history of violent behavior—not even a short temper. How, then, to explain this horrific act?\n \nJournalist Kevin Davis uses the perplexing story of the Weinstein murder to present a riveting, deeply researched exploration of the intersection of neuroscience and criminal justice. Shortly after Weinstein was arrested, an MRI revealed a cyst the size of an orange on his brain’s frontal lobe, the part of the brain that governs judgment and impulse control. Weinstein’s lawyer seized on that discovery, arguing that the cyst had impaired Weinstein’s judgment and that he should not be held criminally responsible for the murder. It was the first case in the United States in which a judge allowed a scan showing a defendant’s brain activity to be admitted as evidence to support a claim of innocence.\n \nThe Weinstein case marked the dawn of a new era in America’s courtrooms, raising complex and often troubling questions about how we define responsibility and free will, how we view the purpose of punishment, and how strongly we are willing to bring scientific evidence to bear on moral questions. Davis brings to light not only the intricacies of the Weinstein case but also the broader history linking brain injuries and aberrant behavior, from the bizarre stories of Phineas Gage and Charles Whitman, perpetrator of the 1966 Texas Tower massacre, to the role that brain damage may play in violence carried out by football players and troubled veterans of America’s twenty-first century wars. The Weinstein case opened the door for a novel defense that continues to transform the legal system: Criminal lawyers are increasingly turning to neuroscience and introducing the effects of brain injuries—whether caused by trauma or by tumors, cancer, or drug or alcohol abuse—and arguing that such damage should be considered in determining guilt or innocence, the death penalty or years behind bars. As he takes stock of the past, present and future of neuroscience in the courts, Davis offers a powerful account of its potential and its hazards.\n \nThought-provoking and brilliantly crafted, The Brain Defense marries a murder mystery complete with colorful characters and courtroom drama with a sophisticated discussion of how our legal system has changed—and must continue to change—as we broaden our understanding of the human mind.\n\nKevin Davis is a Chicago-based journalist and author of Defending the Damned and The Wrong Man. His award-winning writing has appeared in USA Today, The Chicago Tribune, The Utne Reader, Chicago Magazine, The Rumpus, Writer’s Digest, and other publications; he is a former staff reporter for the Sun-Sentinel in South Florida and is an editor at the American Bar Association Journal.\n\nEvent date: \nFriday, March 24, 2017 - 7:00pm\nEvent address: \nLiterati Bookstore\n124 E. Washington St.\nAnn Arbor, MI 48104", "url": "https://www.facebook.com/events/348672965526432/", "name": "Kevin Davis: The Brain Defense"}, {"date": "2017-03-24T19:00:00-04:00", "source": "Facebook", "description": "AAFF grandee Pat Oleszko returns to perform at AAFF55. \"Pat Oleszko makes a spectacle of myself - and doesn't mind if you laugh.\" Her performances range from street to stage to silver screen in a rollicking mass of splendid ephemera.\n\nSix short films  follow Pat's performance including recent experimental, documentary, and animated works. The flms feature a scientist-created world of idyllic happiness, a recorded Skype exorcism, a voyeur cat, and the World Premiere of local film artists Terri Sarris & Frank Pahl's film \"Circular,\" an adaptation of the short story “The Circular Ruins” by Jorge Luis Borges.", "url": "https://www.facebook.com/events/811940635635850/", "name": "Films in Competition 6 - Featuring Pat Oleszko"}]