[{"date": "2016-05-16T11:30:00-04:00", "description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: 10 Blinks Cherry Saison - a well balanced, smooth summer sipper. Abundant michigan cherry flavors, sweet and fruity on the nose, light and malty with strong stone fruit flavors. Finished with a slow burn like a fine wine. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "url": "https://www.facebook.com/events/158066451258466/", "source": "Facebook", "name": "American Craft Beer Week"}, {"date": "2016-05-16T19:00:00-04:00", "description": "AADL is honored to host an evening with Journalist Lesley Stahl.\n\nLeslie will discuss her new book \"Becoming Grandma: The Joys and Science of the New Grandparenting.\"  The event is cosponsored by Michigan Radio.\n\nThere is no fee to attend this special event ,which will include a book signing.  Books will be for sale, courtesy of Nicola’s Books. \n\nLesley Stahl is one of America’s most recognized and experienced broadcast journalists. The 2015-16 season marks her 25th as a correspondent for 60 Minutes.  Her  most vivid and transformative experience of her life, however,  was not covering the White House, interviewing heads of state, or researching stories at 60 Minutes. It was becoming a grandmother. \n\nAnd so, using her 60 Minutes skills, she explored how grandmothering changes a woman’s life, interviewing friends like Whoopi Goldberg, colleagues like Diane Sawyer (and grandfathers, including Tom Brokaw), as well as the proverbial woman next door. \n\nDo not miss this evening with Lesley Stahl as she discusses her career and her new book \"Becoming Grandma: The Joys and Science of the New Grandparenting.\"", "url": "https://www.facebook.com/events/225369014509916/", "source": "Facebook", "name": "An Evening With Lesley Stahl"}, {"date": "2016-05-16T19:00:00-04:00", "description": "Literati welcomes Toni Nealie, author of the essay collection The Miles Between Me,  and Zoe Zolbrod, author of The Telling: A Memoir, for a special night of literary nonfiction from Curbside Splendor Publishing.\n\nToni Nealie is a writer, journalist, and teacher living in Chicago. Her work has appeared in Guernica, The Prague Review, The Offing, The Rumpus, and been nominated for a Pushcart Prize. She worked in magazines, politics, and public relations in the U.K and her native New Zealand before moving to the U.S. She holds an MFA from Columbia College Chicago. In her debut essay collection, New Zealand native Toni Nealie examines journeys, homelands, family, and motherhood. She details humiliating confrontations with airport security, muses on the color brown, and intimately investigates her grandfather’s complicated and criminal past, all while hearkening home—wherever and whatever that is.\n\nZoe Zolbrod's work has appeared in Salon, The Nervous Breakdown, The Weeklings, and The Rumpus, where she serves as Sunday co-editor. Her debut novel Currency won a 2010 Nobbie Award and received an honorable mention by Friends of American Writers. Zolbrod lives in Evanston, Illinois, with her husband and children. About The Telling: Zoe Zolbrod remained silent about her early childhood molestation for nearly a decade. When she finally decided to tell, she wasn't sure what to expect, or what to say. Through a kaleidoscopic series of experiences as an adult, mother, and feminist, Zolbrod traces the development of her sexuality and her relationships with men in the shadow of her sexual abuse.", "url": "https://www.facebook.com/events/1094016970640442/", "source": "Facebook", "name": "Toni Nealie & Zoe Zolbrod"}, {"date": "2016-05-16T19:00:00-04:00", "description": "Free and open to the public, books will be on sale at the event courtesy of Nicola’s Books and a book signing will follow.\n\nLesley Stahl will discuss her new book “Becoming Grandma: The Joys and Science of the New Grandparenting.” After four decades as a reporter, Lesley Stahl’s most vivid and transformative experience of her life was not covering the White House, interviewing heads of state, or researching stories at 60 Minutes. It was becoming a grandmother. She was hit with a jolt of joy so intense and unexpected, she wanted to “investigate” it-as though it were a news flash. And so, using her 60 Minutes skills, she explored how grandmothering changes a woman’s life, interviewing friends like Whoopi Goldberg, colleagues like Diane Sawyer (and grandfathers, including Tom Brokaw), as well as the proverbial woman next door.\n\nPresented By: Ann Arbor District Library", "url": "https://www.facebook.com/events/1687708221503278/", "source": "Facebook", "name": "An Evening With Lesley Stahl Presented by the Ann Arbor District Library at the Michigan Theater"}, {"date": "2016-05-17T11:30:00-04:00", "description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: 10 Blinks Cherry Saison - a well balanced, smooth summer sipper. Abundant michigan cherry flavors, sweet and fruity on the nose, light and malty with strong stone fruit flavors. Finished with a slow burn like a fine wine. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "url": "https://www.facebook.com/events/158066451258466/", "source": "Facebook", "name": "American Craft Beer Week"}, {"date": "2016-05-17T17:00:00-04:00", "description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nBUY JUNE 11 TICKETS: http://bpt.me/2538000\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule", "url": "https://www.facebook.com/events/192972824428594/", "source": "Facebook", "name": "Ann Arbor Derby Dimes 2016 season"}, {"date": "2016-05-17T19:00:00-04:00", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n- May 17 Ryan Racine\nhttp://ryan-racine.squarespace.com/\nIt's been a twenty-plus year journey for Ryan Racine to get to where his music finds itself. Recording for the first time as a solo artist and writing without what he refers to as \"the shackles of genre\", the direction is really a culmination of the variety in his past projects. The sound is still very much grounded in American Roots music but is unbound by the narrow concepts he has applied to previous outings. \n\nRyan Racine first made a name for himself as the front man of Ann Arbor’s rockabilly outfit Lucky Haskins. Formed when he was only 15, the band burst onto the metro Detroit rockabilly scene and quickly garnered attention and a loyal fan base. Besides introducing the genre to a whole new generation in the area, they earned spots opening for legends like Carl Perkins, Johnny Cash, and Lee Rocker as well as a slot in the 1995 Detroit Music Awards.\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/238153536539884/", "source": "Facebook", "name": "Acoustic Tuesdays: Ryan Racine"}, {"date": "2016-05-17T19:00:00-04:00", "description": "Spring has arrived, semeters are ending... come celebrate with us. Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Reader\n\nThis month's feature: STEVIE EDWARDS!\n\nStevie Edwards is Editor-in-Chief at Muzzle Magazine and Acquisitions Editor at YesYes Books. Her first book, GOOD GRIEF (Write Bloody 2012), received the Independent Publisher Book Awards Bronze in Poetry and the Devil's Kitchen Reading Award. Her second book, HUMANLY, was released in 2015 by Small Doggies Press. She has an MFA in poetry from Cornell University, and will be starting a PhD in the English Department at the University of North Texas next fall. She currently resides in Ann Arbor, MI, and grew up in Lansing, MI. Her poems have appeared in Indiana Review, The Offing, Salt Hill, Baltimore Review, The Journal, Rattle, Verse Daily, PANK, and elsewhere.\n\n\nNext month's feature: JOSH DAVIS!", "url": "https://www.facebook.com/events/227229244321687/", "source": "Facebook", "name": "Skazat! Poetry Series featuring Stevie Edwards"}, {"date": "2016-05-18T19:00:00-04:00", "description": "Literati is pleased to host Teen Spirit, an award-winning publication of the Skyline High School Writing Center. Teen Spirit is a literary magazine that allows the entire school’s creative community to exhibit their writing, artwork, and multimedia creations.\n\nThis event will feature several exceptional Skyline student writers reading their fiction, poetry, and essays from Teen Spirit publicly for the first time.\n\nAn editorial board comprised of students in the Skyline Writing Center curate, layout, and edit Teen Spirit. This year’s editorial board consists of general editors Celia Arsen (‘16), Leah Bauer (‘16), Kelsey Carpenter (‘16), and Christopher Morgan-Martin (‘17),  art editors Star Su (‘17) and Eleana Tworek (‘16), and promotions directors Anna Dang (‘17), Ella Horwedel (‘16), and Kaelan Oldani (‘16) .  \n\nThe first two editions of Teen Spirit (‘13 and ‘14) received a superior rating from the National Council of Teachers of English (NCTE), which is the competition’s highest possible rating.  The third edition of Teen Spirit (‘15) received an excellent rating from the NCTE, which was the magazine’s third consecutive top-five finish.\n\nThe Skyline Writing Center is a student-centered peer tutoring and mentoring organization that provides high quality writing support to students every hour of every school day.  Each year, 35 qualified juniors and seniors are trained to work with all students on a wide variety of genres at any stage of the writing process.  Since its founding in 2012, the Writing Center has made more than 4,000 student contacts.  \n\nJeffrey Austin, a Skyline English teacher, is the program’s founder and director.\n\nTwitter: @Skyline_WC\n\nWebsite: tinyurl.com/skylinewc\n\nFacebook: Skyline Writing Center", "url": "https://www.facebook.com/events/629992600482127/", "source": "Facebook", "name": "Skyline High's Teen Spirit issue reading"}, {"date": "2016-05-18T19:00:00-04:00", "description": "John Hart is the author of the upcoming REDEMPTION ROAD, and of four New York Times bestsellers, THE KING OF LIES, DOWN RIVER, THE LAST CHILD and IRON HOUSE. The only author in history to win the best novel Edgar Award for consecutive novels, John has also won the Barry Award, the Southern Independent Bookseller's Award for Fiction, the Ian Fleming Steel Dagger Award and the North Carolina Award for Literature. His novels have been translated into thirty languages and can be found in over seventy countries. A former defense attorney and stockbroker, John spends his time in North Carolina and Virginia, where he writes full-time.\n\nImagine:\nA boy with a gun waits for the man who killed his mother.\nA troubled detective confronts her past in the aftermath of a brutal shooting.\nAfter thirteen years in prison, a good cop walks free as deep in the forest, on the altar of an abandoned church, a body cools in pale linen…\nThis is a town on the brink.\nThis is Redemption Road.\nBrimming with tension, secrets, and betrayal, Redemption Road proves again that John Hart is a master of the literary thriller.", "url": "https://www.facebook.com/events/1530634843907556/", "source": "Facebook", "name": "Meet NYT Bestselling Author John Hart for a Discussion & Signing of His New Novel, 'Redemption Road'"}]