[{"source": "Facebook", "name": "Earth Day Stewardship Workday", "description": "We’re celebrating Earth Day all week! You can too by joining us for work in this 20 acre nature area, rich in different habitats (woods, stream, and ponds!). Bring friends and family out to lend a hand combating garlic mustard and other spring invasive plants that threaten the growth of native plants and provide no food for wildlife.\nMeet us at 3470 Woodland Road, off East Huron River Drive, home of one of the Park’s Stewards.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "url": "https://www.facebook.com/events/2008427479381407/", "date": "2016-04-24T09:00:00-04:00"}, {"source": "Facebook", "name": "Join Us for an Afternoon of Poetry with Ann Arbor's Laszlo Slomovits and Jennifer Burd", "description": "“Receiving the Shore” is a 40 page book of Jennifer’s poems, with a CD of Laszlo's settings of those poems to music.   The duo will perform some of these poems for the audience.\n\nJennifer Burd has had both haiku and lyric poetry published in numerous journals, most recently in Beloit Poetry Journal, NEAT, Acorn, and Modern Haiku. Her full-length book of poems, Body and Echo, was published by PlainView Press in 2010. She is also the author of a book of creative nonfiction, Daily Bread: A Portrait of Homeless Men & Women of Lenawee County, Michigan (Bottom Dog Press, Inc., 2009, with photographs by Lad Strayer), based on her experiences reporting on local homelessness for the Adrian, Michigan, Daily Telegram newspaper. Burd received her BA in English and her MFA in Creative Writing from the University of Washington. She currently works as an editor and writer for HighScope Educational Research Foundation in Ypsilanti, Michigan. \n\nLaszlo Slomovits is one of the twin brothers in the children’s folk music duo Gemini (GeminiChildrensMusic.com).  Laszlo has given concerts throughout the U.S. and a number of his award-winning songs are featured in songbooks music teachers use throughout the country.  In addition, he has set to music the work of many poets. His recordings include five CDs of the poetry of ancient Sufi mystics, Rumi (translated by Coleman Barks) and Hafiz (translated by Daniel Ladinsky) as well as “White Picture” by the Holocaust-era Czech poet Jiri Orten (translated by Lyn Coffin) and “Cry of Freedom,” the poetry of contemporary American poet Linda Nemec Foster. \n\nJennifer and Laszlo have also had their jointly-written poems published in a number of print and on-line journals. In addition, a children’s play they co-wrote, I Can Hear the Sun, based on a book by Patricia Polacco, was produced by Ann Arbor’s Wild Swan Theater in March 2015.", "url": "https://www.facebook.com/events/962465290519288/", "date": "2016-04-24T15:00:00-04:00"}, {"source": "Facebook", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "url": "https://www.facebook.com/events/220537764986115/", "date": "2016-04-24T16:00:00-04:00"}, {"source": "Facebook", "name": "Open Stage", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/1697099597227373/", "date": "2016-04-24T19:00:00-04:00"}, {"source": "Facebook", "name": "Fresh + Fit!", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "url": "https://www.facebook.com/events/1573275812982685/", "date": "2016-04-25T12:00:00-04:00"}, {"source": "Facebook", "name": "Nick Tobier", "description": "Literati is pleased to welcome Nick Tobier in support of his book, written with Juliane Stiegele, Utopia Toolbox: An Incitement to Radical Creativity. Please note that this event will take place on our main floor.\n\nThe presentation will feature readings by featured contributors and Stamps faculty Irina Aristakhova and Stephanie Rowden, as well as special guests.\n\nThink of a hybrid between something like a how-to book and a theoretical framework that asks artists, designers, planners, architects and cultural producers to consider their actions in context. Utopia Toolbox contains an anthology of texts, quotations, interviews, documentation of art and design projects, and do-it-yourself actions and performances.\n\nThe contributions in practice and in text are from a broad array of disciplinary rubrics, including philosophy, art, science, technology, economics, and spirituality. They also provide perspectives from across the stages of life--from an 8 year-old child to octogenarian physicist Hans-Peter Duerr. In content and in proximity to one another, the wide-ranging contributions offer unexpected and fresh impulses, directions, estimations, suggestions and approaches to serve as a catalyst for creativity. The book encourages new and unknown combinations of thinking and also contains a number of empty pages for readers to sketch their own ideas and thinking processes.\n\nNick Tobier is an Associate Professor at the Stamps School of Art and Design and the Center for Entrepreneurship in the College of Engineering at the University of Michigan. His focus as an artist and designer is with the social lives of public places, both in built structures and events.", "url": "https://www.facebook.com/events/1579585742369724/", "date": "2016-04-25T19:00:00-04:00"}, {"source": "Facebook", "name": "Spring Beer Dinner", "description": "We're celebrating spring with two great things: food and beer! Join us on Tuesday, April 26th for four spring-themed courses plus a dessert course, each paired with a Wolverine State brew. Brewmaster Oliver Roberts and Chef Mark Grasso will be on hand to present and discuss the pairings. Ticket cost is $45 per person, and seating is limited, so don't delay! Tickets are available using the Eventbrite link above or in the Tap Room. The event is for ticket holders only and will take place in the Gulo Room. Seating and welcome beer at 6:30, and we roll from there. Call 734-369-2990 with questions, or email mackenzie@wolverinebeer.com.", "url": "https://www.facebook.com/events/103567850045837/", "date": "2016-04-26T18:30:00-04:00"}, {"source": "Facebook", "name": "Acoustic Tuesdays: Heather Schwartz", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1535746816722754/", "date": "2016-04-26T19:00:00-04:00"}, {"source": "Facebook", "name": "Club Above Presents: Hour 24 CD Release Tour/Stankface/Arson Party/Kid Grizzly", "description": "$5 cover, merch available, come have some fun. \n\nSing along: \n\nHour 24 (Toledo)\nWebsite: http://www.hour24band.com\nPre-Order the EP: https://itunes.apple.com/album/emergence-ep/id1091673720\n\nStankface (Ann Arbor) \nhttps://www.facebook.com/stankfacemusic/?fref=nf\n\nArson Party (Ann Arbor)\nhttps://itunes.apple.com/us/album/fall-of-the-rising-ii/id881628750?uo=4\n\nKid Grizzly (Detroit/Toledo)\nhttps://kidgriz.bandcamp.com/releases", "url": "https://www.facebook.com/events/1730384527194484/", "date": "2016-04-26T19:30:00-04:00"}, {"source": "Facebook", "name": "How to Photograph Your Artwork", "description": "Our April Artists' Meet & Greet topic is How to Photograph Your Artwork. Join us for this free event, connect with other artists and the Art Center staff.\n\nSpeaker: Nick Azzaro\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet events: http://www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/1668025760140932/", "date": "2016-04-27T18:00:00-04:00"}]