[{"url": "https://www.facebook.com/events/1607396122915653/", "description": "We're teaming up with a few of our friends again this summer for a casual ride on the border to border trail (or as we like to call it - the brewery to brewery trail!)\n\nSunday, June 12\n10am - depart Arbor Brewing Company Microbrewery in Ypsilanti. 720 Norris Street, Ypsilanti\n\nThe ride will take most people somewhere between 45 and 75 minutes\n\n11ish - grab a bite to eat at Arbor Brewing Company Brewpub in Ann Arbor. 114 E. Washington Street, Ann Arbor\n\nAfter brunch we'll ride back to the Microbrewery and relax in the beer garden with a pint of our B2B Trail Ale.\n\nThere is no charge or purchase required to participate but we do ask that all participants pre-register and sign a waiver. \n\nProceeds from the B2B Trail Ale benefit the Friends of the Border to Border Trail: A group of individuals working to see that the Border To Border Trail is completed, maintained, enhanced and most of all, used. \n\nRide notes:\n\n-        The ride is moderate as the total distance is 20 miles with some hills\n\n-        Solo Riders must be 12 years of age and trailers are aok\n\n-        What to bring: water, spare tire tube, helmet\n\n-        What not to bring: headphones\n\n-        Remember it is the law to obey all traffic rules\n\n-        Don’t forget to check your bike before the ride: breaks, gears, tires", "source": "Facebook", "date": "2016-06-12T10:00:00-04:00", "name": "Arbor Brewing Company B2B Ride"}, {"url": "https://www.facebook.com/events/1062304400483173/", "description": "On Sunday, June 12, UMMA will open from 10 a.m.–12 p.m. exclusively for a FREE ASD friendly program allowing families to enjoy art in a fun and welcoming atmosphere. Families will have access to special hands-on activities in the galleries that will help encourage exploration and discovery. Children will be able to make a Picasso puzzle, a Chinese rubbing, a contemporary sculpture and more, a few will be take-aways. Sketching and or writing materials will be available for children who prefer that to hands-on.\n\nThe Museum will also offer sunglasses, noise reducing earmuffs, and a quiet area with tactile toys for families who need to step away from the activities for a bit.\n\nThis event is recommended for ages 5-18, however all are welcome to participate.\n\nREGISTRATION REQUIRED! \nVisit myturn.eventbrite.com to register today!", "source": "Facebook", "date": "2016-06-12T10:00:00-04:00", "name": "My Turn: A Sensory Friendly Sunday at U-M Museum of Art"}, {"url": "https://www.facebook.com/events/1008482025896787/", "description": "We are gearing up for another week of culinary bliss during Ann Arbor's summer Restaurant Week! \n\nWe are featuring these special menus available in addition to our regular menu all week long.  \n-------------------------------------------------------------------------------\nSummer Restaurant Week 2016\n-------------------------------------------------------------------------------\nTwo for $15 lunch\nTax and gratuity not included\n•\tChoose one entrée for each person\no\tBBQ Tofu Sandwich\no\tWhitefish Po-boy\no\tChicken BLT\no\tCaesar Salad\no\tCherry Almond Salad\n-------------------------------------------------------------------------------\nTwo for $28 dinner per person\nTax and gratuity not included\n\nAppetizer\nTo share, please choose one\n•\tFried Pickle Spears \n•\tTruffle Sprouts\n•\tHummus and Pita \n\nEntree\nEach guest chooses one entree\n•\tMac and Cheese\n•\tFish and Chips\n•\tUrban Cowboy Bean Burger\n•\tAr-burger\n\nDessert or Beer\nTo share, please choose one\n•\tStout Chocolate pudding cake\n•\tStrawberries and Cream Belgian waffle\n•\tMaple Bourbon Bread Pudding\n\nNot interested in dessert? Swap it out for your choice of two 16oz drafts", "source": "Facebook", "date": "2016-06-12T11:00:00-04:00", "name": "Restaurant Week"}, {"url": "https://www.facebook.com/events/577783835736245/", "description": "We're breaking out our grill again to make you this delicicious Mexican Street Corn, served with herbs and spices, spicy peppers, lime, sour cream, and feta cheese- sooo good. Just 2/$3.", "source": "Facebook", "date": "2016-06-12T11:00:00-04:00", "name": "Grilled Mexican Street Corn"}, {"url": "https://www.facebook.com/events/593343600830941/", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.\nEngaging with Art tours are generously supported by the Berkowitz Family Endowed Fund.", "source": "Facebook", "date": "2016-06-12T14:00:00-04:00", "name": "Guided Tour: Engaging with Art"}, {"url": "https://www.facebook.com/events/106497669764310/", "description": "Arthur W. Wiggins is the author of The Joy of Physics (with cartoons by Sidney Harris) and the coauthor, with Charles M. Wynn Sr., of the The Five Biggest Ideas in Science, Quantum Leaps in the Wrong Direction, The Five Biggest Unsolved Problems in Science, and the textbook Natural Science: Bridging the Gaps. Wynn and Wiggins have also edited And God said, \"Let There Be Evolution!”: Reconciling the Book of Genesis, the Qur'an and the Theory of Evolution. Wiggins is Distinguished Professor Emeritus of Physics, Oakland Community College in Michigan.\n\nThis lively and humorous book focuses attention on the fact that \"science is a human enterprise.\" The reader learns about the foibles and quirks as well as the admirable ingenuity and impressive accomplishments of famous scientists who made some of the greatest discoveries of the past and present. Examples abound: James Watson and Francis Crick formed a legendary partnership that led to the discovery of DNA, but they essentially ignored the contribution of female colleague Rosalind Franklin. Later, in the race to sequence the human genome, Watson criticized J. Craig Venter's technique as a process that could be run by monkeys. Nikola Tesla once worked for Thomas Edison, but then quit after a dispute about a bonus. Robert Hooke accused Isaac Newton of stealing his ideas about optics. Plato declared that the works of Democritus should be burned. With tongue-in-cheek illustrations by renowned science cartoonist Sidney Harris, this book takes the reader behind the scenes of scientific research to shine new light on the all-too-human people who do science.", "source": "Facebook", "date": "2016-06-12T15:00:00-04:00", "name": "Meet Distinguished Professor Emeritus of Physics & Author Arthur Wiggins for a Discussion & Signing of 'The Human Side of Science'"}, {"url": "https://www.facebook.com/events/235874080125426/", "description": "Thursdays through Sundays June 9-26.  Check out Tickets Available link for arb member advance ticket info plus note Summer 2016 construction impacting arboretum area parking & traffic.  Arrive early for tickets and time to walk to location of the first scene.", "source": "Facebook", "date": "2016-06-12T18:30:00-04:00", "name": "Shakespeare in the Arb 2016 - Love's Labour's Lost Opening Week"}, {"url": "https://www.facebook.com/events/232840140431419/", "description": "Ann Arbor Civic is hosting the Tony Awards!\n\nWell, we're hosting a Tony-watching party, actually.\nAnd YOU are invited!\n \nJoin us at 7 PM on Sunday, June 12, at the A2CT Studio (322 W Ann Street) for a red-carpet event.  PLEASE RSVP BY FRIDAY, JUNE 3!\n \nWe'll have a red carpet arrival, drinks and light refreshments, ballots for you to pick the winners, and prizes for those who chose the most actual winners. We'll also have the Tony Awards playing on the big screen while we mix, mingle, and celebrate our love of theatre!\nThe party starts at 7:00, and the Tonys start at 8:00\nCome dressed for the red carpet, or as your favorite Broadway character!", "source": "Facebook", "date": "2016-06-12T19:00:00-04:00", "name": "Tony Awards Party!"}, {"url": "https://www.facebook.com/events/1675181302742634/", "description": "Enjoy hilarious video shorts created by some of our very own improvisers and also by professional, amateur and even wannabe film makers in and around the community!!\n\nHere’s how it works: Each month we’ll get a new suggestion from the audience to use as inspiration for the next month’s “Pointless 730 Hour Video Challenge.\" Next, get to work creating your prerecorded masterpiece. Submissions can be no longer than two minutes in length.\n\nAnd the coolest part - We will be taking your video and using it as the suggestion for an improv scene!!! IT'S A FREAKING VIDEO NIGHT/IMPROV JAM!!! People will LITERALLY be DISSECTING your video in the name of improvised comedy. What will they do with it??? Show up to find out.\n\nSend your finished product to pointlessvideoshorts@gmail.com no later than the Saturday before the video night. And finally, come and watch the crowd go wild over your creative and hysterical work of digital media art.\n\nNot into making vids but love watching them? Submit your favorite one from YouTube related to that month’s “suggestion” and we might play it on that Sunday! That’s right, you can share with the world that video you accidentally stumbled upon late one night while browsing the interwebs that made you cry with laughter.\n\nOf course, you are not required to participate in any way. Simply come, enjoy a microbrew, sit back and laugh with some fellow funny people. Admission is pay-what-you-can.\n\nLet’s get ROLLIN’!.", "source": "Facebook", "date": "2016-06-12T19:00:00-04:00", "name": "Pointless 730 Hour Video Challenge - June's Theme \"Road Trip\""}, {"url": "https://www.facebook.com/events/725944687548567/", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $28 for a three course dinner! \n\nThe Main Street Area Association (Main Street Area Ann Arbor) is proud to bring you Ann Arbor's favorite semi-annual dining event - Restaurant Week!\nThe specials run June 12-17th. Visit www.annarborrestaurantweek.com for details.", "source": "Facebook", "date": "2016-06-13T00:00:00-04:00", "name": "Ann Arbor Restaurant Week"}]