[{"source": "Facebook", "name": "Oktoberfest Release", "date": "2016-09-04T16:00:00-04:00", "url": "https://www.facebook.com/events/660184664155555/", "description": "Our in-house Oktoberfest release is one of our favorite days of the year! Come say \"o'zapft is\" with us -- we'll have German food specials running all weekend and 11x17 prints of our Oktoberfest poster wil be available for purchase. Prost!"}, {"source": "Facebook", "name": "Ann Arbor Poetry Slam", "date": "2016-09-04T18:30:00-04:00", "url": "https://www.facebook.com/events/1288504411189429/", "description": "Ann Arbor Poetry Slam is back this Sunday with another all ages open community free-speech event! To read or perform, sign up between 6:30 & 7:00. The show starts at 7. There is a five dollar suggested donation at the door. All proceeds go to send winning poets to National and International poetry tournaments. DIY. Grass-roots. Since 1987. Come early. Stay late. Bring the world. Bring your words. Your host this week is Luis Anderson!"}, {"source": "Facebook", "name": "Not-So-Labor Day", "date": "2016-09-04T20:30:00-04:00", "url": "https://www.facebook.com/events/241524469579758/", "description": "The Not-So-Labor-Day is the official all-night-pre-game  to this year's Labor Day! We've all been going hard in the paint, working our asses off, so it's time to cut loose and get a jump on our day off on Monday!!! It's the dance party of the YEAR. \n\nFeaturing:\n\nU X L (Brian Roberts) - A newcomer to the EDM scene with plenty of totally VIRAL beats to kick off the night!\n\nVest And Tyler - Hnnggngngggwwhhwwnnnggg\n\nKatzMeow - The QUEEN of Bass descends from her throne to grace the peasants and work some hard beats into your souls!\n\nDrop Texture - Making sure you all hit Labor Day RAVING, Drop Texture is ending the night with some deep bass and hitting your chest with some dirty dub!"}, {"source": "Facebook", "name": "Nights at the Museum", "date": "2016-09-05T20:30:00-04:00", "url": "https://www.facebook.com/events/1770837316505091/", "description": "Nights at the Museum, UMMA’s first-ever exterior media art initiative, is open to the public, and will run from September 2-9 from 8:30 p.m. to dawn along its State Street-side facade.\n\nNights at the Museum begins Friday, Sept. 2, during Artscapade!, a Welcome Week event for new U-M students, and concludes on Friday, Sept. 9 at UMMA’s twice-annual After Hours community celebration.\n\nOn Friday, Saturday, and Sunday, from dusk to dawn, UMMA will showcase a digital art installation by Quayola called Pleasant Places. Inspired by the work of Vincent Van Gogh, Quayola has returned to the same countryside of Provence 125 years later to create of a series of digital paintings exploring the boundary between representation and abstraction. Pleasant Places will also be projected overnight throughout the remainder of the week. \n\nFor the Full Schedule Check Here: http://www.umma.umich.edu/news/2016/umma-to-light-up-campus-with-nights-at-the-museum"}, {"source": "Facebook", "name": "Sweetwaters Westgate Grand Opening!", "date": "2016-09-06T09:00:00-04:00", "url": "https://www.facebook.com/events/1090878344334512/", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, allllll day long (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3"}, {"source": "Facebook", "name": "Acoustic Tuesdays: Andrew Langdon Brown", "date": "2016-09-06T19:00:00-04:00", "url": "https://www.facebook.com/events/508029376065329/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nAndrew Langdon Brown, Guitar player and songwriter from Appleseed Collective was born the son of a Motown session musician. After a brief trip to New Orleans as a teenager he became obsessed with fusing an eclectic blend of pre-World-War II american roots music, bluegrass and jazz with modern and genre bending, and poetic songwriting. \n\nNew a cover\nAlways a good time"}, {"source": "Facebook", "name": "Ken Foster", "date": "2016-09-06T19:00:00-04:00", "url": "https://www.facebook.com/events/516806575181956/", "description": "Literati is pleased to welcome Ken Foster in support of the his New York Times-bestselling memoir, The Dogs Who Found Me.\n\nIn concert with Ken's visit, we'll be holding a fundraiser for the Humane Society of Huron Valley's wonderful Bountiful Bowls program, which helps people keep pets instead of surrendering them to a shelter. HSHV accepts and distributes 40,000 pounds of pet food each year, and we're grateful for the work they do as well as their participation in this event. Food donations, as well as donations by cash or check, will be accepted at the event, or you can donate online. \n\nNow regarded as a classic in dog literature, Ken Foster's memoir chronicles his journey from first-time dog owner to rescuer—and all the lessons and mistakes he made along the way. Bookended by the tragedies of 9/11 and Katrina, Foster finds that dogs open his eyes to the benefits of compassion, selflessness, and the chaotic beauty of living each day in the moment. \n\nBut more than Foster's own story, readers remember the dogs. Among them are Duque, a Costa Rican stray; Brando, Foster's first adopted dog and a supposed pit bull mix who outgrew his Manhattan studio apartment; Rocco, a clownish red pit bull whose owner mistakenly gives him away to the wrong person; Zephyr, a cheerful Rottweiler mix who awakens Foster by sitting on his chest when his heart stops working; and Sula, the tiny lost pit bull who showed up at Foster's door one day and stayed. \n\nWhether bearing witness to national tragedy, grieving the death of a friend, or dealing with his own mortality, Foster finds strength in his dogs, and in the reciprocal nature of rescue. \n\n\"Generosity and gratitude power this compelling account of the reciprocal nature of rescue. Ken Foster illuminates a profound lesson about saving a life: Doing it makes you able to do it.\"–Amy Hempel, author of The Dog of the Marriage and Reasons to Live\n\nKen Foster is the editor of two anthologies, including Dog Culture, and the author of Dogs I Have Met and I’m a Good Dog. His collection of short stories, The Kind I'm Likely to Get, was a New York Times Notable Book. His work has appeared in The New York Times Book Review, The San Francisco Chronicle, McSweeney's, and The Believer. He has taught at The New School, Florida State University, and the University of Southern Mississippi. In 2008, he founded The Sula Foundation, which promotes responsible dog ownership among the pit bull population and sponsors education and outreach in the New Orleans area. He lives in New Orleans, with at least three dogs."}, {"source": "Facebook", "name": "Sweetwaters Westgate Grand Opening!", "date": "2016-09-07T09:00:00-04:00", "url": "https://www.facebook.com/events/1090878344334512/", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, allllll day long (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3"}, {"source": "Facebook", "name": "Oktoberfest Release", "date": "2016-09-07T16:00:00-04:00", "url": "https://www.facebook.com/events/660184664155555/", "description": "Our in-house Oktoberfest release is one of our favorite days of the year! Come say \"o'zapft is\" with us -- we'll have German food specials running all weekend and 11x17 prints of our Oktoberfest poster wil be available for purchase. Prost!"}, {"source": "Facebook", "name": "First Wednesday Food Truck Rally", "date": "2016-09-07T17:00:00-04:00", "url": "https://www.facebook.com/events/891980987615391/", "description": "Summer vacation might be over, but we're not quite ready to stop the fun! Join us for our second to last food truck rally of the season! As always, your favorite local food trucks will be serving up a deliciously good time! Face painting, live music and more for a great kick off to the school year! \n\nDon't forget to tag us in your photos with #a2rally We're on Twitter and Instagram too!\n\nUpcoming Rallies:\nSeptember 7\nOctober 5"}]