[{"description": "Experience the flavors of the season and try our new Spring menu. Featuring new food and beverages you are sure to love! \nBut, don't worry we have kept some of the classics on our menu too.\nYou can make your reservation with OpenTable link above.", "name": "Spring Menu Launch", "date": "2016-05-29T12:00:00-04:00", "url": "https://www.facebook.com/events/1745052782438333/", "source": "Facebook"}, {"description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: Strawberries & Cream - Cream soda meets fresh-picked strawberry in this juicy rendition of the infamous Strawberry Blonde. Smooth scents of vanilla flood the nose and taste buds at first sip, followed by the bite of strawberry and a satisfying finish.. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "name": "American Craft Beer Week", "date": "2016-05-31T11:30:00-04:00", "url": "https://www.facebook.com/events/158066451258466/", "source": "Facebook"}, {"description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n- May 31 Nick Fügedi\nhttps://www.reverbnation.com/nickfugedimusic\n\nSinger / Songwriter Nick Fügedi has called many places home. Fügedi's love for music began with his parents record player, where he frequently listened to LP's of popular 1960's Folk singers; Jim Croce, James Taylor, John Denver, Simon and Garfunkel, and Bob Dylan. It was with this inspiration that he decided to start playing and writing music of his own. Fügedi's songs use traditional Folk and Americana styling's to portray modern themes and ideas.\n\nNever a cover\nAlways a good time", "name": "Acoustic Tuesdays: Nick Fügedi", "date": "2016-05-31T19:00:00-04:00", "url": "https://www.facebook.com/events/1687484028205922/", "source": "Facebook"}, {"description": "Experience the flavors of the season and try our new Spring menu. Featuring new food and beverages you are sure to love! \nBut, don't worry we have kept some of the classics on our menu too.\nYou can make your reservation with OpenTable link above.", "name": "Spring Menu Launch", "date": "2016-06-01T12:00:00-04:00", "url": "https://www.facebook.com/events/1745052782438333/", "source": "Facebook"}, {"description": "The first one was so much fun, we're going to do it again! The second Food Truck Rally of the season is here! Bring your friends and enjoy a beautiful summer evening eating delicious, local food! Hope to see you there!\n\nDon't forget to tag us in your pictures with #a2rally We're on Twitter and Instagram too! \n\nUpcoming Rallies:\nJune 1st\nJuly 6th\nAugust 3rd\nSeptember 7th\nOctober 5th", "name": "First Wednesday Food Truck Rally", "date": "2016-06-01T17:00:00-04:00", "url": "https://www.facebook.com/events/1676510779282378/", "source": "Facebook"}, {"description": "Please join us as we celebrate the opening of our outdoor patio with a 4-course dinner paired with your choice of beer or wine!\n\nGuest Speaker:\nMainstreet Ventures’ Beverage Director Todd Winters\n\nThe Menu\nFirst Course \nCaprese Salad\nsliced tomato, avocado, fresh mozzarella, balsamic reduction, black Hawaiian sea salt and basil chiffonade\nSelect: Sonoma Cutrer Chardonnay or Short's Brewing Company Controversiale \n\nSecond Course \nGazpacho \nCarson’s local favorite Spanish-style soup made from fresh tomatoes, vegetables and spices, served cold\nSelect: Carson's Red Sangria or Short's Brewing Company Soft Parade\n\nThird Course\nGrilled Airline Chicken \nwith artichokes, preserved lemons & capers, grilled asparagus, and corn spoonbread\nSelect: Whitehaven Sauvignon Blanc or Short’s Brewing Company Space Rock Pale Ale\n\nFourth Course\nTiramisu\nwith espresso flavored ladyfingers, layered with mascarpone cheese filling\nSelect: Josh Cellars 'Legacy' Red Blend or Short's Brewing Company Bellaire Brown\n\nReservations Required\n(888) 456-3463 (DINE)\n$59.95 per person, tax/gratuity not included\nLimited seating available.", "name": "Carson’s Patio Kick Off Party!", "date": "2016-06-01T18:00:00-04:00", "url": "https://www.facebook.com/events/883372388440349/", "source": "Facebook"}, {"description": "Literati is pleased to welcome Jon M. Sweeney in support of his most recent title, The Enthusiast: How the Best Friend of Francis of Assisi Almost Destroyed What He Started.\n\nPopular historian and award-winning author Jon M. Sweeney relates the untold story of St. Francis’s friendship with Elias of Cortona, the man who helped him build the Franciscan movement. Sweeney uses the complexities of their relationship in a gripping narrative of how their efforts changed the world and how Elias’s enthusiasm betrayed the ideals of his friend.\n\nBlending history and biography, Sweeney reveals how Francis and Elias rebuilt churches, aided lepers, and entertained as “God’s troubadours” to the delight of everyday people who had grown tired of a remote and tumultuous Church. At the height of their spiritual renaissance, however, Elias became “the devil” to many of the other friars; they believed him to be a traitor to their ideals. After Francis’s premature death, the movement fractured. Scorned by most of the Franciscan leadership, Elias followed a path that would leave him a lonely, broken man. Sweeney shows how Elias’s undoing was rooted in his attempts to honor his old friend.\n\nJon M. Sweeney is an independent scholar and one of religion’s most respected writers. His work has been hailed by everyone from PBS and James Martin, S.J., to Fox News and Dan Savage. He’s been interviewed on CBS Saturday Morning, Fox News, CBS-TV Chicago, Religion and Ethics Newsweekly, and on the popular program Chicago Tonight. Several of his books have become Book-of-the-Month Club and Quality Paperback Book Club selections. His popular medieval history, The Pope Who Quit, was published by Image/Random House and optioned by HBO. It was a selection of the History Book Club and received a starred review in Booklist. His book, When Saint Francis Saved the Church, received a 2015 award for excellence in history from the Catholic Press Association. His other words include Inventing Hell, The Complete Francis of Assisi, and The St. Francis Prayer Book. Sweeney writes regularly for America and The Tablet, and is also the editorial director at Franciscan Media. He is married, the father of three, and lives in Vermont.\nEvent date: \nWednesday, June 1, 2016 - 7:00pm", "name": "Jon M. Sweeney: The Enthusiast", "date": "2016-06-01T19:00:00-04:00", "url": "https://www.facebook.com/events/274191096260542/", "source": "Facebook"}, {"description": "Wild Belle\n – multi-instrumentalist Elliott Bergman and his younger sister Natalie Bergman – is an American indie reggae and rock band based in Chicago. Their debut studio album Isles was released 2012.  Wild Belle's latest album, Dreamland was released in April of 2016. \nElliot and Natalie Bergman are two of four children born to musician parents, who brought them up in a house full of music. Elliot, the older sibling, is a multi-instrumentalist studied at the University of Michigan where he started an Afrobeat band called Nomo. His younger sister, Natalie, started performing with Nomo, playing tambourine and singing backing vocals when she was sixteen. Elliott and Natalie decided to branch off with their own project and chose the name, Wild Belle. Wild Belle has gained recognition through touring with Toro y Moi in the past. Wild Belle will continue with their touring kick by appearing at music festivals across the United States, including Lollapalooza, Coachella, Forecastle Festival, and others. http://www.wildbelle.com \n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\n Sonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Wild Belle / June 2nd / Bank of Ann Arbor's Sonic Lunch / 12PM FREE", "date": "2016-06-02T12:00:00-04:00", "url": "https://www.facebook.com/events/272381566427718/", "source": "Facebook"}, {"description": "We're super excited for our very first tap takeover with none other than our good friends from Founders Brewing Company. 5 taps of local hoppy hour goodness- we can hardly wait!", "name": "Tap Takeover with Founders Brewing Company", "date": "2016-06-02T17:00:00-04:00", "url": "https://www.facebook.com/events/1149030195130531/", "source": "Facebook"}, {"description": "$2 pints and custom coloring pages- Thursday is the new Friday! Bonus- Founders Brewing Co.will be here from 5-7 for a tap takeover <3", "name": "Adult Coloring Night", "date": "2016-06-02T18:00:00-04:00", "url": "https://www.facebook.com/events/498663607009941/", "source": "Facebook"}]