[{"source": "Facebook", "name": "Intro to Stagecraft Workshops", "description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "url": "https://www.facebook.com/events/1716505231999811/", "date": "2017-01-29T10:00:00-05:00"}, {"source": "Facebook", "name": "Constructing Gender: Origins of Michigan’s Union and League", "description": "Ask U-M students, alumni, or fans what symbolizes the University of Michigan, and you’ll likely hear the Big House, the Diag, along with the Michigan Union and the Michigan League. Since they officially opened in 1919 and 1929, respectively, the Union and League have been destinations for generations of Wolverines yet few know the rich history of the buildings’ origins or about the architects who brought them both to life: brothers and U-M alums Irving K. and Allen Pond.\n\nThe exhibition, organized in celebration of the University of Michigan’s bicentennial in 2017, illuminates the architecture and bustling student life of these iconic buildings using original drawings, renderings, photographs, color studies, and even dance cards from the Bentley Historical Library, which serves as the University of Michigan archives. These fascinating documents reveal how the buildings were conceived, constructed, and first occupied by students and alumni. Guest curated by Nancy Bartlett of the Bentley Historical Library, the exhibition reveals how the Ponds meticulously conceived and constructed the two clubs—one for men, one for women—by weaving ideas about gender and society into the very fabric of the buildings themselves.\nLead support for this exhibition is provided by the Herbert W. and Susan L. Johe Endowment.", "url": "https://www.facebook.com/events/1257037607708983/", "date": "2017-01-29T11:00:00-05:00"}, {"source": "Facebook", "name": "High Tea: East Meets West", "description": "Come join us for an afternoon of refinement and delicious delights! A traditional English afternoon tea service, with an Asian twist. Three courses of pastries, sandwiches, desserts, and of course, tea!\n\nOnly 35 spots available. Please reserve tickets by emailing lauriev@sweetwaterscafe.com.", "url": "https://www.facebook.com/events/1785299801795011/", "date": "2017-01-29T11:00:00-05:00"}, {"source": "Facebook", "name": "Europe on Paper: Guided Tour", "description": "The works in Europe on Paper: The Ernst Pulgram and Frances McSparran Collection capture artistic compulsions and creative responses to the physical and spiritual world, from tangled, emotionally embroiled nudes to meticulous landscapes and architectural vistas. This exemplary gift from late U-M professor emeritus Ernst Pulgram and his wife, associate professor emerita and chief editor of the Middle English Compendium, Frances McSparran, offers a glimpse into the visually stunning and thought-provoking history of European graphic art. Join UMMA docents as they discuss the myriad artists in this exhibition including Austrian and German expressionists as well as the inventive Italian Giovanni Battista Piranesi.", "url": "https://www.facebook.com/events/361820764183080/", "date": "2017-01-29T13:00:00-05:00"}, {"source": "Facebook", "name": "Japanese Prints of Kabuki Theater from the Collection", "description": "Kabuki actors were superstars in eighteenth- and nineteenth-century Japan. They were admired by passionate fans with an insatiable appetite for images of them, fed by a publishing industry that mass-produced colorful woodblock prints of actors on stage which could act as substitutes for a theater experience. Join a tour with UMMA docents of Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art and discover these dramatic prints by major artists that include off- or backstage portrayals, fantasy scenes of actors in unlikely groupings, and even death portraits of especially famous actors.", "url": "https://www.facebook.com/events/928416833925407/", "date": "2017-01-29T14:00:00-05:00"}, {"source": "Facebook", "name": "Handheld Sculpture: An Introduction to Tibetan Book Covers", "description": "Before becoming art objects in the West, intricately designed Tibetan book covers were considered religious objects, protecting the words and the teachings of the Buddha. The curator of the exhibition Protecting Wisdom (on view through April 2, 2017),\nDr. Kathryn Selig Brown, will discuss the book covers' ornate decoration, form, and production, as well as their place in Tibetan cultural history.\n\nLead support for this exhibition is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, and the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund and the Department of Asian Languages and Cultures.", "url": "https://www.facebook.com/events/1853272068241070/", "date": "2017-01-29T15:00:00-05:00"}, {"source": "Facebook", "name": "Cookbook Event - Chowgirls Killer Party Food", "description": "Heidi Andermack, born in Michigan, co-founded Chowgirls Killer Catering in 2004. She is a passionate member of her community in Minneapolis, helping establish the Northeast Minneapolis Arts District and serving on the board of the local farmers market. She is mom to Maximillian and wife to world-renowned font designer Chank Diesel.\n\nAmy Lynn Brown was born and raised in Kentucky but ended up in Minneapolis, where she married an old college friend. After a 15-year career in bookselling and publishing, she co-created Chowgirls Killer Catering in 2004. She stays busy distance running, gardening, and raising her three daughters Frances, Louise, and Julip.\n\nCookbook: \n\nWith an eye for style and appreciation for seasonal ingredients, the proprietors of Chowgirls Killer Catering, one of the Midwest's leading catering companies, share their inspired ideas for delicious appetizers, small plates, and cocktails that are perfect for home entertaining. Amy Lynn Brown and Heidi Andermack were early adopters of the local, organic, sustainable, and seasonal approach to cooking; their ethos is clearly reflected in this cookbook, which offers fun, elegant, and yet easy-to-prepare recipes arranged by season that will be the hit of your next social gathering.\n\nFor your party to welcome spring, impress your guests with Spring Pea Toasts with Gouda, Mint-Crusted Lamb Chops, and Wasabi Crab Cakes. For that backyard summer fest, try Flank Steak Skewers with Chimichurri, Sweet Corn Risotto with Grilled Shrimp, and Gazpacho Jars. On that chilly fall gathering, offer the Grilled Sirloin with Farro Tomato Salad, Bacon-Pecan Tartlets, and Roasted Fall Vegetables with Saffron Aioli. And for that festive winter blow-out, make the Italian Beef Sliders, Crab & Green Chile Gratin, and Artichoke Tapenade. Then to wash it all down, make sure there's plenty of Mint Julep Sweet Tea, White Sangria, and Strawberry Basil Daiquiris!\n\nAndermack and Brown's shared passion for cooking and entertaining shines throughout this beautiful and inspiring cookbook. Their \"righteous bites\" will impress your guests with dazzling, organic, locally sourced recipes that show you care. Party on!", "url": "https://www.facebook.com/events/732895360195666/", "date": "2017-01-29T15:00:00-05:00"}, {"source": "Facebook", "name": "Inon Barnatan, Anthony McGill & Alisa Weilerstein", "description": "Inon Barnatan, piano\nAnthony McGill, clarinet\nAlisa Weilerstein, cello\n\nThis powerhouse trio brings together some familiar faces.\n\nInon Barnatan was the featured piano soloist with the New York Philharmonic last fall, Anthony McGill is the New York Philharmonic’s principal clarinetist, and Alisa Weilersten has performed on both the Choral Union Series and the Chamber Arts Series in recent years. This concert of beloved clarinet trios includes a new work by Joseph Hallman, a prolific young composer based in Philadelphia, which was co-commissioned by UMS as part of the Music Accord commissioning consortium.\n\nMore info: http://ums.org/performance/inon-barnatan-piano-anthony-mcgill-clarinet-alisa-weilerstein-cello/", "url": "https://www.facebook.com/events/270514846618930/", "date": "2017-01-29T16:00:00-05:00"}, {"source": "Facebook", "name": "Ann Arbor Restaurant Week", "description": "Join us for Ann Arbor\nRestaurant Week\nJanuary 15th – 20th, 2017\nLunch & Dinner\n\nhttp://www.annarborrestaurantweek.com/\n\nReservations Recommended\n(888) 456-3463 (DINE)", "url": "https://www.facebook.com/events/208434849627331/", "date": "2017-01-30T10:00:00-05:00"}, {"source": "Facebook", "name": "Ann Arbor Restaurant Week", "description": "Ann Arbor Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price.\n\nVinology Wine Bar and Restaurant is proud to be part of this great event, offered from January 15 - 20.  Enjoy a three course dinner for only $28!", "url": "https://www.facebook.com/events/1844201079197076/", "date": "2017-01-30T10:00:00-05:00"}]