[{"url": "https://www.facebook.com/events/1737852759803500/", "description": "Stewardship Workday\nSaturday, October 8\nMarshall Nature Area\n9 a.m. to noon\nThis large nature area, which extends into a county park and University of Michigan property, is a valuable piece of wildlife habitat in the northeast part of the city. Come out to help us improve the habitat by removing invasive buckthorn and honeysuckle. This amazing nature area is sure to provide an incredible outdoor experience. Meet in the parking lot off Dixboro Road, north of Plymouth Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "source": "Facebook", "date": "2016-10-08T09:00:00-04:00", "name": "Stewardship Workday-Marshall Nature Area"}, {"url": "https://www.facebook.com/events/1579703035671405/", "description": "Sylvie Granatelli Workshop\nSaturday, October 8 – Sunday, October 9 \n9:30am-4:30pm\n\nIn this two day demonstration workshop Silvie will work with porcelain clay, throwing a variety of forms. The pieces will be altered and built upon to demonstrate how she makes pots and thinks about design and function. The workshop will also focus on surface design and embellishment using slip trailing, carving and line drawing. Silvie is deeply engaged in practice of making functional pots and the theater and atmosphere of the dining experience. Silvie states: “I am interested in discussing how we learn techniques, develop ideas and evolve as innovators rather than imitators. Ideas come easily, but meaning seems to come in layers over decades of time. It is meaning that gives strength to good ideas.” Silvie invites participants to bring images of their work for discussion and questions and themes that we might discuss and all benefit from. How we evolve as makers in our increasingly technological world is a favorite topic of mine.\n\nSilvie Granatelli received her BFA from Kansas City Art Institute and her MFA from Montana State University. Since 1982 she has maintained a home and studio in Floyd, Virginia. Granatelli exhibits her work throughout the United States. She is a seasoned workshop presenter and teacher having taught students in colleges and art centers throughout the US and abroad.\n\nPlease take a moment to watch this interview with Silvie that is available on her website:\nhttp://silviegranatelli.com/interview/\nView less", "source": "Facebook", "date": "2016-10-08T09:30:00-04:00", "name": "Ceramics Workshop: Sylvie Granatelli"}, {"url": "https://www.facebook.com/events/749295545208940/", "description": "Join us for Intuitives Interactive's 4th Annual FALL HOLISTIC & PSYCHIC EXPO! The largest event of its kind in Michigan! Once again, TWO DAYS LONG! Saturday-Sunday, October 8-9, 2016\n\nLOCATION: \nThe beautiful EMU Student Center\nEastern Michigan University in Ypsilanti (next-door to Ann Arbor)\n900 Oakwood Street, 2nd floor Ballroom and Auditorium \n(ground floor as you enter from the parking lot)\nYpsilanti, MI 48197\n~ TONS of FREE PARKING ~ \n(on Oakwood Street and N. Huron River Drive)\n\nSPONSORED BY: Body Mind Spirit Guide & Body Mind Spirit Radio, Crazy Wisdom Bookstore & Tea Room, and the Enlightened Soul Center\n\n- SATURDAY, OCTOBER 8, 2016 - 10:00 am - 6:00 pm\n      Doors open 9:30 am for registration on Saturday\n- 6 pm Saturday: STAY for the SPECIAL PRESENTATION:\n      International Psychic Medium LORI LIPTEN!!\n- SUNDAY, OCTOBER 9, 2016 - 11:00 am - 5:00 pm\n     Doors open 10:30 am for registration on Sunday\n\n**FIRST 50 PAID ATTENDEES EACH DAY**\nGET A GIFT BAG valued at $20 & CHANCE TO WIN A FULL-LENGTH HEALING or READING!\nEnergy Work/Medical Intuitive Session with Lori Irvin, ZSource\nConnection, OR a Channeled Psychic Reading with Amy Garber, Metafizzy LLC, Show Co-Director; Co-Founder, Intuitives Interactive\n\nThe READER ROOM IS FULL! See the readers who will be in our exclusive quiet, private room with concierge service:\nhttp://www.holisticpsychicexpo.com/readers-1\n\nTO APPLY FOR A BOOTH as a bodyworker, reader, or vendor in the Ballroom: http://www.holisticpsychicexpo.com/#!apply-1/dyc85\nAPPLICATION DEADLINE: September 9\nLate applications will be accepted until we are full, but may not be included in the promotions or handouts.\n\nADMISSION: \n$10 Daily Adult Ticket / $9 Online in advance by Oct. 6\n$15 Adult Weekend Pass / $13 Online in advance by Oct. 6\n$8 College students (daily pass)\n$5 Kids 12-17 yrs / Under 12 free \nPAID ADMISSION includes FREE presentations both days! \n\nADVANCE DISCOUNTED TICKETS ONLINE (thru Oct. 6):\nhttp://www.holisticpsychicexpo.com/#!purchase-tickets/p2a3m\n\n~ FEATURED PRESENTATION ~\nSaturday, October 8, 6:00 PM in the Auditorium:\nMEDIUMSHIP GALLERY READING with\n internationally acclaimed Psychic Medium LORI LIPTEN! \nREADINGS of DEPARTED LOVED ONES for the audience\nand sometimes CELEBRITIES COME THROUGH TOO!\n~ FREE with paid Expo Admission ~\n\nREADINGS: BOTH IN OUR PRIVATE READER ROOM (with Concierge Service and no interruptions) & AROUND THE VENDOR BALLROOM! \nThere will be Mediums, Psychics, Tarot & Angel Card Readers, and Intuitive & Channeled Readings...and more! \nSPECIALTY READINGS: Crystal Ball, Rare Hungarian Gypsy Cards, Runes, Numerology, Psychic Artist, Shamanic Stone Bowl...and more!\nhttp://www.holisticpsychicexpo.com/#!readers-1/xuu0n\nhttp://www.holisticpsychicexpo.com/vendors\n\nOTHER GREAT OFFERINGS INCLUDE: Aura Photography, Pyramids, Body & Energy Workers, Essential Oils, Vendors of Holistic & Metaphysical Products, Crystals & Stones, Jewelry, FREE Yoga Demos, and More!\nhttp://www.holisticpsychicexpo.com/#!vendors/tcvqd\n\nSCHEDULE of PRESENTATIONS free with Expo admisison at:\nhttp://www.holisticpsychicexpo.com/#!presentations/zngx1\n\nVOLUNTEERS NEEDED! Volunteers get special perks in exchange for their dedicated service. SIGN UP NOW at:\nhttp://www.holisticpsychicexpo.com/#!volunteer/glc6s\n\nMAILING LIST: Join our mailing list by filling out the form at:\nhttp://holisticpsychicexpo.com/\n\nThanks and we look forward to seeing YOU and your friends at this transformative event!!!", "source": "Facebook", "date": "2016-10-08T10:00:00-04:00", "name": "4th Fall Holistic & Psychic Expo, Oct. 8-9, 2016"}, {"url": "https://www.facebook.com/events/1013140175465605/", "description": "Saturday, October 8, 11:15 a.m.–12 p.m. Meet by UMMA Store\r\n\nChildren ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. Meet in front of the UMMA Store.\rStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "source": "Facebook", "date": "2016-10-08T11:00:00-04:00", "name": "Storytime at the Museum"}, {"url": "https://www.facebook.com/events/1114471478672694/", "description": "Baby got back BBQ ribs with a side of made in-house slaw, $5. Yup, it's gonna be good.", "source": "Facebook", "date": "2016-10-08T11:00:00-04:00", "name": "Popup Kitchen BBQ Ribs"}, {"url": "https://www.facebook.com/events/1745138492407150/", "description": "It's Massacre season! #2016Massacre releases in-house on Saturday, October 8th. Mug Club Members get priority four-pack purchasing power beginning at noon with general public sales opening up at 1 pm. Live music in the afternoon, extra heated seating on the patio, specially dosed casks of Massacre for your tasting pleasure, and giveaways during halftime of the night game v. Rutgers! Don't miss this party!", "source": "Facebook", "date": "2016-10-08T12:00:00-04:00", "name": "2016 Massacre Release Party"}, {"url": "https://www.facebook.com/events/257650911286915/", "description": "Stewardship Workday\nSaturday, October 8\nOakwoods Nature Area\n1 to 4 p.m.\nThis oak-hickory woodland includes a small pond and wetland, which are great spots for bird watching or listening for frog calls. We’ll be cutting and removing invasive shrubs such as buckthorn and honeysuckle to improve the habitat. Please meet at the park entrance off of Dunwoodie Road. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "source": "Facebook", "date": "2016-10-08T13:00:00-04:00", "name": "Stewardship Workday-Oakwoods Nature Area"}, {"url": "https://www.facebook.com/events/313004762411037/", "description": "LSNC is turning 30 this year, and you’re invited to our birthday party! Hike, play, make a birthday card for LSNC, and more with friends and family at this blow-out bash. Visit our raptors and enjoy live animal demonstrations, explore the Critter House, relax by the camp fire, or tie dye your own LSNC shirt. We encourage attendees to wear their LSNC gear and to bring photos or share memories of their favorite LSNC moment on our memory wall!\n\nDon’t worry about dinner plans, instead try out a food truck! Shimmy Shack will be providing vegan and vegetarian options while Hero or Villain will be cooking up awesome sandwiches. Be sure to arrive by 6, to sing “Happy Birthday” and enjoy cupcakes, don’t be late!\n\nWant to buy us a birthday present? Visit www.lesliesnc.org/celebrate30 for ideas and to register!", "source": "Facebook", "date": "2016-10-08T16:00:00-04:00", "name": "LSNC's 30th Birthday Party"}, {"url": "https://www.facebook.com/events/1790543537848554/", "description": "Robert Lopez is the author of two novels, 'Part of the World' and 'Kamby Bolongo Mean River', and two story collections, 'Asunder' and 'Good People'. A new novel, All Back Full, will be published by Dzanc Books in February, 2017. He teaches at Pratt Institute, The New School, and Columbia University.\n\nSamuel Ligon is the author of two novels—'Among the Dead' and 'Dreaming and Safe in Heaven Dead'—and two collections of stories, 'Wonderland', illustrated by Stephen Knezovich, and 'Drift and Swerve'. He edits the journal Willow Springs, teaches at Eastern Washington University, and is Artistic Director of the Port Townsend Writers’ Conference.", "source": "Facebook", "date": "2016-10-08T16:00:00-04:00", "name": "Robert Lopez and Samuel Ligon Discussion & Signing"}, {"url": "https://www.facebook.com/events/1785779555021709/", "description": "Another fall season arrives not only with crisp air and beautiful weather, but also ABC's much anticipated festival, Oktoberfest! The celebration of beers, brats and Leiderhosen. \nWe're once again closing off the street and putting up the beer tents for our annual Oktoberfest street party! Join us at the corner of Main and Washington to enjoy a cool autumn evening under the stars with beer, brats, music, and dancing.\n(Parking available at the 4th and Washington parking structure) \n\n* 5-12 Friday \n* Live music provided by the Immigrant Sons. \nGet ready to Polka!! Friday night will feature the best Oom Pah Pa Band playing Traditional German Oktoberfest Music. The inception of Immigrant Sons is the culmination of all the musical history and heritage of the band members.  Immigrant Son plays a variety of music that makes people want to dance and tap their feet, creating the kind of fun that builds life long memories. \n\n* 5-12 Saturday\n* We're shaking things up for 2016 and are excited to announce that Saturday night's headlining band is our local favorite, Third Coast Kings!\n\nHailing from the Metro Detroit area in southeast Michigan, Third Coast Kings are a deep funk and heavy soul outfit that brings back the era of music one can only find on dusty old 45 records. Right from the beginning in 2007 the band delved into the old, funky catalog of vinyl records that DJ's and beat makers were using to get crowds moving. Over the years they have refined this sound into their own unique blend of the old and the new\n\n* No cover. \n* Must be 21 with valid ID. Children welcome with parents. \n* Brats, veggie brats, chips, pretzels, beer, wine, and soda will be available for purchase. \n* Call Beth at 734-213-1393 for more information. \n\nLeiderhosen optional (but pants required).", "source": "Facebook", "date": "2016-10-08T17:00:00-04:00", "name": "Oktoberfest"}]