[{"source": "Facebook", "date": "2016-05-12T19:00:00-04:00", "url": "https://www.facebook.com/events/1725605471016948/", "description": "Literati is happy to welcome Garrard Conley in support of his memoir, Boy Erased. \n\nBoy Erased is a beautiful, raw and compassionate memoir about identity, love and understanding. The son of a Baptist pastor and deeply embedded in church life in small town Arkansas, as a young man Garrard Conley was terrified and conflicted about his sexuality. When Garrard was a nineteen-year-old college student, he was outed to his parents, and was forced to make a life-changing decision: either agree to attend a church-supported conversion therapy program that promised to “cure” him of homosexuality; or risk losing family, friends, and the God he had prayed to every day of his life. Through an institutionalized Twelve-Step Program heavy on Bible study, he was supposed to emerge heterosexual, ex-gay, cleansed of impure urges and stronger in his faith in God for his brush with sin. Instead, even when faced with a harrowing and brutal journey, Garrard found the strength and understanding to break out in search of his true self and forgiveness. By confronting his buried past and the burden of a life lived in shadow, Garrard traces the complex relationships among family, faith, and community. At times heart-breaking, at times triumphant, this memoir is a testament to love that survives despite all odds.\n\n“Boy Erased is an essential document of the early 21st Century. Conley bears witness to something history will eventually condemn as too horrible to have happened, but he also takes the pain of ‘ex-gay therapy’ and makes of it not just a record but a wonder.”—Alexander Chee, author of The Queen of the Night\n\n“This brave and bracing memoir is an urgent reminder that America remains a place where queer people have to fight for their lives. It’s also a generous portrait of a family in which the myths of prejudice give way before the reality of love. Equal parts sympathy and rage, Boy Erased is a necessary, beautiful book.” —Garth Greenwell, author of What Belongs to You\n\n“Garrard Conley's memoir about the author’s time in the ex-gay movement is actually about surviving an attempt at soul-murder. The author has given us a clear and beautifully written account of what he went through. This is a book that had to be written, and it deserves a wide audience.”—Charles Baxter, author of The Feast of Love\n\n“In 1982, Edmund White broke literary ground with his memoir A Boy’s Own Story. Now it’s Garrard Conley’s turn to bring his own story to readers. Conley is brave and honest in his depiction of growing up gay in conservative Christian America. As White was three decades ago for his generation, Conley is an important and necessary contemporary voice.”—Ann Hood, author of The Knitting Circle and Comfort\n\n“A brave account of a young many coming to terms with his sexuality in an environment that reviles him for it. A triumphant, heart-felt story.” —Julia Scheeres, author of Jesus Land\n\nGarrard Conley’s fiction and nonfiction can be found in The Common, The Madison Review, Spork, and elsewhere. He was a finalist for Narrative Magazine’s Winter 2013 story contest. Conley currently teaches English literature and promotes LGBTQ equality in Sofia, Bulgaria.", "name": "Garrard Conley: Boy Erased"}, {"source": "Facebook", "date": "2016-05-12T19:00:00-04:00", "url": "https://www.facebook.com/events/1593955534251439/", "description": "This month we will host an hour of Open Mic session when area poets can read their own work or share a favorite poem by another author in a welcoming atmosphere.  This is a monthly poetry series held on the second Thursday of most months at 7 pm.\n\nFor the first time, we have a theme - Purple Power - Passion & Peace... More details to come...", "name": "Open Mic & Share Poetry Series"}, {"source": "Facebook", "date": "2016-05-13T15:00:00-04:00", "url": "https://www.facebook.com/events/792788607487695/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe"}, {"source": "Facebook", "date": "2016-05-13T17:00:00-04:00", "url": "https://www.facebook.com/events/227197617636126/", "description": "Join the fun in Downtown Ann Arbor on Friday, May 13th at this Main Street Area Association hosted event!\n\nABC is offering a specials on our Ladies Night cocktail list:\n\nPass that Dutch - Strawberry Blonde & Lemonade.\n\nGet Ur Freak On - Muddled raspberries, blueberries, and mint. Shaken with tequila and sour mix. Served over ice, and topped with ginger beer.\n\nLose Control (BeerRita) - Cuervo, Euchre Pilsner, Simple Syrup, and Fresh lime juice. \n\nSock it to me - Fresh Mint muddled with Bacardi. Topped with hard cider, and Pama Liquor\n\nFrom 5-9pm retailers roll out the red carpet with special offers, discounts, snacks, goody bags, raffles and more! Participate in our ‘passport’ program during this time and be entered into a drawing to win fabulous prizes!\n\nPick up a Ladies Night Passport at any of the participating retailers listed on the MSAA website, and receive a stamp for each one you visit. Collect 15 stamps, turn in your passport at any of the participating shops, and be entered to WIN!\n\nhttp://mainstreetannarbor.org/2016/03/ladies-night-friday-may-13/", "name": "MSAA Ladies Night"}, {"source": "Facebook", "date": "2016-05-13T17:00:00-04:00", "url": "https://www.facebook.com/events/253770371623807/", "description": "Join the fun in Downtown Ann Arbor on Friday, May 13th!\n\nSales will be offered throughout the day, but from 5-9pm the retailers roll out the red carpet with special offers, discounts, snacks, goody bags, raffles and more! Participate in our ‘passport’ program during this time and be entered into a drawing to win fabulous prizes!\n\nPick up a Ladies Night Passport at any of the participating retailers listed below, and receive a stamp for each one you visit. Collect 15 stamps, turn in your passport at any of the participating shops, and be entered to WIN!\n\nFor a complete list of participating retailers and their Ladies Night specials, please visit www.mainstreetannarbor.org", "name": "Ladies Night 2016"}, {"source": "Facebook", "date": "2016-05-13T19:00:00-04:00", "url": "https://www.facebook.com/events/1017328531690686/", "description": "Literati is proud to partner with The Neutral Zone to present an Open Mic Night for writers ages 19 and under! We're excited to continue this relationship with a great nonprofit just down Washington Street from us, and to welcome young writers in a safe and welcoming environment for an Open Mic Night!\n\nMore about The Neutral Zone:\n\nThe mission statement of the center was written by youth and continues to be the voice and heart which drives the center’s creative program and opportunities.\n\nThe mission\nThe Neutral Zone is a diverse, youth-driven teen center dedicated to promoting personal growth through artistic expression, community leadership and the exchange of ideas.\n\nA brief history\nIn 1998, a group of Ann Arbor teens gathered to discuss the need for a place where teens could congregate after school and on weekends. From the very beginning, they felt this place should be more than just a hangout; that is could be a safe place to make new friends, mix with youth from different backgrounds, explore new ideas, learn new skills and do it all in a setting that was teen friendly and teen driven. Teens wrote the mission statement and the first grant proposal to the Ann Arbor Area Community Foundation and, with seed money in hand, enlisted parents and friends to turn an old brick and timber warehouse into a teen center.", "name": "The Neutral Zone Presents: Open Mic Night"}, {"source": "Facebook", "date": "2016-05-13T20:00:00-04:00", "url": "https://www.facebook.com/events/494032960807144/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"MATCH\" starring Matt Pendrige and Mitch Socia \n\nGroup 2: \"Adultery\" starring Aaron Johnstone, Nuverre Naami, Lorin Kozlowski\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Corene Ford, Moni Jones, Maggie O'Reilly, Mitch Socia", "name": "Pointless Improv with MATCH and Adultery"}, {"source": "Facebook", "date": "2016-05-13T20:00:00-04:00", "url": "https://www.facebook.com/events/1637106023218709/", "description": "\"Harmony Bones\" is a quintet of long-time veterans of the Ann Arbor folk music scene. The band consists of Laz Slomovits (of \"Gemini\") Tom Voiles and Linda Teaman (of \"Nutshell\"), Jeanne Mackey, and Eric Fithian. Their sound features rich vocal harmonies on traditional, contemporary and original songs, as well as a huge array of folk instruments — guitar, mandolin, flute, pennywhistle, fiddle, accordion, banjo, banjo ukulele, bass, hand percussion — even sitar and Uilleann Pipes! Their collective name, \" Harmony Bones,\" comes from an acupuncture point that harmonizes imbalances and promotes clear thinking, seeing, and hearing!", "name": "Harmony Bones at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-05-13T21:00:00-04:00", "url": "https://www.facebook.com/events/961752583878622/", "description": "Far House brings you an evening of high energy rock & roll, with a special international touring guest!\n\n\nAn Atomic Whirl (Japan)\nhttp://anatomicwhirl.com/\n\nAn Atomic Whirl mixes chaotic noise, sudden soft melodies and mathy arrangements. They also throw in some doom, jazz, shoegaze and other styles they like. Since 2013, they have toured around Asia and across the US.\n\n\nLocal support by:\n\nSojii (Grand Rapids, MI)\nhttps://sojii.bandcamp.com/\n\nMusical tonic for every dark and ecstatic feeling. Recent import from Brooklyn, NY. \n\n\nRed Robe (Ann Arbor, MI)\nhttps://redrobe.bandcamp.com/\n\nRed Robe is a rock band for the modern age, for the 2000-teens. Birthed in August of 2013, this Ann Arbor area trio coalesced with common influences in Nirvana, Can, Shellac, & The Jesus Lizard. Later, a deep commonality arose in wry humor, record collecting, & true cake-eating sound craft. Psychedelic, crystalline guitars. Buoyant, charred bass. Driving, powerful drums. Bittersweet. Joyous. \n\n\nSuper Thing (Ypsilanti, MI)\nhttps://soundcloud.com/superthing-1\n\nEveryone's favorite post-doom golden boys.\n\n\n$5 suggested donation for our out-of-town friends.\n\nDoors at 9, with music starting at 10.\nSHOW UP ON TIME!\n\nRespect the house and the artists.\nThis is a music event, not a house party.\nEngage and participate.", "name": "An Atomic Whirl (JAPAN) w/ Sojii, Red Robe & Super Thing"}, {"source": "Facebook", "date": "2016-05-13T21:30:00-04:00", "url": "https://www.facebook.com/events/273137836352132/", "description": "Friday, May 13th | 9:30pm | 21+ | $5 Adv. / $8 Door\n\nTHE VILLAGE TALES\n----------------------\nHosted by DAG\n----------------------\nfeaturing Obie Iyoha, Marcel Ke' Von, Tru Klassick, Evan Haywood\n----------------------\nwsg: Nolan The Ninja, Richy Marciano\n----------------------\ndj sets by: Skeezus, Cataclysmic, Megablown, Lord Gulley", "name": "The Village Tales at Club Above - Ann Arbor"}]