[{"date": "2016-08-04T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1572682933024198/", "description": "Joshua Davis's amazing talent led him on a journey that landed him as a finalist on the most recent series of NBC’s The Voice.   Michigan’s Joshua Davis was raised in the folk tradition: the music, the social movements, the land.   He writes songs that blend the roots of American music with gritty rock n' roll and vintage soul.   For over 15 years Joshua has made his living sharing his songs, stories and knowledge across the US and Canada at festivals, concert halls, coffeehouses and dives - as a solo act, front man for roots ensemble \"Steppin' In It\", classic swing band \"Shout Sister Shout\", songwriter showcase band \"The Starlight Six\" and frequently as a workshop facilitator, presenter or instructor. \nhttp://www.joshuadavismusic.com \n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Joshua Davis / August 4th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE"}, {"date": "2016-08-04T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1099742733428684/", "description": "Get your geek on! Board games, card games, everything is in play- we'll have a selection of old standbys and new favorites, or you can feel free to bring your own. Bonus- Short's Brewing Company will be doing a tap takeover, and pints are just 2 for $3. Beer+Games=Good Times", "name": "Short's Brewing Tap Takeover & Game Night"}, {"date": "2016-08-04T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/489036271292453/", "description": "The Electronic Creatives Tour\nThursday - August 4, 2016 @ Club Above \n_________________________________\n_________________________________\n\nPRE-SHOW SCHEDULE\n\n6:00pm Production workshop w/ Frequent\n7:00-8:30pm Discussion panel with the whole gang\n_________________________________\n\nLINE UP:\n\n9:00pm - Sacral Crown (MI, MindFlip Records)\nhttps://soundcloud.com/sacral-crown\n\n9:45pm - Hajimari (IN, Harrow Recordings)\nhttps://soundcloud.com/iamhajimari\n\n10:30pm - Keota (NYC, Drastic) \nhttps://soundcloud.com/keota-us\n\n11:15pm - Frequent (CO, Upscale Records)\nhttps://soundcloud.com/frequentaudio\n\n12:00am - Refraq (UK, Drastic/Soda Island) \nhttps://soundcloud.com/refraq-music\n\n1:00am - Tekvision (FINLAND, Drastic)\nhttps://soundcloud.com/tekvisionmusic\n_________________________________\n\nTICKET LINK: drasticannarbor.splashthat.com\n$7 | 18+\n\nPARTNERS: \nIRL Music & MindFlip Records & Purpose Presents (Robby Lingham & Kelsey Hatley)", "name": "The Electronic Creatives Tour at Club Above"}, {"date": "2016-08-04T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/536543129884608/", "description": "***Please note that this event will be held on our main floor. Browsing will be limited starting at 6:15 to allow for event setup.***\n\nLiterati is pleased to welcome Madeline Diehl and Jennifer Metsker in support of the anthology Show Me All Your Scars: True Stories of Living with Mental Illness. \n\nAbout the book:\n\nEvery year, one in four American adults suffers from a diagnosable mental health disorder. In these true stories, writers and their loved ones struggle as their worlds are upended. What do you do when your father kills himself, or your mother is committed to a psych ward, or your daughter starts hearing voices telling her to harm herselfor when you yourself hear such voices? Addressing bipolar disorder, OCD, trichillomania, self-harm, PTSD, and other diagnoses, these stories depict the difficulties and sorrows--and sometimes, too, the unexpected and surprising rewards--of living with mental illness.\n\nAbout the speakers:\n\nJennifer Metsker lives in Ann Arbor, Michigan where she is the Writing Coordinator at the Stamps School of Art and Design. Her poetry, which often addresses issues related to mental illness, has appeared or is forthcoming in many journals including The Cincinnati Review, Cimarron Review, Gulf Coast, The Seattle Review, Whiskey Island, Rhino, Cream City Review, and Birdfeast. She has written art reviews for Arthopper and Carbon Culture and recently was awarded the Third Coast Audio Shortdoc Prize for an audio piece that she created with artist Stephanie Rowden. \n\nMadeline Strong Diehl has worked as a magazine journalist, editor, and grant writer for almost 30 years. She has won the T.S. Eliot poetry prize from the University of Kent at Canterbury and published a book of poetry, Wrestling with Angels (2013). Her comedies have been produced Off-Broadway and around the Midwest, and she has published dozens of humorous essays, believe it or not.", "name": "Madeline Diehl & Jennifer Metsker"}, {"date": "2016-08-04T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/212274295832362/", "description": "Kuebler Langford Nature Area is a 31-acre park tucked into a sharp curve of Huron River Drive. Part of the park is old field, and contains native dry prairie species. A deep ravine bisects the park, and moist woods cover its slopes. The park connects to Bird Hills Nature Area.\nThis nature walk is a collaboration between the AADL and Natural Area Preservation and is one of a series that take place each month throughout the summer and fall. For this one, we will meet in the parking lot on the western shoulder of Huron River Drive. Wear comfortable clothes and bring water and bug spray if desired. Some of the AADL science tools will be available for use during the walk, too!", "name": "Nature Walk with Ann Arbor District Library"}, {"date": "2016-08-04T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1089237557812945/", "description": "Set in present day Brooklyn and Manhattan - with historic monuments and institutions as background characters - The Linotype Operator is the story of Orthodox Jewish former Linotype operator David Kaplan and his two daughters. Sprinkled with wry humor, and including a cast of  unusual supporting characters, The Linotype Operator gives the reader a deeply poignant look into parallel New York worlds and lives. \n\nMichael Robert Wolf is an author and filmmaker currently living in Cincinnati.\n\nSigning to follow.\n\n“...this unassuming story of a devout Brooklyn Jew and his not-so-wayward daughter enchanted me.. When I finished it, I wanted to read it all over again.” – Jacquelyn Mitchard", "name": "The Linotype Operator with Michael Robert Wolf"}, {"date": "2016-08-04T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1597811077198277/", "description": "At the Kerrytown Concert House this summer: Oscar Wilde’s The Importance of Being Earnest, directed by James Ingagiola.  Unbeknownst to his friends and acquaintances, John Worthing leads a double life:  He is Jack, a respectable landowner, in the country and Ernest in the city.  But when the love of his life, the elegant Gwendolyn Fairfax, insists that her dream is to marry a man named Ernest, John must abandon his dual identity–which may prove harder than it seems…especially when his friend Algernon visits John’s country estate pretending to be Ernest!  This “Trivial Comedy for Serious People” is truly one of the wittiest, funniest plays in the English language.  \n\nThe show will run August 4-6, with 8 p.m. start times on Thursday, Friday and Saturday, PLUS a 2 p.m. matinee on Saturday (there is no show on Sunday).\n\nThe cast will feature Amanda Barnett, Ethan Gibney, Elizaveta McFall, Amanda Photenhauer, Jan Romans, Annaliese Romans, Elizabeth Wagner, and Catherine Zudak.\n\nTickets are $15 for adults/$5 for students.  Visit http://www.kerrytownconcerthouse.com/index.php/events/event/BTE_earnest_thu/, call 734-769-2999 or email reservations@kerrytown.com for tickets.", "name": "The Importance of Being Earnest"}, {"date": "2016-08-05T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1871445973082972/", "description": "Coming Friday, August 5\n\nPOP-IN: Intermitten Edition [intermitten.org]\nWorks that showcase the intersection of Art and Tech\n\nFREE ADMISSION\n6:00PM – 9:00PM \n\nJoin us for POP-IN: one night only pop-up expressions of creativity by local artists that will immerse you in unusual, accessible experiences.\n\nCurated by and in partnership with the Intermitten conference, where influential leaders reveal how harnessing creativity transforms industries\n\nMusic Performances by:\n\nShigeto\nCharles Trees\nwith virtual reality experience provided by ICON Interactive\nFeaturing:\nCreative learning environment with a “hacked piano” by Sam Pierce Lolla\nSound installation booth by Anna Nuxoll\nThe artwork of Jeremy Wheeler\nLive screen dance by Sean Hoskins\nDrop-in origami making and origami exhibition by Beth Johnson\n\nand more!", "name": "Pop in Intermitten Edition"}, {"date": "2016-08-05T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1312355338789742/", "description": "For the second year running, Literati is pleased to help celebrate MGoBlog's Hail To The Victors--an indepedent, definitive, in-depth guide to the upcoming Michigan Football Season--with an event in its honor. The evening will again feature a presentation from the issue's contents, and additional copies will be available for sale. This year's event will take place at Circus Bar & Billiards. Purchase a drink from their full bar, grab a bowl of free popcorn, revel in the football previewing. Free and open to the public. 7pm.\n\nFeatured in Hail To The Victors 2016: \n\nMGoBlog's Brian Cook writes a team preview covering about a third of the book, offers an opinion on the overall state of the offense, defense, and special teams, and then plunks down a prediction that will no longer be roundly mocked because Michigan's coaching staff is no good. Probably.\nAce Anbender surveys the opposition with savage intent. Buckeye Grove's Ross Fulton rounds out the Ohio State preview; Ross's in-depth knowledge of the Buckeyes and surprising sanity are an excellent combination.\nAdam Schnepp sits down with tight end Jake Butt and discusses Harbaugh, the NFL, his decision to avoid it, and many other topics. Michael Elkon on expectations in year two of Harbaugh.\nSBNation's Ian Boyd on John O'Korn and how he fits into Harbaugh's passing game. Steve Sharik on Don Brown's dudes and what he plans to accomplish with them.\nSeth Fisher and Mel Newman on when Texas A&M tried to buy Bo... and failed. John Kryk on The Guarantee, 30 years later. Steve Sapardanis on the Six Penny Defense, or when Bo invented the dime package. Craig Ross on how Michigan more or less invented all of football, from the forward pass to platoons.", "name": "MGoBlog's Hail to the Victors 2016 at Circus Bar"}, {"date": "2016-08-05T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/503218819864337/", "description": "Join us on Friday, Saturday & Sunday, August 5-7 for OUTFest 2016!  OUTFest is free and open to the public. \n\n~~ Friday, August 5, 2016 ~~\n\nMovie Night: Rent in Braun Court: 8:00 PM\nNecto Pride Night at Necto: 9:00 PM - 2:00 AM\n\n~~ Saturday, August 6, 2016 ~~\n\nFestival Booths & Exhibits at Kerrytown N. 4th Ave.: 10:00 AM-8:00 PM\n\nJim Toy Community Center Open House: 10:00 AM-5:00 PM\n\nDJ Selina Style at N. 4th Ave. Stage: 10:00 AM-Noon\n\nRedi and the Midnight Hour Perform at N. 4th Ave. Stage: Noon-2:00 PM\n\nKid Zone in Braun Court at Braun Court Parking Lot: Noon-6:00 PM\n\nElemental Meaning Performs at N. 4th Ave. Stage: 2:00-3:00 PM\n\nDrag Revue at Kerrytown N. 4th Ave. Stage: 3:00-4:30 PM\n\nBeer & Wine Garden at Braun Court Parking Lot: 4:00 PM-Midnight\n\nSilent Auction at Beer & Wine Garden: 4:00-7:00 PM\n\nCivil Rights & Equal Protection Talk at The Bar at 327 Braun Ct: 4:00-5:00 PM\n\nAlise King Performs at Kerrytown N. 4th Ave. Stage: 4:30-5:30 PM\n\nPoetry Slam w/ Jason B. Crawford at The Bar at 327 Braun Ct: 5:00-6:00 PM\n\nOut Loud Chorus Performs at N. 4th Ave. Stage: 5:30-6:30 PM\n\nBoard Game Night at Brillig Dry Bar/Mighty Good (N. Main): 6:00-10:00 PM\n\nBurlesque Show with Queens of Cups at Kerrytown N. 4th Ave. Stage: 6:00-7:00 PM\n\nSam Tolson Performs at Kerrytown N. 4th Ave. Stage: 7:00-8:00 PM\n\nOUTFest Drag Revue w/ Jadein Black & Sabin at N. 4th Ave. Stage: 8:00-9:00 PM\n\nNecto Pride Dance Party with DJ Jace at N. 4th Ave. Stage: 9:00 PM-Midnight\n\nOUTFest After Party at Circus Bar: Midnight-2:00 AM\n\n~~ Sunday, August 7, 2016 ~~\n\nWashtenaw County Pride Picnic at Wheeler Park: Noon-4:00 PM\n\n\nFor a complete and evolving schedule of events, visit www.a2outfest.com\n\nPresenting Sponsors:\nComcast Michigan\nBetween The Lines Newspaper\nWolverine State Brewing Co.\nBarefoot Wine & Bubbly\nNecto Pride\n\nSponsors:\nMANI Osteria & Bar & Isalita\nDomino's Pizza\nComerica Bank\nCare One, Inc.\nVisit Ann Arbor! & Ypsi Real\nOut Post\nBill's Beer Garden\nTrillium Real Estate\nBlue Cross Blue Shield of Michigan\nbank of ann arbor\nPNC\nDuo Security\nAut Bar & Common Language Bookstore\nUNIFIED - HIV Health and Beyond\nAmerican Red Cross, Southeastern Michigan Region\nUniversity of Michigan Spectrum Center\nCorner Health Center\nWoodland Mews\n327 Braun Court\nThe Wurst Bar\nMighty Good Coffee\nBrillig Dry Bar\nWilson P. Tanner III, PLC\nCircus Bar and Billiards Ann Arbor\nColor Pet Productions\n\nFriend of Jim Toy:\n Zingerman’s, Queer Young Professionals, Plum Market\n\nHonorary Chairs:\nJim Toy, Sheriff Jerry Clayton, State Representative Adam Zemke, State Representative Kristy Pagan, Commissioner Felicia Brabec,  Commissioner Andy LaBarre, Commissioner Yousef Rabhi, City Council member Anne Brown, Leigh Greden, Jason Frenzel, Cynthia Dunitz, Jim Simpson, Jeremy Merklinger, Heather Wold-Gallagher, Jennie Hale, Mary Larkin, Christine Kitora, Meg Wyzlic, Renee & John Greden\n\nOur Mission: We envision an inclusive community where people of diverse sexual orientation and gender identity are visible and live together in equality, respect and happiness.", "name": "OUTFest & Pride Picnic 2016"}]