[{"description": "John Freeman was the editor of Granta until 2013. His books include How to Read a Novelist and Tales of Two Cities: the Best and Worst of Times in Today’s New York. He is an executive editor at the Literary Hub and teaches at the New School. His work has appeared in the New Yorker, the New York Times, and the Paris Review.\n\nValeria Luiselli was born Mexico City in 1983 and grew up in South Africa. A novelist (Faces in the Crowd) and essayist (Sidewalks), her work has been translated into many languages and has appeared in publications including the New York Times, the New Yorker, Granta, and McSweeney’s. In 2014, Faces in the Crowd was the recipient of the Los Angeles Times Art Seidenbaum Award for First Fiction and the National Book Foundation’s 5 Under 35 award. Her latest novel, The Story of My Teeth, is available through Coffee House Press.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please visit the LSA's Zell Visiting Writer Series website.", "name": "Zell Visiting Writers Series: John Freeman and Valeria Luiselli", "source": "Facebook", "date": "2016-09-15T17:30:00-04:00", "url": "https://www.facebook.com/events/955485917930514/"}, {"description": "NNA2 edition #38 is proud to present sex smarts, bonkers borders, and a Mario Kart 64 master this month for your learning-while-drinking pleasure. Master of Public Health and owner of the S3 Safe Sex Store Beth Karmeisool presents a pop quiz on sexual health - AND THERE WILL BE PRIZES. Geography buff Alex Stefanov outlines outrageous examples of where (and why) countries draw their lines, and speed-running world record holder Jonathan Serwatowski levels with us on how playing video games as fast as possible can make the world a better place. Bring your brain, your buddy, and your beer money, and join us for a great night of nerd-dom.\n\nWhen: Thursday, September 15, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: Free, thanks to your friendly neighborhood AADL!\n\n\"S3 Safe Sex Store Trivia and Talk\"\nBeth Karmeisool\nPop quiz, hot shot! Bring your sexual health A game and we’ll see what you really know about sex. Be the first to answer correctly and win a sexy prize.\n\nAbout Beth: Beth is the founder of S3 Safe Sex Store and has a Master’s of Public Health specializing in sexual health awareness and prevention of STDs and unintended pregnancies. She has been educating about and promoting sexual health to normalize sex for over 20 years.\n\n\"Bonkers Borders: Crazy Ex(clav)es, Drunken Surveyors, and Uzbeki Seas\"\nAlex Stefanov\nBorders are all around us, literally! These days, too many people struggle to place Poland on a map and even have trouble identifying West Virginia. If we paid more attention to our geopolitical frontiers, we'd find not only fascinating shapes but also rich histories behind them! Was moonshine consumption involved in delineating the Carolinas? Could poker have been a driving factor in demarcating India? Is there still unclaimed land out in the world? Let's explore these and other intriguing cases of bonkers borders!\n\nAbout Alex: Alex is a Michigan alum from New York and Bulgaria who loves the borders of all three. He looks to be a neuroscientist by day and a geography hobbyist by night, a sort of \"Doctor With Borders\".\n\n“The Insanity of Speed Running\"\nJonathan Serwatowski\nWe’ll run down the basics of speed running terminology, frame count, how to select a game to speed run, go in-depth on Mario Kart 64, hand exercises for longevity, and a few funny speed run reaction videos. There’s also more to speed running than meets the eye, so we’ll also discuss  the charity work opportunities the pastime presents.\n\nAbout Jonathan: I am a recent graduate with a B.A in History from Grand Valley State University. I am a speed runner with 3 years of speed running experience. I primarily run Unreal Tournament, Mario Kart 64 and Star Wars Empire at War. I am the current world record holder in Star Wars Empire at War in the Category of Zan Consortium Campaign Easy. I am 17th in the world in Mario Kart 64 Any% No skips and a former record holder of Mario Kart 64 100%. I also have the 4th best time in Unreal Tournament 1999 deathmatch%. Outside of gaming my interests include current world events, heavy music, gardening, fishing and tennis. Follow me on Twitter @serwatoj.", "name": "Nerd Nite A2 #38: Sex, Lines & Video Games", "source": "Facebook", "date": "2016-09-15T18:30:00-04:00", "url": "https://www.facebook.com/events/1593360947626451/"}, {"description": "Literati Bookstore is thrilled to welcome 2000 & 2016 Olympic gold medalist Anthony Ervin and author Constantine Markides to discuss Ervin's memoir, Chasing Water.  \n\nChasing Water tells the dramatic, surprising, and sometimes provocative path that Anthony Ervin has taken to become one of those captivating Olympic heroes. Not your typical sports memoir, Chasing Water also contains arresting black-and-white drawings and a graphic story extra, as well as an inventive and mercurial narrative style that morphs chapter by chapter to reflect Ervin’s restless, multifaceted life. Ervin won a gold medal at the 2000 Sydney Olympic Games at the age of nineteen. He is an athlete branded with a slew of titles including being the first US Olympic swimmer of African American descent, along with Jewish heritage, who also grew up with Tourette’s syndrome. He shocked the sporting world by retiring soon after claiming two world titles following the 2000 Olympics. Auctioning off his gold medal for charity, he set off on a part spiritual quest, part self-destructive bender that involved Zen temples, fast motorcycles, tattoo parlors, and rock ’n’ roll bands. Then Ervin resurfaced in 2012 to not only make the US Olympic team twelve years after his first appearance, but to continue his career by swimming faster than ever before, and faster than anyone else. \n\n\"Here Ervin and swim trainer and journalist Markides combine talents to create a biography that is part first-hand narrative by Ervin, with Markides filling in the details and providing context. The formula works, pulling readers into Ervin's experience of the thrill of victory and search for meaning....Featuring more depth, breadth, truth, and the effects of reckless choices than found in traditional athlete biographies, this gripping account is just in time for the gear up to the Rio 2016 Olympics. Readers will understand the psyche and life of elite athletes as never before, then cheer Ervin on in his attempt to make another Olympic team.\"--Library Journal\n\n\"A celebrated Olympian recounts how he rose to the top of his sport, crashed, and found redemption....This book, which tells his story through a narrative that interweaves the former gold medalist's memories with commentary by his friend and colleague Markides, reveals the extreme highs and lows that characterized Ervin's remarkable life and career....The author never flinches at revealing his less-than-perfect past, and the humility he demonstrates at coming to terms with his own egotism and personal shortcomings makes the book frequently compelling. A provocative and refreshingly honest redemption memoir.\"--Kirkus Reviews\n\n\"Markides smartly combines his own journalistic account with a parallel narrative in which Ervin...explains his life and style. Some talents simply defy explanation, however, and Ervin may be in that category....The story of his comeback at 31 (ancient for a swimmer) is rendered more amazing by the contrast with what went before.\"--Booklist \n\n\"Most memoirs from Olympians are puff pieces, ghost-written so blandly you fall asleep trying to make it to the end of the first chapter. Chasing Water is the opposite of that, an intimate, visceral experience you will appreciate.\"--SwimSwam \n\n\"A refreshingly unexpected athlete biography void of eye-rolling, cliched, self help propaganda bullshit.\"--Gary Hall, Jr., swimmer, ten-time Olympic medalist", "name": "Anthony Ervin & Constantine Markides", "source": "Facebook", "date": "2016-09-15T19:00:00-04:00", "url": "https://www.facebook.com/events/1635855363397658/"}, {"description": "Thursday, September 15 | 9pm | 18+ | $15 Cover\n\nGold Panda wsg: Open Mike Eagle\n\nThe story of Gold Panda’s journey from an acclaimed debut record to now, as he prepares to release his third full length album, is an entirely circular one. Hailing from Chelmsford Essex in the UK, in the six years since the release of his genre-defining debut album ‘Lucky Shiner’, the electronic artist most comfortable with the moniker Derwin Panda spent the subsequent years splitting the majority of his time between London, Berlin and countless excursions to Japan. As he created his third album ‘’Good Luck And Do Your Best’ he ultimately found himself back where he began, in the East of England.\n\nOrigin stories can be fundamentally boring by nature, packed with non-essential details and overly stressed homilies to roots and influences. But the core nature of an artist that has produced some of the most beloved and emotionally-infused electronic music of this decade is deeply rooted in the constant desire to return to where his musical world began.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/710", "name": "Gold Panda w/ Open Mike Eagle 9/15/16 at Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-09-15T21:00:00-04:00", "url": "https://www.facebook.com/events/1186311131413949/"}, {"description": "Michigan Electronic Dance Music Association (MEDMA) & Necto present..\n\nDue to illness Stefano Noferini had to cancel his show for this Thursday. No worries! Dirty Birds own Ardalan is here to save the day!\n\nARDALAN\n\nwith opening sets by MEDMA\nMain Floor & Patio\n\nAbout Ardalan:\nRange, appeal and a massive dose of nasty, gritty bass are the three chief weapons every Dirtybird artist has in his quiver, but Ardalan seems to be the peak culmination of all those assets in one wieldy point. This young archer has had the incomprehensible luck to fall into crew with his idols, be reared by their best and given some of their most guarded musical secrets, then hoisted to a platform to blare his prodigious beats from places where most creators can only dream of being.\nBorn in Tehran, Iran, Ardalan possesses a peculiar, fresh perspective on music genesis without even trying. His mixes, remixes and dubs are known for their sass, energy and wickedly wry samples that snap like a wet towel to the face, but his original records are where his efforts shine, like those released with Justin Martin —“Mr. Spock,” a 2010 party anthem charted by Diplo and Jesse Rose, “LEZGO,” charted by Dog Blood (Skrillex and Boyz Noise) and “Function”, the 2015 banger that keeps giving — as well as two of his own EP’s that were released on Dirtybird, “The Yeah / No” and “Thunderdad”. It is no wonder he has been given the nod by everyone, from Papa Dirtybird himself (Claude VonStroke) and A-Trak, to those who are charting his remixes, like Maya Jane Coles, Audiojack, and Riva Starr.\nThe greatest strength in Ardy’s music is his ability to whip out hits that work equally well from the dankest basements to the most opulent dance-floors; sounds that satisfy those with diverse tastes who can unite under his single agenda of having a good time.\n\nAbout MEDMA:\nMEDMA is a student group of music fans, musicians, producers, and DJs focused on spreading the awareness and appreciation of electronic music on campus as well as in Ann Arbor. They host and attend events all around Ann Arbor, on the University of Michigan campus, and Detroit. MEDMA also sponsors DJ tutorials and music mastering workshops throughout the school year. For more information on joining, email medma-board@umich.edu.\n\nThursday September 15, 2016\nDoors open at 9pm • 18 & over are welcome with proper ID\n\nTickets on sale now\nwww.eventbrite.com\n\nFor VIP services: info@thenecto.com\n\nNecto: 516 E Liberty • Ann Arbor, MI 48104\n734.994.5436 • www.necto.com", "name": "Ardalan x medma (Stefano Noferini canceled)", "source": "Facebook", "date": "2016-09-15T21:00:00-04:00", "url": "https://www.facebook.com/events/527579917366775/"}, {"description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "name": "Sweetwaters Westgate Grand Opening!", "source": "Facebook", "date": "2016-09-16T09:00:00-04:00", "url": "https://www.facebook.com/events/1090878344334512/"}, {"description": "One MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.\nThis week's reading features Austin Blaze (introduced by Bryce Pope) and Marlin Jenkins (introduced by Danez Smith)\nAustin Blaze is a writer from Northern California. His fiction was once described as \"humor infused with sadness,\" which is pretty much what he's going for.\nMarlin M. Jenkins was born and raised in Detroit, where he recently taught poetry to middle-schoolers through the Inside Out program. His poems have recently found homes in The Collagist, The Journal, and Word Riot.", "name": "Mark Webster Reading Series", "source": "Facebook", "date": "2016-09-16T19:00:00-04:00", "url": "https://www.facebook.com/events/928734097252368/"}, {"description": "Literati is pleased to welcome Dr. Jeffrey Kutcher and journalist Joanne Gerstner for a discussion of Back in the Game: Why Concussion Doesn't Have to End Your Athletic Career.\n\nBack in the Game, co-authored by pioneering sports neurologist Jeffrey S. Kutcher and award-winning sports journalist Joanne C. Gerstner, is the definitive guide to sports and concussion for youth parents, coaches and athletes. The topic of concussion in youth sports was relatively unheard of 10 years ago. Today, concerned parents are considering removing their children from participation in contact sports such as football or soccer. Back in the Game is a real-world based discussion of concussion and youth sports, with Dr. Kutcher’s clinical expertise blended with Gerstner’s reporting. World Cup and Olympic champion Kate Markgraf, X Games superstar Ellery Hollingsworth, former NFL quarterback Eric Hipple and an array of today’s youth coaches, parents and athletes honestly discuss concussion.\n\nJeffrey S. Kutcher MD is an internationally recognized sports neurologist and pioneering physician researcher. He is a graduate of the Tulane University School of Medicine and the University of Michigan Neurology Residency program. He founded the American Academy of Neurology’s Sports Neurology Section and was the neurologist for Team USA at the Sochi 2014 Winter Olympics. Kutcher is the national division chief of The Sports Neurology Clinic at The CORE Institute.\n\nJoanne C. Gerstner is an award-winning multimedia sports journalist, who focuses on sports and medicine. Her work has appeared on ESPN.com, in the The New York Times, USA Today, Detroit News, and other publications. She is a graduate of the Medill School at Northwestern University, a 2012 University of Michigan Knight-Wallace Fellow, and 2015 Jacobs Foundation Neuroscience Fellow. Gerstner is a professor of sports journalism in the School of Journalism at Michigan State University.", "name": "Dr. Jeffrey Kutcher & Joanne C. Gerstner", "source": "Facebook", "date": "2016-09-16T19:00:00-04:00", "url": "https://www.facebook.com/events/292667507761004/"}, {"description": "Join us for a special University of Michigan trivia night- our questions will be maize and blue focused, so come see if you know it all for the chance to win $25!", "name": "Trivia Night- U of M edition", "source": "Facebook", "date": "2016-09-16T19:00:00-04:00", "url": "https://www.facebook.com/events/1144263282300140/"}, {"description": "Together with the Detroit Chamber Winds & Strings, KCH highlights the contribution of women to the world of chamber music, featuring works by pioneering female composers Clara Schumann (Piano Trio), Fanny Mendelssohn (Selected \"Songs without Words\"), Augusta Read Thomas (Four Etudes), and Ellen Taaffe Zwilich (Concerto for Trumpet and Five Instruments). Kristin Kuster’s “Jelly Fish” will be performed by new DCWS member Tim McAllister.\n\nMusicians will include: Kimberly Kaloyanides Kennedy, violin;\n Úna O'Riordan, cello; Stephen Molina, bass; David Buck, flute; Shannon Orme, bass clarinet; Timothy McAllister, saxophone; David Ammer, trumpet; Gwen Thrasher Dease, percussion; Zhihua Tang, piano; Liz Ames, piano; and Courtney Snyder, conductor.\n\nThis performance is presented in partnership with the Detroit Chamber Winds & Strings, and is a part of the KCH Does Detroit series, made possible through the generous support of the Community Foundation for Southeast Michigan.\n\nTickets:\n$30 Assigned Seats in Rows 1-2\n$20 Assigned Seats in Rows 3-5\n$15 General Admission\n$5 Student General Admission", "name": "Mothers of Melody, in partnership with DCWS", "source": "Facebook", "date": "2016-09-16T20:00:00-04:00", "url": "https://www.facebook.com/events/1064879823587990/"}]