[{"date": "2016-04-07T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/350155628441442/", "description": "There is no reason needed to revel the greatness that is beer, but National Beer Day is definitely a day to cheers a pint with friends!\n \nHistorically in 1933, April 7 brought back beer with an alcoholic strength of 3.2%. National Prohibition was officially repealed when the 21st Amendment to the Constitution was ratified months later on December 5, but in the meantime April 7 opened the door for the American craft beer revolution to take hold and grow to what it is today\n\nWe are celebrating this fine day in history by offering draft specials all day long. Every two hours we will rotate a featured ABC draft on special from open to close! \n\nStay tuned for the featured beer list...", "name": "National Beer Day"}, {"date": "2016-04-07T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/857480274361121/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "name": "Fresh + Fit!"}, {"date": "2016-04-07T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/634535350033463/", "description": "The Argus Museum and Washtenaw County Historical Society are excited to host a photography exhibition of work by Ann Arbor-based French photographer, Marc-Gregor Campredon. Admission is free.\nThe exhibition, simply entitled, “Downtown”, will showcase digital and analog (film-based) images from Ann Arbor. Campredon, who is a graduate of the Paris College of Art, has traveled the world capturing stories and culture revealing the beauty and dignity of people and places.  \n\nThe Argus Museum is located on the second floor of the Argus I Building, 525 West William Street in Ann Arbor. The show will be available for viewing, M-F, 9-5 through May 13th.    For more information contact Cheryl Chidester at cchidester@onealconstruction.com or 734-769-0770.", "name": "Downtown: A Photographic Exposition by Marc-Grégor Campredon"}, {"date": "2016-04-07T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/645879305571374/", "description": "The creative writing subconcentration in the English Department at the University of Michigan selects no more than 14 seniors each year to work with faculty and complete a creative thesis of poetry or fiction. These collections, the same size as many MFA theses, are first attempts to create book length manuscripts, and to prepare the writers for the work in the future. On April 7 hear 4 of this year's group -- poets Stephanie Choi and Meg Rattanni and fiction writers Alex Bernard and Moe Kolton -- read from their work.", "name": "University of Michigan's Creative Writing Graduates"}, {"date": "2016-04-07T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1736743313279010/", "description": "We're changing things around a bit this year.  Our first chapter meeting of the year will be held at Wolverine Brewing at 7:00 p.m on Thursday, April 7th in the Gulo Room.  The address for Wolverine Brewing is: 2019 W Stadium Blvd, Ann Arbor, MI 48103. Location for future meetings are up in the air but we wanted to patronize Wolverine a bit more because of the incredible support they've given us the last couple of years.  We also want to be sensitive to some of the concerns we've heard about the location of the meeting in the past.  Wolverine gives us a slightly more centralized location to our geographically diverse membership and is very close to the highway.  \n\nAt this meeting we'll be discussing the status of and plans for Waterloo, of course.  We'll also give updates on new events (Brecfest, the Tri Chapter Challenge and Youth Riding Day) as well as talk about the 2016 schedule for all of our traditional events.  If you attend you'll be able to hear the latest about the new IMBA Associate Regional Director for Michigan and how this person will be focusing on advocacy for mountain biking across the state.  And, as usual, we'll give a quick overview of the status of the trails, talk about scheduled trail days and other plans for maintenance this year.\n\nHope to see you there!\n\nThe Poto Chapter Board", "name": "Poto Chapter Meeting"}, {"date": "2016-04-07T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/970118143072822/", "description": "Bryan Burrough is a special correspondent at Vanity Fair magazine and the author of six books, including the No. 1 New York Times Best-Seller Barbarians at the Gate and his latest, Days of Rage. He is also a three-time winner of the prestigious Gerald Loeb Award for Excellence in Financial Journalism.\nBorn in 1961, Bryan was raised in Temple, Texas, and graduated from the University of Missouri School of Journalism in 1983. From 1983 to 1992 he was a reporter for The Wall Street Journal, where he reported from Dallas, Houston, Pittsburgh and, during the late 1980s, covered the busy mergers and acquisitions beat in New York. He has written for Vanity Fair since 1992.\nIn 1990 Bryan and John Helyar co-authored Barbarians, the story of the fight for control of RJR Nabisco. The book, which spent 39 weeks on the New York Times bestseller list, has been hailed as one of the most influential business narratives of all time. Bryan joined Vanity Fair in 1992, where he has reported from locales as diverse as Hollywood, Nepal, Moscow, Tokyo and Jerusalem.\n\nFrom the bestselling author of Public Enemies and The Big Rich, an explosive account of the decade-long battle between the FBI and the homegrown revolutionary terrorists of the 1970s\nThe Weathermen. The Symbionese Liberation Army. The FALN. The Black Liberation Army. The names seem quaint now, when not forgotten altogether. But there was a stretch of time in America, roughly between 1968 and 1975, when there was on average more than one significant terrorist act in this country every week, and the FBI combated these groups and others as nodes in a single revolutionary underground, dedicated to the violent overthrow of the American government.\n\nBenefiting from the extraordinary number of people from the underground and the FBI who speak about their experiences for the first time, Days of Rage is filled with important revelations and fresh details about the major revolutionaries and their connections and about the FBI and its desperate efforts to make the bombings stop. The result is mesmerizing and completely new—a book that takes us into the hearts and minds of homegrown terrorists and federal agents alike and weaves their stories into a spellbinding secret history of the 1970s.", "name": "Meet Author & Journalist Bryan Burrough for a Discussion of 'Days of Rage'"}, {"date": "2016-04-08T12:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1690979864475279/", "description": "Can't Make it to the city to celebrate Opening Day?\n\nJoin us on the patio at babo to cheer in the season! \n\nBringing the ballpark to you!\nWe'll be broadcasting the game live on the patio, grilling up game day favorites (See Menu below), and quenching your thirst all day long with happy hour pricing on beer, wine, and sangria.\n\nDon't be left in the outfield! \nMake Opening Day a home run for you and all your friends.\n\nNo Tickets Needed!\n\nGAMEDAY MENU\n\n$12.50\nEnjoy one item from the grill, unlimited toppings, and 2 sides! \n\nFROM THE GRILL\n\nBabo Burgers on brioche\nBlack bean Burgers (V) on brioche\n\nAll Beef Hotdogs \nItalian Sausage\n\nCONDIMENTS\n\nNew York white cheddar, Swiss cheese, caramelized onions, roasted mushrooms, roasted poblano peppers, lettuce, tomatoes, house pickles, dijon mustard, whole grain mustard, garlic aioli, basil ketchup, house pickle relish or chipotle aioli.\n\nCHOICE OF 2 SIDES\n\nPear and Kale Salad\nParsnip Slaw\nGerman Potato Salad\nAvocado Slaw\nMacaroni and Cheese", "name": "Opening Day at Babo"}, {"date": "2016-04-08T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1111017545627223/", "name": "Chilean Wine tasting"}, {"date": "2016-04-08T17:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1586066655048953/", "description": "A Night OUT is a social mixer for the LGBTQ* community at Necto Nightclub. This event helps raise money to run OUTFest and Pride Picnic - Washtenaw County's pride celebration and festival.\n\nPeople 18+ are encouraged to join us for a fun night, but also a reminder of the strength our community can have when we come together.\n\nSuggested donation of $5. All proceeds go toward OUTFest and Jim Toy Community Center.\n\nEntertainment, silent auction, drag, mixer, amazing local food, drinks, and contests! Come & enjoy! Stay the whole time, or just pop in for a bit. Friends and fun for all to enjoy.\n\nSome of our entertainment for the event will include the following performers (& stay tuned for more):\nEvent hostess: Jadein Black\nMusic by Jaimie Wilson\nPoetry by Jason B. Crawford\nDrag & gender performers:\nA-Train Dkr\n\nHere is a list of some of our silent auction contributors:\nThe Michigan Theater\nZingerman's Delicatessen\nBlack Pearl\nThe Lunch Room\nSidetrack Bar and Grill\nThe M-DEN\nCafe Verde & People's Food Co-op Ann Arbor\nAnn Arbor Marriott\nRevel & Roll\nPlanet Rock\nVisit Ann Arbor! & Ypsi Real\nNecto Pride\n\nFood from local venues including:\nSlurping Turtle\nSava's Restaurant\nSidetrack Bar and Grill\n\na2outfest.com\njimtoycenter.org\nDonate to Jim Toy Center: http://www.jimtoycenter.org/#!donate/xl42w\n\nDirectly followed by Necto Pride with Latrice Royale from RuPaul's Drag Race.", "name": "A Night OUT"}, {"date": "2016-04-08T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/792881080812626/", "description": "Literati is pleased to welcome Christopher Bakken, David Blair, and Cody Walker to kick off our celebration of National Poetry Month. \n\nChristopher Bakken is department chair and Frederick F. Seeley Professor of English at Allegheny College. He is the author of the poetry collections After Greece and Goat Funeral. He is also co-translator of The Lions’ Gate: Selected Poems of Titos Patrikios, and the author of Honey, Olives, Octopus: Adventures at the Greek Table. Of Eternity & Oranges, Adam Zagajewski says: “This is a beautiful collection of poems: half-cryptic, half-open; half based on ancient myths, half on actual life. There’s almost always Greece as the backdrop, olives and the sea but also a human drama. Christopher Bakken proves that what’s ancient is also modern and vice versa. We live between times; only poetry can make it palpable.”\n\nDavid Blair is the author of two previous poetry collections. He teaches at the New England Institute of Art. Another book, Arsonville, is forthcoming. Of his most recent work, Friends with Dogs, Tom Sleigh says: “What gives weight and density to David Blair’s remarkable poems is their almost Hardyish sense of regret and loss. So many of his poems are little dramas of what wasn’t said when it should have been said, or of the way celebratory instincts get undermined by the pressures of day-to-day life. I admire the quick shifts in voicing, the way a whole social world becomes revealed in some small characteristic gesture, and how alert Blair is to other people. Very few poets ever achieve this kind of fellow feeling and write about it with such tact and intelligent sympathy.”\n\nCody Walker is the author of Shuffle and Breakdown and the co-editor of Alive at the Center: Contemporary Poems from the Pacific Northwest. His poems have appeared in The Yale Review, Parnassus, Slate, Poetry Northwest, The Hecht Prize Anthology, and the 2007 and 2015 editions of The Best American Poetry; his essays have appeared online in The New Yorker and The Kenyon Review. He lives with his family in Ann Arbor, where he teaches English at the University of Michigan. Of his latest, Mary Jo Salter says: “In Cody Walker’s The Self-Styled No-Child, the poet-father sings to his new baby (read ‘Cradle Song’ or ‘Small Suite’ for perfect little servings of delight), but his childlike playfulness has an internal source, too. The light verses in Walker’s new collection often have dark edges to them (see ‘The Garden’ or ‘We Hated Our Lives’), and his social and political satires are unflinching. Still, this word-wizard with a genius for rhyme reminds us of how irrepressibly joy remains.”", "name": "Poetry at Literati: Christopher Bakken, David Blair, & Cody Walker"}]