[{"source": "Facebook", "name": "Stewardship Workday - Arbor Day", "description": "Arbor Day in Michigan is the last Friday in April. We’re joining folks across the country in planting native shrubs and trees this weekend. As you can see from the photo, we do this work rain or shine (though not in thunderstorms). Meet at the park entrance on the west side of the park, at the end of Birch Hollow Drive, off Stone School Road. \nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "url": "https://www.facebook.com/events/246460939074982/", "date": "2016-05-01T13:00:00-04:00"}, {"source": "Facebook", "name": "Spring Afternoon with Nadia", "description": "A Music Play-In and Fundraiser for Nadia Johnson to attend Blue Lake International, Summer 2016! Nadia began studying the violin through our Cooperative Outreach Music Program (COMP) six years ago, and continued her music education with Miss Bonnie Lyn on scholarship at CMSa2 once she reached high school. You can read more about COMP here: http://aa-spa.org/impact/comp/ \n\nLocal musicians are invited to participate. Please RSVP to 734-972-9978.  Bring your instrument and let's make some music!!!\n\nMusic donations as well as financial donations will be accepted. Please make checks payable to Blue Lake Fine Arts International with \"Nadia Johnson\" in the memo line. \n\nMore about Nadia below:\n\nMUSIC BACKGROUND\nHello!! My name is Nadia Johnson. I am a junior at Community High School in Ann Arbor Michigan. I have been playing the violin for six years. My primary school does not have an orchestra program, therefore, I attend Huron High School to play in their Symphony Orchestra. \n\nGetting to Symphony orchestra took a lot of hardwork and dedication. As a freshman, I began in the Philharmonic Orchestra in which I received the Most Improved Award. That year I auditioned and  advanced into Concert Orchestra. In my  sophomore year, I again auditioned and advanced into Symphony Orchestra,  which I am currently in. Most recently I was selected to to be a part of  Huron's pit orchestra for their production of “Guys and Dolls.”\n\nEach year I participate in the MSBOA solo and ensemble. I received all 1's in both solo and quartet for all three years. I have taken private lessons at the Community Music School of Ann Arbor since I began playing the violin in 2010. For the last five years I have attended Blue Lake Fine Arts Camp and Interlochen Music Camp for two years.\n\nABOUT ME\nI am extremely dedicated to music, God, and family. When I go to college I plan to study Music Education and/or Composition. I come from a musical family. I have two amazing parents, three siblings, and three awesome cats. My brother plays the trumpet in his school jazz band, my mother a Jazz vocalist and my two older sisters are in college; one of which studies music at Washtenaw Community College.  In my spare time I enjoy drawing, watching movies, attending my Girls Group(a mentoring group for teens), yearbook club and listening to classical music. In addition, I volunteer to mentor music students at my former middle school, Scarlett Junior High.\n\nBlue Lakes International Exchange Program 2016\nIn the summer of  2013, while at Blue Lake, I auditioned and was accepted into the Blue Lake International Exchange Program. This would be an experience that would allow me to travel Europe with the orchestra and perform in amazing concert halls. Unfortunately, I wasn’t able to attend due to family financial reasons. \n\nThis year I was again invited to participate in the exchange program. Being that this will be my last eligible year to attend, I humbly am asking for your financial support.  Details about this trip can be found here.   \n\nFUNDRAISING GOALS\n The departure date is June 19th, 2016 and a return date of July 14th, 2016. My fundraising goal is $6,800 due in full by end of May 2016.  This will cover travel, uniforms, sheet music,  international tours, tickets, passport, housing and more. \n\nTo help raise the funds needed I will be giving mini recitals to be announced, personal fundraising pages, candy sales and a donation jar located at Blackstone Bookstore & Cultural Center located at 214 W. Michigan Ave, Ypsilanti MI 48197. I’ll also be willing to play for any local events upon request. \n\nYou may also send contributions directly to Blue Lake to be credited to my personal account (non-tax deductible).To ensure funds are channeled to proper accounts please follow these procedures: If paying by check, please make checks payable to Blue Lake International Exchange Program or Blue Lake Fine Arts Camp. My name must appear in the memo line of check and touring Ensemble.  For more information, contact the Blue Lake International Office at (800)221-3796 or email international@bluelake.org.\n\nI am truly thankful for any and all contributions made towards my trip and upon returning you will be invited to attend a free concert at Hill Auditorium TBA. I will also provide photos of this once in a lifetime experience for me.\n\nwith Sincere Gratitude,\n\nNadia E. Johnson\n\n(734)972-9978", "url": "https://www.facebook.com/events/994193563991405/", "date": "2016-05-01T13:00:00-04:00"}, {"source": "Facebook", "name": "Paper Flower Making Party", "description": "Learn how to make beautiful paper flowers while helping AOT prepare for the inaugural James K. Berg Award gala on May 20th.  The paper flowers will be sold to raise funds and awareness of an upcoming tour of our “La Traviata” adaptation, which addresses the stigma surrounding mental illness and suicide.  They will also be used to create large topiaries that will be featured at the gala.  No experience is necessary, but it would be useful to bring a good pair of paper scissors and a glue gun (if you have one).  We will provide the papers, the instruction and other tools needed to create gorgeous, paper flowers.  They’d even make a wonderful gift for any woman you wish to honor this mother’s day.\n\nLight refreshments will be provided - Park along the street, as this is the home of artistic director, Shawn McDonald", "url": "https://www.facebook.com/events/169807630081793/", "date": "2016-05-01T14:00:00-04:00"}, {"source": "Facebook", "name": "THE Swingin' Quartet Live at the Waterhill Festival", "description": "Our jazz combo will be performing at the Waterhill festival. Come and check it out!", "url": "https://www.facebook.com/events/1759896990906449/", "date": "2016-05-01T16:00:00-04:00"}, {"source": "Facebook", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "url": "https://www.facebook.com/events/231808753849422/", "date": "2016-05-01T16:00:00-04:00"}, {"source": "Facebook", "name": "The Arcade - A Pointless Improv Jam", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/253856641617487/", "date": "2016-05-01T19:00:00-04:00"}, {"source": "Facebook", "name": "Grand Opening!", "description": "Yes, believe your eyes. Vault of Midnight Detroit will be opening its doors on Monday, May 2nd at 10am, a mere two weeks from now-ish.\n\nWe'll have a full compliment of Earth's Finest comic books and graphic novels, board games, apparel, vinyl toys, and much, much more. \n\nOur custom built, one-of-a-kind shop has been gestating in our minds for the last fifteen months. We absolutely cannot wait to share it with you.\n\nThank you to Detroit for all of the kind words and good feelings you've been sending us since we announced this project. We'll try to make you proud!", "url": "https://www.facebook.com/events/1762135664019568/", "date": "2016-05-02T10:00:00-04:00"}, {"source": "Facebook", "name": "Fresh + Fit!", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 12 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 12, in store or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse = 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "url": "https://www.facebook.com/events/110005266066559/", "date": "2016-05-02T12:00:00-04:00"}, {"source": "Facebook", "name": "Bank of Ann Arbor is matching donation up to a total of $3,000 for United Way's Volunteer program", "description": "http://cafegive.com/make_the_match/boaa-volunteermatch\nWe believe everyone should have the chance to make a difference. That's why United Way of Washtenaw County's Volunteer Center makes it easy for good people and good causes to connect. The Bank of Ann Arbor is a proud sponsor and matching all donations up to $3,000 for a grand total of $3,000 for this amazing volunteer program. www.volunteerwashtenaw.org\n\nPlease share this on your social media to help us hit our goal!!", "url": "https://www.facebook.com/events/1739721849644306/", "date": "2016-05-02T14:00:00-04:00"}, {"source": "Facebook", "name": "Michigan Notable Books: Dave & Jack Dempsey, John Gallagher, & Rob St. Mary", "description": "Literati is pleased to celebrate the literary, artistic, and musical culture of Detroit and Michigan at large by welcoming the authors of works chosen as 2015 and 2016 Michigan Notable Books: Ink Trails II: Michigan's Famous and Forgotten Authors by Dave and Jack Dempsey, Yamasaki in Detroit by John Gallagher, and The Orbit Magazine Anthology by Rob St. Mary.\n\nAbout Ink Trails II: From authors of bodice rippers and gallant figures to hometown poetry, hearty men, and tales of American originals, the history of literature in Michigan is deep and rich. The Wolverine State has been the birthplace, home, and inspiration to a tremendous number of men and women of letters, both the well-known and the obscure. Ink Trails II tells the stories of these fascinating and diverse writers whose talent is inextricably linked to Michigan.Exploring the hidden treasures of otherwise forgotten authors while also acknowledging the Michigan-set stories of giants like Hemingway, Dave and Jack Dempsey delve into the state’s literary heritage, as robust, diverse, and inexhaustible as the natural beauty of the place that nurtured it. This second volume of “ink trails” continues to tell the story of the remarkable writers, powerful words, and sublime nature of Michigan in the same well-researched and entertaining prose as the first.\n\nAbout Yamasaki in Detroit: Although his best-known project was the World Trade Center in New York City, Japanese American architect Minoru Yamasaki (1912–1986) worked to create moments of surprise, serenity, and delight in distinctive buildings around the world. In his adopted home of Detroit, where he lived and worked for the last half of his life, Yamasaki produced many important designs that range from public buildings to offices and private residences. In Yamasaki in Detroit: A Search for Serenity, author John Gallagher presents both a biography of Yamasaki—or Yama as he was known—and an examination of his working practices, with an emphasis on the architect’s search for a style that would express his artistic goals. Both knowledgeable fans of modernist architecture and general readers will enjoy Yamasaki in Detroit.\n\nAbout The Orbit Magazine Anthology: With a mischievous globe-headed mascot that appeared in every issue and even on Quentin Tarantino’s T-shirt in Pulp Fiction, Orbit was an instantly recognizable arbiter of 1990s Detroit culture. But its irreverent tone and unique editorial features could be traced to two earlier local publications from creator Jerry Peterson, a.k.a. Jerry Vile—White Noise (1978–1980) and Fun: The Magazine for Swinging Intelectuals [sic] (1986–1990). In The Orbit Magazine Anthology: Re-Entry, author Rob St. Mary details the full run of White Noise, Fun, and Orbit, collecting two decades’ worth of Detroit’s alternative publishing history into an oversized, heavily illustrated volume that situates the publications in the city’s pop culture and media history. Anyone interested in Detroit arts and culture or the history of alternative publishing will be grateful for The Orbit Magazine Anthology.\n\nEvent date: \nMonday, May 2, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1100713003313165/", "date": "2016-05-02T19:00:00-04:00"}]