[{"source": "Facebook", "url": "https://www.facebook.com/events/777545359014313/", "description": "Let mom relax and give her exactly what she wants this Mother's Day... Someone else to cook!\n\nSunday, May 8th, We’re extending our hours from 9am-3pm, for our special Mother’s day brunch buffet! Offering our already copious buffet of assorted lunch and breakfast foods with some extra special additions. \n\nShow mom how much you care because nothing says ‘I love you’ like Sava’s Brunch! \n\nMake your reservation by clicking the link next to \"Ticket URL\"", "name": "Mother's Day Brunch", "date": "2016-05-08T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/691600014313195/", "description": "Nothing says \"I love you\" like our decadent brunch buffet & bloody mary bar!\n\nMother's Day Brunch Buffet\nSunday, May 8th, 10 am – 2 pm\n\n$28 – Includes non-alcoholic beverage\n$6 Bloody Mary Bar\n\nMake your reservation today by clicking the \"Ticket URL\" above.\n\nMenu Coming Soon =)", "name": "Mother's Day Brunch Buffet", "date": "2016-05-08T10:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1049009351837345/", "description": "MOTHER’S DAY BRUNCH BUFFET\n5/8/2016 - 10am to 3pm\nRegular menu available 3pm - 9pm\n$24.95 Per Person / $10.95 Kids Under 12\nTax & Gratuity Not Included\n\nMENU\nCarved Ham with Cranberry Glaze\nPrime Rib with Horsey Sauce\nBaked Whole Salmon with Lemon-Thyme Glaze\nTraditional and Blueberry Pancakes\nWaffles with your choice of Bacon Gravy or Strawberries\nScrambled Eggs\nHuevos Rancheros\nCorned Beef Hash\nThick Cut Bacon\nHash Browns\nSeasonal Vegetables\nFresh Fruit\nAssorted Salads and Pastries\nMuffins and assorted cakes and pies", "name": "Mother's Day Brunch", "date": "2016-05-08T10:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/885189391591900/", "description": "Join us for this event and bring dry dog and cat food with you for donation to the Humane Society of Huron Valley Bountiful Bowls Program to help people keep their pets instead of surrendering them to a shelter.\n\nGeorge was abandoned and no one wanted him...\n\nIt wasn't an easy start for George. Nobody wanted him... he had been abandoned and needed a home. He was scared and unsure of everything. He was rescued by a recently divorced marketing executive, who had a big, empty house and wanted to help him. Eventually, George's loving personality, and wisdom of an old soul emerges, and it becomes apparent that it is in fact George who rescues his new human friend...\n\nGeorge went from abandoned and homeless in cold rural Canada to a surfing Champion and local celebrity on the sunny beaches of California.  Free Days with George is his story.", "name": "Meet Author Colin Campbell & George the Surfing Newfie for 'Free Days w/George' Plus Fundraiser for HSHV Bountiful Bowls Program", "date": "2016-05-08T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1623937947928631/", "description": "A collaborative concert featuring The Brandenburg Project and students and faculty from the University of Michigan early music program.  Bach, Purcell and Biber on the program!", "name": "Mother's Day Early Music Concert", "date": "2016-05-08T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1060585290673795/", "description": "Pucker up! All cosmetics and facial care are 25% off Friday through Sunday, so stock up for yourself or someone you love <3", "name": "25% Off Cosmetics and Facial Care", "date": "2016-05-09T07:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/110005266066559/", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 12 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 12, in store or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse = 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "name": "Fresh + Fit!", "date": "2016-05-09T12:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/183943595325432/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-       May 10 - Tike Anderson \nTike Anderson’s songs are genuine testaments to life on the road, life at home, life in the center of the fire and life in the Motor City. He is an accomplished guitar player with a voice that sounds trained but feels honest. Tike’s songwriting blends road worn soul with the roots rock grit of the motor city and a hint of the easy intellectual earth tones of Ann Arbor.\n\n\nNever a cover\nAlways a good time", "name": "Acoustic Tuesdays: Tike Anderson", "date": "2016-05-10T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1528797477430060/", "description": "Learn how to make beautiful paper flowers while helping AOT prepare for the inaugural James K. Berg Award gala on May 20th.  The paper flowers will be sold to raise funds and awareness of an upcoming tour of our “La Traviata” adaptation, which addresses the stigma surrounding mental illness and suicide.  They will also be used to create large topiaries that will be featured at the gala.  No experience is necessary, but it would be useful to bring a good pair of paper scissors and a glue gun (if you have one).  We will provide the papers, the instruction and other tools needed to create gorgeous, paper flowers.  They’d even make a wonderful gift for any woman you wish to honor this mother’s day.\n\nLight refreshments will be provided - Park along the street, as this is the home of artistic director, Shawn McDonald", "name": "Paper Flower Making Party 3", "date": "2016-05-10T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1739721849644306/", "description": "http://cafegive.com/make_the_match/boaa-volunteermatch\nWe believe everyone should have the chance to make a difference. That's why United Way of Washtenaw County's Volunteer Center makes it easy for good people and good causes to connect. The Bank of Ann Arbor is a proud sponsor and matching all donations up to $3,000 for a grand total of $3,000 for this amazing volunteer program. www.volunteerwashtenaw.org\n\nPlease share this on your social media to help us hit our goal!!", "name": "Bank of Ann Arbor is matching donation up to a total of $3,000 for United Way's Volunteer program", "date": "2016-05-11T14:00:00-04:00"}]