[{"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/280243392370950/", "date": "2016-11-26T08:00:00-05:00", "source": "Facebook", "name": "10% For Good for Community Action Network"}, {"description": "Don't miss our holiday display Avant Garden: Weaving Fashion & Nature Together. The exhibit explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs Saturday, November 26, 2016-Sunday, January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "url": "https://www.facebook.com/events/723312037871156/", "date": "2016-11-26T10:00:00-05:00", "source": "Facebook", "name": "Holiday Exhibit - Avant Garden"}, {"description": "Create your own forged bracelet out of copper wire! You’ll learn metalsmithing techniques like forming, forging, and finishing while gaining experience with Anvils, Hammers and Torches. \n\nThis 2 hour Make & Take Workshop is perfect for students as young as 8 with an adult (16+), or anyone over 13 on their own.  Fun for kid+adult to do together! No prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.\n\nCall Maker Works at 734-222-4911 or visit  http://www.supersaas.com/schedule/makerworks/CheckOut?day=26&month=11&year=2016&view=day to sign up!", "url": "https://www.facebook.com/events/1824980957787302/", "date": "2016-11-26T11:00:00-05:00", "source": "Facebook", "name": "Forge Your Own Copper Bracelet (good for families!)"}, {"description": "Betrayed by the agency who turned her into the very thing she fought against, Peri abandoned the wealth and privilege of Opti for anonymity riddled with memory gaps and self-doubt. But when a highly addictive drug promises to end her dependency on those who’d use her, she must choose to either remain broken and vulnerable, or return to the above-the-law power and prestige she once had: strong but without will—for whoever holds her next fix will hold her loyalty.\n\nNew York Times bestselling author Kim Harrison was born and raised in the upper Midwest. Her bestselling Hollows novels include Dead Witch Walking; The Good, the Bad, and the Undead; Every Which Way But Dead; A Fistful of Charms; For a Few Demons More; The Outlaw Demon Wails; White Witch, Black Curse; Black Magic Sanction; Pale Demon, A Perfect Blood, Ever After, and The Undead Pool, plus the short story collection Into the Woods, The Hollows Insider and graphic novels Blood Work and Blood Crime. She also writes the Madison Avery series for young adults.", "url": "https://www.facebook.com/events/231825410565016/", "date": "2016-11-26T13:00:00-05:00", "source": "Facebook", "name": "Launch Party for Kim Harrison's 'The Operator'"}, {"description": "Magical Mitten Productions Presents: Strum and Bass Vol. 1\n\nA night filled with some of the best bands/DJ in the area come out and groove on and shake off those extra helpings you took at Thankgiving! :D \n\nMusic Starts at 8pm \n18+\n$5 before 11pm \n$7 After \n\n8-10 PM \nOffset Entertainment DJ Showcase!!\nFogodo\nSUMA\nBrionac\nLiddorHawg\n\n10-11\nr1x0music\nSpace Bass\n\n11-12\nAfter Hours Radio\nFormed in January 2014 in Ann Arbor, Michigan, AHR's name was inspired by one their member's experience as a late-night radio DJ, and the Velvet Underground song \"After Hours.\" Their debut EP discusses themes of frustration and disillusionment while showcasing the band's unique blend of indie rock, catchy hooks, and 90s alternative music. AHR is currently supporting the album throughout the midwest and beyond\n\n12-1\nTek - Mazter\nTek-Mazter is in the game for the love of the music and the process of creating it for other people's ears to enjoy. He never sticks to performing or creating just one genre, his mixes and tracks consist of anything from the heaviest Riddim Dubstep to Chill Trap. In his short career he has performed alongside DJ Starscream (Slipknot's DJ), has been local support for Ghastly, Truth, Eptic, YOOKiE, AB The Thief and Toadface, opened for Timeflies & Walk Off The Earth, DJ'd for D12's Bizarre and has played some legendary venues such as The Detroit Masonic Temple, St. Andrews Hall, Necto Nightclub, Elektricity Nightclub and The Works Nightclub.\n\n1-2\nChirp\nBased in Ann Arbor, MI, Chirp is a four-piece band that does it's fair share of genre-hopping, but often plays in the styles of progressive rock/funk, and jazz-fusion. Though officially formed in Fall 2015, they have a lot of experience playing together in previous bands and jam sessions. Chirp mixes originals and covers into their live sets and aims to put together grabbing, dynamic shows. They have had the pleasure of sharing the stage with bands like Marbin, Broccoli Samurai, Desmond Jones, and Stormy Chromer. Recordings of original material will be made live and in the studio throughout 2016, as they plan on continuing to play shows in southeastern Michigan and branching out in the midwest!", "url": "https://www.facebook.com/events/159662074499562/", "date": "2016-11-26T21:00:00-05:00", "source": "Facebook", "name": "Strum and Bass: Chirp,Tek-Mazter,After Hours Radio,r1x0 + Offset"}, {"description": "Don't miss our holiday display Avant Garden: Weaving Fashion & Nature Together. The exhibit explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs Saturday, November 26, 2016-Sunday, January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "url": "https://www.facebook.com/events/723312037871156/", "date": "2016-11-27T10:00:00-05:00", "source": "Facebook", "name": "Holiday Exhibit - Avant Garden"}, {"description": "The exhibition Traces focuses on one artwork from UMMA’s African holdings: a Chokwe mask that was collected in 1905 near the Angolan city of Dundo by the German explorer Leo Frobenius. Its presence at UMMA today—almost 7,500 miles away from the context in which it was originally created, used, and valued—is the result of a long and tumultuous journey, spanning a hundred years, three continents, and numerous people whose lives are forever connected to the artifact that passed through their hands. Drawing on the Museum’s African collection and national loans, Traces tells the stories of some of these individuals as it reconstructs the “biography” of the mask. Explore some of the historical complexity of this mask with UMMA docents.", "url": "https://www.facebook.com/events/1297908950254482/", "date": "2016-11-27T14:00:00-05:00", "source": "Facebook", "name": "Guided Tour: Reconstructing the History of a Chokwe Mask"}, {"description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "url": "https://www.facebook.com/events/1807900772828520/", "date": "2016-11-28T18:00:00-05:00", "source": "Facebook", "name": "Art Off The Wall Holiday Exhibition & Shopping Event"}, {"description": "Join Jon Milan, Gail Offen, Susan L. Nenadic & M. Joanne Nesbit for an evening of discussion about Ann Arbor Icons and Legends.\n\nWhat is an iconic Ann Arbor restaurant? Ask anyone who has ever spent time there as a student, traveler, or townie, and they are likely to name several favorites in an instant. From debating the best place to celebrate or console on football Saturdays to deciding where to eat after the bars close, the choices have always sparked passionate conversation. In Ann Arbor, people are known to have strong feelings about the best places for pizza, coffee, beer, burgers, noodles, and burritos. Although many of the go-to hangouts are long gone, a surprising number still thrive. And there are always a few newcomers coming along to win the hearts of the next generation of diners, nibblers, and noshers. Some are fine restaurants and taverns, and others are lunch counters, diners, carry-outs, and drive-ins but in each and every case, they are unique and together make up a collection of iconic local eateries.\n\nGraced by the Huron River with an abundance of parks, Ann Arbor offers residents and visitors entertainment, sports, shopping, dining, and of course, the University of Michigan. Legendary Locals of Ann Arbor celebrates its citizens. Some of those who make up Ann Arbor are creative artists, inspiring educators, dedicated public servants, and determined business owners. With the exception of Lewis the cat, who reigned at Downtown Home and Garden, this book is filled with stories about people who have made and are making Ann Arbor one of the best places to live in the United States. Within its pages lie the stories of who chose maize and blue as the University of Michigan s colors; who was the first Ann Arborite to race in the Indy 500; and who sold Tom Monaghan, founder of Domino s, his first pizzeria. Inside are photographs and descriptions of the legendary people of the past and the present, as well as those who are on their way to becoming the legends of the future.", "url": "https://www.facebook.com/events/660281374136185/", "date": "2016-11-28T19:00:00-05:00", "source": "Facebook", "name": "Ann Arbor Icons & Legends"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/280243392370950/", "date": "2016-11-29T08:00:00-05:00", "source": "Facebook", "name": "10% For Good for Community Action Network"}]