[{"url": "https://www.facebook.com/events/1685542291727910/", "source": "Facebook", "date": "2016-04-03T17:30:00-04:00", "description": "Strayaway Child Concert Series is proud to present: Lindsay Straw & Caroline O'Shea in concert!\n\nSunday, April 3, 2016\nConor O'Neill's Celtic Room\nDoors 5pm \nShow 5:30pm\nGeneral Admission: $15\nStudents: $12\nKids under 10- Free\n\nLindsay Straw is a singer, guitarist, and Irish bouzouki player who performs traditional songs and tunes from the British Isles. Originally from Montana, she began to explore Boston’s Irish and folk music scenes while studying film scoring at Berklee College of Music. Her debut solo album My Mind From Love Being Free was released on May 1, 2015. She is a 2015 recipient of Club Passim's Iguana Fund Grant, which will enable her to make her second album in 2016.\n\nLindsay has impressed with her tender singing voice and an extensive repertoire that is rooted in the Scottish and Northern Irish traditions, but which also delves into contemporary songwriters like Richard Thompson and Bob Dylan. She has also drawn praise for her sensitive, agile accompaniment on bouzouki and guitar at many a local session and in concert as a member of the Irish quartet The Ivy Leaf, with piper Joey Abarta, and with fellow guitar & bouzouki player Owen Marshall.\nhttp://www.lindsaystraw.com/\n\nCaroline O’Shea is from Milton, MA, and has played the Irish flute and tin whistle since she was a child. As a teenager, she competed in the All-Ireland championships for four years in a row in Letterkenny, Co. Donegal and in Tullamore, Co. Offaly. She received her TTCT Diploma—a week-long certification course in Dublin for teaching traditional Irish music—in 2016, and has taught for Boston’s branch of Comhaltas Ceoltoiri Eireann (Irish music school); at the Killarney School of Music in Killarney, Co. Kerry; at the Milton Art Center; and at the Irish Cultural Centre of New England, in addition to private lessons. Caroline currently plays in a duo with singer Lindsay Straw, and plays flute, whistles, and sings with traditional Irish group The Ivy Leaf. In addition to playing flute and whistle, Caroline was recently awarded a grant from the MA Cultural Council to study the uilleann pipes with master piper Joey Abarta.\n\nSince 2010, Caroline has played flute, whistles, and sung with traditional Irish group The Ivy Leaf. Their debut CD of tunes and songs The Ivy Leaf: Traditional Irish Music was released in 2012. She plays at festivals and events with Boston-based band Devri as well, and played low and high whistles on the band’s debut CD Broad Street in 2012.\nhttps://cosheamusic.wordpress.com/", "name": "Lindsay Straw & Caroline O'Shea- In Concert"}, {"url": "https://www.facebook.com/events/458624760993768/", "source": "Facebook", "date": "2016-04-03T18:30:00-04:00", "description": "Join us for the LAST CHANCE SLAM! This is the only way to earn one of the last two spots to slam at Finals. The top two poets from this slam get an automatic bid into Finals for a chance to compete to be on the team that goes to The National Poetry Slam in Atlanta this August.\n\nRemember, it's 3 rounds! Come through as poets put it all on the line!", "name": "Ann Arbor Poetry LAST CHANCE Slam"}, {"url": "https://www.facebook.com/events/781623368609473/", "source": "Facebook", "date": "2016-04-03T19:00:00-04:00", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "name": "Aventura March Madness"}, {"url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook", "date": "2016-04-03T19:30:00-04:00", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty"}, {"url": "https://www.facebook.com/events/857480274361121/", "source": "Facebook", "date": "2016-04-04T12:00:00-04:00", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/1032406803469486/", "source": "Facebook", "date": "2016-04-04T17:30:00-04:00", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "name": "TheRide’s ServiceFest"}, {"url": "https://www.facebook.com/events/910013872430895/", "source": "Facebook", "date": "2016-04-04T19:00:00-04:00", "description": "Literati is delighted to welcome Desiree Cooper in support of her debut, Know the Mother.\n\nWhile a mother can be defined as a creator, a nurturer, a protector—at the center of each mother is an individual who is attempting to manage her own fears, desires, and responsibilities in different and sometimes unexpected ways. In Know the Mother, author Desiree Cooper explores the complex archetype of the mother in all of her incarnations. In a collage of meditative stories, women—both black and white—find themselves wedged between their own yearnings and their roles as daughters, sisters, grandmothers, and wives.\n\nIn this heart-wrenching collection, Cooper reveals that gender and race are often unanticipated interlopers in family life. An anxious mother reflects on her prenatal fantasies of suicide while waiting for her daughter to come home late one night. A lawyer miscarries during a conference call and must proceed as though nothing has happened. On a rare night out with her husband, a new mother tries convincing herself that everything is still the same. A politician’s wife’s thoughts turn to slavery as she contemplates her own escape: \"Even Harriet Tubman had realized that freedom wasn’t worth the price of abandoning her family, so she’d come back home. She’d risked it all for love.\" With her lyrical and carefully crafted prose, Cooper’s stories provide truths without sermon and invite empathy without sentimentality.\n\nKnow the Mother explores the intersection of race and gender in vignettes that pull you in and then are gone in an instant. Readers of short fiction will appreciate this deeply felt collection.\n\nA 2015 Kresge Artist Fellow, Desiree Cooper is a former attorney, Pulitzer Prize-nominated journalist and Detroit community activist whose fiction dives unflinchingly into the intersection of racism and sexism. Using the compressed medium of flash fiction, she explores intimate spaces to reveal what it means to be human. Her fiction and poetry have appeared in Callaloo, Detroit Noir, Best African American Fiction 2010, and Tidal Basin Review, among other online and print publications. Cooper was a founding board member of Cave Canem, a national residency for emerging black poets. She is currently a Kimbilio fellow, a national residency for African American fiction writers.", "name": "Desiree Cooper"}, {"url": "https://www.facebook.com/events/162598590780251/", "source": "Facebook", "date": "2016-04-04T21:00:00-04:00", "description": "Monday, April 4 | 9pm | 18+ | $13 adv./ $15 day of\n\nChairlift wsg Starchild & The New Romantic\n\nCritically acclaimed pop duo Chairlift has released new music in the form of the infinitely danceable “Ch-Ching.” The R&B laced, vibrating drum infused pop track serves as the first musical offering from their forthcoming album Moth, which will be released in January 2016 via Columbia Records. Although the single is the first work to be released from Chairlift in three years, the duo – comprised of writer/producers and multi-instrumentalists Caroline Polachek and Patrick Wimberly – has hardly been quiet. They collaborated with Beyoncé on her groundbreaking self-titled album via the track “No Angel,” which was written and produced by Caroline and co-produced by Patrick. Caroline released and toured Arcadia, a self-produced solo album under the alias Ramona Lisa and collaborated with SBTRKT, Blood Orange and others, while Patrick produced and collaborated with artists such as Solange Knowles, Wet, Kelela, and Tei Shi.\n\nAn evolution from their last album, 2012’s Something, Moth proves to be an emotionally uninhibited and markedly stronger, more pop inspired body of work. A very New York City inspired album, listeners can expect to be led through an aural mix of big, rich pop inspired hooks, vibrating bass, lively brass and sensuous R&B inspired vocals, all anchored in the duo’s meticulously crafted instrumentation.", "name": "Chairlift 4/4/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1658487314415325/", "source": "Facebook", "date": "2016-04-05T19:00:00-04:00", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nAPRIL\n\n-          April 5 - Bob Skon \nhttp://bobskon.com/\n\"Bob is a musician best described in the singer / songwriter style, blended with a healthy dose of folk-rock, and a touch of jazz.... He has a wonderful ability to use intelligent wordplay for capturing those moments in life we can all identify with. In this Bob could be a peer of the legendary Ray Davies.\" - The Bodhisattva Beat\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "name": "Acoustic Tuesdays: Bob Skon"}, {"url": "https://www.facebook.com/events/514345188768401/", "source": "Facebook", "date": "2016-04-05T19:00:00-04:00", "description": "Calling all bird-watchers! We need your help to identify the bird species breeding in city parks. This is the night to sign up for your favorite park and pick up materials for our annual survey. *Some experience in bird identification is necessary*! City Ornithologist Julet Berger will also report on last year's survey. Please register by April 4.", "name": "Breeding Bird Survey Kickoff"}]