[{"date": "2017-03-09T10:00:00-05:00", "source": "Facebook", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "name": "Exhibit: Avant Garden-Fashion & Plants Together!", "url": "https://www.facebook.com/events/230775294023258/"}, {"date": "2017-03-09T17:00:00-05:00", "source": "Facebook", "description": "OMCod, KPW is back to share some secrets about selecting and preparing seafood. Come say hello and see what's cookin'!", "name": "Seafood 101s", "url": "https://www.facebook.com/events/1805296583123700/"}, {"date": "2017-03-09T17:30:00-05:00", "source": "Facebook", "description": "Jenny Offill's first novel Last Things, published in 1999, was a New York Times Notable book and a finalist for the L.A Times First Book Award. Offill's second novel Dept. of Speculation was published in January 2014 and was named one of the 10 Best Books of 2014 by the New York Times Book Review. Dept. of Speculation has been shortlisted for the Folio Prize in the UK, the Pen/Faulkner Award and the L.A. Times Fiction Award. Her work has appeared in the Paris Review. She is also the co-editor with Elissa Schappell of two anthologies of essays and the author of several children's books.\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon ’13).", "name": "Zell Visiting Writers Series: Jenny Offill, Prose", "url": "https://www.facebook.com/events/249095642207755/"}, {"date": "2017-03-09T17:30:00-05:00", "source": "Facebook", "description": "Jenny Offill's first novel Last Things was published in 1999 by Farrar, Straus and Giroux and in the UK by Bloomsbury. It was a New York Times Notable book and a finalist for the L.A Times First Book Award. Offill's second novel Dept. of Speculation was published in January 2014 and was named one of the 10 Best Books of 2014 by the New York Times Book Review. Dept. of Speculation has been shortlisted for the Folio Prize in the UK, the Pen/Faulkner Award and the L.A. Times Fiction Award. She teaches in the MFA programs at Brooklyn College, Columbia University and Queens University.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon '13).", "name": "Zell Visiting Writers Series: Jenny Offill", "url": "https://www.facebook.com/events/363157110735120/"}, {"date": "2017-03-09T19:00:00-05:00", "source": "Facebook", "description": "Literati is pleased to welcome Will Schwalbe in support of his latest work, Books for Living.\n\nFrom the author of the beloved New York Times best-selling The End of Your Life Book Club comes an inspiring and magical exploration of the power of books to shape our lives in an era of constant connectivity. Why is it that we read? Is it to pass time? To learn something new? To escape from reality? For Will Schwalbe, reading is a way to entertain himself but also to make sense of the world, to become a better person, and to find the answers to the big (and small) questions about how to live his life. In this delightful celebration of reading, Schwalbe invites us along on his quest for books that speak to the specific challenges of living in our modern world, with all its noise and distractions. In each chapter, he discusses a particular book—what brought him to it (or vice versa), the people in his life he associates with it, and how it became a part of his understanding of himself in the world.  These books span centuries and genres (from classic works of adult and children’s literature to contemporary thrillers and even cookbooks), and each one relates to the questions and concerns we all share. Throughout, Schwalbe focuses on the way certain books can help us honor those we’ve loved and lost, and also figure out how to live each day more fully. Rich with stories and recommendations, Books for Living is a treasure for everyone who loves books and loves to hear the answer to the question: “What are you reading?\"\n\n“Books for Living by Will Schwalbe lives wonderfully up to its title. He offers an easy tone, sections chapter by chapter of his chosen stories and their affiliations to our own lives. He reminds me of a diviner who walks the open fields, taps, and reveals something rarely talked about, or perhaps never noticed, in one story or another, but is important. That’s a thrill! I can’t imagine a person who loves books not being grateful. Any season of the year, this book is a gift.” —Mary Oliver\n\nWill Schwalbe has worked in publishing (he’s now EVP, Editorial Development and Content Innovation for Macmillan); digital media, as the founder and CEO of Cookstr.com; and as a journalist, writing for various publications, including The New York Times and the South China Morning Post. He is on the board of the Kingsborough Community College Foundation. He is the author of The End of Your Life Book Club, and coauthor, with David Shipley, of Send: Why People Email So Badly and How to Do It Better.\n \n\nEvent date: \nThursday, March 9, 2017 - 7:00pm", "name": "Will Schwalbe", "url": "https://www.facebook.com/events/2126330127593241/"}, {"date": "2017-03-09T19:00:00-05:00", "source": "Facebook", "description": "This month we are hosting a full hour of open mic in a relaxed, welcoming atmosphere. In honor of Women's History Month, we would love to feature work that is written by or inspired by women. \n\nPlease join us to hear some fantastic local poets, and feel free to share your own work (or that of a favorite author). This is part of a monthly series on the 2nd Thursday of most months at 7pm in partnership with Les Go Social Media & Marketing.", "name": "Open Mic & Share Poetry Series", "url": "https://www.facebook.com/events/381529218891007/"}, {"date": "2017-03-09T19:30:00-05:00", "source": "Facebook", "description": "VIDEO PREVIEW: https://www.youtube.com/watch?v=H4PpvXNZK3I\n\nMORE INFO: http://ums.org/performance/the-beauty-queen-of-leenane/\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.", "name": "The Beauty Queen of Leenane: Druid", "url": "https://www.facebook.com/events/614995318650187/"}, {"date": "2017-03-09T19:30:00-05:00", "source": "Facebook", "description": "Ann Arbor Civic Theatre presents Almost, Maine by John Cariani, directed by Kat Walsh, March 9-12, 2017, at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, and $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org. \n \nAlmost, Maine is a town so far north, it’s almost in Canada, almost not in the United States, it’s just … Almost. On a cold, clear night in this remotest of towns, witness nine stories of residents falling in and out of love in the strangest of ways. Set against the hovering northern lights, hearts get broken, knees get bruised, and love is lost, found, and confounded. It’s love. But not quite.\n \nThe subject of this critically acclaimed play is something that veteran director Kat Walsh sees as universal to audiences, and her direction aims to make that connection. “Meaningful relationships require vulnerability --- it means allowing yourself to be fully seen and heard by another person and risking rejection. John Cariani brilliantly captures these inspiring, and yes frightening, moments in his play, Almost, Maine,\" shared director Walsh. \"Our actors and production staff have the heroic task of portraying these acts of courage on stage for an audience. We want to tell these stories simply and honestly.”\n \nThe talented cast of Almost, Maine includes Andrew Benson, Elizabeth Docel, Matthew Flickinger, Chris Grimm, Lawrence Havelka, Chris Joseph, Rachael Kohl, Stephanie Laurinec, Joe Lopez, Matthew Miller, Scott Mooney, Sara Rose, Codi Sharp, Megan Shiplett, and Michelle Weiss.", "name": "Almost, Maine", "url": "https://www.facebook.com/events/1877727032438874/"}, {"date": "2017-03-09T21:00:00-05:00", "source": "Facebook", "description": "React Detroit presents\n\n:: Lost Kings::\n\n\nNecto Nightclub\n516 E. Liberty\nAnn Arbor, MI\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet", "name": "Lost Kings at Necto", "url": "https://www.facebook.com/events/1348662695244632/"}, {"date": "2017-03-10T09:00:00-05:00", "source": "Facebook", "description": "“Assembled Works” Multi-Media Workshop\nAlice Vander Vennen\nIn this workshop participants will work with a variety of textiles, including remnants of their own stitched, embroidered and/or embellished work, quilts, knitting, beads, unfinished projects, antique handwork, new fabrics, and found pieces of textiles – anything that “catches the eye”—and combine them with natural materials. Allowing the rich textures, brilliant colors and nuanced lines of stitched textiles to interact with the mysterious beauty of the imprinted stone, a gentle branch or a fragile leaf, students will create a framed (20” x 20”) stitched, three-dimensional textile assemblage. Instruction will be given for the steps used to create a fiber work composition, the techniques used to incorporate natural materials, and for finishing, mounting and framing the finished art work. Website: http://www.alicevandervennen.ca/   To register go to the Ann Arbor Fiberarts Guild website: www.annarborfiberarts.org", "name": "“Assembled Works” Workshop", "url": "https://www.facebook.com/events/1860126057346312/"}]