[{"date": "2016-10-28T12:00:00-04:00", "source": "Facebook", "description": "This class will introduce you to the Epilog 50watt Laser Cutter/Engraver. Learn how to cut and engrave lots of different materials such as paper, fabric, plastics, wood and more! The Epilog Laser can handle many different file formats such as pdf, Adobe illustrator and photoshop, jpgs, dwg, dxf, eps and more. You will learn basic operation of this tool with an emphasis on safety. With the successful completion of this class you will be certified to use the Epilog Laser Cutter/Engraver on your own. Find additional information about this tool here: www.epiloglaser.com/how_lasers_work.htm\n\nRegister by calling 734-222-4911 or visiting http://www.supersaas.com/schedule/makerworks/CheckOut?day=28&month=10&year=2016&view=day\n\nPlease arrive 10 minutes early if this is your first time to Maker Works.", "url": "https://www.facebook.com/events/614932452011114/", "name": "Learn to use a 50W laser - $25 - 1 Hr"}, {"date": "2016-10-28T12:00:00-04:00", "source": "Facebook", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/", "name": "POP-X"}, {"date": "2016-10-28T19:00:00-04:00", "source": "Facebook", "description": "Come join us at the Ann Arbor Farmers Market on Friday, October 28th for a casual, social ride around town and a playful Halloween/Fall theme to boot. Come as you are, or come in disguise. Your costume, favorite fall get-up, or decorated bike will all be welcome and on show as we roll around town and ding those bells. The route, again, will not exceed 10 miles and will remain within the city limits.\n\nOur mid-ride stop will be extended to allow us a break and a chance to enjoy the aptly themed festivities. Be sure to bring lights for the dark (bonus points for themed lighting)! Check back later for this month's ride route and to stay up on the happenings.\n\n\nWhat's Bike-in?\nSee the community page:\nhttps://www.facebook.com/bikeinannarbor/info?tab=page_info\n\nOR read below\n\nBike-in is: Slow bike rides throughout Ann Arbor for everyone. Post-ride fun with friends, neighbors, and visitors around the community.\n\nEach ride we will begin at the listed location & time, ride casually, then finish the ride by \"biking-in\" to a post-ride time together at a local establishment, green space, or other friendly host setting (i.e. Bike-in :: Movie (outdoor), Creamery (ice cream), Picnic (potluck), Garden (beer garden), etc.).\n\nRides will be open and friendly to all. For gathering information, times, locations, riding routes, weather updates, etc. like/follow the page or visit for updates.\n\nPlease practice safe riding and abide by all legal riding rules at all times, especially while riding with a Bike-in community. Be sure to provide your own helmet, riding lights, and other appropriate accessories.", "url": "https://www.facebook.com/events/162156404242383/", "name": "Bike-in :: Halloween"}, {"date": "2016-10-28T19:30:00-04:00", "source": "Facebook", "description": "Ann Arbor Civic Theatre presents Othello, Shakespeare’s iconic tragedy, directed by David Widmayer October 27-30 at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org.  \nThe archetypal villain, Iago, plots against his commander, the moor, Othello, using Othello’s beautiful (and secret) wife, Desdemona, as the linchpin in his scheme. Shakespeare’s tale of jealousy, revenge, and betrayal asks the question, what happens to the boundaries of good and evil as men and women are pushed to desperation in the midst of war?\nA2CT’s upcoming production sets this tale of treachery and revenge against the backdrop of the Vietnam War, with its newly integrated armed services. Says director David Widmayer, “[This setting] has helped me bring this show to life in a way I'm not sure I otherwise could. It's helpful both for the actors and for the audience to understand the context surrounding the play, and that's a very tall order when we're talking about an early seventeenth century English translation of a sixteenth century Italian story.” He approaches the well-known classic with an eye toward the parallels to today, and the larger questions of nature versus nurture. “Iago and Othello don't do terrible things because they're terrible people, but because they've been deeply immersed in a culture which expects men to resort to violence first to solve their problems. The fact that we're still grappling with these issues as a culture centuries after Othello was written is staggering.”\nThe talented cast is led by Justin Gordon as Othello, Ann Dilworth as Desdemona, Sean Sabo as Iago, and Carol Gray as Emilia. Joshua Kay, Greg Kovas, Trevor Maher, Matthew Miller, Maegan Murphy, Kaela Parnicky, Amanda Photenhauer, Russell Schwartz, Megan Shiplett, Tom Underwood, and Cierra Wollack round out a superbly strong ensemble", "url": "https://www.facebook.com/events/604827976308937/", "name": "Othello"}, {"date": "2016-10-28T20:00:00-04:00", "source": "Facebook", "description": "There is no better storyteller than Chuck Brodsky.  Ranging from poignant to hilarious, his songs are about the little things in the lives of everyday people.  Chuck's soulful and compassionate voice brings his characters to life, and is the perfect instrument for infusing his lyrics with heartfelt humanity or biting wit. His spoken introductions to his songs can be as spellbinding as his colorful lyrics, which he brings to life with a well-travelled voice and a delivery that's natural and conversational. His groove-oriented strumming and fingerpicking draw on influences from the mountains of western North Carolina where he now lives, and from lots of different good old traditional folk stuff of all kinds. Chuck is widely known for his many wonderful songs about the heroes -- and zeroes -- of baseball. His latest CD is The Tell Tale Heart.\nwww.chuckbrodsky.com", "url": "https://www.facebook.com/events/147078752335941/", "name": "Chuck Brodsky at Green Wood Coffee House"}, {"date": "2016-10-28T21:00:00-04:00", "source": "Facebook", "description": "LIVE Ann Arbor is excited to announce the launch of the LIVE Festival Series. The last Friday of each month, LIVE Nightclub will transform into a music festival you cannot miss. Something Wicked will take place in Houston this year, but for those of us that can’t make the trip to Texas, we can still enjoy this costumed festival right here at LIVE! \n\nAdd the festival experience to your Halloween weekend! Things will get wild here featuring DJ Xten Sive", "url": "https://www.facebook.com/events/192038364565618/", "name": "LIVE Festival Series: Something Wicked"}, {"date": "2016-10-28T21:00:00-04:00", "source": "Facebook", "description": "Ornâmatik captivates audiences through original compositions, infectious grooves, and unique interpretations of traditional Eastern European folk songs. The band's tight rhythm section and funky horns blend together to bring a fresh sound to the music scene. Ornâmatik will perform two sets, one at 9:00 PM and one after 10 PM (time for second set TBA).\n\nJoin us at the Kerrytown location of Sweetwaters Coffee & Tea and sip on a refreshing drink while enjoying the funky groove of Ornâmatik!\n\nBethanni Grecynski, trombone/voice/flute\nDrew Schmeiding, drums\nEric Schweizer, reeds\nJoe Fee, bass\nDerek Worthington, trumpet\n\nThis performance is a part of the Fringe at the Edge series, celebrating the spirit of Edgefest through free public performances throughout downtown Ann Arbor.", "url": "https://www.facebook.com/events/1207353882670294/", "name": "Ornâmatik at Sweetwaters | Fringe at the Edge"}, {"date": "2016-10-28T21:30:00-04:00", "source": "Facebook", "description": "The 8th Annual Halloween Band Masquerade at the Blind Pig features 4 bands dressing up, learning a whole set and being another band for Halloween. This year's bill features:\n\nVolcano Worshippers Hour as Stone Temple Pilots\n\nCobra Youth as Danzig\n\nVladimir Poutine as Dinosaur Jr.\n\nSharashka as Discharge\n\nDoors at 9:30, $8 cover. Costumes are heavily encouraged!", "url": "https://www.facebook.com/events/301128386924288/", "name": "8th Annual Halloween Band Masquerade"}, {"date": "2016-10-28T22:00:00-04:00", "source": "Facebook", "description": "www.mclovins.band", "url": "https://www.facebook.com/events/1794175210865586/", "name": "McLovins w/ Mister F + Liquid Monk at Club Above (10/28)"}, {"date": "2016-10-29T12:00:00-04:00", "source": "Facebook", "description": "Come watch as Vault of Midnight gets invaded by masked heroes, spooky ghosts, and at least one Harley Quinn. Starting at Noon, Vault Staff will be on hand to take photos of you in your amazing costume. All photos will be entered in our costume contest and the winners will be announced in the coming days. \n\nThis year we will be judging both an adult and kids category (we got pretty tired of all the adults crying about how great the kids' costumes were). Prizes will be given out for the top three costumes in each group and are as follows:\n\nAdults (Ages 16+)\n1st Place: $100 Vault of Midnight Gift Card\n2nd Place: $50 Vault of Midnight Gift Card\n3rd Place: $25 Vault of Midnight Gift Card\n\nKids:\n1st-3rd Place: $10 Vault of Midnight Gift Card and a Halloween-themed Graphic Novel\n\nCheck out Vaultofmidnight.com for our full list of Halloween activities.", "url": "https://www.facebook.com/events/1822022961367861/", "name": "Vault of Make-Believe Costume Contest"}]