[{"date": "2017-01-18T10:00:00-05:00", "description": "Join us for Ann Arbor\nRestaurant Week\nJanuary 15th – 20th, 2017\nLunch & Dinner\n\nhttp://www.annarborrestaurantweek.com/\n\nReservations Recommended\n(888) 456-3463 (DINE)", "url": "https://www.facebook.com/events/208434849627331/", "source": "Facebook", "name": "Ann Arbor Restaurant Week"}, {"date": "2017-01-18T10:00:00-05:00", "description": "Ann Arbor Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price.\n\nVinology Wine Bar and Restaurant is proud to be part of this great event, offered from January 15 - 20.  Enjoy a three course dinner for only $28!", "url": "https://www.facebook.com/events/1844201079197076/", "source": "Facebook", "name": "Ann Arbor Restaurant Week"}, {"date": "2017-01-18T11:00:00-05:00", "description": "We'd love for you to join us for Ann Arbor Restaurant Week, January 15th-20th. Click the link to view our lunch and dinner options for two. We have vegetarian, vegan, and gluten free options.\n\nAlso, $.50 from each Restaurant Week meal purchased at the brewpub will be donated to Food Gatherers!\n\nhttp://www.annarborrestaurantweek.com/…/arborbrewingcompany/", "url": "https://www.facebook.com/events/1894155567471093/", "source": "Facebook", "name": "Ann Arbor Restaurant Week at Arbor Brewing Company"}, {"date": "2017-01-18T11:00:00-05:00", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "url": "https://www.facebook.com/events/357869054582083/", "source": "Facebook", "name": "Ann Arbor Restaurant Week"}, {"date": "2017-01-18T19:00:00-05:00", "description": "Literati is pleased to welcome Jon Milan and Gail Offen for a presentation of their latest work, Iconic Restaurants of Ann Arbor. \n\nWhat is an iconic Ann Arbor restaurant? Ask anyone who has ever spent time there as a student, traveler, or “townie,” and they are likely to name several favorites in an instant. From debating the best place to celebrate or console on football Saturdays to deciding where to eat after the bars close, the choices have always sparked passionate conversation. In Ann Arbor, people are known to have strong feelings about the best places for pizza, coffee, beer, burgers, noodles, and burritos. Although many of the go-to hangouts are long gone, a surprising number still thrive. And there are always a few newcomers coming along to win the hearts of the next generation of diners, nibblers, and noshers. Some are fine restaurants and taverns, and others are lunch counters, diners, carry-outs, and drive-ins—but in each and every case, they are unique and together make up a collection of iconic local eateries.\n\nThrough rare photographs and advertisements, Jon Milan and Gail Offen, coauthors of Grand River Avenue: Detroit to Lake Michigan (Arcadia 2014), rekindle some tasty memories, and perhaps even some of the debates, shared by so many. No matter what, these iconic places will always be an important part of the community’s shared past and palates.", "url": "https://www.facebook.com/events/1836855353238573/", "source": "Facebook", "name": "Iconic Restaurants of Ann Arbor"}, {"date": "2017-01-18T19:00:00-05:00", "description": "The City of Ann Arbor is planning to resurface Arlington Blvd between Washtenaw Ave and Geddes Ave during the upcoming 2017 construction season. To allow neighborhood residents and property owners an opportunity to share their thoughts regarding transportation safety and operational issues or other concerns pertaining to the roadway corridor, and to solicit input regarding potential improvements that could be included as part the project, staff will be hosting a public meeting on Wednesday, January 18, 2017, from 7:00 to 8:30 p.m. in the Tappan Middle School Media Center, 2251 East Stadium Boulevard, Ann Arbor, Michigan.\n\nIf you are unable to attend, and have questions or concerns related to the project, please contact David Dykman, Project Manager, at ddykman@a2gov.org or 734.794.6410 ext. 43685.\n\nAll persons are encouraged to participate in public meetings. Accommodations, including sign language interpreters, may be arranged by contacting the city clerk’s office at 734.794.6140; via email to cityclerk@a2gov.org; or by written request addressed and mailed or delivered to:\n\nCity Clerk’s Office\n301 E. Huron St.\nAnn Arbor, MI 48104\n\nRequests made with less than two business days’ notice may not be able to be accommodated.", "url": "https://www.facebook.com/events/1014567158650029/", "source": "Facebook", "name": "Arlington Blvd resurfacing neighborhood meeting"}, {"date": "2017-01-19T17:00:00-05:00", "description": "Join KPW, our meat department manager, for an informative chat and demo about how to prepare chicken. This time, he'll be focussing on how to break down a chicken to get more out of it. More cluck for your buck- join us!", "url": "https://www.facebook.com/events/952501411516218/", "source": "Facebook", "name": "Chicken 101 with KPW"}, {"date": "2017-01-19T17:30:00-05:00", "description": "Kelly Link is the author of the collections Stranger Things Happen, Magic for Beginners, Pretty Monsters, and Get in Trouble. Her short stories have been published in The Magazine of Fantasy & Science Fiction, The Best American Short Stories, and Prize Stories: The O. Henry Awards. She has received a grant from the National Endowment for the Arts. She and Gavin J. Grant have co-edited a number of anthologies, including multiple volumes of The Year’s Best Fantasy and Horror and, for young adults, Steampunk! and Monstrous Affections. She is the co-founder of Small Beer Press and co-edits the occasional zine Lady Churchill’s Rosebud Wristlet. Link was born in Miami, Florida. Shecurrently lives with her husband and daughter in Northampton, Massachusetts.\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon '13).", "url": "https://www.facebook.com/events/360267014340397/", "source": "Facebook", "name": "Zell Visiting Writers Series: a conversation with Kelly Link"}, {"date": "2017-01-19T18:00:00-05:00", "description": "Improve your woodworking knowledge with one-on-one instruction. The process of using woodworking tools in unison to create a final product is the primary focus of this class. \n\nWe’ll walk you through using the Jointer, Planer, Table Saw and Drum Sander to gain confidence with each tool. You will also be learning how different materials and their features or defects might affect the finished project. \n\nWoodworking skills taught: Wood identification and selection, milling, gluing/clamping, shaping, and table saw ripping/crosscutting. You’ll also learn how to use a table saw in unexpected ways. \n\nProject: End Grain Cutting Board \n\nPrerequisites: Attendees must be checked out on on the Jointer, Planer, Drum Sander and Table Saw. \n\nThis class meets three times: Monday 01/16 6:00pm - 9:00pm and Tuesday, 01/17 6:00pm - 8:00pm, and Wednesday, 01/18 6:00pm - 8:30pm \n\nThis class is taught by Chris Riecker, find out more about his work here: maker-works.com/this-woodworking-is-a-cut-above/", "url": "https://www.facebook.com/events/1826785644235500/", "source": "Facebook", "name": "Woodworking Skill Development - 7.5hrs - $200"}, {"date": "2017-01-19T18:30:00-05:00", "description": "…AND WE’RE BACK! \n\nIt’s the new year and we’ve got an all new line up of speakers ready to let their nerd light shine. First up is Reema Abi-Akar, who knows there’s nothing new under the pun, but has some quip-witted repartee on everyone’s (dad’s) favorite kind of wordplay. Andrew McAllister, he studies applied physics, he works on a super computer, and he predicts a glorious and well-lit future in which super-efficient LED bulbs are also super-affordable. Newshound Jim McBee of The Ann magazine is here to talk about those phony news stories your uncle keeps sharing on Facebook, and how to separate the credible from the incredible.\n\nIt’s going to be illuminating in more ways than one!\n\nWhen: Thursday, January 19, 2017, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER, thanks to your friendly neighborhood AADL!", "url": "https://www.facebook.com/events/1829972520597291/", "source": "Facebook", "name": "Nerd Nite #41: Packing a PUNch, Making Light and Fake News"}]