[{"date": "2017-08-18T07:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1726666764292959/", "name": "Beatles Day at Sweetwaters Downtown!", "description": "Come and celebrate the anniversary of the day one of the greatest music groups in the world formed: The Beatles! We will play Beatles music all day, have special Beatles-themed drinks, and celebrate the genius of Paul, Ringo, George, & John! \n\n🎶 🎶\n\nVisit Ann Arbor! Ann Arbor Townies ONLY! Ann Arbor Townies- Happenings and Gigs! Ann Arbor, Michigan Downtown Ann Arbor, Michigan"}, {"date": "2017-08-18T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/269702390193570/", "name": "Drink & Draw / Imbibe & Inscribe", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor."}, {"date": "2017-08-18T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1962369997381392/", "name": "CMSa2 Friday JAM!", "description": "The Community Music School invites you to our outreach performance at the Kerrytown Market and Shops next Friday, August 18th from 5:00-7:00pm. Come enjoy music while you shop at the wonderful Kerrytown Market & Shops on Friday evening!  We will be promoting the school's \"Take Us to the Next Level\" fundraiser, which ends August 20th!  \n\nCheck out the Fundraiser and Donate Now! \nhttps://www.crowdrise.com/cmsa2-take-ustothenextlevel\n\nIf you are a current student or faculty member who wants to join the \"Friday JAM\" please sign up here for a performance time slot on Friday, August 18th! http://www.signupgenius.com/go/5080e48a4a82fa0fe3-kerrytown"}, {"date": "2017-08-18T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/332020520569354/", "name": "S. Margot Finn", "description": "Literati is delighted to celebrate the publication of Discriminating Taste: How Class Anxiety Created the American Food Revolution by S. Margot Finn.\n\nFor the past four decades, increasing numbers of Americans have started paying greater attention to the food they eat, buying organic vegetables, drinking fine wines, and seeking out exotic cuisines. Yet they are often equally passionate about the items they refuse to eat: processed foods, generic brands, high-carb meals. While they may care deeply about issues like nutrition and sustainable agriculture, these discriminating diners also seek to differentiate themselves from the unrefined eater, the common person who lives on junk food.\n\nDiscriminating Taste argues that the rise of gourmet, ethnic, diet, and organic foods must be understood in tandem with the ever-widening income inequality gap. Offering an illuminating historical perspective on our current food trends, S. Margot Finn draws numerous parallels with the Gilded Age of the late nineteenth century, an era infamous for its class divisions, when gourmet dinners, international cuisines, slimming diets, and pure foods first became fads.\n\nExamining a diverse set of cultural touchstones ranging from Ratatouille to The Biggest Loser, Finn identifies the key ways that “good food” has become conflated with high status. She also considers how these taste hierarchies serve as a distraction, leading middle-class professionals to focus on small acts of glamorous and virtuous consumption while ignoring their class’s larger economic stagnation. A provocative look at the ideology of contemporary food culture, Discriminating Taste teaches us to question the maxim that you are what you eat.\n\n\"Finn's compelling argument about the role of class in today's food culture is sure to have a major impact on how both scholars and foodies think about the food revolution.\"--Charlotte Biltekoff, author of Eating Right in America: The Cultural Politics of Food and Health\n\n\"Finn offers an engaging and compelling explanation for the rise of the modern food movement. It's one that the leaders of the movement will no doubt find unsettling.\"--Jayson Lusk, author of Unnaturally Delicious and The Food Police\n\nS. Margot Finn is a lecturer in literature, science, and the arts at the University of Michigan, Ann Arbor."}, {"date": "2017-08-18T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1077556562379114/", "name": "Pointless Improv with Listen, Stupid and Brenda", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Listen, Stupid \nGroup 2: BRENDA (FKA Shadow League)\nGroup 3: The League of Pointless Improvisers"}, {"date": "2017-08-18T20:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/117592038893449/", "name": "Talent Night at Sweetwaters", "description": "Welcome to Sweetwaters Coffee & Tea's Talent Night! These will occur on the 1st and 3rd Friday of each month from 8:30-11 pm.\n\nFeatured Artist of the Night: Perform from 8:30-9:15pm\nAri plays with the Ann Arbor Pioneer H.S. Bands, attended Interlochen Center for the Arts and focuses on jazz, classical blues and rock guitar styles. \n\nOpen Mic spots available afterwards from 9:30-11pm\n\nWe love our community. The people are passionate, the culture is rich and the spirit of Ann Arbor runs deep. That's why we want to give another voice to our local artists!\n\nIf you want to share your art... let it be music, poetry or comedy, we want to hear it! Simply bring your original material, any equipment you need and show up early to sign up for a performance spot!\n\n*All sumbissions must be originals and family friendly*\n\n***Become a Featured Artist of the Night or reserve your Open Mic spot by emailing joshs@sweetwaterscafe.com"}, {"date": "2017-08-18T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/343904029373162/", "name": "9th YEAR Anniversary SHOW", "description": "FAR HOUSE is celebrating it's 9th YEAR ANNIVERSARY!!!\nFAR OUT!!  Come join us for live music and good times.\n\nShindig Machine \n(https://www.facebook.com/shindigmachine/)\n\nLaserbeams Of Boredom \n(https://laserbeamsofboredom.bandcamp.com/)\n\nHarison Zamperla\n(https://harisonzamperla.bandcamp.com/)\n\nJeffrey Freer\n(https://jeffreyfreer.bandcamp.com/)\n\n\nSmoke in the back yard.\nBe respectful to others."}, {"date": "2017-08-18T22:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/118203095486483/", "name": "A Pointless Display of Improvised Feats", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\nNo two shows are the same!\nTickets are $10."}, {"date": "2017-08-19T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1816943561954084/", "name": "Stewardship Workday", "description": "The 3 miles of trails in Bird Hills give some lovely views of the Huron River. This is the largest Nature Area in Ann Arbor, and provides a great space to get out and see wildlife and wildflowers. Volunteers are needed to help remove invasive weeds like Japanese hedge parsley throughout the park. This is a great workday for the family. Join us at the Bird Road entrance to this park, west of Huron River Drive (additional parking in Barton Nature Area-Dam Entrance). Please wear long pants and closed-toe shoes. Every participant must present a completed release form, and all minors should be accompanied by a guardian. Tools, snacks, and know-how provided."}, {"date": "2017-08-19T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/232807710573977/", "name": "Storytime at the Museum", "description": "Storytime at the Museum promotes art enjoyment for our youngest patrons. Children ages three to six are invited to join in on some children’s fun, hear a story, and do a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. Meet in front of the UMMA Store.\nStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement."}]