[{"source": "Facebook", "name": "5th Annual Jim Toy Birthday Bash", "description": "The Jim Toy Birthday Bash is a fantastic event to honor our namesake, the legendary Jim Toy, while also bringing our community together for an enjoyable evening celebrating an incredible man and his lifetime of advocacy and accomplishments on behalf of the LGBTQ community.\n\nThank you to our growing list of financial sponsors who made this event possible:\n\nSponsors:\nComcast & Out Post\n\nHosts:\nLeigh Greden & Washtenaw Community College\n\nFriends of Jim Toy:\nMichigan Supreme Court Justice Bridget Mary McCormack\nU.S. Congresswoman Debbie Dingell\nState Representative Jeff Irwin\nState Representative Adam F Zemke\nWashtenaw Sheriff Jerry Clayton\nEvan Pratt, Washtenaw County Water Resources Commissioner \nAnn Arbor Mayor Christopher Taylor\nYpsilanti Mayor Amanda Maria Edmonds & Hollie Pietsch\nAnn Arbor City Councilmember Sabra Briere\nAnn Arbor City Councilmember Chip Smith & Courtney Piotrowski\nAnn Arbor City Councilmember Kirk Westphal\nAnn Arbor City Councilmember Jane Lumm\nAnn Arbor City Councilmember Graydon Krapohl\nWashtenaw County Commissioner Yousef Rabhi\nWashtenaw County Commissioner Andy LaBarre\nJoan Lowenstein\nTravis Radina\nAngus Burch\nDoug Scott\nLawrence La Fountain-Stokes\nBarbara Murray\nAnn Arbor Area Convention & Visitors Bureau\n\nTo become a sponsor or donate to the event, please go here: https://secure.lglforms.com/form_engine/s/NMRhi10N5uVq9ZSSGKmuwg\n\nThank you also to our community sponsors, the Washtenaw ID Project, Planned Parenthood Advocates of Michigan and Equality Research Center! These organizations will be in attendance at Birthday Bash - please be sure to learn more about them while you enjoy the party!\n\nPlease note this event is 21-and-over. Minors welcome with a parent. $10 suggested donation at the door. Small appetizers will be provided!", "url": "https://www.facebook.com/events/1714526335426651/", "date": "2016-04-15T18:30:00-04:00"}, {"source": "Facebook", "name": "Tamar Boyadjian, Tarfia Faizullah, & Airea D. Matthews", "description": "Literati is pleased to welcome Tamar Boyadjian, Tarfia Faizullah, & Airea D. Matthews to the store in celebration of National Poetry Month.\n\nTamar Boyadjian is the author of it is what it is and the vineyard of mirrors. Her poetic and academic work has been included in a number of literary journals and creative anthologies around the world including the United States, Turkey, Armenia, parts of Europe and the Middle East. Tamar teaches medieval literature (and the literature of other people and cultures) as well as creative writing at Michigan State University, and is involved with the Armenian Studies Program at the University of Michigan.\n\nPoet, editor, and educator Tarfia Faizullah was born in 1980 in Brooklyn, NY and raised in west Texas. She received an MFA in poetry from Virginia Commonwealth University and is the author of Seam, which U.S. Poet Laureate Natasha Trethewey calls “beautiful and necessary,” as well as Register of Eliminated Villages (forthcoming from Graywolf in 2017).\n\nAirea D. Matthews is a 2015 Kresge Literary Arts Fellow and the executive editor of The Offing. She is currently the Assistant Director of the Helen Zell Writers’ Program at University of Michigan, Ann Arbor, where she earned her MFA. Her poems have appeared or are forthcoming in Best American Poetry 2015, American Poet,The Missouri Review, The Baffler, Callaloo, Indiana Review, WSQ and elsewhere. Her performance work has been featured at the Cannes Lions Festival, PBS’ RoadTrip Nation and NPR. She lives in Detroit with her husband and their four children.", "url": "https://www.facebook.com/events/1064590700274844/", "date": "2016-04-15T19:00:00-04:00"}, {"source": "Facebook", "name": "Zafir: Musical Winds from North Africa to Andalucía", "description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus. There it blended with elements of Spanish music and was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed singer Nidal Ibourk, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "url": "https://www.facebook.com/events/419604171550681/", "date": "2016-04-15T20:00:00-04:00"}, {"source": "Facebook", "name": "Pointless Improv with Trap Queens and Demon Death Stab", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Trap Queens\" starring Annie Hendricks and Cari Sue Murphy\n\nGroup 2: \"Demon Death Stab\" starring Julia Schroeder, James Quesada, Steve Vagts, Nuverre Naami, Travis Pelto, Aaron Mondry, Andy Reid, and Anna Imesch\n\nGroup 3: \"The League of Pointless Improvisers\" starring Corene Ford, Erik Heilner, Matt Swartz, Mitch Socia, and Jason Valentini", "url": "https://www.facebook.com/events/1183566044989707/", "date": "2016-04-15T20:00:00-04:00"}, {"source": "Facebook", "name": "Scott Ainslie at Green Wood Coffee House", "description": "Scott Ainslie came of age during the Civil Rights era, and cultivated a powerful affinity for cross-cultural exchange. He has studied with elder musicians on both sides of the color line, in the old-time southern Appalachian fiddle and banjo traditions, as well as Black gospel and blues. He plays this music with affection, authority, and power. Armed with a variety of instruments -- vintage guitars, a fretless gourd banjo, a one-string, homemade diddley bow (cigar box guitar) --  and carefully chosen personal anecdotes of his encounters with senior musicians across the South, Ainslie explores the African and European roots of American music and culture, bringing the musical history of America alive.  www.cattailmusic.com", "url": "https://www.facebook.com/events/506775856161991/", "date": "2016-04-15T20:00:00-04:00"}, {"source": "Facebook", "name": "Frontier Ruckus w/ Matt Jones & Bonzo 4/15/16 at Blind Pig - Ann Arbor", "description": "frontier ruckus w/ Matt Jones & Bonzo live at the Blind Pig on Friday, April 15th!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/663", "url": "https://www.facebook.com/events/149342562122588/", "date": "2016-04-15T21:00:00-04:00"}, {"source": "Facebook", "name": "BRITES \\\\ Sonny Dulphi \\\\ Harison Zamperla \\\\ Heaven \\\\ CJ Rene \\\\ DJ Joon The Monsoon", "description": "The burly, the girly, the otherworldly. Vibe out with us this Friday...\n\nBRITES\n\nSonny Dulphi\nhttps://soundcloud.com/rill-ill/sonny-dulphi-joon-chickenfriedrice-instrumental\n\nHarison Zamperla \nhttps://www.youtube.com/watch?v=m7qKsN5qIHA\n\nHeaven\nInsta: heavenly.jones \n\nCJ Rene\nhttps://soundcloud.com/louispicasso/coolaxrmx\n\nDJ Joon The Monsoon\nhttps://www.youtube.com/watch?v=1pxHdDpT6_Y\n\nPop up shop from Takin All Bets\n\n9pm doors | 18 and up welcome | $5\n\nClub Above\n215 N Main Street\nDowntown Ann Arbor", "url": "https://www.facebook.com/events/1716657651907307/", "date": "2016-04-15T21:00:00-04:00"}, {"source": "Facebook", "name": "A Pointless Display of Improvised Feats", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring Corene Ford, Erik Heilner, Matt Swartz, Mitch Socia, and Jason Valentini", "url": "https://www.facebook.com/events/1033648280028364/", "date": "2016-04-15T22:00:00-04:00"}, {"source": "Facebook", "name": "Turtle Survey Training & Kick-off", "description": "At least 6 species of turtles live and nest in the city, maybe more! Help us protect nest sites, monitor populations, and look for turtles in habitats along the river and creeks! We’ll cover species identification, nest monitoring, and how to report your turtle observations. This training will be indoors. Please register by April 14. For more information or to register call NAP 734.794.6627, or send us an email at NAP@a2gov.org.", "url": "https://www.facebook.com/events/210256089347134/", "date": "2016-04-16T02:30:00-04:00"}, {"source": "Facebook", "name": "Little Peeps PlayGround - \"Farm\"", "description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "url": "https://www.facebook.com/events/1574774672850185/", "date": "2016-04-16T10:30:00-04:00"}]