[{"source": "Facebook", "date": "2016-03-29T20:00:00-04:00", "name": "Babo Irish Week", "description": "Come celebrate Irish week here at babo!\n\nWe will be offering 10% off all green juices, Irish lattes, and beer on draft. \n\nAnd don't forget about our delicious Irish food specials!\n\nSee our menu below!\n\nHowever, you will be celebrating we have options for you!\n\nBABO IRISH WEEK\nMonday, March. 14th –Sunday, Mar. 20th\n\nFOOD SPECIALS\n\nSANDWICH OF THE WEEK\n\nCORNED BEEF SANDWICH\ncrust bakery rye, housemade corned beef, braised cabbage slaw, whole grain mustard, swiss cheese\n\nENTREE OF THE WEEK\n\nRYE-CRUSTED CORNED BEEF\nbraised corned beef with toasted caraway, crust bakeries rye bread crumbs, topped with rich caraway gravy\n\nVEGETARIAN ENTREE OF THE WEEK\n\nBRAISED CABBAGE\nslow braised cabbage, onion, and tomatoes seasoned with garlic, onion, thyme, and fennel seed\n\nFEATURED SIDES\n\nROSTI POTATOES\nshredded potato pancake filled with roasted shallots, thyme, and cheddar cheese\n\nROASTED ROOT VEGETABLE MEDLEY\ncarrots, parsnips, turnips, fennel, garlic, thyme, and Guinness stout glaze", "url": "https://www.facebook.com/events/1581383522183183/"}, {"source": "Facebook", "date": "2016-03-30T07:00:00-04:00", "name": "Impact Day benefiting Ann Arbor YMCA", "description": "When you shop on this day, we'll give 10% of our sales to Ann Arbor YMCA to help them create their next Learning Garden. Start making your list and stock up to support wellness and sustanability in our community!", "url": "https://www.facebook.com/events/1738849703012983/"}, {"source": "Facebook", "date": "2016-03-30T18:00:00-04:00", "name": "TheRide’s ServiceFest", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "url": "https://www.facebook.com/events/1562324927414210/"}, {"source": "Facebook", "date": "2016-03-30T19:00:00-04:00", "name": "Aventura March Madness", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/"}, {"source": "Facebook", "date": "2016-03-31T19:00:00-04:00", "name": "Third Anniversary Reading", "description": "Join us as we celebrate our third birthday! As on our previous anniversary parties, In the spirit of donating and giving back, all book sales throughout the day will benefit SafeHouse Center, a non-profit organization dedicated to ending domestic violence and sexual assault in Washtenaw County, Michigan.\n\nAdditionally, we'll be hosting a reading from friends & family, featuring the work of former Literati booksellers Russ Brakefield and Tom McCartan, current Literati booksellers John Ganiard, Mairead Small Staid, Sam Krowchenko, and Gina Balibrera, and our dear friend Ray McDaniel. \n\nThis event is free and open to the public.\n\nGina Balibrera is a graduate of the Helen Zell Writers' Program and was a Zell Postgraduate Fellow in Prose. Gina lives in Ann Arbor, where she works at a bookstore, teaches writing, and is finishing a novel set in 1930s El Salvador, Hollywood, and France.\n\nRussell Brakefield received his MFA in poetry from the University of Michigan's Helen Zell Writers' Program. He lives in Ann Arbor where he teaches writing at the University of Michigan and works as the managing editor for Canarium Books. His most recent work appears in The Southern Indiana Review, Hobart, and Language Lessons: An Anthology by Third Man Records. He is currently an artist in residence with the University Musical Society. \n\nJohn M. Ganiard lives and works in Ann Arbor (Michigan, USA). \n\nSam Krowchenko's writing has appeared in Salon, Michigan Quarterly Review, and Full Stop.\n\nTom McCartan used to work at LIterati. He's had stories published in Unsaid, Hobart, and some other places. He also used to work at Melville House. Once he even at a music show at Literati, to which he brought a case of beer.  \n\nMairead Small Staid is a poet and essayist whose work can be found in AGNI, The Believer, The Georgia Review, Kenyon Review, Narrative, Ninth Letter, and Ploughshares, as well as online at The Awl, The Hairpin, Jezebel, and The Point.\n\nRaymond McDaniel is the author of Special Powers and Abilities, Saltwater Empire and Murder (a violet), a National Poetry Series selection. His writing appears in many magazines and in the anthology American Poets in the 21st Century. Born in Florida, McDaniel now lives in Ann Arbor, teaches at the University of Michigan, and writes for The Constant Critic.", "url": "https://www.facebook.com/events/646155202190028/"}, {"source": "Facebook", "date": "2016-03-31T19:30:00-04:00", "name": "American Ballet Theatre: The Sleeping Beauty", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/"}, {"source": "Facebook", "date": "2016-04-01T18:00:00-04:00", "name": "ART NOW 2016: New Directions in Contemporary Photography: Exhibition Opening", "description": "Join us for the opening reception and award announcement for ART NOW: PHOTOGRAPHY on Friday, April 1st, from 6 to 9 pm. \n\nThe exhibition is free and open to the public daily from April 1st to May 14th.\n\n------------------------------\nFeatured Artists: \n\nJim Aho • Christine Atkinson • Philip Augustin • Janet Baugher • Cecilia Borgenstam • Seder Burns • Lorraine Castillo • Brittney Denham • Alexander Diaz • Jennifer Eason • Steven Edson • Sean Fox • Marco Garabello • Phil Gilchrist • Juan Giraldo • Sarah Grew • Richard Haley • Christian Hendricks • Lori Hepner • Ethan Jones • Lori Kella • Horace Kerr II • Dean Kessmann • Chrissy LaMaster • Stephanie Lehr • Wen Hang Lin • Matthew Moore • Sarah Palmeri • Kanthy Peng •David Quinn • Chris Ridgway • John Sanderson • Lisa Shaw • Harry Umen • Tracy Wascom • Christina Washington\n\n-------------------------------\n\nThe Ann Arbor Art Center is pleased to present the 2nd annual exhibition in its Art Now Series, Art Now: New Directions in Contemporary Photography, juried by Millee Tibbs. Each year, on a rotating basis, the Ann Arbor Art Center presents a media-focused exhibition as part of the series. We are pleased to present this year's exhibit which features innovative work in photography.\n\nContemporary photography in America is at an exciting and transitory moment. Since the advent of digital photography, the medium has continued to shapeshift into an increasingly inclusive art form. It has been estimated that around 1.4 billion photographs are taken every day, and even more “photographs” can be created by using scanners or creating photographic elements in digital software.\nSome photographic artists continue to use photography in traditional ways: to capture and record the actual world. From the most news-worthy events to the smallest domestic moments, the strength of these images is reliant on the perceptiveness and timeliness of the photographers making them. Other photographic artists create complicated digital collages that bear many similarities to painting. By removing the necessity of photography to show the thing itself, these artists can create constructed scenes within a photograph that never existed in the physical world. To complicate the medium further, the last several decades have produced a resurgence of photographs created through historic processes like cyanotype and wet collodian. Defining what photography is and what a photograph looks like has never been more challenging.\n\nWhile the world is currently experiencing an overflow of photographic images, what makes a photograph successful has stayed relatively unchanged. ART NOW: PHOTOGRAPHY highlights photographic artists that are able to use the world as a raw material to communicate their own visions and experiences. While the processes may vary significantly, this exhibition highlights innovative artists working in photography whose practices shapes what Photography is in 2016.\n-----------\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC", "url": "https://www.facebook.com/events/1716244898615592/"}, {"source": "Facebook", "date": "2016-04-01T18:30:00-04:00", "name": "Dig In: Mariachi Vargas de Tecalitlán", "description": "Sponsored by the University of Michigan Credit Union, Arts & Eats: Dig In with UMS is a $15 ticket package deal that includes a great seat at the performance, exclusive access to a pre-show dinner, and a fun activity to get you thinking about the performance in a whole new way. You can pick up your tickets for the show at the Arts & Eats event.\n\nMore info about Mariachi Vargas de Tecalitlán : http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan/\n\nMore about Dig Ins: http://ums.org/tickets/students/", "url": "https://www.facebook.com/events/1667725740151395/"}, {"source": "Facebook", "date": "2016-04-01T19:30:00-04:00", "name": "American Ballet Theatre: The Sleeping Beauty", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/"}, {"source": "Facebook", "date": "2016-04-01T20:00:00-04:00", "name": "Mariachi Vargas de Tecalitlán", "description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "url": "https://www.facebook.com/events/453190221522442/"}, {"source": "Facebook", "date": "2016-04-01T20:00:00-04:00", "name": "Pointless Improv with Koala Yummies and Presto Change-o", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Koala Yummies\" starring Emily Engelhart and Jacob Russell\n\nGroup 2: \"Presto Change-o\" starring Chris DiAngelo, Matt Naas, Erik Heilner, Tim Kay, and James Quesada\n\nGroup 3: \"The League of Pointless Improvisers\" starring Arthur Brannon, Matt Swartz, Heather Sejnowski, and Aaron Johnstone", "url": "https://www.facebook.com/events/206519116384351/"}, {"source": "Facebook", "date": "2016-04-01T20:00:00-04:00", "name": "Tom Chapin at  Green Wood Coffee House", "description": "In a career that spans 23 albums and includes three Grammy awards, Tom Chapin has covered a lot of creative ground. In addition to his work as a recording artist and concert performer, Chapin has acted on Broadway and worked in films, television and radio. Tom grew up in a family that encouraged artistic pursuits. He began performing professionally as a teenager in the early 1960s, playing in Greenwich Village folk clubs alongside his siblings, Harry and Steve, as one of The Chapin Brothers. In 1971, he began a five-year run as the host of the ABC-TV children's series, \"Make A Wish.\" Chapin and his songs were also featured in the 1970 documentary film, \"Blue Water, White Death,\" for which he spent six months sailing the Indian Ocean searching for great white sharks.\n\nAs a music-maker, Chapin has maintained two parallel careers, as a highly respected contemporary folk artist and as a pioneer in the field of children's music. In the former role, Chapin has established a reputation for insightful, heartfelt songcraft and charismatic live performances. In the latter, he continues to engage the hearts, minds and imaginations of young listeners with witty, life-affirming original songs delivered in a sophisticated array of musical styles. Chapin's infectious songs, sterling musicianship and personal warmth shine, whether he's performing on record or in a concert hall, an outdoor festival, a school, in front of a symphony orchestra, or in an intimate coffeehouse. www.tomchapin.com", "url": "https://www.facebook.com/events/1713063788906616/"}, {"source": "Facebook", "date": "2016-04-01T22:00:00-04:00", "name": "A Pointless Display of Improvised Feats", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring: Emily Engelhart, Jacob Russell, Arthur Brannon, Matt Swartz, Heather Sejnowski, and Aaron Johnstone", "url": "https://www.facebook.com/events/1553242625005947/"}, {"source": "Facebook", "date": "2016-04-02T10:30:00-04:00", "name": "Little Peeps PlayGround - \"Weather\"", "description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "url": "https://www.facebook.com/events/428722070669780/"}, {"source": "Facebook", "date": "2016-04-02T19:00:00-04:00", "name": "James Stevens & Ralph Nelson: Digital Vernacular", "description": "Literati is pleased to welcome James Stevens and Ralph Nelson for a discussion of their book Digital Vernacular: Architectural Principles, Tools, and Processes.\n\nDigital Vernacular addresses the why and how of digital fabrication in hundreds of step-by-step color images, illuminating a set of working principles and techniques that join theory with practice. Authors James Stevens and Ralph Nelson reconcile local traditions and innovations with globally accessible methods and digital toolsets. By combining ethics with hardware, the book will root you in the origins of making, ensuring a lasting and relevant reference for your studio practice.\n\nThe book opens with the origins and principles of the digital vernacular, then outlines digital vernacular tools including computer numerically controlled (CNC) mills, laser cutters, and 3D printers. You'll even learn to create your own digital fabrication tools out of inexpensive materials. The book concludes with the processes of the digital vernacular, including techniques for removing, joining, forming, and adding.\n\nA companion website at make-Lab.org hosts additional step-by-step processes and project outcomes.\n\nJames Stevens is an Associate Professor and the Director of makeLab, a digital fabrication studio in the College of Architecture and Design at Lawrence Technological University in Michigan, USA.\n\nRalph Nelson is an Associate Professor in the College of Architecture and Design at Lawrence Technological University and Principal of Loom, a collaborative design practice, based in Ann Arbor, Michigan, USA.", "url": "https://www.facebook.com/events/638399229645848/"}, {"source": "Facebook", "date": "2016-04-02T21:00:00-04:00", "name": "185668232 & Beta Max (ON TOUR) w/ Watabou & Public Shaming", "description": "TOURS COLLIDE!\n\nFar House has not one, but two awesome touring acts, traveling separately and touching down in our space for one night only!\n\n185668232 (Philadelphia, PA)\nhttp://www.185668232.org/\n\n185668232 is one brOKen a-neuro-typical, a-gender, a-political individual using their SSN to demonstrate thee <# liberation of Polyversal condition via 'poeticalogic,' sub-syncopated field-recordings, free-improvisation, instruments/non-instruments, processed live by sample-machine-work-stations, software, effect processors, megaphone, DiY inventions, crowd participation + zZz to deliver timeless abstract-avant-activist-audio-alchemy, breaching ∞ genre/astral planes before glitched-3D video projections. ||:♭\n\n\nBeta Max (Cincinnati, OH)\nhttps://www.youtube.com/watch?v=NmmLdP5L6-8\n\nExperimental hip-hop from one half of Chemical Committee (REALICIDE Youth Records).\n\n\nWith local support by:\n\nWatabou (Ann Arbor, MI)\nhttps://watabou.bandcamp.com/\n\nWatabou is the solo electronic project from the mind of multi-instrumentalist Travis Jarosz. With his blend of intelligence and raw power, Watabou aims to evoke the emotions of any audience to the utmost, be it through intensive melodies, driving rhythms, powerful words, or any other number of qualities attributed to the act.\n\n\nPublic Shaming (Detroit, MI)\nhttp://www.discogs.com/artist/1141217-Thom-Elliott\nhttps://soundcloud.com/mephisto_waltz\n\nPublic Shaming is Thom Elliott & Jake Ruppert's latest cold wave/death industrial project. It combines anguished vocals over lurching, decrepit polyrhythms, tape loops and complex synth textures. PS is an attempt to communicate a visceral sonic encounter with the Void.\n\n\n$5 suggested donation for our out-of-town friends.\n\nDoors at 9, with music starting at 10.\nSHOW UP ON TIME!\n\nRespect the house and the artists.\nThis is a music event, not a house party.\nEngage and participate.", "url": "https://www.facebook.com/events/966605056760158/"}, {"source": "Facebook", "date": "2016-04-03T17:30:00-04:00", "name": "Lindsay Straw & Caroline O'Shea- In Concert", "description": "Strayaway Child Concert Series is proud to present: Lindsay Straw & Caroline O'Shea in concert!\n\nSunday, April 3, 2016\nConor O'Neill's Celtic Room\nDoors 5pm \nShow 5:30pm\nGeneral Admission: $15\nStudents: $12\nKids under 10- Free\n\nLindsay Straw is a singer, guitarist, and Irish bouzouki player who performs traditional songs and tunes from the British Isles. Originally from Montana, she began to explore Boston’s Irish and folk music scenes while studying film scoring at Berklee College of Music. Her debut solo album My Mind From Love Being Free was released on May 1, 2015. She is a 2015 recipient of Club Passim's Iguana Fund Grant, which will enable her to make her second album in 2016.\n\nLindsay has impressed with her tender singing voice and an extensive repertoire that is rooted in the Scottish and Northern Irish traditions, but which also delves into contemporary songwriters like Richard Thompson and Bob Dylan. She has also drawn praise for her sensitive, agile accompaniment on bouzouki and guitar at many a local session and in concert as a member of the Irish quartet The Ivy Leaf, with piper Joey Abarta, and with fellow guitar & bouzouki player Owen Marshall.\nhttp://www.lindsaystraw.com/\n\nCaroline O’Shea is from Milton, MA, and has played the Irish flute and tin whistle since she was a child. As a teenager, she competed in the All-Ireland championships for four years in a row in Letterkenny, Co. Donegal and in Tullamore, Co. Offaly. She received her TTCT Diploma—a week-long certification course in Dublin for teaching traditional Irish music—in 2016, and has taught for Boston’s branch of Comhaltas Ceoltoiri Eireann (Irish music school); at the Killarney School of Music in Killarney, Co. Kerry; at the Milton Art Center; and at the Irish Cultural Centre of New England, in addition to private lessons. Caroline currently plays in a duo with singer Lindsay Straw, and plays flute, whistles, and sings with traditional Irish group The Ivy Leaf. In addition to playing flute and whistle, Caroline was recently awarded a grant from the MA Cultural Council to study the uilleann pipes with master piper Joey Abarta.\n\nSince 2010, Caroline has played flute, whistles, and sung with traditional Irish group The Ivy Leaf. Their debut CD of tunes and songs The Ivy Leaf: Traditional Irish Music was released in 2012. She plays at festivals and events with Boston-based band Devri as well, and played low and high whistles on the band’s debut CD Broad Street in 2012.\nhttps://cosheamusic.wordpress.com/", "url": "https://www.facebook.com/events/1685542291727910/"}, {"source": "Facebook", "date": "2016-04-03T19:00:00-04:00", "name": "Aventura March Madness", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/"}, {"source": "Facebook", "date": "2016-04-03T19:30:00-04:00", "name": "American Ballet Theatre: The Sleeping Beauty", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/"}, {"source": "Facebook", "date": "2016-04-04T17:30:00-04:00", "name": "TheRide’s ServiceFest", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "url": "https://www.facebook.com/events/1032406803469486/"}, {"source": "Facebook", "date": "2016-04-04T19:00:00-04:00", "name": "Desiree Cooper", "description": "Literati is delighted to welcome Desiree Cooper in support of her debut, Know the Mother.\n\nWhile a mother can be defined as a creator, a nurturer, a protector—at the center of each mother is an individual who is attempting to manage her own fears, desires, and responsibilities in different and sometimes unexpected ways. In Know the Mother, author Desiree Cooper explores the complex archetype of the mother in all of her incarnations. In a collage of meditative stories, women—both black and white—find themselves wedged between their own yearnings and their roles as daughters, sisters, grandmothers, and wives.\n\nIn this heart-wrenching collection, Cooper reveals that gender and race are often unanticipated interlopers in family life. An anxious mother reflects on her prenatal fantasies of suicide while waiting for her daughter to come home late one night. A lawyer miscarries during a conference call and must proceed as though nothing has happened. On a rare night out with her husband, a new mother tries convincing herself that everything is still the same. A politician’s wife’s thoughts turn to slavery as she contemplates her own escape: \"Even Harriet Tubman had realized that freedom wasn’t worth the price of abandoning her family, so she’d come back home. She’d risked it all for love.\" With her lyrical and carefully crafted prose, Cooper’s stories provide truths without sermon and invite empathy without sentimentality.\n\nKnow the Mother explores the intersection of race and gender in vignettes that pull you in and then are gone in an instant. Readers of short fiction will appreciate this deeply felt collection.\n\nA 2015 Kresge Artist Fellow, Desiree Cooper is a former attorney, Pulitzer Prize-nominated journalist and Detroit community activist whose fiction dives unflinchingly into the intersection of racism and sexism. Using the compressed medium of flash fiction, she explores intimate spaces to reveal what it means to be human. Her fiction and poetry have appeared in Callaloo, Detroit Noir, Best African American Fiction 2010, and Tidal Basin Review, among other online and print publications. Cooper was a founding board member of Cave Canem, a national residency for emerging black poets. She is currently a Kimbilio fellow, a national residency for African American fiction writers.", "url": "https://www.facebook.com/events/910013872430895/"}, {"source": "Facebook", "date": "2016-04-04T20:00:00-04:00", "name": "Babo Irish Week", "description": "Come celebrate Irish week here at babo!\n\nWe will be offering 10% off all green juices, Irish lattes, and beer on draft. \n\nAnd don't forget about our delicious Irish food specials!\n\nSee our menu below!\n\nHowever, you will be celebrating we have options for you!\n\nBABO IRISH WEEK\nMonday, March. 14th –Sunday, Mar. 20th\n\nFOOD SPECIALS\n\nSANDWICH OF THE WEEK\n\nCORNED BEEF SANDWICH\ncrust bakery rye, housemade corned beef, braised cabbage slaw, whole grain mustard, swiss cheese\n\nENTREE OF THE WEEK\n\nRYE-CRUSTED CORNED BEEF\nbraised corned beef with toasted caraway, crust bakeries rye bread crumbs, topped with rich caraway gravy\n\nVEGETARIAN ENTREE OF THE WEEK\n\nBRAISED CABBAGE\nslow braised cabbage, onion, and tomatoes seasoned with garlic, onion, thyme, and fennel seed\n\nFEATURED SIDES\n\nROSTI POTATOES\nshredded potato pancake filled with roasted shallots, thyme, and cheddar cheese\n\nROASTED ROOT VEGETABLE MEDLEY\ncarrots, parsnips, turnips, fennel, garlic, thyme, and Guinness stout glaze", "url": "https://www.facebook.com/events/1581383522183183/"}, {"source": "Facebook", "date": "2016-04-04T21:00:00-04:00", "name": "Chairlift 4/4/16 at Blind Pig - Ann Arbor", "description": "Monday, April 4 | 9pm | 18+ | $13 adv./ $15 day of\n\nChairlift wsg Starchild & The New Romantic\n\nCritically acclaimed pop duo Chairlift has released new music in the form of the infinitely danceable “Ch-Ching.” The R&B laced, vibrating drum infused pop track serves as the first musical offering from their forthcoming album Moth, which will be released in January 2016 via Columbia Records. Although the single is the first work to be released from Chairlift in three years, the duo – comprised of writer/producers and multi-instrumentalists Caroline Polachek and Patrick Wimberly – has hardly been quiet. They collaborated with Beyoncé on her groundbreaking self-titled album via the track “No Angel,” which was written and produced by Caroline and co-produced by Patrick. Caroline released and toured Arcadia, a self-produced solo album under the alias Ramona Lisa and collaborated with SBTRKT, Blood Orange and others, while Patrick produced and collaborated with artists such as Solange Knowles, Wet, Kelela, and Tei Shi.\n\nAn evolution from their last album, 2012’s Something, Moth proves to be an emotionally uninhibited and markedly stronger, more pop inspired body of work. A very New York City inspired album, listeners can expect to be led through an aural mix of big, rich pop inspired hooks, vibrating bass, lively brass and sensuous R&B inspired vocals, all anchored in the duo’s meticulously crafted instrumentation.", "url": "https://www.facebook.com/events/162598590780251/"}, {"source": "Facebook", "date": "2016-04-05T19:00:00-04:00", "name": "Acoustic Tuesdays: Bob Skon", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nAPRIL\n\n-          April 5 - Bob Skon \nhttp://bobskon.com/\n\"Bob is a musician best described in the singer / songwriter style, blended with a healthy dose of folk-rock, and a touch of jazz.... He has a wonderful ability to use intelligent wordplay for capturing those moments in life we can all identify with. In this Bob could be a peer of the legendary Ray Davies.\" - The Bodhisattva Beat\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1658487314415325/"}, {"source": "Facebook", "date": "2016-04-05T19:00:00-04:00", "name": "Meet Debut Novelist Lisa Beazley for a Discussion & Signing for 'Keep Me Posted'", "description": "Sisters Cassie and Sid Sunday have not done a bang-up job of keeping in touch. In their defense, it hasn’t been easy: life veered in sharply different directions for the once-close sisters. Today, beautiful and big-hearted Sid lives an expat’s life of leisure in far-off Singapore, while harried, iPhone-clutching Cassie can’t seem to make it work as a wife and a mom to twin toddlers in Manhattan. \n \nIt doesn’t help that Sid spurns all social media while Cassie is addicted to Facebook. So when Sid issues a challenge to reconnect the old-fashioned way—through real, handwritten letters—Cassie figures, why not? \n \nThe experiment exceeds both of their expectations, and the letters become a kind of mutual confessional that have real and soul-satisfying effects. And they just might have the power to help Cassie save her marriage, and give Sid the strength to get her life back on track.\n \nBut first, one of Cassie’s infamous lapses in judgment comes back to bite her, and all of the letters wind up the one place you’d never, ever want to see them: the Internet…\n\nLisa Beazley has worked in journalism and public relations for more than fifteen years.", "url": "https://www.facebook.com/events/1528777447422865/"}, {"source": "Facebook", "date": "2016-04-05T19:00:00-04:00", "name": "Intro 1: Welcome to Improv", "description": "Learn the fundamentals of improvisation, basic games, scene work and skills. Get used to being on stage and working with others in safe, supportive environment. For ages 18 and up. Every Tuesday for 8 weeks. \n\nDeadline to enroll is April 1.", "url": "https://www.facebook.com/events/205371939823376/"}, {"source": "Facebook", "date": "2016-04-05T20:00:00-04:00", "name": "Run River North w/ The Lighthouse & The Whaler 4/5/16 @ Blind Pig - Ann Arbor", "description": "Tuesday, April 5 | 8pm | 18+ | $12 Cover\n\n“During the writing of Drinking From A Salt Pond, the band admits to flaring tempers and tense operations as they worked to redefine their sound, goals, and relationships…”\n\nRun River North will be the first to tell you: it has largely been an uphill climb for the indie rock sextet from Los Angeles, a hero’s journey full of odds-defying opportunities seized amidst rocky naysayers and the snagging brambles of band life. And now, with their second full-length album Drinking From A Salt Pond, Run River North are poised to push forward and create their own wake as a major voice in today’s music landscape.\n\nSince the band’s beginnings just over four years ago, their rise has been steadily spectacular, marked by appearances on national television, sold-out shows at historic venues, tours with rock and roll royalty and heaps of praise from fans and critics alike. As they blossomed, they embraced their initially folk-driven sound, which found its harmonic home alongside rootsy, foot stomping, sing-along-leading peers like Mumford & Sons, The Head and the Heart, and Of Monsters and Men. Powered by the acoustic-guitar-and-vocals songwriting of frontman Alex Hwang, their 2014 self-titled debut record, produced by Phil Ek (Fleet Foxes, Modest Mouse, Band of Horses), was released with their lineup rounded out by the strings duo of Daniel Chae and Jennifer Rim, Joe Chun on bass, Sally Kang on keys, and John Chong on drums.\n\nAs time and tours passed, the six lives spent in close-quarters began to grind the gears a little differently; their whole dynamic began to change. “When we became a band, we mostly played Alex’s songs in band form,” says Chae. “Since then we’ve all put our musical input into it, so the music has changed a lot.”\n\n“We were tired of me on acoustic guitar and everybody singing harmonies,” says Hwang. “We were hitting a ceiling, and it wasn’t fun. We had always agreed this band was six-ways, for better or worse. So at the end of last year, after being in the van constantly, we said, ‘no more touring, let’s write new songs.’”\n\n“We had to grow up pretty fast as a band,” says Chong. “So this past year, there were times when different perspectives and priorities have butted heads.”\n\nDuring the writing of Drinking From A Salt Pond, the band admits to flaring tempers and tense operations as they worked to redefine their sound, goals and relationships. “We’ve had a lot of hating each other, almost kicking people out of the band,” says Hwang. “We’re being honest and that openness is one of the main thrusts for the album. Embracing the bitter with the sweet, not trying to hide the crappy parts…the crappy parts helped make the good.” Being open about its faults, the band recognizes how the turmoil has helped Run River North create something beautiful.\n\n“The record we just made, it’s all the difficult stuff we went through so there’s a darker tone to the music. It works,” says Chae.\n\nOne of the first steps in leaving behind their folk roots was to work with new collaborators. Instead of the reverb-heavy, northwest sound of Ek, they recorded in Los Angeles with Lars Stalfors (Cold War Kids, HEALTH, Deap Vally, Matt and Kim) at the production helm. Stalfors opened their eyes to the upbeat energy and electric tone of indie bands like The Walkmen. Throughout Salt Pond the indie rock influence can be heard, with the band nodding inspiration to everyone from Cage the Elephant and Kings of Leon to The National, Death Cab for Cutie, and Cold War Kids, whose studio in San Pedro, CA the band borrowed to make the album. Also, in a move encouraged by their record label, Nettwerk, Hwang and Chae were sent to Nashville for a week in April 2015 to work on a few new tracks with two different co-writers, Lincoln Parish (formerly of Cage the Elephant) and the Kings of Leon collaborator Nick Brown.\n\n“It was weird but at the same time it was really encouraging,” says Hwang of the co-writing. “It was like bringing our demos to a blind date.”\n\nThe first song from the Nashville sessions was “Run Or Hide,” co-written with Parish, and from first listen it’s clear that Run River North are exploring bombastic new territory. Hwang, Chae, and Parish came up with an organic way of working that was based on jamming and vibing together, and once the song’s melody was nailed down, the rest came easily. It was immediately hard-hitting than any previous song from the band, with a discernible strut serving as a sonic contrast. When the demo was sent home to LA, the rest of the band was shocked.\n\n“Almost everyone else was really scared,” says Hwang, “‘this is not your voice, this is not who we are.’ I was confident it was a really good song and that we were gonna keep it. There’s nothing more aggressive on the record, and that groove on the verses is bigger than the band. The band can’t contain the song.”\n\n“I loved it!” says Chong emphatically. “Alex has a very wide range of emotion when he sings—soft, whispery things; really bombastic; rough—this song showcases all of that. I got really excited. When we recorded it, it really showcases more groove. Joe, our bass player, is solid, and the way the melody is created in the verses really adds to that. There’s a really cool contrast happening, but the choruses hit hard.”\n\nThe other song written in Tennessee was the Nick Brown co-penned “Can’t Come Down,” a track with pop qualities that the band does not shy away from recognizing. For that they leaned on Brown heavily, who served almost as a mentor to Hwang and Chae during the sessions, teaching them about pop hooks, authenticity, and Southern tradition. Deciding to go all in on a pop song, the trio rallied behind Brown’s catchy melodies and licks, and what they ended up with is a happy medium that “still sounds as Run River North as possible,” according to Chong, while simultaneously reaching for the rafters.\n\n“We really gelled with Nick Brown,” says Hwang. “We had the same idea: ‘We have enough songs that exemplify us, so let’s try our hand at writing a pop hook.’ With that mentality we came up with ‘Can’t Come Down.’ Nick wrote the hook, Daniel and Nick wrote the music, and a heavy collaboration on lyrics from everyone. It’s the first song I ever sang the word ‘baby’ in.”\n\nWith those songs firmly planting the band’s flag in new ground, it is Hwang’s “29” that may be the best indicator of the band Run River North are becoming. A piano and drum fueled anthem examining the ups and downs of transition, it finds the singer posing multiple existential questions at once. “Everyone’s always talking about how if you will something, it’s gonna happen. But, sometimes it doesn’t!” says Hwang. “That was a realization I wanted to play with: ‘Your words are cold like the wind…’ It’s kind of like saying, ‘I don’t care what you think,’ but it’s also a reflection about my words. What I do can be just as insignificant as anyone else. So what are you gonna do about it? You’re 29. ‘I know it’s home, I know it hurts/I know I’ll end up at the bottom/What if I leave?’ What if we go on this tour and we don’t end up anywhere? The brutal question is, who cares, and why does it matter? Not answering that in the song really helps. The music is still upbeat, it still has the ‘oh’s’ going on, it’s an anthemic thing. I’m still energetic, I’m not some old dude at 29.”\n\n“29” was written on electric guitar, a tool Hwang has been using more frequently since the end of the debut album’s touring cycle. Originally intended for a more somber feel, at the suggestion of their producer Stalfors, the tempo rose to meet Hwang’s intonations. “It became this song with so much energy,” says Chong, “it’s probably the fastest song we’ve ever done as a band. It’s new territory for us; it’s very fun. It’s a good transition, with lulled verses and really upbeat instrumentals and choruses. This is a good appetizer for our old fans, as this is who we’ve become.”\n\nEmbracing their natural growth and learning to ride the waves of their personal and musical evolutions with open hearts and nimble hands, Run River North have created a sophomore album that will propel them to the forefront of today’s landscape. Although at times the rushing water of their rise will pool into depths tough to swallow, they have learned to lean on each other and to trust themselves along the way in order to make something lasting and truly beautiful.\n\n“From the start, we always said we wanted to play on the biggest stages possible,” says Hwang. “That’s still the same. But it isn’t some self-indulgent dream of becoming rock stars; we still want to support our families with this, we still have the parents that sacrificed for us and we want to honor them. For us as a band, at times it’s felt like we’ve been drinking from a salt pond—and yet, we still created something pretty fresh that we like and are proud of.”\n\nWSG: The Lighthouse and the Whaler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/634", "url": "https://www.facebook.com/events/629378653882823/"}, {"source": "Facebook", "date": "2016-04-06T19:00:00-04:00", "name": "Women's Hebrew Poetry on American Shores", "description": "Literati is pleased to present a roundtable discussion, in conjunction with the Jean & Samuel Frankel Center for Judaic Studies, to mark the publication of Women's Hebrew Poetry on American Shores: Poems by Anne Kleiman and Annabelle Farmelant.\n\nAlthough Anne (Chana) Kleiman—who died in 2011 at the age of 101—was the first American-born Jewish woman to publish poems in Hebrew, and Annabelle (Chana) Farmelant—who is still living and occasionally publishing—wrote a substantial body of Hebrew verse from the 1940s to the 1960s, their work is virtually unknown today, even to those familiar with Hebrew literature in America. The roundtable will discuss the singular voices of these women, introduce their captivating and wide--ranging poetry and place it in its historical, literary, and cultural contexts. The rountable will feature editor Shachar Pinsker, the translator Adriana Jacobs, Adina Kleiman (the daughter of the poet Anne Kleiman), and faculty from the Frankel Center who are experts on American Jewish Literature.", "url": "https://www.facebook.com/events/598128680341803/"}, {"source": "Facebook", "date": "2016-04-06T19:00:00-04:00", "name": "Meet Author Saadia Faruqi for a Discussion & Signing of 'Brick Walls: Tales of Hope & Courage From Pakistan'", "description": "Saadia Faruqi is a Pakistani American writer of fiction and nonfiction. She writes for a number of publications including Huffington Post and The Islamic Monthly about the global contemporary Muslim experience and about interfaith dialogue. She has trained law enforcement on cultural sensitivity issues and offers community college classes on a variety of topics related to Islam and Muslims. She is editor-in-chief of Blue Minaret, a magazine for Muslim art, poetry and prose. Her short stories have been published in several American literary journals and magazines such as Catch & Release,  On the Rusk, In Flight and The Great American Literary Magazine. “Brick Walls: Tales of Hope & Courage from Pakistan” is her debut fiction book. She is currently working on a novel based in Pakistan and the U.S. as well as a children’s book series.\n\n“Faruqi’s evocative collection is like a breath of fresh air as it breaks through all the clutter of violence, terrorism and fear, and offers much hope and faith in humanity despite the odds.” Kitaab book review.\n\n“Faruqi’s stories beautifully capture the similarities (of the human condition); her ambitious, flawed, raw characters are easy to relate to for any reader, regardless of ethnicity.” Brown Girl Magazine book review.\n\n“If you want to learn about the real Pakistan behind the headlines, this is a good place to start.” Bookmuse book review.", "url": "https://www.facebook.com/events/1677432605865426/"}, {"source": "Facebook", "date": "2016-04-06T19:30:00-04:00", "name": "American Ballet Theatre: The Sleeping Beauty", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "url": "https://www.facebook.com/events/1390173447979498/"}, {"source": "Facebook", "date": "2016-04-06T21:00:00-04:00", "name": "Gosh Pith | Gold Chain Tour 4/6/16 at Blind Pig - Ann Arbor", "description": "Wed. April 6 | 9pm | 18+ | $8 adv./ $10 day of\n\nGosh Pith - Gold Chain Tour\nWSG: Passalacqua, Obese Ghost Children & The Landmarks\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/653", "url": "https://www.facebook.com/events/166980353679332/"}, {"source": "Facebook", "date": "2016-04-07T19:00:00-04:00", "name": "University of Michigan's Creative Writing Graduates", "description": "The creative writing subconcentration in the English Department at the University of Michigan selects no more than 14 seniors each year to work with faculty and complete a creative thesis of poetry or fiction. These collections, the same size as many MFA theses, are first attempts to create book length manuscripts, and to prepare the writers for the work in the future. On April 7 hear 4 of this year's group -- poets Stephanie Choi and Meg Rattanni and fiction writers Alex Bernard and Moe Kolton -- read from their work.", "url": "https://www.facebook.com/events/645879305571374/"}, {"source": "Facebook", "date": "2016-04-07T19:00:00-04:00", "name": "Poto Chapter Meeting", "description": "We're changing things around a bit this year.  Our first chapter meeting of the year will be held at Wolverine Brewing at 7:00 p.m on Thursday, April 7th in the Gulo Room.  The address for Wolverine Brewing is: 2019 W Stadium Blvd, Ann Arbor, MI 48103. Location for future meetings are up in the air but we wanted to patronize Wolverine a bit more because of the incredible support they've given us the last couple of years.  We also want to be sensitive to some of the concerns we've heard about the location of the meeting in the past.  Wolverine gives us a slightly more centralized location to our geographically diverse membership and is very close to the highway.  \n\nAt this meeting we'll be discussing the status of and plans for Waterloo, of course.  We'll also give updates on new events (Brecfest, the Tri Chapter Challenge and Youth Riding Day) as well as talk about the 2016 schedule for all of our traditional events.  If you attend you'll be able to hear the latest about the new IMBA Associate Regional Director for Michigan and how this person will be focusing on advocacy for mountain biking across the state.  And, as usual, we'll give a quick overview of the status of the trails, talk about scheduled trail days and other plans for maintenance this year.\n\nHope to see you there!\n\nThe Poto Chapter Board", "url": "https://www.facebook.com/events/1736743313279010/"}, {"source": "Facebook", "date": "2016-04-07T19:00:00-04:00", "name": "Meet Author & Journalist Bryan Burrough for a Discussion of 'Days of Rage'", "description": "Bryan Burrough is a special correspondent at Vanity Fair magazine and the author of six books, including the No. 1 New York Times Best-Seller Barbarians at the Gate and his latest, Days of Rage. He is also a three-time winner of the prestigious Gerald Loeb Award for Excellence in Financial Journalism.\nBorn in 1961, Bryan was raised in Temple, Texas, and graduated from the University of Missouri School of Journalism in 1983. From 1983 to 1992 he was a reporter for The Wall Street Journal, where he reported from Dallas, Houston, Pittsburgh and, during the late 1980s, covered the busy mergers and acquisitions beat in New York. He has written for Vanity Fair since 1992.\nIn 1990 Bryan and John Helyar co-authored Barbarians, the story of the fight for control of RJR Nabisco. The book, which spent 39 weeks on the New York Times bestseller list, has been hailed as one of the most influential business narratives of all time. Bryan joined Vanity Fair in 1992, where he has reported from locales as diverse as Hollywood, Nepal, Moscow, Tokyo and Jerusalem.\n\nFrom the bestselling author of Public Enemies and The Big Rich, an explosive account of the decade-long battle between the FBI and the homegrown revolutionary terrorists of the 1970s\nThe Weathermen. The Symbionese Liberation Army. The FALN. The Black Liberation Army. The names seem quaint now, when not forgotten altogether. But there was a stretch of time in America, roughly between 1968 and 1975, when there was on average more than one significant terrorist act in this country every week, and the FBI combated these groups and others as nodes in a single revolutionary underground, dedicated to the violent overthrow of the American government.\n\nBenefiting from the extraordinary number of people from the underground and the FBI who speak about their experiences for the first time, Days of Rage is filled with important revelations and fresh details about the major revolutionaries and their connections and about the FBI and its desperate efforts to make the bombings stop. The result is mesmerizing and completely new—a book that takes us into the hearts and minds of homegrown terrorists and federal agents alike and weaves their stories into a spellbinding secret history of the 1970s.", "url": "https://www.facebook.com/events/970118143072822/"}, {"source": "Facebook", "date": "2016-04-08T12:30:00-04:00", "name": "Opening Day at Babo", "description": "Can't Make it to the city to celebrate Opening Day?\n\nJoin us on the patio at babo to cheer in the season! \n\nBringing the ballpark to you!\nWe'll be broadcasting the game live on the patio, grilling up game day favorites (See Menu below), and quenching your thirst all day long with happy hour pricing on beer, wine, and sangria.\n\nDon't be left in the outfield! \nMake Opening Day a home run for you and all your friends.\n\nNo Tickets Needed!\n\nGame Day Menu\nEnjoy one item from the grill, unlimited toppings, and two sides for $12-$14. \n\nFrom the Grill:\nBabo Burgers\nAll beef hotdogs\nLocally made Italian Sausage \n\nHot Item toppings:\nCaramelized onions\nRoasted mushrooms\nRoasted poblano peppers.\n\nCold Toppings:\nLettuce\nTomato\nRed onion\nHousemade pickles\nNew York Cheddar or Swiss Cheese\n\nSides:\nPear and Kale Salad \nParsnip Slaw\nGerman Potato Salad\nAvocado Slaw\nMacaroni and Cheese", "url": "https://www.facebook.com/events/1690979864475279/"}, {"source": "Facebook", "date": "2016-04-08T17:30:00-04:00", "name": "A Night OUT", "description": "A Night OUT is a social mixer for the LGBTQ* community at Necto Nightclub. This event helps raise money to run OUTFest and Pride Picnic - Washtenaw County's pride celebration and festival.\n\nPeople 18+ are encouraged to join us for a fun night, but also a reminder of the strength our community can have when we come together.\n\nSuggested donation of $5. All proceeds go toward OUTFest and Jim Toy Community Center.\n\nEntertainment, silent auction, drag, mixer, amazing local food, drinks, and contests! Come & enjoy! Stay the whole time, or just pop in for a bit. Friends and fun for all to enjoy.\n\nHere is a list of some of our silent auction contributors:\nThe Michigan Theater\nBlack Pearl\nThe Lunch Room\nSidetrack Bar and Grill\nThe M-DEN\nCafe Verde\nAnn Arbor Marriott\nRevel & Roll\nPlanet Rock\nVisit Ann Arbor! & Ypsi Real\n\na2outfest.com\njimtoycenter.org\nDonate to Jim Toy Center: http://www.jimtoycenter.org/#!donate/xl42w\n\nDirectly followed by Necto Pride with Latrice Royale from RuPaul's Drag Race.", "url": "https://www.facebook.com/events/1586066655048953/"}, {"source": "Facebook", "date": "2016-04-08T19:00:00-04:00", "name": "Poetry at Literati: Christopher Bakken, David Blair, & Cody Walker", "description": "Literati is pleased to welcome Christopher Bakken, David Blair, and Cody Walker to kick off our celebration of National Poetry Month. \n\nChristopher Bakken is department chair and Frederick F. Seeley Professor of English at Allegheny College. He is the author of the poetry collections After Greece and Goat Funeral. He is also co-translator of The Lions’ Gate: Selected Poems of Titos Patrikios, and the author of Honey, Olives, Octopus: Adventures at the Greek Table. Of Eternity & Oranges, Adam Zagajewski says: “This is a beautiful collection of poems: half-cryptic, half-open; half based on ancient myths, half on actual life. There’s almost always Greece as the backdrop, olives and the sea but also a human drama. Christopher Bakken proves that what’s ancient is also modern and vice versa. We live between times; only poetry can make it palpable.”\n\nDavid Blair is the author of two previous poetry collections. He teaches at the New England Institute of Art. Another book, Arsonville, is forthcoming. Of his most recent work, Friends with Dogs, Tom Sleigh says: “What gives weight and density to David Blair’s remarkable poems is their almost Hardyish sense of regret and loss. So many of his poems are little dramas of what wasn’t said when it should have been said, or of the way celebratory instincts get undermined by the pressures of day-to-day life. I admire the quick shifts in voicing, the way a whole social world becomes revealed in some small characteristic gesture, and how alert Blair is to other people. Very few poets ever achieve this kind of fellow feeling and write about it with such tact and intelligent sympathy.”\n\nCody Walker is the author of Shuffle and Breakdown and the co-editor of Alive at the Center: Contemporary Poems from the Pacific Northwest. His poems have appeared in The Yale Review, Parnassus, Slate, Poetry Northwest, The Hecht Prize Anthology, and the 2007 and 2015 editions of The Best American Poetry; his essays have appeared online in The New Yorker and The Kenyon Review. He lives with his family in Ann Arbor, where he teaches English at the University of Michigan. Of his latest, Mary Jo Salter says: “In Cody Walker’s The Self-Styled No-Child, the poet-father sings to his new baby (read ‘Cradle Song’ or ‘Small Suite’ for perfect little servings of delight), but his childlike playfulness has an internal source, too. The light verses in Walker’s new collection often have dark edges to them (see ‘The Garden’ or ‘We Hated Our Lives’), and his social and political satires are unflinching. Still, this word-wizard with a genius for rhyme reminds us of how irrepressibly joy remains.”", "url": "https://www.facebook.com/events/792881080812626/"}, {"source": "Facebook", "date": "2016-04-08T19:00:00-04:00", "name": "Aventura March Madness", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/"}, {"source": "Facebook", "date": "2016-04-08T20:00:00-04:00", "name": "Jerusalem Quartet", "description": "Friday, April 8, 2016, 8:00 pm\nRackham Auditorium \n\n“An absolute triumph. Their playing has everything you could possibly wish for.” (BBC Music) The Jerusalem Quartet’s confident energy and exquisite sensitivity have kept audiences on the edges of their seats since their UMS debut in 2005. \n\nMore info: http://ums.org/performance/jerusalem-quartet/", "url": "https://www.facebook.com/events/827290400697161/"}, {"source": "Facebook", "date": "2016-04-08T21:00:00-04:00", "name": "The Mountain Goats w/ William Tyler 4/8/16 @ Blind Pig - Ann Arbor", "description": "Friday, April 8 | 9pm | 18+ | $22 Adv./ $25 Day of\n\nthe Mountain Goats - One thing that happened this past year was at City Winery, in April, where we did a session down in the cellar between soundcheck and the show. We hadn’t really thought a whole lot about the session in advance—on tour, your default response to things is “let’s just show up and play”—and we were kind of under the gun time-wise when we got to the club. So we decided to just do it quick and dirty, old-school style. Like the open mic nights I used to play: unamplified guitar and vocals, friends with their axes playing along, arrangements arrived at on the fly and infinitely flexible. Four songs later we felt really inspired—me and Matt played a song or two without anybody else around because we’d gotten down to the basement before the others, the total song choice was strictly “what do you figure we should play now?”, the mood was relaxed and free…we loved it. Later that night, we decided to strip down the drum kit to essentials and play a choke-the-motor set echoing and elaborating on what we’d done downstairs: a sort of small-ensemble feel, lower in volume but actually higher in intensity. Like what we do in concentrate. It was one of our two favorite performances of the year, the other being the second night at the Fillmore. It felt like acres of new terrain opening up atop an ancient foundation. As soon as it was over, we all wanted to do it again. So in 2016 we’re taking that set on the road. Not that exact set, obviously; the particulars will vary from night to night. But smaller rooms, audible frequencies, up close and personal: this is the general plan. Making eye contact with people in the back row, being able to go off-mic when I want to and still be heard. Total visibility. We couldn’t be more excited about this tour. I love the big album release shows as much as anybody, but that City Winery feel of just playing together with bare essentials in close quarters…there’s nothing like it, and when the whole room locks onto the signal, it’s really special.\nWith: William Tyler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/581", "url": "https://www.facebook.com/events/554988117991170/"}, {"source": "Facebook", "date": "2016-04-09T15:00:00-04:00", "name": "Meet Local Author Melissa Grunow for a Discussion & Signing of Her Memoir 'Realizing River City'", "description": "Melissa Grunow is the author of Realizing River City: A Memoir (Tumbleweed Books, 2016). Her writing has appeared in Creative Nonfiction, River Teeth, New Plains Review, Blue Lyra Review, Temenos, and Yemassee, among many others. She is also a live storyteller who competes in Detroit's The Moth StorySLAM.  \n\nAn award-winning writer, Melissa was a semi-finalist for the 2015 DISQUIET International Literary Lisbon Writing Program, a Pushcart Prize nominee for her essay \"Home,\" a two-time recipient of the Detroit Working Writers creative nonfiction prize, and is featured in Poets & Writers  Directory of Writers. \n\nShe is a volunteer reader for Creative Nonfiction magazine, screening general submissions for publication and and editor for Grey Wolfe Publishing. She is a member of Detroit Working Writers, Michigan Writers, and the Association of Writers and Writing Programs (AWP).  \n\nMelissa holds a Bachelor of Science in English-creative writing and journalism from Central Michigan University, a Master of Arts in English from New Mexico State University, and a Master of Fine Arts in Creative Writing with distinction from National University.\n\nAt times, life can feel like a challenging feat of survival. Whether it’s living through abusive relationships or figuring out the complexities of what it means to be a woman searching for love, Realizing River City is a memoir that proves how despite the troubles we may face, there is hope in the way we continually risk ourselves in search for the life we want to live. In her poetic exploration of past relationships, Melissa Grunow’s honest words do not falter in the face of so much loss. Taking the rage we all feel about grief and pain, and funneling it into truth, beauty, and ultimately redemption on each page, Realizing River City is about discovering how the most important relationship is the one we have with ourselves.", "url": "https://www.facebook.com/events/1721699551382115/"}, {"source": "Facebook", "date": "2016-04-09T16:00:00-04:00", "name": "SOUND/SIGHT an ÆPEX Contemporary Performance", "description": "ÆPEX Contemporary Performance is proud to present SOUND/SIGHT, an immersive concert experience designed in collaboration with the Ann Arbor Art Center to accompany ART NOW: NEW DIRECTIONS IN CONTEMPORARY PHOTOGRAPHY. \n\nThe concert's program includes world premieres of Garrett Schumann's Moments, for string trio, and Spencer Arias' InTerLuDes, for solo flute, and will take advantage of the Art Center's unique gallery space to merge patrons' experiences of the music and the visual art.\n\nSOUND/SIGHT will feature performances by ÆPEX Artists Zan Berry, Erin Napier, and Tiffany Kang, as well as flutist Brice Smith of the Sphinx Symphony. The concert's program will be presented three times from 4-6 PM, with the performances beginning at:\n\n4:00 PM\n\n4:45 PM\n\n5:30 PM\n\nÆPEX will also be having an end-of-season/fundraiser party at the Beer Grotto immediately after (from 6-8 PM) feel free to join them! \n--------------------------------\nÆPEX Contemporary Performance was founded by conductor Kevin Fitzgerald and composer Garrett Schumann, ÆPEX Contemporary Performance is concert-presenting organization dedicated to bringing the world’s best new music to audiences in Ann Arbor and across Southeast, Michigan. Featuring five outstanding concerts, ÆPEX’s inaugural season includes six world premieres, daring and thoughtfully crafted programming, along with solo appearances by rising stars in the world of American contemporary music.\n\nTo stay connected to ÆPEX Contemporary Performance and learn more about its inaugural season, personnel, and future programming, follow us on Facebook and Twitter (@aepexcp). You can find infortmation about supporting ÆPEX's ambitious second season by visiting aepexcontemporary.org/support. \n \nÆPEX’s leaders are Artistic Director Garrett Schumann, Music Director Kevin Fitzgerald, and Development and Engagement Manager Spencer Arias.", "url": "https://www.facebook.com/events/1241585872576950/"}, {"source": "Facebook", "date": "2016-04-09T20:00:00-04:00", "name": "Flint Eastwood w/ Marcus Alan Ward, Jacob Sigman & The Timbre of Cedar 4/9/16 at Blind Pig - Ann Arbor", "description": "Sat. April 9 | 8pm | 18+ | $10 adv./ $12 day of\n\nFlint Eastwood with: Marcus Alan Ward, Jacob Sigman & The Timbre of Cedar\n\nFlint Eastwood is the evolution of the creative side of Detroit-based multi-talented artist Jax Anderson. Flint Eastwood is what happens when friends and family gather in the forgotten spaces of an embattled city and are left to create with no rules, no boundaries, and nothing holding them back. Jax's endless creativity is a byproduct of growing up in a talented family.\n\nHer father was one of ten kids, each of whom played guitar and sang. Her oldest brother, Sam, played in punk bands, and Jax spent her teenage years learning the value of passion and acceptance at DIY shows. As she got older, her other brother (and Flint Eastwood collaborator and producer) Seth started playing in bands throughout the Detroit garage rock scene. Their dad worked as a curb address painter to pay the bills once the housing crash made his job as a mortgage broker invalid. During this time, Jax and her brothers went door to door, passing out flyers advertising her father's services, through some of the toughest residential neighborhoods in Detroit. These struggles helped form the vision that drives Flint Eastwood: to give everyone listening (whether live or on record) a momentary escape from the problems we all have.\n\nBetween helping around the house, Jax spent her days in her family's Detroit-area home, without cable and internet, teaching herself to play her father's 12-string Taylor guitar that he left for them in the living room. It was also during this time that her mother's love for Motown music began to influence Jax's knack for the theatrics and power of the Detroit sound, as Mom played records from The Temptations, the Jackson Five, and Earth Wind & Fire.\n\nOnce old enough to break out on her own, Jax briefly moved to a small German tourist town in rural Georgia, where the only station in town played solely pop and country. There, she fell in love with the hooks and harmonies that define American pop music. Later, she moved with Seth to Los Angeles, to mainly focus on writing for licensing opportunities and playing small clubs and house parties around town. While in LA, Jax developed a love for film, hopping on tour with bands every chance she could get as a self-taught videographer. Her experiences on the West Coast still influence Jax's push to make her musical endeavors into well-rounded multimedia presentations (mixing music with theatrical lighting, video projection, and costumes).\n\nUpon returning home to Detroit at the very beginning of the much-maligned city's recent resurgence, Jax's explosive and endearing personality on stage became the driving force behind Flint Eastwood. But through it all, it was the songs that were always the focus.\n\nOn their now sold-out debut EP Late Nights In Bolo Ties (2013), Jax and her friends mixed elements of pulsing electronic tracks with blistering bluesy guitar licks, all with a spaghetti-western backdrop, inspired by Sunday night movie sessions with Jax and her father.\n\nOn the forthcoming EP, Small Victories (to be released October 23), Jax has returned to her Detroit roots, mixing a taste of the theatricality of Motown music with her more recently found love for pop music. The result is six songs full of hooks. The type of tracks that you turn up a little too loud, close your eyes, and forget where you are for four minutes. In a live setting, the songs are taken to another level entirely, mixing a CHVRCHES-like depth with a twenty | one | pilots-style flair for the dramatic. This approach has led the band to rapidly gain an ever-growing fanbase. Their last two hometown headline plays have sold out (400+ tickets per show), and the band has toured heavily through the Midwest, mixing festival looks like Electric Forest, MoPop Festival, and Midpoint Music Festival with club appearances alongside acts such as Foxy Shazam, Mayer Hawthorne, Betty Who, X Ambassadors, and Andrew WK.\n\nSmall Victories was crafted and polished in Detroit’s second oldest church, now repurposed as Assemble Sound, a hub of Detroit creativity that fosters artists through collaboration. In this crumbling but inspiring location, the new record was created as a coping mechanism to help Jax deal with the loss of her mother, who was her biggest fan and inspiration. As the listener makes their way through the EP, they experience Jax making her way through her mother's illness and passing, railing against it, dealing with the aftermath associated with such a loss, eventually accepting it, and using it as a driving force to continue to create.\n\nJax broke the EP down in one simple thought:\n\n\"Small Victories comes from the idea that doing anything creative in life takes a lot of persistence, struggle, and hustle. It's easy to expect that the spoils will come easily and be immediately fruitful. But if you focus on the little things, the \"small victories\", you realize that it's those things that are the most rewarding. That's what keeps me going.\"\n\nThe lead single is the EP's first track, \"Find What You're Looking For\", which is Jax's interpretation of her mother's final words to her:\n\n\"Don't let this break you\".", "url": "https://www.facebook.com/events/1217913291571431/"}, {"source": "Facebook", "date": "2016-04-11T18:30:00-04:00", "name": "TheRide’s ServiceFest", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "url": "https://www.facebook.com/events/194586454240654/"}, {"source": "Facebook", "date": "2016-04-11T19:00:00-04:00", "name": "Poetry at Literati: Sarah Messer & Suzanne Wise", "description": "Literati is pleased to welcome Sarah Messer and Suzanne Wise as part of our celebration of National Poetry Month.\n\nSarah Messer has received grants and awards from the National Endowment for the Arts, the Mellon Foundation, the Fine Arts Work Center in Provincetown, the Michigan Council for the Arts and others. She is the author of four books: two poetry collections, Bandit Letters and Dress Made of Mice, a history/memoir Red House, and a book of translations, Having Once Paused, Poems of Zen Master Ikkyu. In 2008-2009, she was a Poetry Fellow at the Radcliffe Institute for Advanced Studies. For many years she taught in the MFA program at the University of North Carolina-Wilmington. Currently she runs One Pause Poetry (onepausepoetry.org) in Ann Arbor, Michigan and works at White Lotus Farms.\n\nSuzanne Wise is the author of the poetry collection The Kingdom of the Subjunctive and a chapbook, Talking Cure. Recent poems have appeared in Bomb, Guernica, Ploughshares, Bone Bouquet, Catch Up, Green Mountains Review, and elsewhere. She has taught creative writing at Middlebury College in Vermont, and Pratt Institute and Poets House in New York City.", "url": "https://www.facebook.com/events/970356073044758/"}, {"source": "Facebook", "date": "2016-04-12T12:00:00-04:00", "name": "Commute By Bus? May Service Improvements Explained", "description": "This event is geared toward downtown Ann Arbor employees. \nDrop in to this casual informational workshop to find out how these bus service improvements could impact your bus commute. \n\nAlso welcome are any employees who may be interested in taking to bus but are unsure what to do.\n\nFree lunch and giveaways provided!\nRSVP: https://www.messageblocks.com/commute-by-bus", "url": "https://www.facebook.com/events/1692753224315937/"}, {"source": "Facebook", "date": "2016-04-12T17:30:00-04:00", "name": "Alice McDermott Fiction Reading & Book Signing", "description": "The Zell Visiting Writers Series Presents:\n\nAlice McDermott \nZell Distinguished Writer in Residence\nFiction Reading and Book Signing\nTuesday, April 12th, 5:30pm \nUMMA Apse\n\nAlice McDermott: In Conversation with Peter Ho Davies\nThursday, April 14th, 5:30 pm\nUMMA Helmut Stern Auditorium \n\nAll events free & open to the public.\n\n* * *\nAlice McDermott is an American writer and university professor. For her 1998 novel Charming Billy she won an American Book Award and the U.S. National Book Award for Fiction.\n\nMcDermott is Johns Hopkins University's Richard A. Macksey Professor of the Humanities. Born in Brooklyn, New York, McDermott attended St. Boniface School in Elmont, New York, on Long Island (1967), Sacred Heart Academy in Hempstead (1971), and the State University of New York at Oswego, receiving her BA in 1975. She received her MA from the University of New Hampshire in 1978.\n\nShe has taught at UCSD and American University, has been a writer-in-residence at Lynchburg College and Hollins College in Virginia, and was lecturer in English at the University of New Hampshire. Her short stories have appeared in Ms., Redbook, Mademoiselle, The New Yorker and Seventeen. She has also published articles in the New York Times and Washington Post.\n\nMs. McDermott lives outside Washington, D.C. with her husband, a neuroscientist, and three children.\n\nFor more info, please visit: https://events.umich.edu/event/26829", "url": "https://www.facebook.com/events/546120148869085/"}, {"source": "Facebook", "date": "2016-04-12T19:00:00-04:00", "name": "In Pursuit of Pepper", "description": "Peppercorns could well be said to have changed the world. Economically, politically and culturally, because it was the pursuit of pepper that led Columbus to sail west across the Atlantic. Culinarily because the Columbian Exchange that followed brought tomatoes, potatoes, corn and cacao to the Eastern Hemisphere; cows, goats, and pigs among others went west. And, probably above all, because very few of us sit down to eat a meal that hasn’t been spiced with peppercorns in one way or another.\n\nFor this special meal we’ve put together the culinary talents of Roadhouse Chef Alex Young and Philippe de Vienne, master pepper trader for over thirty years. Together they’ve put together a menu that features some of THE finest peppercorns the world has to offer, all right here at the Roadhouse in form of one delicious meal, all personally selected the de Vienne family who have rightly earned their moniker of Spice Traders by traveling the globe and searching for the most remarkable spices anywhere.\n\nMise en Bouche:\nGrilled Issan Chicken wings\nwith green pepper and garlic, hot sweet and sour dip\n\nAppetizer:\nIsekaya-Style Fish Tartare\nwith sancho pepper, nori and toasted sesame\n\nEntree Choices:\nBraised Cornman Farms’ Pork\nwith figs, almonds and sweet and sour Long pepper sauce\nOR\nSlow Roasted Goat\nwith cubebs, white pepper and lemon grass shallot sauce\n\nDessert:\nChocolate Voatsiperifery Pot de Crême", "url": "https://www.facebook.com/events/868952316560479/"}, {"source": "Facebook", "date": "2016-04-12T19:00:00-04:00", "name": "Acoustic Tuesdays: Nick Zomparelli", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1686417714974855/"}, {"source": "Facebook", "date": "2016-04-12T21:00:00-04:00", "name": "Denzel Curry - 2055: The Ult Experience 4/12/16 @ Blind Pig - Ann Arbor", "description": "Tuesday, April. 12 | 9pm | 18+ | $13 Adv./ $15 Day of\n\nDenzel Curry 2055 The Ult Experience\nwsg: Allan Kingdom,  Sdotbraddy, and Detroit Che\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/636", "url": "https://www.facebook.com/events/523621744459410/"}, {"source": "Facebook", "date": "2016-04-13T21:00:00-04:00", "name": "The Appleseed Collective w/ Big Dudee Roo & Rick Chyme 4/13/16 at Blind Pig - Ann Arbor", "description": "Wed. April 13 | 9pm | 18+ | $8 adv./ $10 day of\n\nThe Appleseed Collective \nwith: Big Dudee Roo & Rick Chyme\n\nThe Appleseed Collective is a four-piece Americana band that's toured these United States since 2010, serving up songs new and old—barn-burners, old soul jazz, airy mood pieces, bluesy digressions—to crowds hungry for more. Their music is a rich Dixie-Gypsy roots-music mélange with a modern twist, a long-simmering stew of old-time, ragtime, and bluegrass constantly refreshed—like the Melting Pot itself—with immigrant sounds and international spices. \n\nhttp://www.blindpigmusic.com/calendar.html#!/events/643", "url": "https://www.facebook.com/events/1698946970352936/"}, {"source": "Facebook", "date": "2016-04-14T19:00:00-04:00", "name": "Aventura March Madness", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/"}, {"source": "Facebook", "date": "2016-04-14T19:30:00-04:00", "name": "Mnozil Brass", "description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "url": "https://www.facebook.com/events/1621365181438631/"}, {"source": "Facebook", "date": "2016-04-15T18:30:00-04:00", "name": "5th Annual Jim Toy Birthday Bash", "description": "Come join us to celebrate our namesake's birthday!\n\nThis event is 21-and-over. Minors welcome with a parent. $10 suggested donation at the door. \n\nTo become a sponsor or donate to the event, please go here: https://secure.lglforms.com/form_engine/s/NMRhi10N5uVq9ZSSGKmuwg", "url": "https://www.facebook.com/events/1714526335426651/"}, {"source": "Facebook", "date": "2016-04-15T19:00:00-04:00", "name": "Beer Tasting: April Foolishness", "description": "the event: our monthly beer tasting series explore the expansive world of beer through the lens of different themes. we'll gather a couple dozen brews worth sampling to bring you a novel and varied experience for your palates. We’ll pair the beer samples with an appetizer buffet, provide a program with tasting notes, and top off the night with a door prize drawing.\n\nthe style: For April's tasting, we're getting weird. Think Hefeweizen's made with curry, porters made with pig heads, historical ales made with heather.  Whatever outlandish beers that we can get out hands on, we guarantee they will be unorthodox and out of the ordinary.\n\nthe details: Arbor Brewing Company's monthly tastings run from 7-9 PM on the 2nd Thursday of each month. Ticket holders will enter through the Arbor Brewing Company Tap Room entrance. \n\nthe contest: Guests who come attired in a creative costume will get a second raffle ticket for the door prize drawing. Get wacky, get weird, get funky and double your chances!\n\nthe tickets: Tickets are available at the pub or by phone at 734-213-1393. $25 in advance, $30 day of. \nTickets are also available on Eventbrite: https://www.eventbrite.com/e/beer-tasting-april-foolishness-tickets-22819923004", "url": "https://www.facebook.com/events/1767827183440408/"}, {"source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "name": "Zafir: Musical Winds from North Africa to Andalucía", "description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus. There it blended with elements of Spanish music and was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed singer Nidal Ibourk, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "url": "https://www.facebook.com/events/419604171550681/"}, {"source": "Facebook", "date": "2016-04-15T20:00:00-04:00", "name": "Scott Ainslie at Green Wood Coffee House", "description": "Scott Ainslie came of age during the Civil Rights era, and cultivated a powerful affinity for cross-cultural exchange. He has studied with elder musicians on both sides of the color line, in the old-time southern Appalachian fiddle and banjo traditions, as well as Black gospel and blues. He plays this music with affection, authority, and power. Armed with a variety of instruments -- vintage guitars, a fretless gourd banjo, a one-string, homemade diddley bow (cigar box guitar) --  and carefully chosen personal anecdotes of his encounters with senior musicians across the South, Ainslie explores the African and European roots of American music and culture, bringing the musical history of America alive.  www.cattailmusic.com", "url": "https://www.facebook.com/events/506775856161991/"}, {"source": "Facebook", "date": "2016-04-15T21:00:00-04:00", "name": "Frontier Ruckus w/ Matt Jones 4/15/16 at Blind Pig - Ann Arbor", "description": "frontier ruckus w/ Matt Jones live at the Blind Pig on Friday, April 15th!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/663", "url": "https://www.facebook.com/events/149342562122588/"}, {"source": "Facebook", "date": "2016-04-16T15:00:00-04:00", "name": "Rock The District // 4/16 Saturday // Music Festival // Maynard St. Ann Arbor // FREE", "description": "The State Street District is hosting a music festival!!  \nRock The District, Saturday April 16th  (3-10pm)  \n- All Ages & FREE\n- 300 block of Maynard Street will be closed. \n- Main Stage on the corner of Maynard Street & East Williams.\n- Parking garage acess on Thompson Street.  \n- There will be food and beverages available.  \n- The District is partnering with Knights to have a Beer Garden \n-  Matthew Altruda of Tree Town Sound will be our emcee \n\nLINEUP: (SET TIMES TBA) \nJoe Hertler & The Rainbow Seekers\nDave Menzo\nMisty Lyn & The Big Beautiful (Misty Solo Set)\nKate Peterson of nervous but excited\nMatt Jones\nBarelyon\nBarbarossa Brothers\nStormy Chromer\n\nListen to our lineup! \n---------------\nJoe Hertler & The Rainbow Seekers\nhttps://joehertler.bandcamp.com/album/terra-incognita\n----------------\nDave Menzo \nhttps://davemenzo.bandcamp.com\n-----------------\nMisty Lyn \nhttps://mistylyn.bandcamp.com\n-----------------\nKate Peterson \nhttps://kpeterson.bandcamp.com/releases\n------------------\nMatt Jones\nhttps://mattjones.bandcamp.com/album/the-deep-enders\n------------------\nBarelyon \nhttps://barelyonmusic.bandcamp.com\n-------------------\nBarbarossa Brothers\nhttps://soundcloud.com/barbarossa-brothers\n-------------------\nStormy Chromer\nhttps://soundcloud.com/stormy_chromer", "url": "https://www.facebook.com/events/941632505932642/"}, {"source": "Facebook", "date": "2016-04-16T20:00:00-04:00", "name": "Bavarian Radio Orchestra", "description": "Saturday, April 16, 2016, 8:00 pm\nHill Auditorium\n\nOf the three major orchestras based in Munich, the Bavarian Radio Orchestra is the most prominent, with a string of eminent music directors including Rafael Kubelik, Sir Colin Davis, Lorin Maazel, and, since 2003, Mariss Jansons. Leonidas Kavakos, who made his UMS debut last year with Yuja Wang, returns as soloist with the Korngold Violin Concerto. \n\nMore info: http://ums.org/performance/bavarian-radio-orchestra/", "url": "https://www.facebook.com/events/1579924995611394/"}, {"source": "Facebook", "date": "2016-04-16T21:00:00-04:00", "name": "Jai Wolf 4/16/16 at Blind Pig - Ann Arbor", "description": "Sat. April 16 | 9pm | 18+ | $15 Cover\n\nMixing a unique future sound with hip-hop and pop elements, Jai Wolf is gaining the attention of fans and influential musicians alike. After Skrillex saw a tweet containing Jai’s bootleg of his hit song, “Ease My Mind,” he immediately signed the remix. Since, Jai Wolf has done official work for Alesso, Dirty South, Melanie Martinez, ODESZA, and more.\n\nIn June 2015, Jai Wolf released his first original single, Indian Summer. Within three weeks, Indian Summer hit #1 on the US Spotify Viral Charts, and has gained global recognition.\n\nJai Wolf has toured nationally including pitstops at Coachella, Bonnaroo, Hard Summer, and will wrap up the year with a headlining tour in Australia this Fall.", "url": "https://www.facebook.com/events/533365020158543/"}, {"source": "Facebook", "date": "2016-04-17T21:00:00-04:00", "name": "Futuristic and Devvon Terrel 4/17/16 at Blind Pig - Ann Arbor", "description": "$14 adv./ $16 day of | 18+\n\nFuturistic & Devvon Terrell\nwith Munch & Mocha\n\nGrowing up around music from his Father & two older brothers, it was inevitable that Futuristic would be a natural. He wrote his first raps at the age of six and hasn't looked back since. Born in Illinois but moved to Arizona in high school, Futuristic's flow seems to be just as hot as his surroundings. His album \"The Rise\" released on May 12th 2015 debuted at #2 on itunes and #9 on Hip-Hop Billboard charts. He has been touring virtually non-stop over the last 2 years headlining his own tours and supporting bigger acts such as Somo & Machine Gun Kelly. His fast witty lyrics mixed with substance and relatable subject matter has gained him a die hard fan base called WTFGang which stands for \"We're The Future\". As an independent artist Futuristic takes pride in his creativity and versatility using his words to inspire his fans and let them know that anything is truly possible but also gives them music to BANG with the top down in the summer. Moving forward he expects to be exactly what he named his lead single from his album.... \"The Greatest\". Futuristic recently was featured on A Great Big World single \"Hold Each Other\" which has led him to National television performances on The Tonight Show Starring Jimmy Fallon, VH1 Streamy Awards, Performing for the Vice President Joe Biden & CEO of Apple Time Cook, for the HRC National Dinner in Washington D.C.\n\nGood music arguably comes from a place that is insightful, meaningful and modern.This is where the living weirdo known as Devvon Terrell lives and sleeps. Hailing from Brooklyn, New York the singer has his own urban style and sound that is a testament to his generation.\n\nDevvon Terrell took the internet by storm, showcasing his talent on various remixes and cover videos on youtube that have gained him as much as 200,000 views on a single video.\n\n \n\nDevvon Terrell wears a variety of hats to translate his music to his audience. From shooting and editing videos to engineering, mixing and mastering all of his music. This jack of all trades mentality has earned him placements with And One Live, C2C Dj Khaled's Halftime Report, a number one Mixtape on Datpiff.com and countless other mediums. Devvon Terrell recently released his first album titled \"Weird Sexy Cool\" and earned a the spot of top 16 albums on the itunes RNB charts. With all his endeavors on the rise Devvon Terrell will surely make the transformation from local talent, to mainstream superstar.", "url": "https://www.facebook.com/events/1042945595776720/"}, {"source": "Facebook", "date": "2016-04-18T20:00:00-04:00", "name": "Polica w/ Mothxr 4/18/16 @ Blind Pig - Ann Arbor", "description": "Monday, April 18 | 8pm | 18+ | $15 adv./ $17 day of\n\nPolica with MOTHXR \n\nUnited Crushers (out March 4, 2016) is POLIÇA’s third full-length release and most remarkable album to date. The band, which includes Channy Leaneagh, dual drummers, Drew Christopherson and Ben Ivascu and Chris Beirden on bass with producer Ryan Olson at the helm, collectively wrote the album in Minneapolis in the winter of 2015 during their first true break from two straight years of touring. The new album builds on POLIÇA’s signature synthesizer and percussion-heavy sounds with more complex arrangements and a bigger, crisper hi-fi punch due to the new approach they took to writing and recording: together, all in the same room. There's a tighter groove to these songs and a more vulnerable quality to them, especially in Leaneagh's singing. Her incredible vocal range is consistently on display throughout, beautifully raw and less electronically effected than on previous recordings. United Crushers is the follow up to 2013’s Shulamith which EW called \"propulsive enough for dance floors, and dreamy enough for headphones\" andMOJO said \"proves that intelligent pop music still has the ability to seduce and enthral.\" Their debut, 2012's Give You The Ghost, also garnered international acclaim, with Rolling Stone hailing it as \"the sound of heartbreak and celebration happening simultaneously\" and Q praising it as \"a bewitching, urgent, magical debut.\" The band has conquered massive festivals around the world from Coachella to Glastonbury in addition to performing on Late Night With Jimmy Fallon, Later With Jools Holland and more.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/564", "url": "https://www.facebook.com/events/769930223136488/"}, {"source": "Facebook", "date": "2016-04-19T13:10:00-04:00", "name": "Commute by Bus? May Service Improvements Explained", "description": "This event is geared toward Ypsilanti employees. \n\nDrop in to this casual informational workshop to find out how these bus service improvements could impact your bus commute. \n\nAlso welcome are any employees who may be interested in taking to bus but are unsure what to do.\n\nFree snacks and giveaways provided!\nRSVP: https://www.messageblocks.com/commute-by-bus-ypsi", "url": "https://www.facebook.com/events/617117388436683/"}, {"source": "Facebook", "date": "2016-04-20T16:00:00-04:00", "name": "SITA 2016 Auditions", "description": "Audtions WED & THU APRIL 20-21 4-7 PM\nNo monologue needed; Be prepared to work with scenes from the play.  Many roles are double cast.  Performances in June.", "url": "https://www.facebook.com/events/557979811041512/"}, {"source": "Facebook", "date": "2016-04-20T19:00:00-04:00", "name": "Meet Author & U of M Grad Monica Tesler for a Discussion & Signing of Her Debut YA Novel 'Bounders'", "description": "Monica Swanson Tesler is a graduate of the University of Michigan Law School, and is an attorney in Boston, where she lives with her family.\n\nIn the tradition of Michael Vey and The Unwanteds, twelve-year-old Jasper and his friends are forced to go up against an alien society in this first book in a brand-new adventure series \nThirteen years ago, Earth Force a space-military agency discovered a connection between brain structure and space travel. Now they ve brought together the first team of cadets, called Bounders, to be trained as high-level astronauts. \n\nTwelve-year-old Jasper is part of this team being sent out into space. After being bullied back on Earth, Jasper is thrilled to have something new and different to do with other kids who are more like him. While learning all about the new technologies and taking classes in mobility otherwise known as flying with jetpacks Jasper befriends the four other students in his pod and finally feels like he has found his place in the world. \n\nBut then Jasper and his new friends learn that they haven t been told everything about Earth Force. They weren t brought to space for astronaut training, but to learn a new, highly classified brain-sync technology that allows them to manipulate matter and quantum bound, or teleport. And it isn t long before they find out this new technology was actually stolen from an alien society.\nWhen Jasper and his friends discover the truth about why Earth Force needs them, they are faced with a choice: rebel against the academy that brought them together, or fulfill their duty and protect the planet at all costs.", "url": "https://www.facebook.com/events/1019071558166423/"}, {"source": "Facebook", "date": "2016-04-21T16:00:00-04:00", "name": "SITA 2016 Auditions", "description": "Audtions WED & THU APRIL 20-21 4-7 PM\nNo monologue needed; Be prepared to work with scenes from the play.  Many roles are double cast.  Performances in June.", "url": "https://www.facebook.com/events/557979811041512/"}, {"source": "Facebook", "date": "2016-04-21T19:00:00-04:00", "name": "Aventura March Madness", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/"}, {"source": "Facebook", "date": "2016-04-21T19:00:00-04:00", "name": "Meet Ann Arbor Graphic Novel Author Jim Ottaviani for a Discussion & Signing of His New Novel The Imitation Game: Alan Turing Decoded", "description": "Jim Ottaviani (\"Feynman\", \"Primates\") is the world s preeminent writer of comics and graphic novels about science. Notable works include a biography of Niels Bohr and the fast-paced tale of the desperate lives of early paleontologists and \"T-Minus: The Race to the Moon\", from Aladdin books. He has worked as a nuclear engineer and is currently employed as a reference librarian in Ann Arbor, Michigan.\n\nEnglish mathematician and scientist Alan Turing (1912 1954) is credited with many of the foundational principles of contemporary computer science. \"The Imitation Game\" presents a historically accurate graphic novel biography of Turing's life, including his groundbreaking work on the fundamentals of cryptography and artificial intelligence. His code breaking efforts led to the cracking of the German Enigma during World War II, work that saved countless lives and accelerated the Allied defeat of the Nazis. While Turing's achievements remain relevant decades after his death, the story of his life in post-war Europe continues to fascinate audiences today. \nAward-winning duo Jim Ottaviani (the #1 \"New York Times \"bestselling author of \"Feynman \"and \"Primates\") and artist Leland Purvis (an Eisner and Ignatz Award nominee and occasional reviewer for the \"Comics Journal\") present a factually detailed account of Turing's life and groundbreaking research as an unconventional genius who was arrested, tried, convicted, and punished for being openly gay, and whose innovative work still fuels the computing and communication systems that define our modern world. Computer science buffs, comics fans, and history aficionados will be captivated by this riveting and tragic story of one of the 20th century's most unsung heroes.", "url": "https://www.facebook.com/events/1715972678661999/"}, {"source": "Facebook", "date": "2016-04-21T19:30:00-04:00", "name": "Barefoot in the Park", "description": "Ann Arbor Civic Theatre presents Neil Simon’s comedy, Barefoot in the Park, directed by Wendy Wright, April 21-24, 2016, at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org.  \n\nThis hilarious romantic comedy concerns New Yorkers Paul, a buttoned-down lawyer, and his free spirited bride Corrie. Their explosive and passionate relationship plays itself out in a five-story walk-up apartment, while an eccentric neighbor and a meddling mother conspire to test the newlywed’s marriage — all set to a 60’s groovy “Love, American Style” type setting. Director Wendy Wright, whose past A2CT shows have garnered critical and audience acclaim, says of this production, \"Barefoot was Neil Simon's first true hit and has autobiographical elements. It has a freshness and a spark, plus people can easily recognize and relate to the relationships between the characters. This stellar cast is having a ball and we can't wait for the audience to join in the fun. It's the perfect date night comedy!\"\n\nThe production stars Karl Kasischke as Paul, and Colleen Davis as Corrie. Ellen Finch plays the mother, and Larry Rusinsky neighbor Victor. The cast is rounded out by Theo Polley and Thom Johnson in supporting roles.  \n\n“A bubbling, rib-tickling comedy” is how the New York Times gushed about the show in 1963. “I don’t think anyone stopped laughing while the curtain was up last night” gushed The New York Daily News.The original production was Neil Simon’s first big hit and launched his remarkable career.\n\nEnjoy an April spring evening with Ann Arbor Civic Theatre as they go “barefoot in the park”", "url": "https://www.facebook.com/events/580331615466350/"}, {"source": "Facebook", "date": "2016-04-21T21:00:00-04:00", "name": "The Thermals w/ Summer Cannibals 4/21/16 at Blind Pig - Ann Arbor", "description": "Thu. April 21 | 9pm | 18+ | $15 Cover\n\nI don’t know how to write a bio for an album. I’ve never written one. I’m a comedian. My job is to talk onstage for long enough that the trapped, drunken audience has to buy more chicken wings from the club. I am not qualified to write about music. And yet here I am, writing a bio for the new The Thermals record, We Disappear. Thank god it’s a great fucking record.\n\nThe first time I heard The Thermals was on broken headphones while riding the A Train to Rockaway, Brooklyn, flying mere feet over a frozen Jamaica Bay on a too-bright January morning. I had just fallen in love with a wonderful, terrible woman who was thousands of miles away. I was very fragile, I had no boundaries, and I was the strongest I’d ever been. And that’s how this album feels. There’s a new vulnerability here, but The Thermals’ sound is as strong as it’s ever been.\n\nThe Thermals are best at making songs you put on mixtapes named ‘Drunken Sing-alongs When You’re Sad.’ They specialize in late-night, secret conversations about feeling simultaneously romantic and resentful over being raised Catholic. They’re the soundtrack to breaking glass, and an ode to the beauty of brokenness.\n\nThey say that the mark of intelligence is the ability to hold two disparate and conflicting truths in the mind at the same time: I am a good person; I am not a good person. We Disappear lives in this delicate, in-between place: at once hard and noisy, while also soft and personal. And seeming contradictions abound on this album. We Disappear is an all-too-real, dark, and intensely personal album – in the past most of singer Hutch Harris’ lyrics have been mostly fictitious tales – about how we try to outrun demise, whether personal or physical. It is an emotional document of how two people can tear each other apart, while simultaneously making you wanna get up and jump around the room.\n\nThe deeply dark, yet oddly catchy “Heart Went Cold” plays on the double metaphor of loss of love/life and features the sad realization “I pushed you away”, but is immediately followed by the super poppy “oh-oh oh”. The classic fucking rock anthem “Hey You” is a paranoid fantasy about running from the Grim Reaper as he calls after you, about “being terrified of death,” says Harris, but “a celebration of that feeling as opposed to feeling sad about it.” A surprisingly uplifting eulogy of the death of a relationship, “Thinking Of You” is explained by Harris as “one of the most straight-forward love songs we’ve ever written, a point-blank post-break up song. It’s a song that says exactly what it means. It and a lot of the record are about regret, i.e. still loving someone after a break-up and hanging on to these feelings.”\n\nWe Disappear is also about separation in terms of technology, how it can isolate us and impact our relationships, and how humans have embraced it to the point where we’ve already assimilated into it. “The Great Dying” and “Into the Code” examine how we’re so afraid we’re going to be forgotten, or overlooked, that we upload everything about our lives onto the Internet.\n\nHarris explains, “Technology, love and death are the three obsessions of the record. Our privacy used to be so important to us and now everything has changed – we freely offer once private information about relationships and reveal everything about our day-to-day lives. We’re trying to preserve our life digitally so when we’re gone people won’t forget us. We’re using technology to become immortal. You can even set up Facebook and Twitter accounts to continue updating after you die! We Disappear is about how humans fight the inevitable.”\n\nI’m sure you want to know that the record will come out March 25th, 2016 on Saddle Creek, that it features the longest running Thermals line-up of Hutch Harris, Kathy Foster, and Westin Glass, and that it was recorded in Portland, OR at Kung Fu Bakery (The Shins, Tegan and Sara) and in Seattle, WA at The Hall of Justice (Nirvana, Mudhoney), and produced by Chris Walla (formerly of Death Cab For Cutie). But what really matters is that this record GETS IT. It walks that fine line between truth and lies, between death and life, between depression and joy – all the while recognizing that one cannot exist without the other. And it brings us with it. That’s the reason to listen to this record: Because it’s a fucking great album, by an amazing band. Long Live The Thermals.", "url": "https://www.facebook.com/events/1683772608545604/"}, {"source": "Facebook", "date": "2016-04-22T20:00:00-04:00", "name": "Jonathan Edwards at Green Wood Coffee House", "description": "Warm as summer sunshine, real as the truth, intimate as a long overdue visit between old friends … such is a Jonathan Edwards concert. Four decades into a stellar career of uncompromising musical integrity, the man simply delivers, night after night – songs of passion, songs of insight, songs of humor, all rendered in that pure and powerful tenor which, like fine wine, has only grown sweeter with age.\nThis is one veteran performer who is neither grizzled nor nostalgic.  \nJonathan's  highly respected repertoire  includes such classics as, “Sometimes,” “One Day Closer,” “Don’t Cry Blue,” “Emma,” “Everybody Knows Her,” “Athens County,” and everyone’s favorite ode to putting a good buzz on, “Shanty.” And then, of course, there’s the anthemic “Sunshine (Go Away Today),” that fierce proclamation of protest and independence that resonated with thousands and thousands of frustrated and angry young men and women when it was first released in 1971. Almost 40 years later, at show after show, the song continues to be embraced by faithful followers and new fans alike.\nSince 1971, Jonathan has released 15 albums, including \"Blue Ridge,\" his standard-setting collaboration with bluegrass favorites the Seldom Scene, and \"Little Hands,\" his collection of children’s songs, which was honored with a National Library Association award. His brand new album is, \"Tomorrow's Child.\"\nwww.jonathanedwards.net", "url": "https://www.facebook.com/events/1943009162591226/"}, {"source": "Facebook", "date": "2016-04-22T21:00:00-04:00", "name": "Big Wild :: 4/22 at Blind Pig - Ann Arbor", "description": "Big Wild\nw/ guests TBA!\n\nFri. April 22 | 9pm | All Ages | $10 adv./ $12 day of\n\nStemming from a relentless desire to create something new, Big Wild’s sound taps into the natural curiosity we all share by exploring beyond conventional boundaries in music. This spark was ignited when he first began creating music under the heavy influence of modern hip hop producers. Since then, he has increasingly drawn inspiration from the limitless potential of electronic music, while at the same time building a style unique to him.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/637\n\nConnect with Big Wild:\nhttp://bigwildmusic.com\nhttp://soundcloud.com/bigwildmusic \nhttp://twitter.com/bigwildmusic\nhttp://instagram.com/bigwildmusic", "url": "https://www.facebook.com/events/935490533173037/"}, {"source": "Facebook", "date": "2016-04-23T20:00:00-04:00", "name": "The Bad Plus Joshua Redman", "description": "Saturday, April 23, 2016, 8:00 pm\nMichigan Theater \n\nOn paper, the partnership of Joshua Redman and the Bad Plus seems unlikely. The saxophonist was embraced by the jazz mainstream on the release of 1994’s Moodswing, and he’s been both a critical and commercial favorite ever since. The Bad Plus, by contrast, have courted controversy since the release of their 2003 major label debut, These Are the Vistas. But when Joshua Redman joined the idiosyncratic trio as a special guest a few years back, a brilliant collaboration was born. Redman’s melodic prowess blends seamlessly with the “avant-garde populism” of The Bad Plus, pushing the boundaries of jazz beyond all imagination. Metroland describes this new all-star quartet best: “It’s as though Redman is the long-lost fourth member of the group, just waiting to be snapped snugly into place.” \n\nMore info: http://ums.org/performance/the-bad-plus-joshua-redman", "url": "https://www.facebook.com/events/1589849627952742/"}, {"source": "Facebook", "date": "2016-04-23T21:00:00-04:00", "name": "Saul Conrad (Boston) w/ Ben Willis, Nick Zomparelli, Travis Jarosz", "description": "Far House presents an evening of neoclassical and avant-folk, featuring touring artist:\n\nSaul Conrad (Boston, Massachusetts)\nhttps://soundcloud.com/teamlove/sets/saul-conrad-requiem\n\nSaul Conrad’s Requiem is a musical setting of the 12th century poem Dies Irae. It combines, perhaps for the first time, singer/songwriter stylings with the rigors of a classical and sacred form—the Requiem Mass—a prayer on behalf of dying souls. Supported by piano, a pipe organ, 1st and 2nd violin, viola, electric bass, french horn and oboe, Saul sings a combination of the original Latin verse and his own words drawn from the stories and scenes of the poem. Influences include Alexander Skip Spence’s Oar, Bach’s Goldberg Variations, Mozart’s Requiem and Great C Minor Mass, Chopin’s Preludes, and the adagio of Mahler’s last symphony. Requiem is dedicated to Saul’s great-uncle, Claude Frank.\n\n\nWith local support by:\n\nBen Willis (Ann Arbor, MI)\nhttp://www.benwillis.us/\n\nBen Willis is a bassist whose affinities lie in collaborative projects, new music, improvisation, and the merging of cross-disciplinary elements. He's performed his original collaborative work at venues and festivals around the U.S., including the International Society for Improvised Music Conference, Electroacoustic Barn Dance at the University of Mary Washington, the Whitewater Arts Alliance Series at the University of Wisconsin, Whitewater and the Ratchet Series at the Skylark in Chicago. In 2013, he was a Robert Black Bass Fellow at the Bang on a Can Summer Festival. Much of his work highlights the importance of collaborative, performative process in the development of new art.\n\n\nNick Zomparelli (Ann Arbor, MI)\n\nSolo set from Far House resident and multi-instrumentalist Nick Zomparelli (PING PoNG/Daughters of Eternity).\n\n\nTravis Jarosz (Ann Arbor, MI)\n\nSolo cello with accompaniment from multi-instrumentalist, Travis Jarosz (commonly known as Watabou).\n\n\n$5 suggested donation for our out-of-town friend.\n\nDoors at 9, with music starting at 10.\nSHOW UP ON TIME!\n\nRespect the house and the artists.\nThis is a music event, not a house party.\nEngage and participate.", "url": "https://www.facebook.com/events/995714530505088/"}, {"source": "Facebook", "date": "2016-04-26T19:00:00-04:00", "name": "Acoustic Tuesdays: Heather Schwartz", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1535746816722754/"}, {"source": "Facebook", "date": "2016-04-27T18:00:00-04:00", "name": "How to Photograph Your Artwork", "description": "Our April Artists' Meet & Greet topic is How to Photograph Your Artwork. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet events: http://www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/1668025760140932/"}, {"source": "Facebook", "date": "2016-04-27T21:00:00-04:00", "name": "Rev. Horton Heat & Company 4/27/16 @ Blind Pig - Ann Arbor", "description": "Wed. April 27 | 9pm | 18+ | $28 Cover\n\nReverend Horton Heat with: Unknown Hinson, Nashville Pussy & Lucky Tubb & the Modern Day Troubadours Live in Concert!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/612", "url": "https://www.facebook.com/events/991272244292924/"}, {"source": "Facebook", "date": "2016-04-28T19:00:00-04:00", "name": "Meet Illustrator/Artist Diane Wege for a discussion & Signing of 'A Day with Bonefish Joe' her First Children's Picture Book", "description": "Diana Wege is an artist. She has painted in all fifty states and in 2000 she published Land America Leaves Wild, a book of her paintings of 23 of those states. This is her first children’s book.  Diane also grew up in Grand Rapids and Ann Arbor and is a graduate of Greenhills School.\n\nHarbour Island, only three miles long and half a mile wide, is one of the oldest settlements in the Bahamas and is best known for its broad pink-sand beaches and for bonefishing, a compelling catch-and-release enterprise that pits a determined angler against an inedible, surprisingly powerful, and elusive quarry.\n\nYoung and fearless Flossie lives on Harbour Island and has a persistent dream is to go fishing with the legendary guide Bonefish Joe, a beloved island institution who picks up his wealthy clients at the dock and returns with them hours later, fishless but satisfied. One Sunday, after church, Flossie’s wish is surprisingly granted and she discovers the allure, the challenge, and the delights of hooking (and releasing) one of angling’s greatest prizes.\n\nDiana Wege’s illustrations of the island, its inhabitants, its customs, and its architecture,bring this story alive, perfectly catching the characters, culture and charm of Harbour Island.", "url": "https://www.facebook.com/events/1079340418752835/"}, {"source": "Facebook", "date": "2016-04-28T21:00:00-04:00", "name": "Chris Pureka w/ Anna Vogelzang 4/28/16 @ Blind Pig - Ann Arbor", "description": "Thursday, April 28 | 9pm | 18+ | $15 Cover\n\nIt’s rare for an artist to bridge the divide between critical acclaim and dedicated fan engagement. Chris Pureka is a Portland-based singer-songwriter whose body of work has resonated deeply with these seemingly disparate milieus. Her bold vulnerability in processing the intimacies of her life in song has long appealed to those listeners who crave authenticity. Now, five years coming, she shares with us another powerful entry in her life’s work, her sixth release, the aptly titled, Backin the Ring. Chris’s elegant emotionality as a vocalist, and her flair and immediacy as a lyricist have garnered her favorable comparisons to Gillian Welch, Ryan Adams, Bruce Springsteen, and Patty Griffin. She’s earned accolades from such distinguished taste-making outlets as The New York Times, Paste, Magnet,Billboard.com, and The AllMusic Guide. She’s shared the stage with such diverse and esteemed artists as Dar Williams, TheLumineers, The Cowboy Junkies, Gregory Alan Isakov, Martin Sexton, and Ani DiFranco. Along the way, Chris has remained fiercely independent, selling nearly 50,000 albums through her own label, Sad Rabbit Records. Chris’s journey in music mirrors her path toward self-discovery. At 16, writing songs became a way of journaling. “I was shy and introverted, and songwriting was a very personal process. I never had any intention of performing,” she shares. Post high school, she went on to complete a biology degree at Wesleyan University, and afterwards, worked in a microbiology research lab at Smith College. Meanwhile, she established a music career parallel to her biology work through touring and issuing a clutch of well-received indie releases.In 2006, when Chris found herself turning down too many opportunities as a musician, she shifted her priorities to become a full-time artist. Her latest album, Backin the Ring, is Chris’s first studio full length since 2010’s critically acclaimedHow I Learned to See in the Dark. “I’m not interested in releasing songs I can’t get behind or records I don’t love,” she says of the five-year span between albums. The title of her latest playfully suggests something of an artistic comeback, but it also references the album’s themes of relationship conflict and making the decision to fight back against dark inner demons. “My music is the outward expression of the work I’m doing internally. What I do comes from my experiences, and I strive to express these experiences authentically. Speaking my truth, and being myself, is the way that I connect with people,” Chris confides. Her rise as an esteemed artist with captivating emotional integrity has been organic and always on her own terms.For someone who never had an intention of being a professional musician, it’s been a life of far-reaching changes and unexpected rewards. \n\nWSG: Anna Vogelzang\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/595", "url": "https://www.facebook.com/events/1318721681600135/"}, {"source": "Facebook", "date": "2016-04-29T19:00:00-04:00", "name": "Aventura March Madness", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/"}, {"source": "Facebook", "date": "2016-04-29T20:00:00-04:00", "name": "A Special Evening Of Dan Fogelberg Music by Don Campbell", "description": "Don Campbell is a contemporary/country crossover and folk-rock singer/songwriter whose presentation of music supports the story in the song and welcomes the audience on board for the ride. Often compared to the sounds of Dan Fogelberg, Vince Gill, and Chris Isaak, Don and his ensembles are based out of New England. In 2012, Don released a double CD, \"Kites To Fly: Celebrating the Music of Dan Fogelberg,\" and in 2013 began presenting live performances of this music around his own busy schedule of Don Campbell shows.\nwww.doncampbellmusic.com", "url": "https://www.facebook.com/events/930690620345924/"}, {"source": "Facebook", "date": "2016-04-30T11:00:00-04:00", "name": "Meet NYT Bestselling Children's Author Andy Griffiths for a Discussion & Signing of His New Book, 'The 52- Story Treehouse'", "description": "Nicola's Books is THRILLED to be hosting a store event for NYT bestselling children's author Andy Griffiths. \n\nAndy Griffiths is one of Australia’s most popular children’s authors. Andy is best known for The Treehouse series, the JUST! books and The Day My Bum Went Psycho. Over the last 20 years Andy’s books have been New York Times bestsellers, adapted for the stage and television and won more than 50 Australian children’s choice awards. Andy, a passionate advocate for literacy, is an ambassador for The Indigenous Literacy Foundation and The Pyjama Foundation.\n\nAndy and Terry live in a 52-Story treehouse. (It used to be a 39-story treehouse, but they keep expanding.) It has a chainsaw-juggling level, a make-your-own-pizza parlor, a rocket-powered carrot-launcher, a life-size snakes and ladders game, a remembering booth, a Ninja Snail Training Academy and a high-tech detective agency, with all the latest high-tech detective technology, including the Disguise-o-Matic 5000!\nSomething that is sure to come in handy as they try to solve the mystery of: What happened to Mr. Big Nose? After all, it's hard to turn in your next book when your publisher has vanished!\nJoin \"New York Times-\"bestselling author Andy Griffiths and illustrator Terry Denton on another wild storytelling adventure in a series \"Publishers Weekly\" described as \"Anarchic absurdity at its best.\" Welcome to \"The 52-Story Treehouse...\"What are you waiting for? Come on up!", "url": "https://www.facebook.com/events/1697126153910182/"}, {"source": "Facebook", "date": "2016-04-30T12:00:00-04:00", "name": "International Tabletop Day 2016", "description": "International Tabletop Day is back and this year Vault of Midnight is going to make it better than ever. Founded in 2013 by Geek & Sundry, International Tabletop Day is a worldwide celebration of board-gaming awesomeness. Join your local community of board gamers and play the latest heavy hitters or revisit a classic.\n\nInternational Tabletop Day is a free, family friendly event for both tabletop enthusiasts and curious noobs alike. Join Vault of Midnight's staff and a small army of gaming experts at The Beer Grotto - we'll teach you all the rules and make recommendations on some new games that you might want to add to your game collection.\n\nExcelsior!", "url": "https://www.facebook.com/events/1711823135728044/"}, {"source": "Facebook", "date": "2016-05-06T20:00:00-04:00", "name": "An Evening of Sam Cooke by Daughter Carla Cooke", "description": "Vocalist and composer Carla Cooke is the youngest daughter of the legendary Sam Cooke, whose musical life encompassed religion, romance, and history. Carla’s career mirrors that of her father, in that she crafted her sound in the church. Carla sought not to use her father’s name, but to build her own reputation. Now the younger Cooke knows that her roots are firmly entwined in her father's as she connects with them through his music.\n\nCarla Cooke’s style is diverse in gospel, Christian, R&B, soul, and pop styles. With a strong vocal range and warm personality, Carla shows that the apple doesn't fall far from the tree, as she channels the raw talent, emotion, beauty, and charisma of the Cooke family persona. www.carlacooke.com", "url": "https://www.facebook.com/events/919947144747827/"}, {"source": "Facebook", "date": "2016-05-07T11:00:00-04:00", "name": "Water Treatment Plant Open House", "description": "Get an up-close look at what makes the water flow to your faucet.\n\nSaturday, May 7th\n11am to 3pm\n\n919 Sunset Rd\nAnn Arbor, MI 48103\n(734) 794– 6426\n\nFreebies, tours, family friendly activities and light refreshments.", "url": "https://www.facebook.com/events/1513835392257274/"}, {"source": "Facebook", "date": "2016-05-07T21:30:00-04:00", "name": "Super Happy Funtime Burlesque 5/7/16 at Blind Pig - Ann Arbor", "description": "Sat. May 7 | 9:30pm | 18+ | $10 Cover\n\nSuper Happy Funtime Burlesque is a 16 member band/burlesque show showcasing genre defying music and sexy striptease all in the name of good jokes and bad taste.  Designed to find your line and cross it, SHFB presents its shows as full on musical theater.  Rather than the typical variety show format, SHFB presents a full on original rock opera at its many stops around the nation as it tours year after year in its big red school bus.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/652", "url": "https://www.facebook.com/events/1763664110523989/"}, {"source": "Facebook", "date": "2016-05-08T10:00:00-04:00", "name": "Mother's Day Brunch Buffet", "description": "Nothing says \"I love you\" like our decadent brunch buffet & bloody mary bar!\n\nMother's Day Brunch Buffet\nSunday, May 8th, 10 am – 2 pm\n\n$28 – Includes non-alcoholic beverage\n$6 Bloody Mary Bar\n\nMake your reservation today by clicking the \"Ticket URL\" above.\n\nMenu Coming Soon =)", "url": "https://www.facebook.com/events/691600014313195/"}, {"source": "Facebook", "date": "2016-05-08T19:00:00-04:00", "name": "Aventura March Madness", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/"}, {"source": "Facebook", "date": "2016-05-11T19:00:00-04:00", "name": "Emily St. John Mandel", "description": "Literati is thrilled to welcome Emily St. John Mandel, author of Station Eleven, which was chosen as the 2015-16 Great Michigan Read! This event is sponsored by the Michigan Humanities Council and is free and open to the public.\n\nStation Eleven is an audacious, darkly glittering novel about art, fame, and ambition set in the eerie days of civilization's collapse. One snowy night a famous Hollywood actor slumps over and dies onstage during a production of King Lear. Hours later, the world as we know it begins to dissolve. Moving back and forth in time—from the actor's early days as a film star to fifteen years in the future, when a theater troupe known as The Travelling Symphony roams the wasteland of what remains—this suspenseful, elegiac, spellbinding novel charts the strange twists of fate that connect five people: the actor, the man who tried to save him, the actor's first wife, his oldest friend, and a young actress with the Traveling Symphony, caught in the crosshairs of a dangerous self-proclaimed prophet. Sometimes terrifying, sometimes tender, Station Eleven tells a story about the relationships that sustain us, the ephemeral nature of fame, and the beauty of the world as we know it.\n\nEmily St. John Mandel is the author of four novels, most recently Station Eleven, which was a finalist for a National Book Award and the PEN/Faulkner Award, and won the 2015 Arthur C. Clarke Award. A previous novel, The Singer's Gun, was the 2014 winner of the Prix Mystere de la Critique in France. Her short fiction and essays have been anthologized in numerous collections, including Best American Mystery Stories 2013. She is a staff writer for The Millions. She lives in New York City with her husband and daughter.", "url": "https://www.facebook.com/events/606755719498706/"}, {"source": "Facebook", "date": "2016-05-11T21:00:00-04:00", "name": "Del The Funky Homosapien wsg DJ Shiftee & Sean Anonymous 5/11/16 at Blind Pig - Ann Arbor", "description": "Wed. May 11 | 9pm | 18+ | $20 Cover\n\nHailing from Oakland, California, Del the Funky Homosapien and his crew, the Hieroglyphics came out as a markedly non-gangster response to a burgeoning West Coast scene. After being put on at the tender age of 17 by his cousin Ice Cube, Del released two records on Elektra, I Wish My Brother George Was Here (1991) and No Need For Alarm (1993). Despite record sales in the hundreds of thousands, he recorded a third album, Future Development, which was never commercially released. Del parted with Elektra and started work on the Hieroglyphics..family album, 3rd Eye Vision (Hiero Imperium, 1998). Hiero went on the road and toured incessantly in support of the album for much of 1998. Del also spent a good portion of his time drawing, practicing Japanese, and playing mass amounts of video games. Finally ready to unleash a new record on the world, Del comes with BOTH SIDES OF THE BRAIN. Seventeen tracks of pure Del. He says of his work on this album: ..\"I've had complete control\". At times, Del has felt restrained by the formulas in hip hop and the expectations fans place upon emcees who have had hits. I wish that I had the same freedom that someone like Bjork has when she puts out an album..Apart from collaborations with PrincePaul, El-P (Company Flow), and help from a few of his Hiero cohorts (A-plus, Casual, Domino) Del handled the majority of production on this album. By staying true to himself, Del has earned legions of adoring fans. He may have said it best in his classic, Mistadobalina when he declared all in the mind and the heart. WSG: Sean Anonymous", "url": "https://www.facebook.com/events/222011124804458/"}, {"source": "Facebook", "date": "2016-05-13T20:00:00-04:00", "name": "Harmony Bones at Green Wood Coffee House", "description": "Harmony Bones is a quartet of long-time veterans of the Ann Arbor folk music scene. The band consists of Jeanne Mackey, Tom Voiles, Linda Teaman, and Laz Slomovits. The name Harmony Bones comes from an acupuncture point that harmonizes imbalances and promotes clear thinking, seeing, and hearing.\nJeanne, Tom, Linda and Laz have joined forces to explore a wide range of traditional, contemporary and original folk songs. Rich vocal harmonies and an array of instruments -- guitar, mandolin, flute, pennywhistle, fiddle, banjo, percussion, sitar -- combine to make Harmony Bones.\nSinger/songwriter Jeanne Mackey offers a blend of emotional intensity, wry humor, and global consciousness. In addition to original tunes, her repertoire ranges from Dar Williams to Patsy Cline, from Pete Seeger to Irving Berlin. A seasoned guitarist, she draws on a variety of styles -- folk, classic swing, funky blues, and more -- with the occasional sprinkle of mandolin, accordion, or banjo. Mackey rocked the 1970s East Coast topical music circuit as a young musician advocating feminist values and social justice.  In 2010, Mackey created \"Drop The Knife: A Memoir-in-Song,\" an evening of original songs and stories exploring the meaning of homeland, curses, death, and magic.\nLinda Teaman and Tom Voiles do much of their singing and playing with Nutshell, an Ann Arbor-based Celtic roots band. Nutshell plays for contra-dances and performs at festivals across North America.\nLinda is a singer who brings depth of understanding, warmth and sensitivity to the music. In 2005, her graduation recital for a degree in k-12 choral music had her singing in five languages, encompassing musical forms such as Irish sean nos singing and Italian and German arias by composers Purcell, Mozart and Brahms. She leads the Rudolf Steiner Community Singers, a small choir that sings uncommon Christmas and seasonal songs of celebration.  She hopes you'll forgive her classical background and that she is redeemed by her love of folk music.  In addition to vocals, she adds light percussion to the mix.\nTom consumes a well-rounded musical diet that ranges from Celtic to Indian to rock and roll. He enjoys mixing different styles while maintaining a respect for the traditions from which they spring. Tom has studied North Indian Classical music, Moroccan folk drumming and western classical flute. He has worked with performance artists, dancers, mimes and poets, including Hosain Mosavat, Gerry the Fool, Matthew Smith, ML Liebler and the Magic Poetry Band.\nLaz Slomovits is one of the twin brothers in Ann Arbor’s nationally-known children’s music duo, Gemini. A fine singer and multi-instrumentalist, Laz is starting his 4nd year playing music. His songs are featured in songbooks used by music teachers throughout the country, and Gemini's recordings have won numerous awards. In addition, Laz has had a notable solo career. In his solo work, Laz is best known for his powerful musical settings of the poetry of ancient Sufi mystics Rumi and Hafiz, as well as that of contemporary American poets.", "url": "https://www.facebook.com/events/1637106023218709/"}, {"source": "Facebook", "date": "2016-05-13T21:00:00-04:00", "name": "An Atomic Whirl (JAPAN) w/ Sojii, Red Robe & Super Thing", "description": "Far House brings you an evening of high energy rock & roll, with a special international touring guest!\n\n\nAn Atomic Whirl (Japan)\nhttp://anatomicwhirl.com/\n\nAn Atomic Whirl mixes chaotic noise, sudden soft melodies and mathy arrangements. They also throw in some doom, jazz, shoegaze and other styles they like. Since 2013, they have toured around Asia and across the US.\n\n\nLocal support by:\n\nSojii (Grand Rapids, MI)\nhttps://sojii.bandcamp.com/\n\nMusical tonic for every dark and ecstatic feeling. Recent import from Brooklyn, NY. \n\n\nRed Robe (Ann Arbor, MI)\nhttps://redrobe.bandcamp.com/\n\nRed Robe is a rock band for the modern age, for the 2000-teens. Birthed in August of 2013, this Ann Arbor area trio coalesced with common influences in Nirvana, Can, Shellac, & The Jesus Lizard. Later, a deep commonality arose in wry humor, record collecting, & true cake-eating sound craft. Psychedelic, crystalline guitars. Buoyant, charred bass. Driving, powerful drums. Bittersweet. Joyous. \n\n\nSuper Thing (Ypsilanti, MI)\nhttps://soundcloud.com/superthing-1\n\nEveryone's favorite post-doom golden boys.\n\n\n$5 suggested donation for our out-of-town friends.\n\nDoors at 9, with music starting at 10.\nSHOW UP ON TIME!\n\nRespect the house and the artists.\nThis is a music event, not a house party.\nEngage and participate.", "url": "https://www.facebook.com/events/961752583878622/"}, {"source": "Facebook", "date": "2016-05-18T19:00:00-04:00", "name": "Aventura March Madness", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/"}, {"source": "Facebook", "date": "2016-05-20T20:00:00-04:00", "name": "Pat Donohue at Green Wood Coffee House", "description": "Grammy winner Pat Donahue is one of the most popular finger pickers in the world. His musical tastes are eclectic. Though he considers himself foremost a folk guitarist, Pat’s influences are rooted in bluesmen Blind Blake, Robert Johnson, Duke Ellington, Muddy Waters and Miles Davis.\nHaving been a songwriter and guitarist for twenty years for the “Guys All Star Shoe Band” of Minnesota Public Radio’s “A Prairie Home Companion,” Pat got to show off his savvy licks and distinctive original songs to millions of listeners each week. After wrapping up this impressive longterm gig, Pat now turns to full time concert touring, presenting master guitar workshops and attending prestigious music camps. www.patdonahue.com", "url": "https://www.facebook.com/events/148870615480384/"}, {"source": "Facebook", "date": "2016-05-25T18:00:00-04:00", "name": "How to Submit Your Artwork to a Show or Gallery", "description": "Our May Artists' Meet & Greet topic is \nHow to Submit Your Artwork to a Show or Gallery. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/1176167649079840/"}, {"source": "Facebook", "date": "2016-05-29T19:00:00-04:00", "name": "Aventura March Madness", "description": "JOIN THE MADNESS!\nFor the first time ever Aventura will be showing all of the happenings for March Madness.\n\nTipping off with Selection Sunday we invite you to make your own Aventura March Madness Bracket. Have a drink while you bounce ideas off our knowledgeable bartenders. \n\nClick the link in the \"Tickets Available\" section above to download and print your own Aventura Bracket. \n\nTo enter, you must bring your Bracket into Aventura by March 14 at Midnight. $10 cash or credit gets you in the game, and the winner gets all in the form of an Aventura gift card.\n\nWe will announce the Bracket winner April 6.\n\nEXTENDING THE MADNESS \nMarch 15, join the LIVE stream of each round in one of our VIP spaces, offering game day inspired food and drink specials.\n\nBEVERAGES\nTeam Spirited Cocktail Specials\nWe will announce our team-spirited cocktails on game days\n\nGame Day Happy Hour Specials\n-$2 off Drafts\n-$5 House Wines\n-$5 Sangria\n\nGAME DAY FOOD\nCrispy Chicken Legs   \n with crunchy celery salad\n     choose from: Lemon Pepper or honey harissa\n\nFried Michigan Cheese Curds\nwith romesco sauce\n\nSmoked Whitefish Salad", "url": "https://www.facebook.com/events/781623368609473/"}, {"source": "Facebook", "date": "2016-06-17T20:00:00-04:00", "name": "Vance Gilbert", "description": "New music!", "url": "https://www.facebook.com/events/206916049673630/"}, {"source": "Facebook", "date": "2016-06-18T20:00:00-04:00", "name": "Hayes Carll w/Emily Gimble", "description": "New music from Hayes! Emily Gimble is the granddaughter of legendary Texas fiddler Johnny Gimble.", "url": "https://www.facebook.com/events/1200205393330710/"}, {"source": "Facebook", "date": "2016-06-20T21:00:00-04:00", "name": "James McCartney 6/20/16 at Blind Pig - Ann Arbor", "description": "Monday, June 20 | 9pm | 18+ | $15 adv./ $20 day of\n\nCritically acclaimed singer-songwriter James McCartney has remained fiercely dedicated to his musical vision of melding smart hooks and feral alt-rock with the grandeur and spiritually centeredness of psychedelic music. Now, he issues the sharpest entry of his vision, the majestic The Blackberry Train engineered by Steve Albini (Nirvana, The Pixies and PJ Harvey).\n\n“It’s all been an evolution,” James says. “This set of songs definitely has a harder edge, but it’s a continuation of the last album. The main thing for me is to not conform or compromise.”\n\nJames’ panoramic artistry is inspired by such diverse musicians as Kurt Cobain, The Smiths, Radiohead, PJ Harvey, The Cure, The Beatles, Neil Young, Jimi Hendrix, and Hank Williams. His fingerprint aesthetic has earned him plaudits from Rolling Stone, The Boston Globe, The New York Times, and The Daily News. He’s earned a strong following the old fashioned way, through tirelessly touring the US, Europe and the UK, and playing bigger and bigger shows with each go around.\n\nThe Blackberry Train is an epiphanic co-mingling of aesthetics. James sought out the distinct audio stylings of Steve Albini to conjure a grungier sensibility. He welcomed the engineer’s gifts for capturing music with a raw clarity, and Steve Albini’s reputation for not impinging on an artist’s vision. The results make for an eclectic album with fastidiously crafted songs documented in the studio with glorious purity.\n\n“I like the music to have elements of the avant garde, psychedelic, and be just a little against the grain,” James reveals. “But in the end, it’s about having as much emotion as possible for me, musically and lyrically. It’s all about the music being cathartic, heartfelt and true.”\n\nThe Blackberry Train manages to be both diverse and cohesive. The album opens invigoratingly with the jangling rocker, “Too Hard” and closes with the stately and aptly named folk song “Peace and Stillness.” Between these bookends, highlights include the rough-edged and urgently melodic “Unicorn,” the anthemic “Peyote Coyote,” and the soulful ballad “Prayer.” One very personal song is the winsome and reflective “Waterfall” which was inspired by memories of his mother.\n\nThis summer and fall James will embark on extensive tour dates in the U.S. Thinking ahead, James says: “I just want to keep on going, keep working, and improving as a songwriter. I’d love to feel that I realized my full potential both as a person, and as a songwriter. That feels like a great, fulfilling goal to shoot for. Making a lot of music, and striving for more depth artistically–those are my goals.”", "url": "https://www.facebook.com/events/573249992825775/"}, {"source": "Facebook", "date": "2016-06-22T20:00:00-04:00", "name": "HONEYHONEY", "description": "Rescheduled from March 16.", "url": "https://www.facebook.com/events/1671101093151272/"}, {"source": "Facebook", "date": "2016-06-23T20:00:00-04:00", "name": "The Steve Nardella Blues Band", "description": "A walking encyclopedia of American blues and roots music", "url": "https://www.facebook.com/events/1238691669478608/"}, {"source": "Facebook", "date": "2016-06-28T20:00:00-04:00", "name": "Boy & Bear", "description": "International new folk sensations from Australia", "url": "https://www.facebook.com/events/662938483846794/"}, {"source": "Facebook", "date": "2016-06-29T18:00:00-04:00", "name": "Legal Issues for Artists", "description": "Our June Artists' Meet & Greet topic is Legal Issues for Artists. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/527954430710284/"}, {"source": "Facebook", "date": "2016-07-06T20:00:00-04:00", "name": "Matt the Electrician", "description": "\"A young Paul Simon wrapped in a Tom Waits heart\"—Zvents", "url": "https://www.facebook.com/events/836609109798914/"}, {"source": "Facebook", "date": "2016-07-10T19:30:00-04:00", "name": "Tim Shelton", "description": "Newfound Road's amazing lead vocalist steps out with music by Jackson Browne and more. This show has been rescheduled from June 16.", "url": "https://www.facebook.com/events/1124052387614735/"}, {"source": "Facebook", "date": "2016-07-21T10:00:00-04:00", "name": "The 2016 Ann Arbor Art Fair", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/"}, {"source": "Facebook", "date": "2016-07-21T10:00:00-04:00", "name": "State Street Art Fair", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "url": "https://www.facebook.com/events/487403974717996/"}, {"source": "Facebook", "date": "2016-07-22T10:00:00-04:00", "name": "The 2016 Ann Arbor Art Fair", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/"}, {"source": "Facebook", "date": "2016-07-22T10:00:00-04:00", "name": "State Street Art Fair", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "url": "https://www.facebook.com/events/487403974717996/"}, {"source": "Facebook", "date": "2016-07-24T10:00:00-04:00", "name": "The 2016 Ann Arbor Art Fair", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/"}, {"source": "Facebook", "date": "2016-07-24T10:00:00-04:00", "name": "State Street Art Fair", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "url": "https://www.facebook.com/events/487403974717996/"}, {"source": "Facebook", "date": "2016-07-27T10:00:00-04:00", "name": "The 2016 Ann Arbor Art Fair", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "url": "https://www.facebook.com/events/994376950635153/"}, {"source": "Facebook", "date": "2016-07-27T10:00:00-04:00", "name": "State Street Art Fair", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "url": "https://www.facebook.com/events/487403974717996/"}, {"source": "Facebook", "date": "2016-07-27T20:00:00-04:00", "name": "Leftover Cuties", "description": "A retro-tinged jazz sound with contemporary honesty", "url": "https://www.facebook.com/events/1570961503220935/"}, {"source": "Facebook", "date": "2016-07-28T20:00:00-04:00", "name": "Scythian", "description": "The Old Tin Can tour!", "url": "https://www.facebook.com/events/1262918310390270/"}, {"source": "Facebook", "date": "2016-08-06T20:00:00-04:00", "name": "John Berry", "description": "The king of romantic country, up close and personal", "url": "https://www.facebook.com/events/1694055327520106/"}, {"source": "Facebook", "date": "2016-08-10T20:00:00-04:00", "name": "Hot Tuna Acoustic", "description": "Jefferson Airplane's blues-roots offshoot, sounding better than ever", "url": "https://www.facebook.com/events/976545022426759/"}, {"source": "Facebook", "date": "2016-08-12T20:00:00-04:00", "name": "Captain Ivory", "description": "Nashville rock 'n' roll with Motor City soul", "url": "https://www.facebook.com/events/1680680362219416/"}, {"source": "Facebook", "date": "2016-08-14T19:30:00-04:00", "name": "The Lunar Octet and The Lunar Glee Club", "description": "Highly eclectic Latin sounds from Michigan", "url": "https://www.facebook.com/events/850613031732051/"}, {"source": "Facebook", "date": "2016-08-19T20:00:00-04:00", "name": "Dougie MacLean", "description": "\"Scotland's greatest living songwriter\"—Celtic World", "url": "https://www.facebook.com/events/1120634974616420/"}, {"source": "Facebook", "date": "2016-08-24T20:00:00-04:00", "name": "Katie Geddes", "description": "Southeast Michigan's beloved songstress", "url": "https://www.facebook.com/events/241378229531717/"}, {"source": "Facebook", "date": "2016-08-26T20:00:00-04:00", "name": "Ellis Paul", "description": "\"Finds light in telling stories through music\"—Albuquerque Journal", "url": "https://www.facebook.com/events/1721730291447543/"}, {"source": "Facebook", "date": "2016-08-27T20:00:00-04:00", "name": "George Bedard’s History of American Music Series—Part 4", "description": "Tonight's show explores rockabilly and related genres.", "url": "https://www.facebook.com/events/1705288336408032/"}, {"source": "Facebook", "date": "2016-09-15T20:00:00-04:00", "name": "Altan", "description": "Ireland's legends push musical boundaries", "url": "https://www.facebook.com/events/905763186211716/"}, {"source": "Facebook", "date": "2016-09-16T20:00:00-04:00", "name": "Second City—Night 1", "description": "The Free Speech (While Supplies Last) tour", "url": "https://www.facebook.com/events/1275355069146738/"}, {"source": "Facebook", "date": "2016-09-16T20:00:00-04:00", "name": "Melanie at Green Wood Coffee House", "description": "At Woodstock, as a New York kid barely known outside the coffeehouse circuit in Greenwich Village, she sang her song, \"Beautiful People\" and inspired the first panorama of candles and cigarette lighters ever raised at a concert event. That, in turn, moved the young singer to write \"Lay Down (Candles in the Rain\"), which sold more than one million copies in 1970 and prompted Billboard, Cashbox, Melody Maker, Record World, and Bravo to anoint her as female vocalist of the year. Her single, \"Brand New Key,\" topped the charts in 1971.\nWith guitar in hand and a combination of amazing vocal talent, disarming humor, and a vibrant engagement with life, she was booked as the first solo pop/rock artist ever to appear at the Royal Albert Hall, Carnegie Hall, and the Metropolitan Opera House, and later opened the New Metropolitan Opera House in New York, the Sydney Opera House, and in the General Assembly of the United Nations, where she was invited to perform on many occasions as delegates greeted her performances with standing ovations.\nThe top television hosts of all time -- Ed Sullivan, Johnny Carson, and Dick Cavett -- battled to book her.\nUNICEF made her its spokesperson; Jimi Hendrix's father introduced her to the multitude assembled for the twentieth anniversary of Woodstock. Her records continued to sell -- more than eighty million to date. She's had her songs covered by singers as diverse as Cher, Dolly Parton, and Macy Gray. She's raised a family, won an Emmy, opened a restaurant, and written a musical about Wild Bill Hickok and Calamity Jane.\nThis is a rare opportunity to experience Melanie live and in person in an intimate venue. Don't miss it!\nwww.melaniesafka.com", "url": "https://www.facebook.com/events/1653085994944878/"}, {"source": "Facebook", "date": "2016-09-17T20:00:00-04:00", "name": "Second City—Night 2", "url": "https://www.facebook.com/events/230895810592540/"}, {"source": "Facebook", "date": "2016-09-18T21:00:00-04:00", "name": "UnDebateable, the UnPresidential Debates - Clown Car to the White House", "description": "THIS EVENT HAS BEEN POSTPONED TO LATER IN THE POLITICAL SEASON.  PLEASE CHECK OUT THE NEW NOVEMBER 1ST PROGRAM, \"JOKES IN PROCESS\" THAT WE HAVE PUT INTO ITS PLACE.  \n\nThe presidential candidates have been HILARIOUS this year, but now let's see how the professionals do.\nJoin the Emergent Art's Theater and the UnClub as they present \"UnDebateable, the UnPresidential Debates\".\n\nIf you would like to be a part of this historic event, either as a moderator, an interview, and audience reporter, or an actual campaign spokeperson, or if you can do an impression of a candidate, please click the 'Going' button.  If you can't commit, but you are interested in following this event, click 'Maybe' and we will keep you informed.\n\nWe are also looking for folks who can help us stream a webcast of this event.\n\nWant to be a sponsor?  We'll take that too.", "url": "https://www.facebook.com/events/1690454564522707/"}, {"source": "Facebook", "date": "2016-09-20T20:00:00-04:00", "name": "Bill Staines", "description": "\"Bill Staines has been my hero since 1977.\"—Nanci Griffith", "url": "https://www.facebook.com/events/1581166152202412/"}, {"source": "Facebook", "date": "2016-09-22T20:00:00-04:00", "name": "The Fred Eaglesmith Traveling Steam Show", "description": "\"I think the bottom of the barrel is where the answers are.\"—Fred Eaglesmith", "url": "https://www.facebook.com/events/183894411968312/"}, {"source": "Facebook", "date": "2016-10-01T20:00:00-04:00", "name": "Melissa Ferrick", "description": "New music from an OUT magazine OUT100 featured music honoree", "url": "https://www.facebook.com/events/1679614935644801/"}, {"source": "Facebook", "date": "2016-10-07T20:00:00-04:00", "name": "Lou and Peter Berryman at Green Wood Coffee House", "description": "Lou and Peter Berryman were both raised in Appleton, WI, and began playing music together in high school during the sixties. During the following nomadic decade, Lou studied classical voice and music theory in college while Peter continued an unfocused fascination with surrealist art, beatnik poetry, and jug band music. Early influences of American and British musical comedy and folk music fed a growing repertoire of original songs. A brief marriage in the early seventies resolved into a lifelong friendship, and by the late seventies and early eighties the two were honing their skills playing regular weekly concerts in Madison, becoming full-time musicians and songwriters in 1979. During those early years they wrote new songs every week, many about the history, cheese, beer and strange politics of their home state. By the mid '80s they were traveling all across the country, still writing and singing, but now with a broader perspective, finding that the quirks of their home state were not so much Midwestern as human. In twenty-five years of performing together, Lou and Peter have released twenty albums and four songbooks worth of hilarious, quirky, yet oddly profound songs, rich with word play and interesting images. Pete Seeger, Tom Paxton and Tom Lehrer count themselves among their fans. Their work has appeared in numerous compilations such as the popular \"Rise Up Singing\" songbook, in periodicals like \"SING OUT! Magazine\", and in many audio compilations. Berryman songs are being sung around the world by a legion of professional musicians including Peter, Paul and Mary, Garrison Keillor and Peggy Seeger. They have appeared numerous times on such national programs as NPR's \"A Prairie Home Companion\" and \"Weekend Edition.\"\nwww.louandpeter.com", "url": "https://www.facebook.com/events/964923176923370/"}, {"source": "Facebook", "date": "2016-10-21T20:00:00-04:00", "name": "Joshua Davis—Night 1", "description": "Two nights with Steppin' in It's fast-rising lead vocalist", "url": "https://www.facebook.com/events/1668844700041158/"}, {"source": "Facebook", "date": "2016-10-22T20:00:00-04:00", "name": "Joshua Davis—Night 2", "url": "https://www.facebook.com/events/215744518775574/"}]