[{"source": "Facebook", "date": "2016-05-21T09:00:00-04:00", "description": "Come lend a hand in our largest nature area! Bird Hills is a great place to hike, with rolling terrain and great views of the river. The slopes make for more types of habitat too, so there’s a lot of natural diversity to protect here. Bring your family and friends, we’ll be removing invasive garlic mustard and other exotics that crowd out and suppress native wildflowers. Join us at the Bird Road entrance on the north side of this park, west of Huron River Drive. There is limited parking at the entrance, but more nearby at the Barton Nature Area entrance on Huron River Drive.", "url": "https://www.facebook.com/events/222937878093236/", "name": "Park Stewardship Workday"}, {"source": "Facebook", "date": "2016-05-21T10:30:00-04:00", "description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "url": "https://www.facebook.com/events/1241626532528989/", "name": "Little Peeps PlayGround - \"Feelings\""}, {"source": "Facebook", "date": "2016-05-21T13:00:00-04:00", "description": "The Park Stewards here need your help in this small gem of a nature area. The dogwoods should be blooming about this time; we can admire them while we remove garlic mustard and other invasive plant species. Please meet at the park entrance on Beechwood Drive.", "url": "https://www.facebook.com/events/534260020089677/", "name": "Park Stewardship Workday"}, {"source": "Facebook", "date": "2016-05-21T18:30:00-04:00", "description": "Come join The SWITCHBACKS for a high-steppin', foot-stompin', toe-tappin' good-ole time! No cover charge, food, drink, dance floor, groovin' music... aw yeah!", "url": "https://www.facebook.com/events/838479462963723/", "name": "Switchbacks at Club Above SAT 5/21/16"}, {"source": "Facebook", "date": "2016-05-21T20:00:00-04:00", "description": "Join us in the Pendleton Room at the Union when Out Loud explores the process of discovering oneself. Selections include Natasha Bedingfield’s Unwritten, Defying Gravity, a medley from the smash Broadway musical, “Kinky Boots”, I've Gotta Be Me, Reflection from Mulan, and Christina Aguilera’s Beautiful. Director Paul Haebig leads the chorus with Annie Jeng on piano, Tamara Perkuhn on percussion and Edie Herrold on bass. \n\nPrice: \n—$15 advance/$18 at door, \n—$12 for seniors (65+) and students\n—Free for children under 4\n\nTickets available online http://olconline.org/ or at Common Language Bookstore.\n\nOut Loud is sponsored in part by the Michigan Council for Arts and Cultural Affairs, the National Endowment for the Arts and U-M’s Spectrum Center.  \n—http://www.michiganbusiness.org/community/council-arts-cultural-affairs/#MCACA\n—https://www.arts.gov/  \n—https://spectrumcenter.umich.edu/", "url": "https://www.facebook.com/events/1572133599768114/", "name": "Destination: Me - The Journey of Transformation - SATURDAY NIGHT"}, {"source": "Facebook", "date": "2016-05-21T20:00:00-04:00", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Natural Born Killaz\" starring Jaclynn Cherry and Michael Owen Smith\n\nGroup 2: \"The Agenda\" starring Gary Lehman, Chris Fortin, Jeremy St. Martin, and Scotty Meyers\n\nGroup 3: \"The League of Pointless Improvisers\" starring Matt Swartz, Matthew Flickinger, Steve Oliver, Aaron Johnstone, and Gary Lehman", "url": "https://www.facebook.com/events/267317186952645/", "name": "Pointless Improv with Natural Born Killaz and The Agenda"}, {"source": "Facebook", "date": "2016-05-21T21:00:00-04:00", "description": "Dancehall, Reggae, Hip Hop\nFree before 10 pm 18+\n$5", "url": "https://www.facebook.com/events/480648552124801/", "name": "Rebel Alliance 5"}, {"source": "Facebook", "date": "2016-05-21T22:00:00-04:00", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"The Agenda\" starring Gary Lehman, Chris Fortin, Jeremy St. Martin, and Scotty Meyers\n\nGroup 2: \"Natural Born Killaz\" starring Jaclynn Cherry and Michael Owen Smith\n\nGroup 3: \"The League of Pointless Improvisers\" starring Matt Swartz, Matthew Flickinger, Steve Oliver, Aaron Johnstone, and Gary Lehman", "url": "https://www.facebook.com/events/1763625963871522/", "name": "Pointless Improv with The Agenda and Natural Born Killaz"}, {"source": "Facebook", "date": "2016-05-22T11:30:00-04:00", "description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: Strawberries & Cream - Cream soda meets fresh-picked strawberry in this juicy rendition of the infamous Strawberry Blonde. Smooth scents of vanilla flood the nose and taste buds at first sip, followed by the bite of strawberry and a satisfying finish.. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "url": "https://www.facebook.com/events/158066451258466/", "name": "American Craft Beer Week"}, {"source": "Facebook", "date": "2016-05-22T12:00:00-04:00", "description": "Our Bacon Mac and Cheese Poppers are already popping with flavor- add extras like jalepeno, bacon, or sriracha and you've pretty much got modern comfort food nirvana!\n\n3/$5\n\nSunday 12-2 and 5-7", "url": "https://www.facebook.com/events/498636503664121/", "name": "Magic Mac-n-Cheese Balls"}]