[{"date": "2016-10-17T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1374253909486568/", "description": "Give the Gift of Fine Dining\nEnjoy FREE MSV Gift Certificates with your purchase.\n\nPurchase $250 or more in Gift Cards and get a free $25 Gift Certificate for every $250 spent.     \n\nPurchase $1,000 or more in Gift Cards, and get a free $50 Gift Certificate for every $250 spent. \n\nMSV Combo Package \nFor only $75 get a $50 Gift Card and TWO Distinctive Recipes Cookbooks \n\nOur Gift Cards and MSV Combo Package can be purchased at our restaurant,\n by calling (888) 456-3463 (DINE), or visit us online at: www.mainstreetventuresinc.com/shop. \n\nTake advantage of this special offer. Offer only available until 12/31/2013.", "name": "Give the gift of fine dining with MSV Gift Cards!"}, {"date": "2016-10-17T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/523276784537267/", "description": "Learn to use the Arduino, a popular micro-controller used by artists, musicians, gardeners, hobbyists and engineers! In this class we will cover the basics of programming and connecting simple switches, sensors, and outputs. \n\nThis is a beginner course, so no electronics or programming experience is necessary. (It may move slow for experienced programmers.) \n\nThis is a 3 hour class and the cost is $90. Arduino supplied for use in class. More details at maker-works.com/classes/introduction-to-arduino-skill-development/ \nPlease arrive 10 minutes early if visiting Maker Works for the first time.\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=17&month=10&year=2016&view=day to sign up", "name": "Intro to Arduino"}, {"date": "2016-10-17T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1294572053921403/", "description": "Literati is thrilled to welcome Brit Bennett back to Ann Arbor in support of her debut novel, The Mothers, a staff pick and our Literati Cultura selection for October. Brit will be joined in conversation by Chris McCormick, the author of Desert Boys.\n\nSet within a contemporary black community in Southern California, Brit Bennett’s mesmerizing first novel is an emotionally perceptive story about community, love, and ambition. It begins with a secret. “All good secrets have a taste before you tell them, and if we’d taken a moment to swish this one around our mouths, we might have noticed the sourness of an unripe secret, plucked too soon, stolen and passed around before its season.”\n\nIt is the last season of high school life for Nadia Turner, a rebellious, grief-stricken, seventeen-year-old beauty. Mourning her own mother’s recent suicide, she takes up with the local pastor’s son. Luke Sheppard is twenty-one, a former football star whose injury has reduced him to waiting tables at a diner. They are young; it’s not serious. But the pregnancy that results from this teen romance—and the subsequent cover-up—will have an impact that goes far beyond their youth. As Nadia hides her secret from everyone, including Aubrey, her God-fearing best friend, the years move quickly. Soon, Nadia, Luke, and Aubrey are full-fledged adults and still living in debt to the choices they made that one seaside summer, caught in a love triangle they must carefully maneuver, and dogged by the constant, nagging question: What if they had chosen differently? The possibilities of the road not taken are a relentless haunt.\n\nIn entrancing, lyrical prose, The Mothers asks whether a “what if” can be more powerful than an experience itself. If, as time passes, we must always live in servitude to the decisions of our younger selves, to the communities that have parented us, and to the decisions we make that shape our lives forever.\n\n“Brit Bennett’s masterful debut is brimming with unforgettable scenes and the sort of keenly-observed, precise language that makes you look at your own relationships anew. Told with the wisdom of a seasoned, compassionate storyteller, The Mothers is a novel about community, friendship, grief and growth. The two women at the center of this novel are characters you will find yourself thinking about long after you’ve turned the last page– they pull you in close and never let you go. Bennett is a brilliant and much-needed new voice in literature.” –Angela Flournoy, author of National Book Award-finalist The Turner House\n\n“Brit Bennett’s The Mothers is an engaging and assured debut novel of depth, and introspective power. It succeeds as a brilliant study of a modern black woman, and as a lyrical and majestic portrait of her place in society.” —Chigozie Obioma, author of The Fishermen\n\n“Wonderful – warm and tender and necessary.” –Yaa Gyasi, author of Homegoing \n\nBorn and raised in Southern California, Brit Bennett graduated from Stanford University and later earned her MFA in fiction at the University of Michigan, where she won a Hopwood Award in Graduate Short Fiction as well as the 2014 Hurston/Wright Award for College Writers. Her work is featured in The New Yorker, The New York Times Magazine, The Paris Review, and Jezebel.", "name": "Brit Bennett, with Chris McCormick"}, {"date": "2016-10-18T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/278610785853131/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nDickie D. - Richard Delcamp, Singer-songwriter-guitar-banjo artist from Dragon Wagon, one of Michigan's premier bluegrass outfits,  playing a little bit of everything, Acoustic rock/Americana/traditional roots/bluegrass/folk/blues/original songwriting!\n\nNew a cover\nAlways a good time", "name": "Acoustic Tuesdays: Rich Delcamp"}, {"date": "2016-10-18T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1050170571748316/", "description": "The weather is turning crisp and cool, so warm up with poetry and coffee at Sweetwaters Coffee & Tea. Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Readers\n\nThis month's feature: CITYWIDE POETS!\n\nThree representatives of Citywide Poets will feature this month: SAKILA ISLAM is a two time iO Slam Team member and current U of M Student. MARRIM AL-AKASHI is a Detroit Citywide poet alumna. Her poetry centers around her identity as a Muslim American poet of Iraqi descent. JUSTIN ROGERS is a Detroit poet educator and host. He was a BNV participant with Detroit's Youth Team Citywide Poets in '09 and 2011. CITYWIDE POETS (CWP) is Inside Out's award-winning after school performance poetry troupe for teens offers the mentorship of adult poets who possess strong publication and performance credentials. Youth perform at numerous venues, see their work published in an anthology, take awards for their poetry, and compete to attend the Brave New Voices National Youth Poetry Slam, held annually in various cities across the country.\n\n\nNext month: MATT HART!", "name": "Skazat! Poetry Series featuring Citywide Poets"}, {"date": "2016-10-19T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1760094844245246/", "description": "This class will introduce you to MIG and TIG welding. You will learn the basic operations with an emphasis on safety. Maker Works has welding jackets and face shields for you to borrow. If you have a welding jacket, please bring it. With successful completion of this class, you will be certified to use the TIG and MIG welder.\n\nPlease arrive 10 minutes early if visiting Maker Works for the first time. $70\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=19&month=10&year=2016&view=day to sign up.", "name": "MIG / TIG Welding"}, {"date": "2016-10-19T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/333437037006239/", "description": "You've come to your local theatre/brewery to see the premiere of \"Happy Hour,\" a brand new play, only to find that you've stepped right into a space-time anomaly. The actors are all missing and the oblivious bartender doesn't know he's caught in a time loop - but he'll still serve you drinks! You and your team have one hour to find clues and solve puzzles in order to repair the timeline and, more importantly, escape the room. \n\nAdventure Lab is a new business specializing in escape rooms and other live-action puzzle games. If you enjoy puzzles, fun, adventures, games, or improving your small group communication skills, then you won't want to miss this unique event at Pointless!\n\nSelect the time and date you would like to attend. Each time slot is limited to 3-6 people.\n\nAdventures are:​\nWednesday, October 19 @ 6 pm\nWednesday, October 19 @ 8 pm\nWednesday, October 19 @ 10 pm", "name": "Trappy Hour - an escape room adventure with a Halloween twist"}, {"date": "2016-10-19T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1284592874904358/", "description": "Literati is pleased to welcome Christine Sneed and Grace Tiffany, reading from their latest work. \n\nChristine Sneed is the author, most recently, of The Virginity of Famous Men. Her story collection Portraits of a Few of the People I've Made Cry won the Grace Paley Prize, Ploughshares’ John C. Zacharis Prize, and was a Los Angeles Times Book Prize finalist. Her debut novel Little Known Facts won the Society of Midland Authors award for best adult fiction and was named a top ten debut novel of 2013 by Booklist. Her latest novel is Paris, He Said. Sneed teaches at Northwestern University and DePaul University and lives in Evanston, Illinois.\n\nGrace Tiffany is the author of six historical novels set in the Renaissance or Middle Ages, including Will (Berkley 2004), My Father Had a Daughter (Berkley 2003), Ariel (HarperCollins 2005), The Turquoise Ring (Berkley 2005), Paint (Bagwyn Books 2013), and Gunpowder Percy (ACMRS 2016). A Shakespeare scholar and editor, a professor of English at Western Michigan University, and the author of two nonfiction works on Renaissance literature and culture, Grace Tiffany uses fiction as an additional medium for exploring the early modern world", "name": "Christine Sneed & Grace Tiffany"}, {"date": "2016-10-19T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1769515709996649/", "description": "Two nights of dark delights!\n\nWednesday October 19, and Wednesday, October 26!\n\nThis annual event will be one of your favorite events this fall!  Please call 734.222.9841 for reservations.  Seats are very limited.", "name": "Black Wine Night"}, {"date": "2016-10-19T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/200433560358995/", "description": "Wednesday, Oct. 19 | 9pm | 18+ | $10 Cover\n\nSeamlessly blending Funk, Soul, and Rock n’ Roll, THE MAIN SQUEEZE promises to keep your body moving with their infectious feel-good musical gumbo.\n\nThe energetic five-piece found its roots in Bloomington Indiana’s surprisingly vibrant live music scene, and they have been leaving audiences “Freshly Squozen” since 2010.\n\nTheir ability to fluidly blend and bend genres is unparalleled, and creates for an unforgettable live experience. Every performance is different from the last, showcasing each member’s virtuosic talent with soulful vocals, intricate jams, tight grooves and powerful solos.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/765", "name": "The Main Squeeze 10/19/16 at Blind Pig - Ann Arbor"}]