[{"source": "Facebook", "url": "https://www.facebook.com/events/1716312661946739/", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "name": "TheRide’s ServiceFest", "date": "2016-03-23T10:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/968784676489949/", "description": "Join us for this free event!\n\nOur March Artists' Meet & Greet topic is \"How to write an artist statement\". \n\nSPEAKER: Maya West\n\nMaya West is a freelance writer, translator, and designer splitting her time between Ann Arbor, Michigan and Seoul, Korea. She currently works in administration at the Helen Zell Writers' Program at the University of Michigan, where she graduated with an MFA in Fiction in 2014.\n\n---------------------------\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "name": "How to Write an Artist Statement", "date": "2016-03-23T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1056784647698709/", "description": "This week at the Yellow Barn's Unplugged Wednesdays series:\n\nRebel A's – Two voices and a guitar. Amy Johnson and Aaron Tice perform original acoustic americana music for all audiences who can relate to wanting to live out of the ordinary..\n\nZoe Raine – An Ann Arbor native and student of Schoolcraft College, playing solo acoustic originals on guitar and ukulele.\n\n$5 at the door.", "name": "Rebel A's + Zoe Raine – Unplugged Wednesdays", "date": "2016-03-23T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1053725137981528/", "description": "What is it?\nWe are working with the community to help\ncreate a light rail transit system that will\nconnect downtown to world-class medical\ncenters. Central Campus to North Campus.\nPlymouth Road to Main Street shops. All with\ngreater capacity. Greater comfort. More\nsustainably powered. Faster, more reliable\nservice. And setting Ann Arbor up for the next\ncentury.\n\nThese Open House Events will include\nproject staff and representatives from\nthe collaborating organizations to answer\nquestions and record comments.\nWe’ll provide an overview of the project to\ndate and the draft recommendations of\nthe consultant and Project Management\nCommittee.\n\nAreas of discussion:\n• Type of transit technology\n• Configuration of the route\n• Station locations\n• Cost estimate\n• Future expansion possibilities\n\nThis is the fourth in a series of public input\nopportunities. Previous meetings were held in\nDecember 2012, June 2013, and November,\n2013.\n\nFor more information about the project, please\ncontact us at info@aaconnector.com", "name": "Connector Open House", "date": "2016-03-24T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/837658899685192/", "description": "The Zell Visiting Writers Series Presents:\n\nLyrae Van-Clief Stefanon Q&A\nThursday, March 24th, 2pm\nHopwood Room\n\nLyrae Van-Clief Stefanon Poetry Reading & Book Signing\nThursday, March 24th, 5:30 pm\nUMMA Helmut Stern Auditorium \n\nAll events free & open to the public.\n\n* * *\nLyrae Van Clief-Stefanon is the author of Open Interval, a 2009 National Book Award finalist,and Black Swan, winner of the 2001 Cave Canem Poetry Prize, as well as Poems in Conversation and a Conversation, a chapbook in collaboration with Elizabeth Alexander. Her work has appeared in such journals as African American Review, Callaloo, Crab Orchard Review, Gulf Coast, and Shenandoah, and in the anthologies Bum Rush the Page, Role Call, Common Wealth, Gathering Ground, and The Ringing Ear: Black Poets Lean South. She is currently at work on a third collection, The Coal Tar Colors.\n\nFor more info, please visit: https://events.umich.edu/event/26827", "name": "Lyrae Van-Clief Stefanon Poetry Reading & Book Signing", "date": "2016-03-24T17:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1650481561881321/", "description": "What is it?\nWe are working with the community to help\ncreate a light rail transit system that will\nconnect downtown to world-class medical\ncenters. Central Campus to North Campus.\nPlymouth Road to Main Street shops. All with\ngreater capacity. Greater comfort. More\nsustainably powered. Faster, more reliable\nservice. And setting Ann Arbor up for the next\ncentury.\n\nThese Open House Events will include\nproject staff and representatives from\nthe collaborating organizations to answer\nquestions and record comments.\nWe’ll provide an overview of the project to\ndate and the draft recommendations of\nthe consultant and Project Management\nCommittee.\n\nAreas of discussion:\n• Type of transit technology\n• Configuration of the route\n• Station locations\n• Cost estimate\n• Future expansion possibilities\n\nThis is the fourth in a series of public input\nopportunities. Previous meetings were held in\nDecember 2012, June 2013, and November,\n2013.\n\nFor more information about the project, please\ncontact us at info@aaconnector.com", "name": "Connector Open House", "date": "2016-03-24T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1734419736791919/", "description": "Literati is thrilled to welcome Tom Bissell, reading from his latest, Apostle: Travels Among the Tombs of the Twelve.\n\nIn this profound and moving journey into the heart of Christianity, the widely acclaimed author of\"The Disaster Artist\"explores the mysterious and often paradoxical lives and legacies of the Twelve Apostles a book both for those of the Christian faith and those who want to understand it from the outside in.\n\nPeter, Matthew, Thomas, John: Who were these men? What was their relationship to Jesus? Tom Bissell gives us rich and deeply informed answers to these ancient and surprisingly elusive questions. He examines not just who these men were (and weren't), but how their identities have taken shape over the course of two millennia. He makes clear that, ultimately, their story is the story of Christianity and its growth from an obscure Jewish sect to the global faith we know today. Bissell has visited holy sites from Rome and Jerusalem to Turkey, India, and Kyrgyzstan, and he vividly captures the rich diversity of Christianity's global reach. Written with warmth, humor, and rare acumen, Apostle is a brilliant synthesis of travel writing, biblical history, and a deep lifelong relationship with Christianity. The result is an unusual, erudite, at times hilarious book a religious, intellectual, and personal adventure.\n\nTom Bissell was born in Escanaba, Michigan, in 1974. He has lived in New York City, Uzbekistan, Vietnam, Italy, Las Vegas, Estonia, Portland, and currently lives in Los Angeles. In 2006 he was awarded the Rome Prize, and in 2010 he received a Guggenheim Fellowship. He has also done scriptwriting for several popular video-game franchises, including Gears of War, Battlefield, and Uncharted.", "name": "Tom Bissell", "date": "2016-03-24T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1581383522183183/", "description": "Come celebrate Irish week here at babo!\n\nWe will be offering 10% off all green juices, Irish lattes, and beer on draft. \n\nAnd don't forget about our delicious Irish food specials!\n\nSee our menu below!\n\nHowever, you will be celebrating we have options for you!\n\nBABO IRISH WEEK\nMonday, March. 14th –Sunday, Mar. 20th\n\nFOOD SPECIALS\n\nSANDWICH OF THE WEEK\n\nCORNED BEEF SANDWICH\ncrust bakery rye, housemade corned beef, braised cabbage slaw, whole grain mustard, swiss cheese\n\nENTREE OF THE WEEK\n\nRYE-CRUSTED CORNED BEEF\nbraised corned beef with toasted caraway, crust bakeries rye bread crumbs, topped with rich caraway gravy\n\nVEGETARIAN ENTREE OF THE WEEK\n\nBRAISED CABBAGE\nslow braised cabbage, onion, and tomatoes seasoned with garlic, onion, thyme, and fennel seed\n\nFEATURED SIDES\n\nROSTI POTATOES\nshredded potato pancake filled with roasted shallots, thyme, and cheddar cheese\n\nROASTED ROOT VEGETABLE MEDLEY\ncarrots, parsnips, turnips, fennel, garlic, thyme, and Guinness stout glaze", "name": "Babo Irish Week", "date": "2016-03-24T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1577492092573060/", "description": "All About Eve (Katie Geddes and Deb Wood) and Michael Krieger present the story of Good Friday, told through the music of Indigo Girls, Natalie Merchant, and Andrew Lloyd Webber, along with scripture and prayer.\n \n                               30 minute service\n                    repeats at 7:30pm and 8:00pm\n            Enter at any time; stay as long as you like\n              (worship service; no admission charge)", "name": "Good Friday Evening Vigil featuring All About Eve and Michael Krieger", "date": "2016-03-25T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/487821191409092/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"The Real Thing\" starring Nathan Corliss and Mat De Lisle\n\nGroup 2: \"Doom and Doomer\" starring Jeremy Conn and Jenny Bloomer\n\nGroup 3: \"The League of Pointless Improvisers\" starring Andy Reid, Jason Valentini, Matt Swartz, Matthew Flickinger, Mitch Socia, and Moni Jones", "name": "Pointless Improv with The Real Thing and Doom and Doomer", "date": "2016-03-25T20:00:00-04:00"}]