[{"url": "https://www.facebook.com/events/857480274361121/", "source": "Facebook", "date": "2016-04-11T12:00:00-04:00", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "name": "Fresh + Fit!"}, {"url": "https://www.facebook.com/events/194586454240654/", "source": "Facebook", "date": "2016-04-11T18:30:00-04:00", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "name": "TheRide’s ServiceFest"}, {"url": "https://www.facebook.com/events/970356073044758/", "source": "Facebook", "date": "2016-04-11T19:00:00-04:00", "description": "Literati is pleased to welcome Sarah Messer and Suzanne Wise as part of our celebration of National Poetry Month.\n\nSarah Messer has received grants and awards from the National Endowment for the Arts, the Mellon Foundation, the Fine Arts Work Center in Provincetown, the Michigan Council for the Arts and others. She is the author of four books: two poetry collections, Bandit Letters and Dress Made of Mice, a history/memoir Red House, and a book of translations, Having Once Paused, Poems of Zen Master Ikkyu. In 2008-2009, she was a Poetry Fellow at the Radcliffe Institute for Advanced Studies. For many years she taught in the MFA program at the University of North Carolina-Wilmington. Currently she runs One Pause Poetry (onepausepoetry.org) in Ann Arbor, Michigan and works at White Lotus Farms.\n\nSuzanne Wise is the author of the poetry collection The Kingdom of the Subjunctive and a chapbook, Talking Cure. Recent poems have appeared in Bomb, Guernica, Ploughshares, Bone Bouquet, Catch Up, Green Mountains Review, and elsewhere. She has taught creative writing at Middlebury College in Vermont, and Pratt Institute and Poets House in New York City.", "name": "Poetry at Literati: Sarah Messer & Suzanne Wise"}, {"url": "https://www.facebook.com/events/1692753224315937/", "source": "Facebook", "date": "2016-04-12T12:00:00-04:00", "description": "This event is geared toward downtown Ann Arbor employees. \nDrop in to this casual informational workshop to find out how these bus service improvements could impact your bus commute. \n\nAlso welcome are any employees who may be interested in taking to bus but are unsure what to do.\n\nFree lunch and giveaways provided!\nRSVP: https://www.messageblocks.com/commute-by-bus", "name": "Commute By Bus? May Service Improvements Explained"}, {"url": "https://www.facebook.com/events/546120148869085/", "source": "Facebook", "date": "2016-04-12T17:30:00-04:00", "description": "The Zell Visiting Writers Series Presents:\n\nAlice McDermott \nZell Distinguished Writer in Residence\nFiction Reading and Book Signing\nTuesday, April 12th, 5:30pm \nUMMA Apse\n\nAlice McDermott: In Conversation with Peter Ho Davies\nThursday, April 14th, 5:30 pm\nUMMA Helmut Stern Auditorium \n\nAll events free & open to the public.\n\n* * *\nAlice McDermott is an American writer and university professor. For her 1998 novel Charming Billy she won an American Book Award and the U.S. National Book Award for Fiction.\n\nMcDermott is Johns Hopkins University's Richard A. Macksey Professor of the Humanities. Born in Brooklyn, New York, McDermott attended St. Boniface School in Elmont, New York, on Long Island (1967), Sacred Heart Academy in Hempstead (1971), and the State University of New York at Oswego, receiving her BA in 1975. She received her MA from the University of New Hampshire in 1978.\n\nShe has taught at UCSD and American University, has been a writer-in-residence at Lynchburg College and Hollins College in Virginia, and was lecturer in English at the University of New Hampshire. Her short stories have appeared in Ms., Redbook, Mademoiselle, The New Yorker and Seventeen. She has also published articles in the New York Times and Washington Post.\n\nMs. McDermott lives outside Washington, D.C. with her husband, a neuroscientist, and three children.\n\nFor more info, please visit: https://events.umich.edu/event/26829", "name": "Alice McDermott Fiction Reading & Book Signing"}, {"url": "https://www.facebook.com/events/868952316560479/", "source": "Facebook", "date": "2016-04-12T19:00:00-04:00", "description": "Peppercorns could well be said to have changed the world. Economically, politically and culturally, because it was the pursuit of pepper that led Columbus to sail west across the Atlantic. Culinarily because the Columbian Exchange that followed brought tomatoes, potatoes, corn and cacao to the Eastern Hemisphere; cows, goats, and pigs among others went west. And, probably above all, because very few of us sit down to eat a meal that hasn’t been spiced with peppercorns in one way or another.\n\nFor this special meal we’ve put together the culinary talents of Roadhouse Chef Alex Young and Philippe de Vienne, master pepper trader for over thirty years. Together they’ve put together a menu that features some of THE finest peppercorns the world has to offer, all right here at the Roadhouse in form of one delicious meal, all personally selected the de Vienne family who have rightly earned their moniker of Spice Traders by traveling the globe and searching for the most remarkable spices anywhere.\n\nMise en Bouche:\nGrilled Issan Chicken wings\nwith green pepper and garlic, hot sweet and sour dip\n\nAppetizer:\nIsekaya-Style Fish Tartare\nwith sancho pepper, nori and toasted sesame\n\nEntree Choices:\nBraised Cornman Farms’ Pork\nwith figs, almonds and sweet and sour Long pepper sauce\nOR\nSlow Roasted Goat\nwith cubebs, white pepper and lemon grass shallot sauce\n\nDessert:\nChocolate Voatsiperifery Pot de Crême", "name": "In Pursuit of Pepper"}, {"url": "https://www.facebook.com/events/1686417714974855/", "source": "Facebook", "date": "2016-04-12T19:00:00-04:00", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "name": "Acoustic Tuesdays: Nick Zomparelli"}, {"url": "https://www.facebook.com/events/523621744459410/", "source": "Facebook", "date": "2016-04-12T21:00:00-04:00", "description": "Tuesday, April. 12 | 9pm | 18+ | $13 Adv./ $15 Day of\n\nDenzel Curry 2055 The Ult Experience\nwsg: Allan Kingdom, & Sdotbraddy\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/636", "name": "Denzel Curry - 2055: The Ult Experience 4/12/16 @ Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/2029438033947526/", "source": "Facebook", "date": "2016-04-13T07:00:00-04:00", "description": "Wednesday only, allll of our supplements are 30% off! Stock up on your favorites, from A-Zinc!", "name": "One Day Sale- 30% Off Suplements"}, {"url": "https://www.facebook.com/events/1708827906036419/", "source": "Facebook", "date": "2016-04-13T18:00:00-04:00", "description": "It's time to get things rolling for the 9th Annual HomeGrown Festival! We need your help to plan this fun event...and the best kept secret of HomeGrown is that our planning team meetings are a blast! \n\nOur team meets twice monthly April-July and weekly in August and the first half of September. There is usually food involved. And a positive, supportive group of folks!\n\nOur kickoff planning meeting will be held Wednesday, April 13 from 6:00-8:00pm downstairs at the Bar at 327 Braun Court in Kerrytown. If you would like to consider being part of the fantastic team of volunteers that plans this amazing event please join us at this meeting and learn more about the planning process.\n\nThe festival will take place on Saturday September 10 at the Ann Arbor Farmers' Market.\n\nWe hope to see you soon!\n\nMore information at HomeGrownFestival.org", "name": "HomeGrown Festival Planning Committee Kickoff"}]