[{"url": "https://www.facebook.com/events/1533173573364052/", "description": "America's High Fiver: A Michigan 5-on-5 Roller Derby Tournament! \n\nThis event is open to teams of 5 skaters (from anywhere, not just Michigan!) who will compete against other teams in 5-minute \"mini-bouts\" for the ultimate glory of being crowned the best team of 5! Minimum of 3 \"mini-bouts\" guaranteed per team. Registration fee is $75/team ($15/particpant, but you MUST sign up with a team of 5). Deadline for registration is 2/12/17. \n\n*Participation open to anyone who identifies within the WFTDA gender policy. All teams must bring black and white with numbers on the back -- feel free to make some sweet DIY team jerseys! Unfortunately, due to space limitations, NO SPECTATORS allowed. Due to small team size, no Coaches will be allowed for teams either.*\n\n***REGISTRATION INFO***\nEach individual interested in participating must fill out the Registration Form (link below). Once we've received your completed form, you will be sent an invoice through Venmo to pay the registration fee. Please allow a bit of a window for this to happen and don't freak out if you don't see it right away. We have real jobs (bummer) and will be sending the invoices out when we get a chance. Your registration is NOT COMPLETE until this payment has been made.\n\nhttps://goo.gl/forms/vVkm9iNyuIK5Ncrv2", "source": "Facebook", "name": "America's High- Fiver", "date": "2017-02-26T12:00:00-05:00"}, {"url": "https://www.facebook.com/events/248475528931412/", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni on the global art world. This exhibition features works collected by a diverse group of alumni and the artworks themselves span 3,500 years of art making, from ancient sculptures to multimedia works by emerging artists. Victors for Art offers visitors an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not together. Presented in two parts—Figuration (February 18-June 11, 2017) and Abstraction (July 1- October 29, 2017) this first part, Figuration will presents art across a wide range of media, time periods, and geographies including works by artists as diverse as Christo, Jean Dubuffet, Georgia O’Keeffe, and Elizabeth Vigeé Le Brun, among others. By assembling these seemingly disparate works and displaying them alongside one another, the scope of what is encompassed by the term “figuration” is explored and revealed, even as its meaning continues to evolve today.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "source": "Facebook", "name": "Guided Tour: Victors for Art", "date": "2017-02-26T14:00:00-05:00"}, {"url": "https://www.facebook.com/events/424265344632355/", "description": "Featuring \nRandy Napoleon \nRick Roe\nSean Dobbins \nPaul Keller \nPaul Finkbeiner", "source": "Facebook", "name": "Celebrating the music of Louis Smith ", "date": "2017-02-26T14:00:00-05:00"}, {"url": "https://www.facebook.com/events/272966006455623/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "source": "Facebook", "name": "Beer and Board Games", "date": "2017-02-26T16:00:00-05:00"}, {"url": "https://www.facebook.com/events/1881419365435222/", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "source": "Facebook", "name": "Open Stage", "date": "2017-02-26T19:00:00-05:00"}, {"url": "https://www.facebook.com/events/1724899501156129/", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "source": "Facebook", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration", "date": "2017-02-28T11:00:00-05:00"}, {"url": "https://www.facebook.com/events/343837269331327/", "description": "Celebrate Mardi Gras with Zingerman's Roadhouse as we pay tribute to Galatoire's, the infamous restaurant on Bourbon Street that has impacted New Orlean's with it's festive charm and Creole dishes since 1905. Chef Alex Young has put together a menu this year that will combine the zest of New Orlean's flavor with classic French cuisine. Look forward to unforgettable dishes like Filet Mignon March de Vin, Seafood Okra Gumbo, and King Cake Bread Pudding!", "source": "Facebook", "name": "Mardi Gras Special Dinner #205: A Tribute to Galatoire’s", "date": "2017-02-28T19:00:00-05:00"}, {"url": "https://www.facebook.com/events/387891208259229/", "description": "February means love and love means poetry (well, to us, anyway). And we'd love for you to join us on our new FOURTH Tuesday at Sweetwaters Coffee & Tea for some. Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\nSign up! 7:00 p.m.\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Readers\nThis month's feature: MONICA RICO!\n\nMonica Rico grew up in Saginaw, Michigan alongside General Motors and the legend of Theodore Roethke. She has a BA in Women’s Studies and Creative Writing from Western Michigan University and a MA in Creative Writing from The City College of New York. She is an avid fan of space exploration, home cooking, and beautifully tall glasses of champagne. She currently lives in Michigan and works for the Bear River Writers’ Conference.\n\nNext month: CODY WALKER!", "source": "Facebook", "name": "Skazat! Poetry Series featuring Monica Rico", "date": "2017-02-28T19:00:00-05:00"}, {"url": "https://www.facebook.com/events/731926473638010/", "description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "source": "Facebook", "name": "Sunseed Farm CSA Pickup", "date": "2017-03-01T17:00:00-05:00"}, {"url": "https://www.facebook.com/events/1840510362829589/", "description": "We're featuring a robust list of 15+ different IPAs within six different catagories from both guest breweries and our own stash. We are aquiring more beers to taste, keep an eye on this list for updates. We will also have strolling appetizers to pair with each category. \n\nAmerican IPA\n- Buzzsaw, Arbor Brewing Company\n- Michigan IPA (featuring all Michigan hops), Arbor Brewing Company\n- TBD\n\nEnglish Style IPA\n- Sacred Cow, Arbor Brewing Company\n- Arcadia IPA, Arcadia Ales\n- TBD\n\nSession IPA\n- All Day IPA, Founders Brewing Company\n- Go To IPA, Stone Brewing\n- TBD\n\nBlack IPA\n- India Porter, Arbor Brewing Company\n- B-Craft, Arcadia Ales\n- TBD\n\nDouble/Imperial IPA\n- HXL, Arbor Brewing Company\n- Mr. Delicious, Arbor Brewing Company\n- Hoptronics, New Holland Brewing Company\n\nWood Aged IPA\n- Unearthly, Southern Tier\n- Rum Barrel Aged Piraat, Brouwerij Van Steenberg N.V. \n-TBD", "source": "Facebook", "name": "Hop Focused Beer Tasting", "date": "2017-03-01T19:00:00-05:00"}]