[{"date": "2017-03-26T07:30:00-04:00", "name": "2017 Probility Ann Arbor Marathon", "description": "Take to the scenic streets of Ann Arbor on Sunday, March 26 for the 2017 Probility Ann Arbor Marathon, brought to you by Epic Races and Champions for Charity. Featuring a full marathon, half marathon, 10K, and 5K, you’ll find that the Probility Ann Arbor Marathon is your ideal early-spring race, whether you’re walking your first 5K or running your 50th marathon. Be sure to check in on race day! For full details, visit http://www.theannarbormarathon.com.", "source": "Facebook", "url": "https://www.facebook.com/events/1849004435342777/"}, {"date": "2017-03-26T10:00:00-04:00", "name": "Women's History Month and Planned Parenthood", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "source": "Facebook", "url": "https://www.facebook.com/events/189417071550325/"}, {"date": "2017-03-26T10:00:00-04:00", "name": "Photo Monitoring Kick-off & Training", "description": "Do you like photography and spending time outdoors? Photo monitoring may be the perfect volunteer opportunity for you! We need volunteers to take beautiful photos at specific locations each season to record the progress of our restoration work. Come join us at this informational meeting for more details about this volunteer opportunity! Please register by March 19. For more information or to register call NAP 734.794.6627, or send us an email at NAP@a2gov.org.", "source": "Facebook", "url": "https://www.facebook.com/events/1864939247128977/"}, {"date": "2017-03-26T12:00:00-04:00", "name": "Ernestine Ruben at Willow Run: Mobilizing Memory", "description": "March 11–August 20, 2017\nPhotography Gallery\n\nIn 2013, artist Ernestine Ruben (BSDEs ’53) photographed the once-famed industrial complex Willow Run in Washtenaw County, Michigan. Designed by her grandfather, Detroit architect Albert Kahn, for the Ford Motor Company, Willow Run was an exemplar of American defense manufacturing because of its efficient mass-production of B-24 Liberators during World War II.\nFor this exhibition, Ruben overlaid interior views of the now-dormant factory with imagined glimpses into her body’s interior landscape. The resulting compositions seem to breathe energy and light into the stagnant and cavernous spaces of Willow Run and suggest a longing for a productive existence undeterred by mortality for both Willow Run and the artist. Her grandfather’s role in the history of the site underscores Ruben’s personal connection.\nThe exhibition presents Ruben’s photographs of Willow Run in UMMA’s Photography Gallery and an original film—co-created by Ruben and video artist Seth Bernstein and featuring an original score by award-winning composer Stephen Hartke—in the Museum’s Forum.\n\nLead support for Ernestine Ruben at Willow Run: Mobilizing Memory is provided by the University of Michigan Office of the Provost and the Herbert W. and Susan L. Johe Endowment.", "source": "Facebook", "url": "https://www.facebook.com/events/1008319905968712/"}, {"date": "2017-03-26T12:00:00-04:00", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "source": "Facebook", "url": "https://www.facebook.com/events/1724899501156129/"}, {"date": "2017-03-26T15:00:00-04:00", "name": "In Conversation: Framing the Word of the Buddha", "description": "In Tibetan Buddhism, books are the embodiment of the word of the Buddha, serving as his substitute after his passage into nirvana. They are therefore venerated and handled with the utmost respect. Elaborate book covers were commissioned to honor the Buddha, as well as to accrue good merit on the path to enlightenment. Protecting Wisdom features thirty-three book covers dating from the eleventh to the eighteenth century that represent the glorious iconographic array and non-figural decoration typical of these sacred items. Distinguished scholar of Tibetan Buddhism, Professor Donald Lopez will talk about the function, the meaning, and the artistry of these sacred objects that reflect an intense devotion to the Buddha and his teachings. The program starts in The Multipurpose Room.\n\nLead support for Protecting Wisdom: Tibetan Book Covers from the MacLean Collection is provided by the University of Michigan Office of the Provost, Michigan Medicine, and the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund and the Department of Asian Languages and Cultures.", "source": "Facebook", "url": "https://www.facebook.com/events/1216178128436669/"}, {"date": "2017-03-26T17:00:00-04:00", "name": "Winners Night: Awards 1 & Awards 2", "description": "Two different screenings of selected awarded films from the 55th Ann Arbor Film Festival at 5pm and 7pm. Onstage announcement of winning films, an appearance by performance artist Pat Oleszko, and between-shows lobby entertainment by Groove Percussion make the closing events a special celebration.", "source": "Facebook", "url": "https://www.facebook.com/events/1277206499031012/"}, {"date": "2017-03-27T14:00:00-04:00", "name": "The 55th Ann Arbor Film Festival", "description": "The Ann Arbor Film Festival has been around for over 50 years, fascinating, challenging, enchanting, even appalling and often surprising tens of thousands of viewers - some who have been attending for decades. The AAFF is a highlight of Michigan's cultural year. The majority of screenings will take place at the Michigan Theater (603 E Liberty St, Ann Arbor, MI 48104) with additional events and exhibitions at other venues around downtown Ann Arbor. Tickets and passes are available for purchase on our website.\n\nFind out more info on our website:\nhttp://aafilmfest.org", "source": "Facebook", "url": "https://www.facebook.com/events/1821291198093435/"}, {"date": "2017-03-28T00:00:00-04:00", "name": "2017 Probility Ann Arbor Marathon Virtual Half Marathon", "description": "Can't make it to Ann Arbor on March 26? You can still participate in the Probility Ann Arbor Marathon by registering for our Virtual Half Marathon! Virtual participants run or walk 13. 1 miles at a location of their choosing: at a park, on a trail, on a treadmill, even in a different part of Ann Arbor! All Virtual Half Marathons must be completed between February 1 and March 26. When you've completed your Virtual Half Marathon, tell us about it! Post your stats, photos, and story here on the Probility Ann Arbor Marathon Virtual Half Facebook event page; if you post on Twitter, be sure to tag @epicraces and @a2marathon. Best of all, you get the same race shirt and medal as those who join us in downtown Ann Arbor for the actual event!\n\nPlease note: Epic Races does not ship swag to Canada or internationally. If you are a resident of Canada or another country and wish to participate in an Epic Races virtual event, please provide us with a U.S. shipping address.", "source": "Facebook", "url": "https://www.facebook.com/events/1006014226188234/"}, {"date": "2017-03-28T15:00:00-04:00", "name": "Ann Arbor Orchid Festival", "description": "NOTE: Orchid Festival dates are Sat. & Sun., March 18 & 19, 2017\n\nA two-day orchid extravaganza with orchid displays, orchids in bloom, and regional commercial vendors. Tropical and hardy orchids and orchid-growing supplies and related items for sale. Free informational talks and demos. Presented by Ann Arbor Orchid Society. Free. For hours, photos, and info follow this link: mbgna.blogspot.com/2017/02/2017-ann-arbor-orchid-festival-at.html", "source": "Facebook", "url": "https://www.facebook.com/events/348084575586028/"}]