[{"date": "2017-02-04T09:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/169321516879125/", "description": "Join us at Aventura for a 50-minute, strengthening barre class led by The Barre Code’s very own Adrianne Madias! Work through dynamic, full-range movements to the top 40 pop & hip-hop hits at Ann Arbor's Hottest Restaurant.\u0003\u0003The class will be followed by a light and healthy, authentic Spanish brunch and a build your own mimosa bar!", "name": "Barre, Bubbles, & Brunch"}, {"date": "2017-02-04T09:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/735590043264320/", "description": "Hot cacao has been a happening drink for thousands of years. Mayan people drank it 1,500 years ago, and the Aztecs sipped it as a spicy bitter drink in the 1400s. What we call “hot cocoa’ didn’t become popular until the 1700s—and we’re still drinking it today! Please join us on Saturday February 4th to make hot cocoa, play games, and taste chocolate. Plus you'll learn all about how to enjoy this delicious food while protecting some of Earth's most endangered ecosystems. \n\n\nThe event will take place in two sessions. The times are as follows:\n\nSession 1: 9:30-11:00 am\nSession 2: 12:00-1:30 pm \n\nPlease register your child for the event using the following link. Children who are not registered will not be guaranteed a spot at this event. See you there!\n\nhttp://mbgna-peony.miserver.it.umich.edu/shop/youth-programs", "name": "Hot Chocolate at Matthaei Botanical Gardens"}, {"date": "2017-02-04T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1716505231999811/", "description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "name": "Intro to Stagecraft Workshops"}, {"date": "2017-02-04T13:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1578091195538718/", "description": "Help remove exotic shrubs invading the wetlands along the Huron River. Meet at the Barton Dam parking lot off Huron River Drive. \nPlease dress in layers and wear shoes for snow and wet ground. Workdays are free and suitable for all ages. Minors must be accompanied by a guardian or have a signed release form. Tools, snacks, and know-how provided.", "name": "Stewardship Workday - World Wetland Day"}, {"date": "2017-02-04T15:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/304390803296325/", "description": "Some like it cold!\n\nFebruary temperatures means it’s time for the annual University of Michigan Ice Carving Extravaganza in the Main Street area. Watch members of the U of M Ice Carving Team as they carve sculptures on the sidewalks of Main, Liberty, Washington, and Fourth with chainsaws, blowtorches and power tools. Come downtown and see the amazing work created by these talented students!\n\nSculpting Hours:\nFriday, February 3 from 3-7pm\nSaturday, February 4 from 10am-5pm\nSunday, February 5 from 10am-2pm\n\nSculptures will remain on display for as long as they last!", "name": "Annual Ice Carving Extravaganza"}, {"date": "2017-02-04T18:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1807900772828520/", "description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "name": "Art Off The Wall Holiday Exhibition & Shopping Event"}, {"date": "2017-02-04T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1403334909698427/", "description": "Come join us at 8pm on Saturday, February 4th at the Leon Loft Space to celebrate the release of our new DVD and view highlights from the 54th Ann Arbor Film Festival. The screening begins at 8pm, but come early to enjoy appetizers, a beer or a glass of wine. $10 Cover at the door (includes food, and beverges), with free admission to current Film Festival Members. See you there!!", "name": "Ann Arbor Film Festival DVD Release Party"}, {"date": "2017-02-05T14:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/722433277934469/", "description": "Protecting Wisdom: Tibetan Book Covers from the MacLean Collection is the first major exhibition to examine the subject of Tibetan book covers. This stunning visual display illuminates a virtually unknown type of art, one that will charm and intrigue both those familiar and unfamiliar with Tibetan art. For Tibetan Buddhists, books are a divine presence in which the Buddha lives and reveals himself, and they are venerated and handled with the utmost respect. The exhibition features 33 book covers dating from the eleventh to the eighteenth century that represent the glorious iconographic array and non-figural decoration typical of these sacred items. UMMA docents will explore the construction of these hand-held relief sculptures and the images depicted, most commonly deities, important teachers, mantras, and sacred symbols.", "name": "Guided Tour Protecting Wisdom: Tibetan Book Covers from the Mac"}, {"date": "2017-02-05T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1713140125617477/", "description": "Winners of the grand prize at the inaugural M-Prize Chamber Music Competition at the University of Michigan in May, the Calidore String Quartet is “a miracle of unified thought,” (La Presse, Montreal).\n\nhttp://ums.org/performance/calidore-string-quartet/", "name": "Calidore String Quartet"}, {"date": "2017-02-05T18:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1323412567725529/", "description": "Join us this Sunday at the Brewpub to watch the game! Happy hour starts early for the game at 6:30pm (normally 8:00pm).\n\n***WE WILL NOT CLOSE BEFORE THE GAME IS OVER***", "name": "Super Sunday at the Brewpub"}]