[{"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/1171307782957839/", "source": "Facebook", "name": "10% For Good for Community Action Network", "date": "2016-12-17T09:00:00-05:00"}, {"description": "Join our Little Peeps crew for a celebration of winter and holiday fun. The morning will include a short interactive performance, drama activities, and a winter holiday craft.\n\nRecommended for pre-k through grade 5.\nTickets: $7 for the first child, $5 for each additional child\nAdults are free.", "url": "https://www.facebook.com/events/353097648372451/", "source": "Facebook", "name": "Little Peeps - Winter Holidays", "date": "2016-12-17T10:30:00-05:00"}, {"description": "Father Christmas is coming to Matthaei this Saturday. This is the real McCoy! In town for one day only.", "url": "https://www.facebook.com/events/294577747610611/", "source": "Facebook", "name": "A Visit with Father Christmas", "date": "2016-12-17T12:00:00-05:00"}, {"description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/1778118985738288/", "source": "Facebook", "name": "Icebreakers^2", "date": "2016-12-17T16:00:00-05:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nThe League will invite volunteers from the audience to share stories about their holidays – funny, awkward, sad, or wacky – and then they will perform scenes inspired by these tales.\n\nGroup 1: RAJ\nGroup 2: Unicornucopia\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/374025222930874/", "source": "Facebook", "name": "Holiday Improv Show with RAJ and Unicornucopia", "date": "2016-12-17T20:00:00-05:00"}, {"description": "REUNITED AND IT FEELS SO GOOD!\nSATURDAY, DECEMBER 17 - PLASTIC PASSION returns for a special reunion party!\n\nResident DJ JOSH BURGE will be joined by MIKEY (Strangewaysradio.com) to bring the passion back to the RED ROOM: 80s/90s alternative dance, post-punk, electro-funk, industrial, EBM, indie, and modern synthicide!  DOC COLONY also returns to splash hot colors on the telescreens.  Half-off all drinks before 11pm! \n\nNECTO RED ROOM, 516 E. Liberty, Downtown Ann Arbor.\n9:00pm - 2:00am\n$5 cover 21+ / $8 cover 18-20\nIMPORTANT: When arriving, be sure to tell the fine Necto door staff that you're there for PLASTIC PASSION in the RED ROOM. Follow the steps down on the right for Red Room Fun.\n\nSupport PP by RSVPing, inviting others to this event page, and sharing the event link! THANKS!", "url": "https://www.facebook.com/events/460675907436417/", "source": "Facebook", "name": "Plastic Passion - Reunion! Dec 17!", "date": "2016-12-17T21:00:00-05:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nThe League will invite volunteers from the audience to share stories about their holidays – funny, awkward, sad, or wacky – and then they will perform scenes inspired by these tales.\n\nGroup 1: Unicornucopia \nGroup 2: RAJ\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/597030170498201/", "source": "Facebook", "name": "Holiday Improv Show with Unicornucopia and RAJ", "date": "2016-12-17T22:00:00-05:00"}, {"description": "dancehall / hiphop\nDJ ADRENALIN\nDJ RUDY\n\n18+ welcome\n$5 cover", "url": "https://www.facebook.com/events/753259491488714/", "source": "Facebook", "name": "Reggae Rebel Alliance: #10", "date": "2016-12-17T22:00:00-05:00"}, {"description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "url": "https://www.facebook.com/events/230775294023258/", "source": "Facebook", "name": "Exhibit: Avant Garden-Fashion & Plants Together!", "date": "2016-12-18T10:00:00-05:00"}, {"description": "It's the most wonderful time of the year! Bring the whole family to the Tap Room on Sunday, December 18th starting at 1 pm. Kevin Devine will lead a sing-a-long of favorite carols and songs, and Santa will make an appearance! We'll have hot chocolate and treats for the kiddos AND some extra special treats for mom and dad (read: cheap beer). \n\nThis is a fun family day at the brewery, so come hang out with us. (Holiday) cheers!", "url": "https://www.facebook.com/events/216010205492368/", "source": "Facebook", "name": "Annual Santa Sing-a-Long!", "date": "2016-12-18T13:00:00-05:00"}]