[{"url": "https://www.facebook.com/events/324709987912141/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "date": "2016-12-15T08:00:00-05:00", "source": "Facebook", "name": "10% For Good for Community Action Network"}, {"url": "https://www.facebook.com/events/381601068852607/", "description": "This week, all our body care is 25% off! Skin care, hair care, cosmetics, soaps- it's all on sale, just in time for your holiday shopping. And with prices like this, you can pick up a few things to treat yo' self, too <3", "date": "2016-12-15T10:00:00-05:00", "source": "Facebook", "name": "25% Off Body Care"}, {"url": "https://www.facebook.com/events/944135112354321/", "description": "Join our friends from New Belgium Brewing to try their new Ben & Jerry's Chocolate Chip Cookie Dough Ale! They'll be pairing it with Ben and Jerry's ice creams to get the full effect- beer float, anyone?", "date": "2016-12-15T19:00:00-05:00", "source": "Facebook", "name": "Adult Ice Cream Social"}, {"url": "https://www.facebook.com/events/237397100022638/", "description": "Dead Hit will be back at the Blind Pig - Ann Arbor, MI on Thursday, December 15 for an evening of live music. Come Boogie Down during a fun night of musical mischief! Doors will be opening at 9:00, and music will start at 10:00.\n\nWe will be playing two sets of tunes throughout the night.\n\nSet 1\n10:00-11:45\n\nSet 2\n12:00 ~1:30\n\nBe sure to drop by for a tasty platter rock n' roll with a healthy slosh of improvisation.", "date": "2016-12-15T21:00:00-05:00", "source": "Facebook", "name": "Dead Hit at the Blind Pig 12/15"}, {"url": "https://www.facebook.com/events/1417695524925106/", "description": "Southpaw Events  proudly presents...\n\nCloZee and Psymbionic - Biohackers Tour at Necto Nightclub\nDecember 15th, 2016\n\nLocal Support by Adam Westing & r1x0music\n\nDoors at 9pm | 18+ are welcome\n$10 Presale | $15 DOS | 4 pack presale for $30\n\nClozee\nHailing from Toulouse, CloZee is Chloé, a young music producer who seamlessly combines technical precision with a wild imagination. An accomplished instrumentalist, she began playing the classical guitar at 11. Influenced by edIT, Bonobo, The Widdler and Amon Tobin, she started producing electronic music at the age of 16.\n\nIn 2014, she won the 'Best International Newcomer of 2013' at the UK Glitch-Hop Award.\n\nHer tracks defy genres, oscillating between World Bass, Tribal Trap, Glitch-Hop, Trip-Hop, and Downtempo. She created her own place in the glitch community, thanks to a unique, highly surprising style, mixing powerful basslines, funky off beat percussion and emotional cinematic sounds. A musical identity which led her to play in the USA (including the festivals Coachella, Lightning In A Bottle, Shambhala...), Canada, India, Berlin, and more than 30 cities in France, alongside artists like Bonobo, Gramatik, Chet Faker, Tipper, TOKiMONSTA, Tipper, Big Gigantic, GRiZ...\n\nRunner-up of several remix contests (launched by artists like Mr. Bill, Asian Trash Boy, Crazy Daylight, Daenine...), CloZee was spotted by respected labels such as Gravitas Recordings, Glitch Hop Community, Adapted Records, Digital Whomp, Empathy Recordings, MOR Records, Waxhole Records… \n\nWebsite - http://www.clozeemusic.com/\nSoundcloud - https://soundcloud.com/clozee\nFacebook - https://www.facebook.com/CloZee \n\nPsymbionic\nCresting the modern wave of electronic producers, Psymbionic creates aural experiences that explore the range of multi-tempo Bass Music within an influential and dynamic culture. With an ear for situational relevance, Psymbionic enjoys turning non-traditional sound design and infectious rhythms into dancefloor heat, while also maintaining his history in the downtempo, emotive side of the electronic sound.\n\nJohn Burcham has been moving bodies and turning heads as Psymbionic for several years in all corners of the USA, playing with acts such as Bassnectar, STS9, Big Gigantic, ill.Gates, Excision, EOTO, and Tipper. His passion and innovation in the music world are showcased through album releases on Muti Music and MalLabel, as well as in his role as label manager for the popular Electronic imprint Gravitas Recordings.\n\nIn a live show context, Psymbionic confronts mixes that are limited to the scope of the build and release, avoiding an industry epidemic of drop-monotony that overpowers the flow of music. Burcham seeks to prove that there are more powerful influences in moving a crowd than simple tension, providing an interwoven dynamic that relies on the strength of his blend, rather than the sole force or familiarity of the apex.\n\nPsymbionic's theory of music is a journey that doesn't visit the same place twice, building excitement for what's next not because you can anticipate it, but because you've never been there before.\n\nWebsite - http://www.psymbionicmusic.com/\nFacebook - https://www.facebook.com/psymbionic\nSoundcloud - https://soundcloud.com/psymbionic", "date": "2016-12-15T21:00:00-05:00", "source": "Facebook", "name": "CloZee & Psymbionic - Biohackers Tour at Necto - 12/15"}, {"url": "https://www.facebook.com/events/558399577690989/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "date": "2016-12-16T15:00:00-05:00", "source": "Facebook", "name": "Drink & Draw / Imbibe & Inscribe"}, {"url": "https://www.facebook.com/events/241191552964337/", "description": "Bring your well-worn items that could use a tune up, and we'll take a look at them! \n\nOr, make someone else's day by volunteering at Fix-It Friday and repairing their items.\n\nFix-It Friday:\nThink of this as the last chance before you get rid of something; Free, but no Guarantee.\n\nWe will:\n- try to diagnose what is wrong\n- tell you if we think we may be able to fix it today\n- tell you if you'll need a part, and where you might be able to get it\n- try to fix it to the best of our ability, but in the limited time we have\n\nHowever, we may not be able to fix it. Many products are not designed to be fixed, and just opening them up may damage them. Furthermore, we may not have someone on hand with the expertise to do a proper repair. Also, it may require a special part, tools, information, or materials to repair, or it may just require more time than we have.\n\nWe may end up damaging your item even more. Please let the repairer know how comfortable you are at each stage of diagnosis and repair.\n\nItems that are often easier to repair: lamps, types of toys, broken wires, things that need epoxy/wood glue\n\nItems that are often very difficult to repair: consumer electronics such as CD/Cassette boom boxes, TVs, radios, CD players, VCRs, and DVD players", "date": "2016-12-16T16:00:00-05:00", "source": "Facebook", "name": "Fix-It Friday (third Friday of every month)"}, {"url": "https://www.facebook.com/events/1050535105058833/", "description": "Beginning November 4th, GameStart will be hosting a six-week series of Open House workshops called GameLab. Each week will feature a FREE to participate class, rotating* between two of GameStarts most popular courses: Game Creation with Unity and Minecraft Python Programming. Students are invited to try out and retake each class as often as they'd like during the six-week term.\n\nGameLab Course Schedule:\nDecember 9th, 4:00pm - 5:00pm: Minecraft Python Programming\nDecember 16th, 4:00pm - 5:00pm: Game Creation with Unity", "date": "2016-12-16T16:00:00-05:00", "source": "Facebook", "name": "GameLab: Game Creation with Unity Game Engine (6/6)"}, {"url": "https://www.facebook.com/events/1807900772828520/", "description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "date": "2016-12-16T18:00:00-05:00", "source": "Facebook", "name": "Art Off The Wall Holiday Exhibition & Shopping Event"}, {"url": "https://www.facebook.com/events/1606342193002928/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nThe League will invite volunteers from the audience to share stories about their holidays – funny, awkward, sad, or wacky – and then they will perform scenes inspired by these tales.\n\nGroup 1: Listen, Stupid \nGroup 2: With Wieck\nGroup 3: The League of Pointless Improvisers", "date": "2016-12-16T20:00:00-05:00", "source": "Facebook", "name": "Holiday Improv Show with Listen, Stupid and With Wieck"}]