[{"description": "This class will introduce you to the Amaya Bravo 16-Thread CNC Embroidery Machine and the Design Shop software that lets you create digitalized embroidery files from an image file. This machine is great for monogramming shirts or towels, decorating bags and accessories and making patches! Use the Design Shop software and design your own. There is also a baseball cap attachment! You will learn the basic operation with an emphasis on safety. With the successful completion of this class you will be certified to use the Amaya CNC Embroidery Machine on your own.", "url": "https://www.facebook.com/events/1279411065486061/", "source": "Facebook", "name": "Learn to use the Amaya CNC Embroidery Machine", "date": "2017-02-10T10:00:00-05:00"}, {"description": "Joins us for our special Valentine's Day creations all weekend long all they way through Valentine's Day. \n\nWe'll be featuring some great Food & Beverage Specials. To make your reservations visit SavasRestaurant.com/reservations or call us at 734-623-2233\n\nDRINK SPECIALS\n__________________\n\nA FRENCH ROSE\ncreme yvette, cocchi americano rosa, parigot rosé\n\nQUEEN OF HEARTS\nhendrick's gin, st. germain, lavender syrup, lemon juice, cranberry juice, apple-cranberry cider\n\nKING OF HEARTS\njohnnie walker red, averna, carpano antica, chocolate bitters\n\nDINNER SPECIALS\n__________________\n\nFILET & PRAWNS\nchoice grade 6 oz. filet with 2 jumbo prawns and beurre maître d’hotel. With pommes fondant and veal glazed carrots\n\nMOULES  CHAMPAGNE \nbay harbor mussels steamed in an herbed champagne cream broth, served with baguette\n\nOYSTERS\noysters, black pepper-balsamic sorbet, minced shallot, micro radish, cucumber brunoise\n\nHALF-ROAST CHICKEN\nbrined half-chicken, roasted fingerling potatoes, warm spinach salad with apple, sarvecchio and creamy bacon vinaigrette\n\nRISOTTO STUFFED SQUASH\nbutternut squash risotto, wild mushroom blend, braised leeks, roast acorn squash, curried romesco, roasted asparagus", "url": "https://www.facebook.com/events/1197760063612471/", "source": "Facebook", "name": "Sava's Valentine's Day Featured Food & Beverage Specials", "date": "2017-02-10T17:00:00-05:00"}, {"description": "Join us on Friday, February 10th for a tasting of our bottled offerings at Lucky's Market! We'll be on site to answer your beer questions and send you home with some stickers. See you there!", "url": "https://www.facebook.com/events/1814728462131014/", "source": "Facebook", "name": "Lucky's Market Tasting", "date": "2017-02-10T17:00:00-05:00"}, {"description": "Don't miss Artini 2017, which in its 9th edition will once again transform the Downtown Ann Arbor area into a festive competition between the finest bars and restaurants, where the goal is to design the city's most artful martini!\n\nArtini will be on Friday, February 10, from 6:30 to 10:00 pm. Tickets will be for sale on Wednesday, January 4th for members of the Ann Arbor Art Center and on Friday, January 6th for all! As usual tickets will sell fast, so please make sure you purchase yours as soon as possible (in 2016 we sold out in 10 days!) to guarantee your spot.\n\nWHAT IS ARTINI?\n\nArtini is an annual fundraiser hosted by the Ann Arbor Art Center in which local bars and restaurants are invited to compete to create the most artful and innovative martini cocktail. Guests purchase tickets to participate in a fun bar crawl amongst the participating venues and spend the evening walking in Downtown Ann Arbor for the search of the best tasting martini.\n\nParticipating Venues (with new ones added daily!)\nAlley Bar\nAventura Ann Arbor\nBabs' Underground\nThe Beer Grotto Ann Arbor\nBlack Pearl\nConor O'Neills Ann Arbor\nFelix Bistro & Bar\nIsalita\nMélange\nThe Pretzel Bell\nThe Ravens Club\n\n*Attendees must be 21 or older by 2/10/2017. Ticket prices are $55 and are non-refundable. The Ann Arbor Art Center is a 501©(3) and $25 of your Artini ticket is tax deductible.\n\n#A2ARTINI\n\n--------------\n\nArtini 2017 is sponsored by Alex Milshteyn Real Estate Associates \n\nBeverage sponsor Two James Spirits", "url": "https://www.facebook.com/events/377472489259538/", "source": "Facebook", "name": "Artini 2017", "date": "2017-02-10T18:30:00-05:00"}, {"description": "SECOND ROUND of Auditions for:\nThe Civic Improv Ensemble, Season 2\n\nFriday, February 10 from 7:00-9:00\nSaturday, February 11 from 6:00-8:00\n\nNOTE: We're holding this second round of auditions to try to fill several slots in each of the three troupes. The audition process will be the same as the first round's - more information below.\n\nThe Civic Improv Ensemble is excited to announce auditions for the second season of the new A2CT endeavor. The Ensemble is a great place for both new and experienced improvisers to form brand new troupes of enthusiastic actors who will spend a year developing their improv skills and performing together. Our previous troupes have performed around southeast Michigan, and former CIE members have been cast at Pointless Brewery & Theatre, Planet Ant Theatre, and Go Comedy! Improv Theater.\n\nAuditions will take place at the A2CT Studio (322 W. Ann St, Ann Arbor) on Friday, February 10 from 7:00-9:00, and Saturday, February 11 from 6:00-8:00. Auditioners must be at least 18 years old, and need attend only one of the two audition days, but should plan to stay the entire time if possible. No pre-registration is required - please arrive a few minutes early to fill out an audition form.\n\nNo preparation or previous experience is required for auditions, which will consist of a variety of short improv games and some basic two-person scene work. We are looking for actors with good energy, a willingness to take chances, and the ability to listen closely on stage and react honestly. Please wear comfortable clothes and be prepared to move. The only fee for Civic Improv is the standard membership fee for all A2CT actors - $25 per year.\n\nEach of our three coaches is looking to cast a troupe of 6 to 12 actors. The three troupes will be:\n\nShort-Form Troupe - coached by Shelly Smith\nThis troupe will focus on short-form games like those featured on Whose Line Is It Anyway or at ComedySportz. This is a great place for those brand new to improv to start out, as well as quick-witted quipsters and anyone who's a fan of fun.\n\nMid-Form Troupe - coached by Jen Delisi\nLearn to create longer scene-based stories in this troupe. Jen introduces improvisers to a variety of tools for bridging the gap between short-form games and long-form scene work. With a clap of their hands, your fellow improvisers will send your characters to unusual locations and hilarious new situations.\n\nLong-Form Troupe - coached by David Widmayer\nScene work is the core of long-form improv - improvisers will learn to walk onto a blank stage with nothing but a simple suggestion and create unique, complex characters and a whole world for them to inhabit. This troupe will be introduced to a variety of scenic forms, and ultimately choose and develop a signature format to bring to their performances.\n\nPlease email David Widmayer (djwidmayer@gmail.com) with any questions.", "url": "https://www.facebook.com/events/736458266531240/", "source": "Facebook", "name": "Civic Improv Auditions! Part 2", "date": "2017-02-10T19:00:00-05:00"}, {"description": "Pianist Richard Goode joins the Budapest Festival Orchestra for this all-Beethoven program, which also features the UMS Choral Union in a performance of Beethoven’s Ninth Symphony.\n\nMore info: http://ums.org/performance/budapest-festival-orchestra/", "url": "https://www.facebook.com/events/226856454345333/", "source": "Facebook", "name": "Budapest Festival Orchestra", "date": "2017-02-10T20:00:00-05:00"}, {"description": "Soave Soirée:\npresented in partnership with the Detroit Chamber Winds & Strings\n\nPeter Soave, accordion and bandoneon virtuoso, joins DCWS wind and strings musicians in a cabaret-style setting. The program will include music ranging from Piazzolla to Bach.\n\nThis performance is presented in partnership with the Detroit Chamber Winds & Strings.\n\nPeter Soave, accordion & bandoneon\nKimberly Kaloyanides Kennedy, violin\nJames VanValkenburg, viola\nKevin Brown, bass\nLaurence Liberson, clarinet\nAdditional musicians TBA\n\nProgram:\n\nFuga con Pajarillo\tAldemaro Romero\nQuintet Op. 39\tSergei Prokofiev\nEscualo\tAstor Piazzolla\nSicilienne\tJ.S. Bach\nSentimentale\tClaude Bolling\nSinfonia from Cantata No. 29\tJ.S. Bach\nFlora's Fame (Milonga Prelude)\tAstor Piazzolla\n\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student", "url": "https://www.facebook.com/events/979459058826229/", "source": "Facebook", "name": "Soave Soirée", "date": "2017-02-10T20:00:00-05:00"}, {"description": "The string band and vocal trio Low Lily explores the roots and branches of American folk music with traditional influences and modern inspiration that weave together a unique brand of acoustic music. Liz Simmons (vocals and guitar), Flynn Cohen (vocals, guitar, and mandolin), and Lissa Schneckenburger (vocals and fiddle) are masterful players with deep relationships to traditional music styles ranging from bluegrass to Irish, Scottish, New England, and Old Time Appalachian sounds. When you combine this with stellar composition skills and inventive arrangements you get music that is rooted yet contemporary. www.lowlily.com", "url": "https://www.facebook.com/events/1799368086971033/", "source": "Facebook", "name": "Low Lily at Green Wood Coffee House", "date": "2017-02-10T20:00:00-05:00"}, {"description": "COPACETIC is back! Join us at club above to honor one of hip hops most influential artists! With an all star cast of local producers showcasing their finest for your ears. With your favorite DJ Cataclysmic on the ones and twos and hosted by your girl Nickie P. $5. Doors at 9pm. 18+ welcome. Doughnuts encouraged...\n\nMegablown\nhttps://soundcloud.com/prof-megablown\n\nDayggs\nhttps://soundcloud.com/dayggs\n\nPat2Dope\nhttps://soundcloud.com/patrick-shepard\n\nSonny Dulphi\nhttps://soundcloud.com/sonnydulphi\n\nTru Klassick\nhttps://soundcloud.com/truklassick\n\nDante Lasalle \nhttps://soundcloud.com/dantelasalle\n\nwith your host Nickie P\nhttps://soundcloud.com/nickiep\n\nand DJ Cataclysmic\nhttps://soundcloud.com/dj-cataclysmic\n\nClub Above\n215 N Main Street\nDowntown Ann Arbor\n[above the Heidelberg Restaurant]", "url": "https://www.facebook.com/events/198655163942933/", "source": "Facebook", "name": "Club Above presents Copacetic - Glazed: J Dilla Tribute", "date": "2017-02-10T21:00:00-05:00"}, {"description": "18+\n$8/$11\n\nDoors at 9:30pm\n\nIt's dancey-dance time. Come party with us surf-disco style while we are in Michigan!", "url": "https://www.facebook.com/events/1172670636119907/", "source": "Facebook", "name": "The Outer Vibe // The Stellars", "date": "2017-02-10T22:00:00-05:00"}]