[{"date": "2016-03-31T19:00:00-04:00", "description": "Join us as we celebrate our third birthday! As on our previous anniversary parties, In the spirit of donating and giving back, all book sales throughout the day will benefit SafeHouse Center, a non-profit organization dedicated to ending domestic violence and sexual assault in Washtenaw County, Michigan.\n\nAdditionally, we'll be hosting a reading from friends & family, featuring the work of former Literati booksellers Russ Brakefield and Tom McCartan, current Literati booksellers John Ganiard, Mairead Small Staid, Sam Krowchenko, and Gina Balibrera, and our dear friend Ray McDaniel. \n\nThis event is free and open to the public.\n\nGina Balibrera is a graduate of the Helen Zell Writers' Program and was a Zell Postgraduate Fellow in Prose. Gina lives in Ann Arbor, where she works at a bookstore, teaches writing, and is finishing a novel set in 1930s El Salvador, Hollywood, and France.\n\nRussell Brakefield received his MFA in poetry from the University of Michigan's Helen Zell Writers' Program. He lives in Ann Arbor where he teaches writing at the University of Michigan and works as the managing editor for Canarium Books. His most recent work appears in The Southern Indiana Review, Hobart, and Language Lessons: An Anthology by Third Man Records. He is currently an artist in residence with the University Musical Society. \n\nJohn M. Ganiard lives and works in Ann Arbor (Michigan, USA). \n\nSam Krowchenko's writing has appeared in Salon, Michigan Quarterly Review, and Full Stop.\n\nTom McCartan used to work at LIterati. He's had stories published in Unsaid, Hobart, and some other places. He also used to work at Melville House. Once he even at a music show at Literati, to which he brought a case of beer.  \n\nMairead Small Staid is a poet and essayist whose work can be found in AGNI, The Believer, The Georgia Review, Kenyon Review, Narrative, Ninth Letter, and Ploughshares, as well as online at The Awl, The Hairpin, Jezebel, and The Point.\n\nRaymond McDaniel is the author of Special Powers and Abilities, Saltwater Empire and Murder (a violet), a National Poetry Series selection. His writing appears in many magazines and in the anthology American Poets in the 21st Century. Born in Florida, McDaniel now lives in Ann Arbor, teaches at the University of Michigan, and writes for The Constant Critic.", "name": "Third Anniversary Reading", "url": "https://www.facebook.com/events/646155202190028/", "source": "Facebook"}, {"date": "2016-03-31T19:30:00-04:00", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty", "url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook"}, {"date": "2016-04-01T18:00:00-04:00", "description": "Join us for the opening reception and award announcement for ART NOW: PHOTOGRAPHY on Friday, April 1st, from 6 to 9 pm. \n\nThe exhibition is free and open to the public daily from April 1st to May 14th.\n\n------------------------------\nFeatured Artists: \n\nJim Aho • Christine Atkinson • Philip Augustin • Janet Baugher • Cecilia Borgenstam • Seder Burns • Lorraine Castillo • Brittney Denham • Alexander Diaz • Jennifer Eason • Steven Edson • Sean Fox • Marco Garabello • Phil Gilchrist • Juan Giraldo • Sarah Grew • Richard Haley • Christian Hendricks • Lori Hepner • Ethan Jones • Lori Kella • Horace Kerr II • Dean Kessmann • Chrissy LaMaster • Stephanie Lehr • Wen Hang Lin • Matthew Moore • Sarah Palmeri • Kanthy Peng •David Quinn • Chris Ridgway • John Sanderson • Lisa Shaw • Harry Umen • Tracy Wascom • Christina Washington\n\n-------------------------------\n\nThe Ann Arbor Art Center is pleased to present the 2nd annual exhibition in its Art Now Series, Art Now: New Directions in Contemporary Photography, juried by Millee Tibbs. Each year, on a rotating basis, the Ann Arbor Art Center presents a media-focused exhibition as part of the series. We are pleased to present this year's exhibit which features innovative work in photography.\n\nContemporary photography in America is at an exciting and transitory moment. Since the advent of digital photography, the medium has continued to shapeshift into an increasingly inclusive art form. It has been estimated that around 1.4 billion photographs are taken every day, and even more “photographs” can be created by using scanners or creating photographic elements in digital software.\nSome photographic artists continue to use photography in traditional ways: to capture and record the actual world. From the most news-worthy events to the smallest domestic moments, the strength of these images is reliant on the perceptiveness and timeliness of the photographers making them. Other photographic artists create complicated digital collages that bear many similarities to painting. By removing the necessity of photography to show the thing itself, these artists can create constructed scenes within a photograph that never existed in the physical world. To complicate the medium further, the last several decades have produced a resurgence of photographs created through historic processes like cyanotype and wet collodian. Defining what photography is and what a photograph looks like has never been more challenging.\n\nWhile the world is currently experiencing an overflow of photographic images, what makes a photograph successful has stayed relatively unchanged. ART NOW: PHOTOGRAPHY highlights photographic artists that are able to use the world as a raw material to communicate their own visions and experiences. While the processes may vary significantly, this exhibition highlights innovative artists working in photography whose practices shapes what Photography is in 2016.\n-----------\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC", "name": "ART NOW 2016: New Directions in Contemporary Photography: Exhibition Opening", "url": "https://www.facebook.com/events/1716244898615592/", "source": "Facebook"}, {"date": "2016-04-01T18:30:00-04:00", "description": "Sponsored by the University of Michigan Credit Union, Arts & Eats: Dig In with UMS is a $15 ticket package deal that includes a great seat at the performance, exclusive access to a pre-show dinner, and a fun activity to get you thinking about the performance in a whole new way. You can pick up your tickets for the show at the Arts & Eats event.\n\nMore info about Mariachi Vargas de Tecalitlán : http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan/\n\nMore about Dig Ins: http://ums.org/tickets/students/", "name": "Dig In: Mariachi Vargas de Tecalitlán", "url": "https://www.facebook.com/events/1667725740151395/", "source": "Facebook"}, {"date": "2016-04-01T19:30:00-04:00", "description": "March 31 - April 3\nDetroit Opera House\n\nUMS and Michigan Opera Theatre join forces to bring American Ballet Theatre’s new production of The Sleeping Beauty to the Detroit Opera House. Choreographed by Marius Petipa with staging and additional choreography by Alexei Ratmansky, this classic story ballet premiered 125 years ago at the Mariinsky Theatre in St. Petersburg. The story is one of the most familiar and enchanting of all fairy tales: the beautiful princess Aurora is cursed by the evil sorceress Carabosse to sleep for 100 years, until she is awakened by the kiss of a handsome prince. It’s ballet on the grandest possible scale, with superstar dancers, opulent sets and costumes, and Tchaikovsky’s ravishing score performed live by the Michigan Opera Theatre Orchestra.\n\nUMS will provide round-trip luxury coach service for a nominal fee on Friday and Saturday (details to be announced).\n\nMore info: http://ums.org/performance/american-ballet-theatre/", "name": "American Ballet Theatre: The Sleeping Beauty", "url": "https://www.facebook.com/events/1390173447979498/", "source": "Facebook"}, {"date": "2016-04-01T20:00:00-04:00", "description": "Friday, April 1, 2016, 8:00 pm\nHill Auditorium \n\nWe are proud to bring back Mariachi Vargas de Tecalitlán after their extremely popular performances in 2010 and 2013. No other mariachi in history has had a trajectory or influence remotely comparable to theirs; they are widely considered the finest mariachi in the world. Founded in a small city near Jalisco by Don Gaspar Vargas in the 1890s, this band basically invented the modern mariachi. With world-class vocalists and instrumentalists, flawless ensemble work, impeccable taste in repertoire, and spellbinding showmanship, the group never fails to engage its audience, eliciting spontaneous gritos, sing-alongs, and one ovation after another with their heart-wrenching vocals and virtuosic instrumentals. Masters at melding the old world style of mariachi music with new, innovative pieces, Mariachi Vargas is appealing to audiences across all generations. \n\nMore info: http://ums.org/performance/1516-mariachi-vargas-de-tecalitlan", "name": "Mariachi Vargas de Tecalitlán", "url": "https://www.facebook.com/events/453190221522442/", "source": "Facebook"}, {"date": "2016-04-01T20:00:00-04:00", "description": "In a career that spans 23 albums and includes three Grammy awards, Tom Chapin has covered a lot of creative ground. In addition to his work as a recording artist and concert performer, Chapin has acted on Broadway and worked in films, television and radio. Tom grew up in a family that encouraged artistic pursuits. He began performing professionally as a teenager in the early 1960s, playing in Greenwich Village folk clubs alongside his siblings, Harry and Steve, as one of The Chapin Brothers. In 1971, he began a five-year run as the host of the ABC-TV children's series, \"Make A Wish.\" Chapin and his songs were also featured in the 1970 documentary film, \"Blue Water, White Death,\" for which he spent six months sailing the Indian Ocean searching for great white sharks.\n\nAs a music-maker, Chapin has maintained two parallel careers, as a highly respected contemporary folk artist and as a pioneer in the field of children's music. In the former role, Chapin has established a reputation for insightful, heartfelt songcraft and charismatic live performances. In the latter, he continues to engage the hearts, minds and imaginations of young listeners with witty, life-affirming original songs delivered in a sophisticated array of musical styles. Chapin's infectious songs, sterling musicianship and personal warmth shine, whether he's performing on record or in a concert hall, an outdoor festival, a school, in front of a symphony orchestra, or in an intimate coffeehouse. www.tomchapin.com", "name": "Tom Chapin at  Green Wood Coffee House", "url": "https://www.facebook.com/events/1713063788906616/", "source": "Facebook"}, {"date": "2016-04-02T19:00:00-04:00", "description": "Literati is pleased to welcome James Stevens and Ralph Nelson for a discussion of their book Digital Vernacular: Architectural Principles, Tools, and Processes.\n\nDigital Vernacular addresses the why and how of digital fabrication in hundreds of step-by-step color images, illuminating a set of working principles and techniques that join theory with practice. Authors James Stevens and Ralph Nelson reconcile local traditions and innovations with globally accessible methods and digital toolsets. By combining ethics with hardware, the book will root you in the origins of making, ensuring a lasting and relevant reference for your studio practice.\n\nThe book opens with the origins and principles of the digital vernacular, then outlines digital vernacular tools including computer numerically controlled (CNC) mills, laser cutters, and 3D printers. You'll even learn to create your own digital fabrication tools out of inexpensive materials. The book concludes with the processes of the digital vernacular, including techniques for removing, joining, forming, and adding.\n\nA companion website at make-Lab.org hosts additional step-by-step processes and project outcomes.\n\nJames Stevens is an Associate Professor and the Director of makeLab, a digital fabrication studio in the College of Architecture and Design at Lawrence Technological University in Michigan, USA.\n\nRalph Nelson is an Associate Professor in the College of Architecture and Design at Lawrence Technological University and Principal of Loom, a collaborative design practice, based in Ann Arbor, Michigan, USA.", "name": "James Stevens & Ralph Nelson: Digital Vernacular", "url": "https://www.facebook.com/events/638399229645848/", "source": "Facebook"}, {"date": "2016-04-02T21:00:00-04:00", "description": "TOURS COLLIDE!\n\nFar House has not one, but two awesome touring acts, traveling separately and touching down in our space for one night only!\n\n185668232 (Philadelphia, PA)\nhttp://www.185668232.org/\n\n185668232 is one brOKen a-neuro-typical, a-gender, a-political individual using their SSN to demonstrate thee <# liberation of Polyversal condition via 'poeticalogic,' sub-syncopated field-recordings, free-improvisation, instruments/non-instruments, processed live by sample-machine-work-stations, software, effect processors, megaphone, DiY inventions, crowd participation + zZz to deliver timeless abstract-avant-activist-audio-alchemy, breaching ∞ genre/astral planes before glitched-3D video projections. ||:♭\n\n\nBeta Max (Cincinnati, OH)\nhttps://www.youtube.com/watch?v=NmmLdP5L6-8\n\nExperimental hip-hop from one half of Chemical Committee (REALICIDE Youth Records).\n\n\nWith local support by:\n\nWatabou (Ann Arbor, MI)\nhttps://watabou.bandcamp.com/\n\nWatabou is the solo electronic project from the mind of multi-instrumentalist Travis Jarosz. With his blend of intelligence and raw power, Watabou aims to evoke the emotions of any audience to the utmost, be it through intensive melodies, driving rhythms, powerful words, or any other number of qualities attributed to the act.\n\n\nPublic Shaming (Detroit, MI)\nhttp://www.discogs.com/artist/1141217-Thom-Elliott\nhttps://soundcloud.com/mephisto_waltz\n\nPublic Shaming is Thom Elliott & Jake Ruppert's latest cold wave/death industrial project. It combines anguished vocals over lurching, decrepit polyrhythms, tape loops and complex synth textures. PS is an attempt to communicate a visceral sonic encounter with the Void.\n\n\n$5 suggested donation for our out-of-town friends.\n\nDoors at 9, with music starting at 10.\nSHOW UP ON TIME!\n\nRespect the house and the artists.\nThis is a music event, not a house party.\nEngage and participate.", "name": "185668232 & Beta Max (ON TOUR) w/ Watabou & Public Shaming", "url": "https://www.facebook.com/events/966605056760158/", "source": "Facebook"}, {"date": "2016-04-03T17:30:00-04:00", "description": "Strayaway Child Concert Series is proud to present: Lindsay Straw & Caroline O'Shea in concert!\n\nSunday, April 3, 2016\nConor O'Neill's Celtic Room\nDoors 5pm \nShow 5:30pm\nGeneral Admission: $15\nStudents: $12\nKids under 10- Free\n\nLindsay Straw is a singer, guitarist, and Irish bouzouki player who performs traditional songs and tunes from the British Isles. Originally from Montana, she began to explore Boston’s Irish and folk music scenes while studying film scoring at Berklee College of Music. Her debut solo album My Mind From Love Being Free was released on May 1, 2015. She is a 2015 recipient of Club Passim's Iguana Fund Grant, which will enable her to make her second album in 2016.\n\nLindsay has impressed with her tender singing voice and an extensive repertoire that is rooted in the Scottish and Northern Irish traditions, but which also delves into contemporary songwriters like Richard Thompson and Bob Dylan. She has also drawn praise for her sensitive, agile accompaniment on bouzouki and guitar at many a local session and in concert as a member of the Irish quartet The Ivy Leaf, with piper Joey Abarta, and with fellow guitar & bouzouki player Owen Marshall.\nhttp://www.lindsaystraw.com/\n\nCaroline O’Shea is from Milton, MA, and has played the Irish flute and tin whistle since she was a child. As a teenager, she competed in the All-Ireland championships for four years in a row in Letterkenny, Co. Donegal and in Tullamore, Co. Offaly. She received her TTCT Diploma—a week-long certification course in Dublin for teaching traditional Irish music—in 2016, and has taught for Boston’s branch of Comhaltas Ceoltoiri Eireann (Irish music school); at the Killarney School of Music in Killarney, Co. Kerry; at the Milton Art Center; and at the Irish Cultural Centre of New England, in addition to private lessons. Caroline currently plays in a duo with singer Lindsay Straw, and plays flute, whistles, and sings with traditional Irish group The Ivy Leaf. In addition to playing flute and whistle, Caroline was recently awarded a grant from the MA Cultural Council to study the uilleann pipes with master piper Joey Abarta.\n\nSince 2010, Caroline has played flute, whistles, and sung with traditional Irish group The Ivy Leaf. Their debut CD of tunes and songs The Ivy Leaf: Traditional Irish Music was released in 2012. She plays at festivals and events with Boston-based band Devri as well, and played low and high whistles on the band’s debut CD Broad Street in 2012.\nhttps://cosheamusic.wordpress.com/", "name": "Lindsay Straw & Caroline O'Shea- In Concert", "url": "https://www.facebook.com/events/1685542291727910/", "source": "Facebook"}]