[{"description": "Artistic Director Shawn McDonald and other Arbor Opera Theater artists will perform Broadway favorites.\nTickets may be purchased online for the concert and the luncheon that follows. Tickets for the concert only may be purchased at the door beginning at 10 a.m.", "url": "https://www.facebook.com/events/1831074080507588/", "source": "Facebook", "name": "Ann Arbor Society for Musical Arts Concert", "date": "2016-10-26T10:30:00-04:00"}, {"description": "AOT Artistic Director Shawn McDonald and friends will perform Broadway selections. Buy tickets for the concert and the meet-the-artist luncheon here. http://annarborsma.org/purchase-tickets/\nIf you are able to attend the concert, but can't stay for  the luncheon, you can arrive at 10 and buy tickets at the door. \nHere is additional information http://annarborsma.org/", "url": "https://www.facebook.com/events/1199670356770424/", "source": "Facebook", "name": "Ann Arbor Society for Music Arts Concert", "date": "2016-10-26T10:30:00-04:00"}, {"description": "Join us in welcoming Wil Wheaton at this stop on his tour, advocating support for Presidential Candidate Hillary Clinton. He will be visiting Vault of Midninght for one hour and one hour only. Don't miss it!", "url": "https://www.facebook.com/events/263263914068936/", "source": "Facebook", "name": "Wil Wheaton talks Hillary Clinton", "date": "2016-10-26T11:00:00-04:00"}, {"description": "Is your costume not ready and you're freaking out a little? Don’t worry, Maker Works can help. Come to a two hour workshop with YOUR costume and we will help you with any problems that you are having. We will have two experts on-hand that have skills in sewing, pattern reading, and light fabrication. We won’t make it for you, but we will make sure you make it right. Price includes a day pass and time with instructors. Patrons are encouraged to bring all of their materials.\n\nCall 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=26&month=10&year=2016&view=day to sign up.", "url": "https://www.facebook.com/events/1464735420222775/", "source": "Facebook", "name": "Halloween Workshop", "date": "2016-10-26T17:00:00-04:00"}, {"description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Will McEvoy's Third Coast Quartet, Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation: A Tribute to Connie Crothers, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, MoTreetown Collective, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest website: \nwww.edgefestannarbor.com", "url": "https://www.facebook.com/events/1606056323056977/", "source": "Facebook", "name": "Edgefest 20: 20 Years At The Edge!", "date": "2016-10-26T17:00:00-04:00"}, {"description": "Our October Artists Meet & Greet topic is “How to Create a Strong Creative Business”, involving an extensive talk and discussion by Andrea Rosenfeld—former Director of Merchandising and Operations for Isaac Mizrahi, Ltd., professional fine artist, and business consultant. Join us for this free event, connect with other artists, and the Art Center staff.\n\nSpeaker: Andrea Rosenfeld, CEO of Detroit Art & Business \n\nAndrea Rosenfeld uses her passion and expertise guiding creative entrepreneurs to greater confidence, clear forward movement and financial sustainability.  \n\nAndrea consults her clients and students to rise above their business fears and reach their goals through mindful business coaching. “I guide my clients to grow a healthy and strong business by helping them look inside themselves, seeing how they react to life’s challenges, create realistic action steps and “see” their business, the good, the bad and the ugly, so we can capitalize on strengths and combat challenges, together.”  Rosenfeld speaks and lives this ideal daily. \n\nOur monthly Artists' Meet & Greets held at the 117 Gallery are a perfect opportunity to connect with the Art Center, network with other artists, and attend artist talks by guest speakers.\n\nLearn more about our Artist Meet & Greet Events:\nhttp://www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/1237258406316643/", "source": "Facebook", "name": "How to Create a Strong, Creative Business", "date": "2016-10-26T18:00:00-04:00"}, {"description": "Literati is pleased to welcome poets Troy Jollimore and Heather Altfeld for a reading and signing. \n\nTroy Jollimore’s most recent collection of poetry, Syllabus of Errors, was chosen by the New York Times as one of the best poetry books of 2015. His previous poetry books are At Lake Scugog (2011) and Tom Thomson in Purgatory, which won the National Book Critics Circle Award in poetry for 2006. He teaches philosophy at California State University, Chico, and is the author of two philosophical works, Love’s Vision and On Loyalty. He has been the recipient of fellowships from the Bread Loaf Writers Conference, the Stanford Humanities Center, and the Guggenheim Foundation.\n\nHeather Altfeld is the author of The Disappearing Theatre, chosen by Stephen Dunn for the Poets at Work prize. Her poetry appears or is forthcoming in Narrative Magazine, ZYZZYVA, Pleiades, Copper Nickel, The Literary Review, Cimarron Review, Watershed, and others, and she has written essays for North American Review, Superstition Review, and Poetry Northwest. Her research and areas of interest include Children’s Literature, Anthropology and Poetry, Waldorf Education for K-12, and things that have vanished. She has taught in Juvenile Hall, California Poets-in the Schools, Teachers and Writers Collaborative in New York City, and various campuses in the North State.", "url": "https://www.facebook.com/events/210635872681910/", "source": "Facebook", "name": "Troy Jollimore & Heather Altfeld", "date": "2016-10-26T18:15:00-04:00"}, {"description": "Create your own forged bracelet out of copper wire! You’ll learn metalsmithing techniques like forming, forging, and finishing while gaining experience with Anvils, Hammers and Torches. \n\nThis 2 hour Make & Take Workshop is intended for all ages, but please give us a call if you are bringing someone under the age of 12. No prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.\nCall Maker Works at 734-222-4911 or visit  http://www.supersaas.com/schedule/makerworks/CheckOut?day=26&month=10&year=2016&view=day to sign up!", "url": "https://www.facebook.com/events/1600184536952443/", "source": "Facebook", "name": "Forge Your Own Copper Bracelet", "date": "2016-10-26T19:00:00-04:00"}, {"description": "Rise Again Community Sing-Along with Jeanne Mackey • Oct. 26, 7 p.m. in the Crazy Wisdom Community Room • Join song leader Jeanne Mackey for a community sing-along from the recently released Rise Again Songbook, a guide with lyrics to over 1200 songs, from Beatles to ballads, Dylan to Broadway. Purchase the songbook at Crazy Wisdom or use the store copy. Shower singers welcome! Suggested donation $5. Call 665-2757 or email rachel@crazywisdom.net.", "url": "https://www.facebook.com/events/1775512142736337/", "source": "Facebook", "name": "Rise Again Community Sing-Along with Jeanne Mackey", "date": "2016-10-26T19:00:00-04:00"}, {"description": "Two nights of dark delights!\n\nWednesday October 19, and Wednesday, October 26!\n\nThis annual event will be one of your favorite events this fall!  Please call 734.222.9841 for reservations.  Seats are very limited.", "url": "https://www.facebook.com/events/284974851895383/", "source": "Facebook", "name": "Black Wine Night", "date": "2016-10-26T19:00:00-04:00"}]