[{"source": "Facebook", "url": "https://www.facebook.com/events/636392859875157/", "description": "Please help us finish the fantastic addition and re-route that has been added to Torn Shirt. We will have two back-to-back trail days on Saturday and Sunday, from 9am-1pm both days.  You'll be helping us add the finishing touches to this new section. Tools will be provided.\n\nWe will meet at the trail head at Bishop Lake  at 9:00 and then split up into groups.", "date": "2016-08-14T09:00:00-04:00", "name": "Bright Rec/Torn Shirt Trail Days"}, {"source": "Facebook", "url": "https://www.facebook.com/events/552129054974239/", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.\n￼\nEngaging with Art tours are generously supported by the Berkowitz Family Endowed Fund.", "date": "2016-08-14T14:00:00-04:00", "name": "Guided Tour - Catherine Opie: 700 Nimes Road"}, {"source": "Facebook", "url": "https://www.facebook.com/events/821495207950213/", "description": "Former University of Michigan hockey standout and Hobey Baker award winner Kevin Porter just won the 2016 Stanley Cup with the Pittsburgh Penguins.  He will be bringing the Cup back to his home state to share with his many fans on August 14th from 2pm to 5pm at the Jolly Pumpkin restaurant.\n \nFor a donation of $10 take your photo with @kporter12 and the Cup.  All proceeds benefit Athletes Connected. #stanleycup #hockey #annarbor\n\nFor more information about @Aths_Connected please visit http://athletesconnected.umich.edu.", "date": "2016-08-14T14:00:00-04:00", "name": "Stanley Cup and Kevin Porter at Jolly Pumpkin!"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1184830471537277/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "date": "2016-08-14T16:00:00-04:00", "name": "Beer and Board Games"}, {"source": "Facebook", "url": "https://www.facebook.com/events/602973329873681/", "description": "Join us for the next installment of Friends of babo on Sunday, August 14th at 6pm. We'll be serving four rounds of drinks featuring local spirits from Ann Arbor Distilling Co. and light snacks prepared from ingredients sourced at babo. This event is 21+.\n\nRound 1\nVodka, Campari, Cocchi Rosa, Grapefruit, Lavender\n\nRound 2\nGin old-fashioned\n\nRound 3\nStrawberry Basil Daiquiri\n\nRound 4\nChipotle infused vodka, coffee liqueur, babo cold-press coffee", "date": "2016-08-14T18:00:00-04:00", "name": "Friends of babo: Ann Arbor Distilling Co. Cocktail Party"}, {"source": "Facebook", "url": "https://www.facebook.com/events/270052306706747/", "description": "Ann Arbor's Club Above presents\n\nBooks On Tape\nhttps://www.facebook.com/therealbooksontape/\nhttps://booksontapeband.bandcamp.com/\n\nNature's Garbage\nhttps://www.facebook.com/naturesgarbage/\nhttps://naturesgarbage.bandcamp.com/\n\nParkway & Columbia\nhttps://www.facebook.com/ParkwayAndColumbia/\nhttps://parkwayandcolumbia.bandcamp.com/\n\nWelman\nhttps://www.facebook.com/Welman-1680372282184769/?fref=ts\nhttps://welman.bandcamp.com/\n\nDoors: 7:00PM\nShow: 8:00PM\n\nTickets: $5 for 21+ and $7 for - 21\n\nMerch will be availble at show\n\nClub Above, Ann Arbor\n215 N Main St, Ann Arbor, MI 48104", "date": "2016-08-14T19:00:00-04:00", "name": "Books On Tape // Nature's Garbage // Welman // Parkway & Columbia"}, {"source": "Facebook", "url": "https://www.facebook.com/events/268595390193528/", "description": "Now through next Thursday, all our Private Label supplements and essential oils are 25% off! Stock up on nutritional support, tintures, essential oils for health or aromatherapy, vitamins, and more. While supplies last.", "date": "2016-08-15T10:00:00-04:00", "name": "25% Off Lucky's Market Supplements"}, {"source": "Facebook", "url": "https://www.facebook.com/events/170729440003602/", "description": "August 9–October 30, 2016\nCorridor Gallery\n\nArtist and poet Ann Holmes first encountered Japanese folk ceramics while living in Tokyo in the late 1960s. Fascinated by the simple aesthetic, the craftsmanship, and the makers’ unassuming personalities and ways of life, Holmes visited many kiln towns to photograph and interview the artists and collect ceramic wares of various shapes and techniques. She donated a significant portion of her collection to UMMA in 2013.\n\nRichly introduced in this presentation are works by ceramic artists emerging in the late 1960s and the early 1970s in the town of Mashiko, two hours north of Tokyo by train. Mashiko became an international mecca of folk ceramics after Hamada Shōji (1894–1978), a major figure of Japan’s Folk Craft (Mingei) Movement, set up his studio there in 1930. Hamada’s idea of ceramic making for a new age, which combined the aesthetic of folk ceramics and the modern concept of the studio artist, attracted many younger artists of unconventional backgrounds, including women.", "date": "2016-08-15T11:00:00-04:00", "name": "In Focus: Modern Japanese Folk Ceramics"}, {"source": "Facebook", "url": "https://www.facebook.com/events/494075117454653/", "description": "“Art is made in the freedom of the imagination with no rules”\n\n\"bobrauschenbergamerica\" is a fast paced non-traditional slice of life story revolving around relationships, explored through wacky images, poetry, jokes, dance, and more, providing a wild look at American culture. \n\nWritten by Charles L. Mee. Featuring: Danielle Clevenger, Elizabeth Dieterich, Rick Eva, Alanna Elling, Mark Isler, Kelsea Kerkes, Josie Lapczynski, Sara Long, Jeffery Stringer, and James Walrod. \n\nFriday, August 12 @ 8 pm \nSaturday, August 13 @ 8 pm\nSunday, August 14 @ 7 pm", "date": "2016-08-15T20:00:00-04:00", "name": "Bobrauschenbergamerica"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1210761835633153/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nHeather Schwartz \nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "date": "2016-08-16T19:00:00-04:00", "name": "Acoustic Tuesdays: Heather Schwartz"}]