[{"source": "Facebook", "url": "https://www.facebook.com/events/208434849627331/", "description": "Join us for Ann Arbor\nRestaurant Week\nJanuary 15th – 20th, 2017\nLunch & Dinner\n\nhttp://www.annarborrestaurantweek.com/\n\nReservations Recommended\n(888) 456-3463 (DINE)", "name": "Ann Arbor Restaurant Week", "date": "2017-01-16T10:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1844201079197076/", "description": "Ann Arbor Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price.\n\nVinology Wine Bar and Restaurant is proud to be part of this great event, offered from January 15 - 20.  Enjoy a three course dinner for only $28!", "name": "Ann Arbor Restaurant Week", "date": "2017-01-16T10:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1894155567471093/", "description": "We'd love for you to join us for Ann Arbor Restaurant Week, January 15th-20th. Click the link to view our lunch and dinner options for two. We have vegetarian, vegan, and gluten free options.\n\nAlso, $.50 from each Restaurant Week meal purchased at the brewpub will be donated to Food Gatherers!\n\nhttp://www.annarborrestaurantweek.com/…/arborbrewingcompany/", "name": "Ann Arbor Restaurant Week at Arbor Brewing Company", "date": "2017-01-16T11:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/357869054582083/", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "name": "Ann Arbor Restaurant Week", "date": "2017-01-16T11:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/217809182006562/", "description": "Martin Luther King Jr. Day of Service is an opportunity to make your day “off” a day “on” for community service. Help improve a park and protect biodiversity by removing invasive shrubs from Black Pond Woods Nature Area. Meet at the park entrance on Tibbits Court near the intersection with Brookside Drive. If you would like to learn more about the MLK Day of Service mission, please visit the organization’s website at www.mlkday.gov.  \nPlease dress in layers and wear shoes suitable for snow or wet ground. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided.\n#a2parks #annarborparks #michigan #exercise #nature #volunteer #a2nap #MLKDay", "name": "MLK Day of Service Stewardship Workday", "date": "2017-01-16T13:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1826785644235500/", "description": "Improve your woodworking knowledge with one-on-one instruction. The process of using woodworking tools in unison to create a final product is the primary focus of this class. \n\nWe’ll walk you through using the Jointer, Planer, Table Saw and Drum Sander to gain confidence with each tool. You will also be learning how different materials and their features or defects might affect the finished project. \n\nWoodworking skills taught: Wood identification and selection, milling, gluing/clamping, shaping, and table saw ripping/crosscutting. You’ll also learn how to use a table saw in unexpected ways. \n\nProject: End Grain Cutting Board \n\nPrerequisites: Attendees must be checked out on on the Jointer, Planer, Drum Sander and Table Saw. \n\nThis class meets three times: Monday 01/16 6:00pm - 9:00pm and Tuesday, 01/17 6:00pm - 8:00pm, and Wednesday, 01/18 6:00pm - 8:30pm \n\nThis class is taught by Chris Riecker, find out more about his work here: maker-works.com/this-woodworking-is-a-cut-above/", "name": "Woodworking Skill Development - 7.5hrs - $200", "date": "2017-01-16T18:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/280243392370950/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network", "date": "2017-01-17T08:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1716505231999811/", "description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "name": "Intro to Stagecraft Workshops", "date": "2017-01-17T10:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/712053682285362/", "description": "One of the most celebrated and innovative American artists of our time, Frank Stella is renowned for his early minimalist aesthetic and later expressive abstraction. His investigations into form and materials have led him to continually explore the parameters of two– and three–dimensional space. In 1967 Stella began a thirty–year creative collaboration with master printer Ken Tyler and his Los Angeles workshop. Stella and Tyler inspired and challenged each other to move in exciting new artistic directions. The Museum was recently gifted three exceptional prints that developed out of this historic partnership. Based on Stella’s paintings from the Notched-V series, they reflect the artist’s signature geometric style of the 1960s, during which he eschewed illusionistic space, choosing instead large–scale, shaped canvases that tightly frame the composition. The prints are both optical and tactile: The ink rises from the paper and the slightly rough lines reveal the artist’s hand.\n\nThis work was recently gifted to UMMA by Marsha Vinson and Marvin Rotman and will be on display till April 23, 2017.", "name": "In Focus: Frank Stella", "date": "2017-01-17T11:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1720937631566664/", "description": "Biscuits for Your Outside Man: A Fundraiser Dinner for the Music Makers Relief Foundation\n\nThough the Blues has had an enormous impact on American music, many of the form’s most influential artists have struggled behind the scenes. In 1994, Tim and Denise Duffy started the Music Makers Relief Foundation to provide financial support to Southern working class musicians, ensuring that their legacies and music will be preserved. Limited by age and abject poverty, many of these artists have almost given up hope when instead they should be celebrated and recorded into history.\n\nJust like the Music Makers have brought back musicways embedded in American roots, Zingerman’s Roadhouse has strived to connect with foodways that are steeped in American culture. Chef Alex Young has collaborated with our special guest, Music Makers member Dom Flemons from The Carolina Chocolate Drops, to create a dinner that reflects the music of the very artists the foundation has helped promote. Come by and taste the BBQ that Drink Small praises in his song, “Living in a BBQ World”, and the buttery biscuits that Algia Mae Hinton sings about in “Biscuits for your Outside Man”. The Music Makers Relief Dinner on Tuesday, January 17th, will be an opportunity to enjoy great food, hear soulful music, and to help protect expressive talent by purchasing tickets to a truly remarkable event.\n\nTo hear the songs we will feature at the dinner, follow this link: \n\nhttp://musicmaker.bandcamp.com/album/biscuits-for-your-outside-man", "name": "African American Special Dinner: Biscuits for Your Outside Man", "date": "2017-01-17T18:00:00-05:00"}]