[{"description": "Join us for Ann Arbor\nRestaurant Week\nJanuary 15th – 20th, 2017\nLunch & Dinner\n\nhttp://www.annarborrestaurantweek.com/\n\nReservations Recommended\n(888) 456-3463 (DINE)", "date": "2017-01-25T10:00:00-05:00", "name": "Ann Arbor Restaurant Week", "source": "Facebook", "url": "https://www.facebook.com/events/208434849627331/"}, {"description": "Ann Arbor Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price.\n\nVinology Wine Bar and Restaurant is proud to be part of this great event, offered from January 15 - 20.  Enjoy a three course dinner for only $28!", "date": "2017-01-25T10:00:00-05:00", "name": "Ann Arbor Restaurant Week", "source": "Facebook", "url": "https://www.facebook.com/events/1844201079197076/"}, {"description": "We'd love for you to join us for Ann Arbor Restaurant Week, January 15th-20th. Click the link to view our lunch and dinner options for two. We have vegetarian, vegan, and gluten free options.\n\nAlso, $.50 from each Restaurant Week meal purchased at the brewpub will be donated to Food Gatherers!\n\nhttp://www.annarborrestaurantweek.com/…/arborbrewingcompany/", "date": "2017-01-25T11:00:00-05:00", "name": "Ann Arbor Restaurant Week at Arbor Brewing Company", "source": "Facebook", "url": "https://www.facebook.com/events/1894155567471093/"}, {"description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "date": "2017-01-25T11:00:00-05:00", "name": "Ann Arbor Restaurant Week", "source": "Facebook", "url": "https://www.facebook.com/events/357869054582083/"}, {"description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "date": "2017-01-25T17:00:00-05:00", "name": "Sunseed Farm CSA Pickup", "source": "Facebook", "url": "https://www.facebook.com/events/731926473638010/"}, {"description": "Dreaming of a vacation? Come join us at Carson’s for our Taste of Paradise chef-inspired 4-course dinner served in our toasty warm glass room!  \n\nCarson’s American Bistro\nTaste of Paradise \n4-Course Chef-Inspired Dinner \n\nWednesday, January 25, 2017\n6PM | $39.95 (tax/tip not included)\nwww.carsonsamericanbistro.com/taste-of-paradise\n\nTHE MENU\n\nFIRST COURSE\nCoconut Shrimp \nwith orange marmalade rum sauce\nCranberry Margatini\n\nSECOND COURSE\nJerk Chicken Cobb Salad\nKey West jerk marinated chicken, Applewood smoked bacon, avocado, tomato, bleu cheese crumbles & honey mustard dressing\nRanger IPA\n\nTHIRD COURSE\nCarson’s “Moonshine” Burger\nbourbon glazed beef patty topped with bourbon onions, bacon, cheddar cheese, lettuce & tomato \nCarson’s Rum Punch \n\nFOURTH COURSE\nKey Lime Pie\ntopped with a dollop of crème fraiche \nGrand Traverse Riesling \n\nReservations Required\n(888) 456-3463 (DINE)\nCarson’s American Bistro \n2000 Commonwealth Blvd.  \nAnn Arbor, MI 48105 \nPhone (888) 456-3463 (DINE)\nwww.carsonsamericanbistro.com", "date": "2017-01-25T18:00:00-05:00", "name": "Taste of Paradise Chef's Dinner", "source": "Facebook", "url": "https://www.facebook.com/events/362129777482951/"}, {"description": "Literati is pleased to welcome acclaimed photographer Camilo José Vergara in celebration of his latest work, Detroit Is No Dry Bones: The Eternal City of the Industrial Age.\n\nOver the past 25 years, award-winning ethnographer and photographer Camilo José Vergara has traveled annually to Detroit to document not only the city’s precipitous decline but also how its residents have survived. From the 1970s through the 1990s, changes in Detroit were almost all for the worse, as the built fabric of the city was erased through neglect and abandonment. But over the last decade Detroit has seen the beginnings of a positive transformation, and the photography in Detroit Is No Dry Bones provides unique documentation of the revival and its urbanistic possibilities. Beyond the fate of the city’s buildings themselves, Vergara’s camera has consistently sought to capture the lives of Detroit’s people. Not only has he shown the impact of depopulation, disinvestment, and abandonment during the worst years of the urban crisis, but he has also shown Detroiters’ resilience. The photographs in this book are organized in part around the way people have re-used and re-purposed structures from the past. Vergara is unique in his documentation of local churches that have re-occupied old bank buildings and other impressive structures from the past and turned them into something unexpectedly powerful architecturally as well as spiritually.\n\n“Vergara is especially alert to changes in the urban landscape . . . perhaps more people will take a second, closer look at the wealth of native folk art we have all over town. And Vergara deserves thanks for recording them and offering a serious critical appraisal.”\n—Detroit Metro Times\nCamilo José Vergara was named a MacArthur Foundation Fellow in 2002 and received a Berlin Prize Fellowship in 2010. In 2013, he became the first photographer to be awarded the National Humanities Medal. He is author of numerous books, including Silent Cities: The Evolution of the American Cemetery; The New American Ghetto; and Harlem: The Unmaking of a Ghetto.", "date": "2017-01-25T19:00:00-05:00", "name": "Camilo Jose Vergara: Detroit Is No Dry Bones", "source": "Facebook", "url": "https://www.facebook.com/events/1169444286484219/"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "date": "2017-01-26T08:00:00-05:00", "name": "10% For Good for Community Action Network", "source": "Facebook", "url": "https://www.facebook.com/events/324709987912141/"}, {"description": "The City of Ann Arbor has scheduled a Public Information Meeting from 4:00 p.m. to 6:30 p.m. on Thursday, January 26, 2017 in the basement conference room at the Ann Arbor City Hall, 301 E. Huron Street, Ann Arbor, Michigan 48104.\n\nAn Environmental Assessment (EA) was prepared in 2010 to evaluate the social, economic, and environmental aspects of proposed improvements to the Ann Arbor Municipal Airport. The proposed improvements focus on shifting and extending Runway 6/24, the primary runway, to address the needs of the existing critical aircraft that use the airport. Alternatives were developed to provide options for extending the existing runway by 795 feet, from 3,505 feet to 4,300 feet, while extending the existing parallel taxiway to the same length.  \n\nThe original 2010 Environmental Assessment has been revised and updated, however the proposed improvements have not changed between the original 2010 EA and the recently revised EA.\n\nThe revised EA is available for public review starting today until February 10, 2017 at the following locations:\nAnn Arbor Municipal Airport\n801 Airport Drive\nAnn Arbor, MI 48108\n\nAnn Arbor Public Library 343 S. Fifth Avenue\nAnn Arbor, MI 48104\n\nAnn Arbor Municipal Airport website\t\nhttp://www.a2gov.org/departments/fleet-facility/Airport/Pages/AirportNewsProjects.aspx\n\nAnn Arbor City Hall\n301 E. Huron Street\nAnn Arbor, MI 48104\n\nPittsfield Township Administrative Offices \n6201 W. Michigan Avenue\nAnn Arbor, MI 48108\n\nMDOT – Office of Aeronautics website\nhttp://www.michigan.gov/aero/\n\nThe purpose of the Public Information Meeting is to answer questions regarding the revised EA, or the Preferred Alternative, and to solicit constructive input from interested citizens regarding the social, economic, and environmental impacts of the proposed improvements. Maps, drawings and other pertinent information, including the EA document, will be available for public information. Please take an opportunity to review the EA at one of the locations listed above prior to the meeting as there will be no formal presentation.  Written comments may be submitted during the Public Information Meeting or may be mailed or e-mailed to the following address. All comments must be received by 5:00 p.m. on February 10, 2017 to be included in the study record.\n\nContact Name:\t\tMr. Steve Houtteman\nContact Address:\tOffice of Aeronautics\nMichigan Department of Transportation\n2700 Port Lansing Road\nLansing, MI 48906\nEmail Address: \tHouttemanS@michigan.gov", "date": "2017-01-26T16:00:00-05:00", "name": "Ann Arbor Airport EA Public Information Meeting", "source": "Facebook", "url": "https://www.facebook.com/events/1282795971759170/"}, {"description": "It happens every day, that creeping question that lingers in the back of our minds until we have to figure it out- what's for dinner?! Join Victoria, our culinary manager, for some easy ways to add our house-made salads and entrees into your meal, and great tips to make your dinner game strong. Our chef's case makes dinner decisions delicious!", "date": "2017-01-26T17:00:00-05:00", "name": "Dinner 101 with Victoria", "source": "Facebook", "url": "https://www.facebook.com/events/2197830000442548/"}]