[{"date": "2016-07-06T17:00:00-04:00", "source": "Facebook", "description": "What better way to close out the 4th of July holiday than with a Food Truck Rally?! We're back again with your favortie, local food trucks serving up a great time! Take a break from all that grilling this weekend and have dinner with us!\n\nDon't forget to tag us in your photos with #a2rally we're on Twitter and Instagram too!\n\nUpcoming Rallies:\nJuly 6th\nAugust 3rd\nSeptember 7th\nOctober 5th\n\nDelectabowl Food Truck & Catering\nBigalora Wood Fired Food Truck\nMatt & Mo's\nTHE PITA POST\nShimmy Shack\nMI Pops\nHello! Ice Cream & Gelato\nHero Or Villain Van\nCheese Street\nPetey's Donuts", "url": "https://www.facebook.com/events/1597397783915820/", "name": "First Wednesday Food Truck Rally"}, {"date": "2016-07-06T19:00:00-04:00", "source": "Facebook", "description": "Literati is pleased to welcome Lauren Gucik to Literati in support of Women Street Artists of Latin America: Art without Fear. \n\nIn this groundbreaking, in-depth look at a rarely explored perspective of street art, more than twenty female artists from seven nations in Latin America discuss themes of social justice, artist process, community, visibility, feminism, and more. A bilingual edition packed with full-color photographs and interviews, this revealing exploration of contemporary street art includes work from Colombia, Peru, Panama, El Salvador, Nicaragua, Guatemala, and Mexico. Viva!\n\nLauren Gucik is an artist and community organizer living in Oakland, CA. She graduated with a degree in Theatre Arts from Indiana University. She has worked with the SF Mime Troupe, Brava Theatre, and Precita Eyes Mural Project as a children's art teacher. She is currently the Secretary of the Community Advisory Panel at KQED, the Bay Area's public media station and she organizes the Dia de Los Muertos Festival of Altars with the Marigold Project. \n\nEvent date: \nWednesday, July 6, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1024696030948987/", "name": "Lauren Gucik"}, {"date": "2016-07-07T12:00:00-04:00", "source": "Facebook", "description": "The Outer Vibe is a musical vacation where everyone enjoys a slice of paradise delivered by the band’s feel-good nostalgic and energetic concert experience. “Clint Eastwood drinking a pina colada at a Dick Dale concert” is how the band describes the sounds and styles of their 2015 full-length release “Full Circle,” a collection of songs they often describe as cinematic surf disco.\n“Full Circle” was created in collaboration with producer Brad Dollar (Grateful Dead, Keb-Mo, The National) and mastering engineer Joe LaPorta (The Foo Fighters, Imagine Dragons, Vampire Weekend). Upon its release in May 2015, “Full Circle” was supported by a national tour, along with radio airplay in 11,000 retail stores, commercial radio airplay in 5 midwest states, and airplay on 200+ college radio stations.\nDollar says, “When I listen to the latest batch of The Outer Vibe productions, I feel like I'm on a vacation I don't want to leave. The guitars feel like a Cheshire smile on a sunny beach, the drums beat like perfect waves on the shore. Everything stays glued together with sticky-sweet vocals, trumpets sounding from the west, and bass sounds that walked down from another planet. All at the same moment providing reflection and rejoice.”\n“Full Circle” is a follow-up to their 2012 album “Hoka Hey”, which independently achieved much success, achieving top 5 request at radio in Michigan, Wisconsin, and the Dakotas and licensing from ABC News’s “Good Morning, America” and West Michigan’s Baker College in 2013.\nhttps://theoutervibe.com\n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "url": "https://www.facebook.com/events/1564710407160434/", "name": "The Outer Vibe / July 7th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE"}, {"date": "2016-07-07T16:00:00-04:00", "source": "Facebook", "description": "This FIGHT CLUB 2 appearance is a signing ONLY\n\nChuck will not be performing or reading at this event\n\nThis is a ticketed event & each ticket will include a copy of the FIGHT CLUB 2 hardcover ($29.95 plus tax)\n\nTickets must be purchased in order to join the signing line\n\nIn addition to FIGHT CLUB 2, Chuck will sign TWO other items (memorabilia or book) ONLY FIGHT CLUB 2 WILL BE PERSONALIZED, All Other Items WILL BE SIGNATURE ONLY\n\nChuck will happily pose for photos with fans\n\nLine formation will begin at 3:00 pm, signing starts at 4:00 pm\n\nYou may reserve your ticket in-person or by calling the store at 734-662-0600 and purchasing via credit card over the phone.", "url": "https://www.facebook.com/events/223050211404675/", "name": "Chuck Palahniuk - Signing Only Ticketed Event for 'Fight Club 2' Graphic Novel - Only Michigan Event"}, {"date": "2016-07-07T19:00:00-04:00", "source": "Facebook", "description": "Barton Nature Area is a 102-acre park located along the Huron River. The main part of the park is known as the oxbow, and contains dry prairie, wet meadow, mesic forest, old field, and other unique ecosystems. Barton Dam is a must-see sight in the park!\nThe nature walks are a collaboration between the AADL and Natural Area Preservation, and take place each month throughout the summer and fall. For this one, we will meet in the parking lot off Huron River Drive. Wear comfortable clothes and bring water and bug spray if desired. Some of the AADL Science Tools will be available for use during the walk, too!", "url": "https://www.facebook.com/events/250519785315692/", "name": "Nature Walk with Ann Arbor District Library"}, {"date": "2016-07-07T21:00:00-04:00", "source": "Facebook", "description": "With the Neti Collective in the summer groove you know it's going to be a long summer of stanky dank tunage. Following June's Wet Hot American Bummer is the first Neti show of July, Yeti's Revenge! Come on out to the Club Above and party with some of your favorite local artists!\n\nFeaturing music from...\n\ncig butts - A great up and coming garage rock outfit from Ypsi\nhttps://soundcloud.com/cig-butts // http://cigbutts.com\n\nVest And Tyler - A rising chiptune/drum 'n' bass artist from Ann Arbor\nhttps://soundcloud.com/vestandtyler\n\nTigerbride (split set w/ Squaredog) - A local indie folk project consisting of Wes Holkeboer and Scott Crandall, featuring new tunes from Scott's solo project Squaredog\n\nL.R. Caraway - A new solo act with bluesy tones\n\n----------------------------------------------\nDoors @ 9 // Music @ 9:30\n$3 cover // 18+\nhttp://neticollective.com/", "url": "https://www.facebook.com/events/1690269164571027/", "name": "Neti Collective presents Yeti's Revenge"}, {"date": "2016-07-08T07:00:00-04:00", "source": "Facebook", "description": "This is one of our biggest- and favorite- One Day Sales! All self-serve bulk items are 30% off for one day only, so make some room in your pantry, grab some containers, and come see us this Friday :)\n\nThis sale applies to bulk items in our self-serve bins, and not on our packaged bulk items.", "url": "https://www.facebook.com/events/295464824122080/", "name": "30% Off Bulk- One Day Sale"}, {"date": "2016-07-08T14:00:00-04:00", "source": "Facebook", "description": "Bill Crispin Chevrolet and the Main Street Area Association present the 22nd Annual “Rolling Sculpture Car Show” on July 8 from 2-10 pm.\n\nThe event itself is free and open to the public. Spectators enjoy the energy of more than 300 exotic, antique, classic, and one of a kind cars on Main, Liberty, and Washington Streets in downtown Ann Arbor.\n\nOur Hot Rod DJ, Surfer Joe, will be “spinning” all of your favorite, and soon to be favorite, hot rod songs throughout the show. Surfer Joe Productions has 25 hours of all hot rod tunes, and Joe will play his most popular 8 hours at the show. Stop by and make a request at the corner of Main and Liberty.\n\nThe Ann Arbor District Library will have family activities at their booth on Liberty Street between Fourth and Fifth Ave.\n\nAwards judged by Bill Crispin Chevrolet and other show sponsors will be presented at 7pm at the corner of Main and Liberty.", "url": "https://www.facebook.com/events/1717075365223531/", "name": "2016 Rolling Sculpture Car Show"}, {"date": "2016-07-08T14:00:00-04:00", "source": "Facebook", "description": "Bill Crispin Chevrolet and the Main Street Area Association present the 22nd Annual “Rolling Sculpture Car Show” on July 8 from 2-10 pm.\n\nTaking place in the heart of downtown Ann Arbor, the Rolling Sculpture Car Show is a one of kind experience for the car enthusiast. All cars are welcome to exhibit at the Show. Exhibitors pre register vehicles, $20. Show cars enter on Washington Street at Fifth.\n\nThe event itself is free and open to the public. Spectators enjoy the energy of more than 300 exotic, antique, classic, and one of a kind cars on Main, Liberty, and Washington Streets in downtown Ann Arbor. Plenty of public parking is available in all structures and surface lots. Visit www.a2dda.org for parking options.\n\nHot Rod DJ, Surfer Joe, will be “spinning” all of your favorite, and soon to be favorite, hot rod songs throughout the show. Surfer Joe Productions has 25 hours of all hot rod tunes, Joe will play his most popular 8 hours at the show. Stop by and make a request at the corner of Main and Liberty.\n\nThe Ann Arbor District Library will have family activities at their booth on Liberty Street between Fourth and Fifth. Stop by Ann Arbor’s 107one booth on Main Street and sign up for some great giveaways.\n\nThe special display area on E. Liberty between Fourth and Fifth will feature Studebakers. The Studebaker family, with a tradition of blacksmithing, began building wagons in South Bend, Indiana in 1852, and eventually became the world’s largest manufacturer of horse-drawn vehicles. Early in the 20th century they added electric, and then gasoline powered, vehicles (initially produced in Detroit). Studebaker was the only wagon and carriage manufacturer to successfully transition to motor vehicles into the modern era, ending production of automobiles in 1966. Though always outpaced by the Big Three financially, Studebaker often exhibited daring and ground breaking design, especially after World War II. One model, the Avanti, was so well regarded that it continued in production by various independent successor companies into 2006. This display will showcase vehicles dating back to 1880 all the way up to 2002.\n\nAwards judged by Bill Crispin Chevrolet and other Show sponsors presented at 7 pm at the corner of Main and Liberty.", "url": "https://www.facebook.com/events/1629489244034490/", "name": "Rolling Sculpture Car Show"}, {"date": "2016-07-08T19:00:00-04:00", "source": "Facebook", "description": "Literati is thrilled to launch the latest issue of the Michigan Review of Prisoner Creative Writing, produced by the Prison Creative Arts Project. You can learn more about PCAP and their work here.\n\n\"PCAP’s Michigan Review of Prisoner Creative Writing seeks to showcase the talent and diversity of Michigan's incarcerated writers.  The review features writing from both beginning and experienced writers - writing that comes from the heart, and that is unique, well-crafted, and lively.\"\n\nSelections from the issue will be read and copies will be available for sale.", "url": "https://www.facebook.com/events/1026985497386536/", "name": "Michigan Review of Prisoner Creative Writing"}]