[{"source": "Facebook", "url": "https://www.facebook.com/events/1744036255811922/", "description": "This is not a large park, but it has some of the largest trees in the city! Wonderful giants! Come visit them, and protect their seedlings from invasive garlic mustard and other species. We’ve made a lot of progress restoring the woodland here, and we want to keep the momentum. Family and friends are welcome to help pull. \nMeet us at the park entrance at the north end of Upland Drive, north of Plymouth Road", "name": "Park Stewardship Workday", "date": "2016-05-15T13:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1775647169313579/", "description": "Natsu Oyobe, UMMA's Curator of Asian Art and the exhibition curator, will lead a discussion of the themes and artistic influences present in Xu Weixin's portrait paintings. Trained in the Socialist Realism style that was developed in the Soviet Union and emphasized the depiction of Communist values, Xu Weixin experiments with and expands this approach to present a more nuanced view of China's modern history and social conditions today.\n\nLead support for the exhibition Xu Weixin: Monumental Portraits is provided by the University of Michigan Health System, University of Michigan Office of the President, and\nthe Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts. Additional generous support is provided by the University of Michigan Confucius Institute, Lieberthal-Rogel Center for Chinese Studies, Beijing Fu Zhan Zhou Culture Art Development Co. Ltd, Boylescott Limited, and University of Michigan Ross School of Business China Initiatives.", "name": "In Conversation: Realism in Portraiture", "date": "2016-05-15T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/715826915224940/", "description": "Our 7' peacock is taking shape - we just need some more flowers to really make him extra special.  Come and learn how to make beautiful paper flowers while helping AOT prepare for the inaugural James K. Berg Award gala on May 20th.  The paper flowers will be sold to raise funds and awareness of an upcoming tour of our “La Traviata” adaptation, which addresses the stigma surrounding mental illness and suicide.  They will also be used to create large topiaries that will be featured at the gala.  No experience is necessary, but it would be useful to bring a good pair of paper scissors and a glue gun (if you have one).  We will provide the papers, the instruction and other tools needed to create gorgeous, paper flowers.  \n\nLight refreshments will be provided - Park along the street, as this is the home of artistic director, Shawn McDonald", "name": "Paper Flower Making Party 4", "date": "2016-05-15T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/231668393872238/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games", "date": "2016-05-15T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/192972824428594/", "description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nBUY JUNE 11 TICKETS: http://bpt.me/2538000\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule", "name": "Ann Arbor Derby Dimes 2016 season", "date": "2016-05-15T17:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/263081930707505/", "description": "Ever hear a song and think, \"this is a shame to art...and also a shame to language.\" \"Never should have been recorded.\" \"Really? People listen to this? Really?!\" Well then you might have found yourself a winner. Welcome to the Song Slam where you bring lyrics to the best worst song of all time and perform them as though your reeeaaalllly mean it!  Hit me baby one more time. Ice Ice Baby. Call me maybe. I'm too sexy. Who let the dogs out? And more! Last year's winner Trevor Torres took home a gift card to Wazoo Records (upstairs, nextdoor to the slam). Bring lyrics to three songs from Youtube, radio, Disney movies, or your own itunes library, and bring your A-game. Original poetry open mic to start the night. Slam follows. (Sign up 6:30-7:00, first come first shout). Event at 7. See you there!", "name": "Annual Ann Arbor Song Lyric Slam!", "date": "2016-05-15T18:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/839092692886359/", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "name": "The Arcade - A Pointless Improv Jam", "date": "2016-05-15T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/158066451258466/", "description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: 10 Blinks Cherry Saison - a well balanced, smooth summer sipper. Abundant michigan cherry flavors, sweet and fruity on the nose, light and malty with strong stone fruit flavors. Finished with a slow burn like a fine wine. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "name": "American Craft Beer Week", "date": "2016-05-16T11:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/225369014509916/", "description": "AADL is honored to host an evening with Journalist Lesley Stahl.\n\nLeslie will discuss her new book \"Becoming Grandma: The Joys and Science of the New Grandparenting.\"  The event is cosponsored by Michigan Radio.\n\nThere is no fee to attend this special event ,which will include a book signing.  Books will be for sale, courtesy of Nicola’s Books. \n\nLesley Stahl is one of America’s most recognized and experienced broadcast journalists. The 2015-16 season marks her 25th as a correspondent for 60 Minutes.  Her  most vivid and transformative experience of her life, however,  was not covering the White House, interviewing heads of state, or researching stories at 60 Minutes. It was becoming a grandmother. \n\nAnd so, using her 60 Minutes skills, she explored how grandmothering changes a woman’s life, interviewing friends like Whoopi Goldberg, colleagues like Diane Sawyer (and grandfathers, including Tom Brokaw), as well as the proverbial woman next door. \n\nDo not miss this evening with Lesley Stahl as she discusses her career and her new book \"Becoming Grandma: The Joys and Science of the New Grandparenting.\"", "name": "An Evening With Lesley Stahl", "date": "2016-05-16T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1094016970640442/", "description": "Literati welcomes Toni Nealie, author of the essay collection The Miles Between Me,  and Zoe Zolbrod, author of The Telling: A Memoir, for a special night of literary nonfiction from Curbside Splendor Publishing.\n\nToni Nealie is a writer, journalist, and teacher living in Chicago. Her work has appeared in Guernica, The Prague Review, The Offing, The Rumpus, and been nominated for a Pushcart Prize. She worked in magazines, politics, and public relations in the U.K and her native New Zealand before moving to the U.S. She holds an MFA from Columbia College Chicago. In her debut essay collection, New Zealand native Toni Nealie examines journeys, homelands, family, and motherhood. She details humiliating confrontations with airport security, muses on the color brown, and intimately investigates her grandfather’s complicated and criminal past, all while hearkening home—wherever and whatever that is.\n\nZoe Zolbrod's work has appeared in Salon, The Nervous Breakdown, The Weeklings, and The Rumpus, where she serves as Sunday co-editor. Her debut novel Currency won a 2010 Nobbie Award and received an honorable mention by Friends of American Writers. Zolbrod lives in Evanston, Illinois, with her husband and children. About The Telling: Zoe Zolbrod remained silent about her early childhood molestation for nearly a decade. When she finally decided to tell, she wasn't sure what to expect, or what to say. Through a kaleidoscopic series of experiences as an adult, mother, and feminist, Zolbrod traces the development of her sexuality and her relationships with men in the shadow of her sexual abuse.", "name": "Toni Nealie & Zoe Zolbrod", "date": "2016-05-16T19:00:00-04:00"}]