[{"date": "2016-06-23T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1771333209777255/", "description": "This week is National Pollinator Week which is celebrated all across the country to raise awareness for pollinators and their importance to the ecosystem. NAP is participating in National Pollinator Week by hosting a workday in the Native Garden at Furstenberg Nature Area. Join us on Saturday, June 25th from 9:00am-Noon at Furstenberg Nature Area to help the local pollinators by removing invasive plants from within the Native Garden. For more information on the workday with NAP please visit www.a2gov.org/napevents and for more information on National Pollinator Week visit www.pollinator.org/pollinatorweek .", "name": "National Pollinator Week"}, {"date": "2016-06-23T11:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1717896315157605/", "description": "JR JR w/s/g Joe Hawley of Tally Hall\nWith an ear for Brian Wilson-esque harmony, JR JR swirl indie pop, folk, and electronic elements into one breezy package. Originally named Dale Earnhardt Jr. Jr. with typical irreverence, the duo of Joshua Epstein (also of the Silent Years) and Daniel Zott came together in Detroit in 2009. Working out of a basement studio, the pair worked to create a sound that was danceable without sacrificing anything in the songwriting department, merging intricate and airy melodies with solid programmed beats and synth atmospherics.\nTheir hard work bore fruit in 2010 when they released their debut EP, Horse Power, on Quite Scientific, quickly followed by the EP My Love Is Easy: Remixes Pt. 1. That same year, the pair was also tapped to do a remix of Moby's \"Wait for Me.\" The resulting buzz from their early releases led to a record deal with Warner Bros., who released their Record Store Day-exclusive EP titled We Almost Lost Detroit in spring 2011. The duo's full-length debut, It's a Corporate World, followed that summer. In 2013, they returned with an EP, Patterns, before releasing their sophomore full-length, The Speed of Things, later that year. \nIn 2015, even though they had the blessing of Dale Earnhardt, Jr. himself, to avoid ongoing confusion by fans and seekers of the race car driver, Epstein and Zott decided to change the band's name to simply JR JR. Their first LP under the shortened handle and their third with Warner Bros., the endearing JR JR was released that September\nwww.jrjrmusic.com \n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "JR JR w/s/g Joe Hawley of Tally Hall / June 23rd / Bank of Ann Arbor's Sonic Lunch / 11:30AM FREE"}, {"date": "2016-06-23T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1880068362221268/", "description": "Join us every Thursday in June to help support our community partner, Growing Hope! From 6-9 pm, $1 of each beer sold will be donated towards Growing Hope's efforts to educate, inspire, and empower the community through gardening and access to healthy food.", "name": "Hops for Hope"}, {"date": "2016-06-23T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/108996502858146/", "description": "The results are in, and the readers have spoken! Join us to celebrate the eclectic mix of businesses, individuals, arts and entertainment that make Washtenaw County an awesome place to live.\n\nParty with Washtenaw County's finest on Thursday, June 23rd at Club Above (215 N. Main St. Above The Heidelberg). \n\nAgent 99 will be spinning 45's from the Motown era:\nhttps://www.mixcloud.com/alexis-ford/\n\nFood and swag will be provided along with a cash bar. \n\nThe event is FREE and open to the public! \n\nSee all of the 2016 Best of Washtenaw results online at: www.ecurrent.com/Best-of-Washtenaw-2016/", "name": "2016 Best of Washtenaw Party"}, {"date": "2016-06-23T21:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/487051708161044/", "description": "Hey Friends!\n\nSo Cameron Wasacz & I decided since our birthdays are so close that we throw one big banger for them!!\n\nHOPE ALL OF YOU CAN MAKE IT!\n\n\nMORE DETAILS TBA\n\n\n\n___________________________________________________\n\n9:30-10:10: Live Hiphop Performances by: \nLucyV, Sickwit, OSHEA\n\n10:10-10:55: Quack Attak\n10:55- 11:35: Ondemand\n11:35-12:15: DïRTYBLÜR\n12:15-1 Cass Wasacz\n1-2 Hans Play b2b DJ CHöFF\n\n___________________________________________________\n\n\n\n\nLighting supplied by: ProLux Entertainment", "name": "Patrick and Cams 22nd Birthday Bash"}, {"date": "2016-06-23T23:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/262997064049616/", "description": "Create your own art project inspired by the sensitivity and beauty of Japanese design. Local artist and long-time UMMA docent Susan Clinthorne will lead families on an exploration of the Japanese gallery followed by a hands-on workshop. Designed for families with children ages 6 and up to experience art together.\n\nThursday, June 23, 11 a.m.–1 p.m. & 2–4 p.m.\nMultipurpose Room\n\nIn conjunction with U-M Center for Japanese Studies’ Ann Arbor Japan Week, June 20– 26", "name": "Family Art Studio: Japanese Design"}, {"date": "2016-06-24T07:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1355323777814283/", "description": "Yes, Virginia, it's real- all wine is 25% off on Friday the 24th!", "name": "25% Off All Wine- One Day Only"}, {"date": "2016-06-24T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1748987448719458/", "description": "Our Fingers on Fire: American Strings campers will be presenting their newfound skills in fiddling and improve in the historic barn at Rentschler Farms THIS Friday, June24th!  The Moxie Strings and Sarah Lenhart as their mentors during this week long camp will also be performing!", "name": "Fingers on Fire Jam Session with The Moxie Strings at Rentschler Farm"}, {"date": "2016-06-24T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1189411824410155/", "description": "Join us on FRIDAY, JUNE 24 (6 - 9PM) for 'A DIGITAL TAKE OVER OF THE ANN ARBOR ART CENTER'\n\nFree and open to the public.\n\nOur first POP•IN of the year highlights processes and products of electric and electronic arts, featuring:\n\nMUSIC PERFORMANCES:\n- The.Black.Opera. a multimedia rap performance group with creative roots from Nigeria, Uganda, Madagascar, France and the United States.  They have toured extensively in Europe and the USA.\n\n- Efflux a project intended as a structure for interdisciplinary improvisation.  It encompasses algorithms that react to sounds of percussion and electronic instruments.  This is a project of Simon Alexander-Adam (digital visual artist/musician) and Jon Taylor (percussionist.)\n\n- Live DJ music from Scout, LIVE Nightclub's Saturday night resident.\n\nAN INTERACTIVE PLAY STATION:\nFeaturing tech tools from the Ann Arbor District Library such as the gesture-operated Theremini, glowing Bliptronic, synthesizers, beat machines, and effects pedals.\n\nDIGITAL ART MAKING STATIONS:\nFeaturing the tools of the Art Center's ARTLab, which combines traditional art and digital technologies. Pop-up workstations will allow visitors to try animation, claymation, and digital drawing.\n\nIMMERSIVE THEATER PERFORMANCE:\n-Featuring Kickshaw Theatre's production, Technology, In the Flesh.\nDevised by Angela Dawe, Aral Gribble, and Lynn Lammers, \nlaugh out loud in this playful 15-minute immersive performance. Tickets will be $8 at the event for the performance, that follows the journey of a scientist experimenting with digital and analog stimuli of human humor.\n----------\nPOP•IN- Injecting the Art Center with a spirit of pop-up culture and by collaborating with diverse artists, we aim to attract intrepid young adults looking to explore and be excited by a city. \n\nCommunity members who attend POP•IN will be immersed in unusual, accessible experiences, whether they planned to attend the event or wandered in off the street.\n\nWhile POP•IN is free, we will allow visitors to buy tickets to reserve seating for performances, and make things they can take home.\n\nPOP·OFF: POP·IN's official after party.\n\nALL ATTENDEES receive coupons for discounts and freebies at several participating bars/restaurants within a block of the Art Center.\n\nOfficial page: http://www.annarborartcenter.org/events/popin/\n-------------------\nSponsored by \nMichigan Council for Arts and Cultural Affairs & PNC\n\n#POPIN", "name": "Pop•In"}, {"date": "2016-06-24T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1751217745099856/", "description": "Come join friends & neighbors alike for a fun, slow, community bike ride through Ann Arbor.\n\nThe fun starts at the Ann Arbor Farmers Market and will continue at a leisurly pace around town, where we will \"bike-in\" to Top of the Park (https://goo.gl/maps/zSwW1vsk9X32) for some post-ride music, dancing, food, drink, & fun.\n\nThat night on the Rackham Stage PanaMO and Orquesta RITMO are playing. There will also be salsa lessons. For more information about the festival go to http://a2sf.org/\n\nMeet up time is 7:00 PM (departing 7:15 PM). Plan on a nice & easy route, 10 miles or less, within city limits. Check back later this week for route & other details to come. Until then, ride safe, be friendly, and have fun!\n\n\nWhat's Bike-in?\nSee the community page:\nhttps://www.facebook.com/bikeinannarbor/info?tab=page_info\n\nOR read below\n\nBike-in is: Slow bike rides throughout Ann Arbor for everyone. Post-ride fun with friends, neighbors, and visitors around the community.\n\nEach ride we will begin at the listed location & time, ride casually, then finish the ride by \"biking-in\" to a post-ride time together at a local establishment, green space, or other friendly host setting (i.e. Bike-in :: Movie (outdoor), Creamery (ice cream), Picnic (potluck), Garden (beer garden), etc.).\n\nRides will be open and friendly to all. For gathering information, times, locations, riding routes, weather updates, etc. like/follow the page or visit for updates.\n\nPlease practice safe riding and abide by all legal riding rules at all times, especially while riding with a Bike-in community. Be sure to provide your own helmet, riding lights, and other appropriate accessories.", "name": "Bike-in :: Top of the Park"}]