[{"description": "Tom Sleigh was born in Mount Pleasant, Texas. He attended the California Institute of the Arts and Evergreen State College, and earned an MA from Johns Hopkins University. Sleigh is the author of several books of poetry; his most recent collections include Army Cats (Graywolf Press, 2011), winner of the John Updike Award from the American Academy of Arts and Letters, and Space Walk (Houghton Mifflin, 2007), winner of the Kingsley Tufts Award. His latest book, Station Zed, was published by Graywolf Press in 2015. He has also published a translation of Euripides’s Herakles and a book of essays, Interview With a Ghost (Graywolf Press, 2006). Sleigh has received the Shelley Prize from the Poetry Society of America, an Academy Award from the American Academy of Arts and Letters, an Individual Writer’s Award from the Lila Wallace/Reader’s Digest Fund, and fellowships from the American Academy in Berlin, the Guggenheim Foundation, and the National Endowment for the Arts, among many others. He is a Distinguished Professor in the MFA program at Hunter College and lives in Brooklyn.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon '13).", "date": "2017-02-02T17:30:00-05:00", "name": "Zell Visiting Writers Series: Tom Sleigh", "source": "Facebook", "url": "https://www.facebook.com/events/1576186542414108/"}, {"description": "Join us on Thursday, February 2nd for a beer dinner at Portland's Wagon Wheel, benefiting Sparrow Hospital! This German-themed beer dinner features four courses of plus a dessert course, all paired with Wolverine State brews. Ticket info and pricing forthcoming.", "date": "2017-02-02T18:00:00-05:00", "name": "Wagon Wheel Beer Dinner", "source": "Facebook", "url": "https://www.facebook.com/events/615446661974202/"}, {"description": "The Ann Arbor District Library will be showing the 54th AAFF Tour on Thursday, February 2nd! They will be hosting the event at their downtown location (343 South Fifth Avenue, Ann Arbor, MI 48104), and it is FREE and open to the public. The event will take place from 7:00 pm to 8:30 pm in the Multi-Purpose Room. We look forward to seeing you all there for this chance to enjoy some amazing films with your local community!", "date": "2017-02-02T19:00:00-05:00", "name": "54th AAFF Tour at the Ann Arbor District Library", "source": "Facebook", "url": "https://www.facebook.com/events/1825557424364548/"}, {"description": "This unique concert features an Austrian orchestra performing works by composers who wrote about the experience of Africans and African-Americans.\n\nThe program features Phillip Glass’s recent collaboration with the Beninese singer Angélique Kidjo, one of the great international artists performing today, based on three poems of Ifé, where the Yoruba people believe the world was created. \n\n“The power of Kidjo’s unflappable voice, the range of her emotional expression, the stellar, genre-bending musicians who back her, and the infectious, activist energy that course through her songs all transcend any native tongue.” (NPR Music)\n\nThe program also includes Alexander Zemlinsky’s Africa Sings, which was written in 1929 and features poetry by Langston Hughes and other prominent writers from the Harlem Renaissance.\n\nMore info: http://ums.org/performance/bruckner-orchester-linz/", "date": "2017-02-02T19:30:00-05:00", "name": "Bruckner Orchester Linz", "source": "Facebook", "url": "https://www.facebook.com/events/523093904564649/"}, {"description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "date": "2017-02-02T19:30:00-05:00", "name": "Sing Happy!", "source": "Facebook", "url": "https://www.facebook.com/events/254338798323472/"}, {"description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2017-02-02T20:00:00-05:00", "name": "Wine, Women, and Song XV", "source": "Facebook", "url": "https://www.facebook.com/events/195810100885174/"}, {"description": "Join us this Thursday February 2nd for Afro Latin Thursday\n\nComplementary Bachata lessons with Carlos Mora\n\nDJ Sabor will spin Bachata Salsa Zouk Merengue Reggaeton\n\n21 and over\n$5 cover", "date": "2017-02-02T21:00:00-05:00", "name": "Afro Latin First Thursdays", "source": "Facebook", "url": "https://www.facebook.com/events/401095670223628/"}, {"description": "Some like it cold!\n\nFebruary temperatures means it’s time for the annual University of Michigan Ice Carving Extravaganza in the Main Street area. Watch members of the U of M Ice Carving Team as they carve sculptures on the sidewalks of Main, Liberty, Washington, and Fourth with chainsaws, blowtorches and power tools. Come downtown and see the amazing work created by these talented students!\n\nSculpting Hours:\nFriday, February 3 from 3-7pm\nSaturday, February 4 from 10am-5pm\nSunday, February 5 from 10am-2pm\n\nSculptures will remain on display for as long as they last!", "date": "2017-02-03T15:00:00-05:00", "name": "Annual Ice Carving Extravaganza", "source": "Facebook", "url": "https://www.facebook.com/events/304390803296325/"}, {"description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "date": "2017-02-03T17:00:00-05:00", "name": "Sunseed Farm CSA Pickup", "source": "Facebook", "url": "https://www.facebook.com/events/731926473638010/"}, {"description": "Please join us for the opening reception of ART NOW: PRINTMAKING on Friday, February 3, from 6 to 9 pm. \n\nThe exhibition is free and open to the public daily from February 3 to March 4\n\nJuror: Tyanna J. Buie, Assistant Professor/ Section Chair of Printmaking at the College for Creative Studies.\n\nART NOW: PRINTMAKING is the third annual exhibition in the Ann Arbor Art Center’s Art Now Series.  Each year, on a rotating basis, the Ann Arbor Art Center presents a media-focused exhibition as part of the series. We are pleased to present this year's exhibit which features innovative work in printmaking.\n\n“We deal with printed images every day. Anything that is made in a reproducible format is a print.”  - A Complete Guide to Materials & Processes by Beth Grabowski & Bill Fick\n\nThe field of printmaking is an ever-evolving medium that is deeply engaged in the act of social practice. Printmakers are artists who employ the rich history of printmaking as a basis for the works they create, and are also known to share their methods, facilitate workshops, and create environments where collaboration is welcomed. Although printmaking is considered to be a niche field of study, it is universally known through its traditional and historical processes such as Lithography, Intaglio, Relief, and Screen-printing. Printmaking has paved the way for technology and many digital advances, changing the landscape of the art world, politics and education. Walter Benjamin’s 1936 essay “The Work of Art in the age of Mechanical Reproduction” suggests that a series or an edition is equal to an “original” work, which holds an historical perception of uniqueness and authenticity.\n\nWhile some artists are heavily based in traditional modalities of printmaking, other artists will test the limits of what defines a “print” and push beyond the conventional boundaries, thus allowing for hybrid processes to be employed and combined. The use of such advances include, digital photo-based imaging, sculpture, performance, video, installation, painting and drawing.\n\nThis exhibition will highlight artists that employ traditional printmaking processes, as well as artists who move across disciplines, using “print” as their foundation, with an emphasis on investigative and exploratory ways of working with the printed image.\n\n-----------\n\nThe 117 Gallery 2016/2017 season is supported by Vintage Financial Services LLC\n\nArt Now: Printmaking is sponsored by Underground Printing", "date": "2017-02-03T18:00:00-05:00", "name": "Art Now: Printmaking", "source": "Facebook", "url": "https://www.facebook.com/events/1857023781249128/"}]