[{"url": "https://www.facebook.com/events/312947649079847/", "source": "Facebook", "description": "Literati is delighted to welcome Matt Bell back to Ann Arbor in support of his most recent work, A Tree or a Person or a Wall.\n\nHere we have Matt Bell at his most inventive and uncanny: parents and children, murderers and monsters, wild renditions of the past, and stunning visions of the present, all of which build to a virtuoso reimagining of our world. A 19th-century minister builds an elaborate motor that will bring about the Second Coming. A man with rough hands locks a boy in a room with an albino ape. An apocalyptic army falls under a veil of forgetfulness. The story of Red Riding Hood is run through a potentially endless series of iterations. A father invents an elaborate, consuming game for his hospitalized son. Indexes, maps, a checkered shirt buried beneath a blanket of snow: they are scattered through these pages as clues to mysteries that may never be solved,  ingering evidence of the violence and unknowability of the world. A Tree or a Person or a Wall brings together Bell’s previously published shorter fiction—the story collection How They Were Found and the acclaimed novella Cataclysm Baby—along with seven dark and disturbing new stories, to create a collection of singular power.\n\n“These fables plumb the depths of human longing… a collection that resonates like a tuning fork, lingering after the book is closed.”—Publishers Weekly\n\n“A clutch of stories with a flavor of the experimental, the apocalyptic, and often both…Admirable efforts to strip familiarity and sentiment from stories of humanity at its worst.”—Kirkus Reviews\n\n“Told in a mythic, ­omniscient voice, some of these pieces read like cruel fairy tales… Imagine a tale from Lydia Davis on a bad trip… smart and edgy.”—Library Journal\n\nMatt Bell is the author of the novels Scrapper and In the House Upon the Dirt Between the Lake and the Woods, which was a finalist for the Young Lions Fiction Award, a Michigan Notable Book, and an Indies Choice Adult Debut Book of the Year Honor Recipient, as well as the winner of the Paula Anderson Book Award. His writing has appeared in Best American Mystery Stories, Tin House, The New York Times, Conjunctions, Gulf Coast, The American Reader, and many other publications. Born in Michigan, he now teaches creative writing at Arizona State University.\n\nEvent date: \nWednesday, November 2, 2016 - 7:00pm", "date": "2016-11-02T19:00:00-04:00", "name": "Matt Bell"}, {"url": "https://www.facebook.com/events/205606623195025/", "source": "Facebook", "description": "This meeting had been cancelled and will be rescheduled for a later date. \n\nSubject: Meeting #3 - Nixon Road Corridor Traffic Study & Dhu Varren/Nixon/Green Road Roundabout - November 2, 7-9 pm Clague Middle School. \n\nPLEASE JOIN US: Wednesday, November 2, 2016 from 7 to 9 p.m. in the Multi-Purpose Room at Clague Middle School, 2616 Nixon Road.  \n\nThe primary focus of the meeting is to:\n•\tPresent and discuss corridor traffic study options.\n•\tPresent the finalized design details for the roundabout project. \n•\tShare options for traffic maintenance during roundabout construction. \n\nThe meeting will Include: \n1.\tWelcome & introduction\n2.\tPresentation of corridor traffic study options with brief question and answer period*. \n3.\tPresentation of roundabout design with brief question and answer period*. \n4.\tDiscussion of options for traffic maintenance during roundabout construction*.\n5.\tNext Steps and public comments*.  \n\n* Questions/comments will be limited to three minutes per person. Numbered cards will be distributed during each question and answer period to facilitate equal opportunities for all participants. \n\nAdditional information regarding the two projects is available at www.a2gov.org/Nixon.\n\nAll persons are encouraged to participate in public meetings. Accommodations including sign language interpreters, may be arranged by contacting the city clerk’s office at 734.794.6140;\nvia email to cityclerk@a2gov.org; or by written request addressed and mailed or delivered to:\n\nCity Clerk’s Office\n301 E. Huron St.\nAnn Arbor, MI 48104\nRequests made with less than two business days’ notice may not be able to be accommodated.", "date": "2016-11-02T19:00:00-04:00", "name": "Cancelled - Nixon Road Traffic Study & Roundabout "}, {"url": "https://www.facebook.com/events/672314046278929/", "source": "Facebook", "description": "Music at far house! Get yer post punk post halloween scream on\n\nLet The Animals Kill Us (chi) https://lettheanimalskillus.bandcamp.com/\n\nApe Not Kill Ape (gr) https://apenotkillape1.bandcamp.com\n\nSoji (gr) \n\nAdam Shead (a2) Solo - drums and electronics\nhttps://soundcloud.com/adamsheadmusic\n\nAdam Shead is a Improvisor, Percussionist, and Composer whose life and work is deeply rooted in the intercommunication of tones in space. Adam received a BM in Percussion Performance from Columbia College Chicago and is currently pursuing an MM in Improvisation at The University of Michigan.  During Adam’s time in Chicago he developed a strong background in orchestral, chamber, theatrical, and interdisciplinary performance as well as founding such groups as Dod Kalm, Action Patterns, and Adam Shead's 'Stasis'; performing at such venues as The Jazz Showcase, Experimental Sound Studio, Andy's Jazz Club, The Whistler, and Cafe Mustache. Since moving to Ann Arbor, Michigan Adam has been focusing on the development of solo repertoire for Percussion & Electronics with the goal of creating music that not only resembles place but is inherently place.", "date": "2016-11-02T21:00:00-04:00", "name": "[••][••][••][••][••][••]"}, {"url": "https://www.facebook.com/events/1804342093174211/", "source": "Facebook", "description": "Free and open to the public. Seating is first come, first served.\nDonovan Hohn is the recipient of the Whiting Writers’ Award, A National Endowment for the Arts Creative Writing Fellowship, and a Knight-Wallace Fellowship. His work has appeared in Harper’s Magazine, The New York Times Magazine, and Outside, among other publications. His book, Moby-Duck, was a finalist for the Helen Bernstein Prize for Excellence in Journalism, and runner-up for both the PEN/E. O. Wilson Literary Science Writing Award and the PEN/John Kenneth Galbraith Award for Nonfiction. A former features editor of GQ and contributing editor of Harper’s, Hohn now teaches creative writing at Wayne State University and lives with his family in Ann Arbor, where he is working on his second book.\n \nRachel Richardson is the author of two books of poetry, Copperhead (2011) and Hundred-Year Wave (2016), both selections in the Carnegie Mellon Poetry Series. She has received fellowships from the National Endowment for the Arts, the Sewanee Writers’ Conference, and the Wallace Stegner Program at Stanford University. Her poetry and prose have appeared in The New York Times, Guernica, New England Review, Kenyon Review Online, the Poetry Foundation website, The Rumpus, and elsewhere. Richardson is a contributing editor at Memorious and directs poetry programming for the Bay Area Book Festival. She lives with the writer David Roderick and their two children in Berkeley, California.", "date": "2016-11-03T17:30:00-04:00", "name": "Zell Visiting Writers Series: Donovan Hohn and Rachel Richardson"}, {"url": "https://www.facebook.com/events/1672019293126958/", "source": "Facebook", "description": "Donovan Hohn is the recipient of the Whiting Writers’ Award, A National Endowment for the Arts Creative Writing Fellowship, and a Knight-Wallace Fellowship. His work has appeared in Harper’s Magazine, The New York Times Magazine, and Outside, among other publications. His book, Moby-Duck, was a finalist for the Helen Bernstein Prize for Excellence in Journalism, and runner-up for both the PEN/E. O. Wilson Literary Science Writing Award and the PEN/John Kenneth Galbraith Award for Nonfiction.\n\n A former features editor of GQ and contributing editor of Harper’s, Hohn now teaches creative writing at Wayne State University and lives with his family in Ann Arbor, where he is Rachel Richardson is the author of two books of poetry, Copperhead (2011) and Hundred- Year Wave (2016), both selections in the Carnegie Mellon Poetry Series. She has received fellowships from the National Endowment for the Arts, the Sewanee Writers’ Conference, and the Wallace Stegner Program at Stanford University. Her poetry and prose have appeared in The New York Times, Guernica, New England Review, Kenyon Review Online, the Poetry Foundation website, The Rumpus, and elsewhere. Richardson is a contributing editor at Memorious and directs poetry programming for the Bay Area Book Festival. She lives with the writer David Roderick and their two children in Berkeley, California.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64).", "date": "2016-11-03T18:15:00-04:00", "name": "Zell Visiting Writer Series"}, {"url": "https://www.facebook.com/events/1292501757449172/", "source": "Facebook", "description": "Literati is pleased to welcome Julia Sonnevend in support of her book Stories without Borders: The Berlin Wall and the Making of a Global Iconic Event. Julia will be joined in conversation by Professor William Uricchio. This event is cosponsored by the Global Media Studies Initiative in the Department of Communication Studies and the Sheldon Cohn Fund in the Department of Screen Arts & Cultures at the University of Michigan.\n\nWhat comes to be known and seen as a global iconic event? Focusing on news coverage of the fall of the Berlin Wall and on contemporary retellings of the event, Julia Sonnevend discusses how storytellers build up certain events so that people remember them for a long time. The East German border opening that we know as the \"fall of the Berlin Wall\" was in fact unintentional, confusing, and prompted in part by misleading media coverage of bureaucratic missteps. But its global message is not about luck or accident or happenstance in history. Incarnated as a global iconic event, the fall of the Berlin Wall has come to communicate the momentary power that ordinary people can have. The event's story, branded as a simple phrase, a short narrative and a recognizable visual scene, provides people from China to Israel to the United States with a powerful social myth. This myth shapes our debates about separation walls and fences, borders, and refugees, and the possibilities of human freedom to this day.\n\nJulia Sonnevend is Assistant Professor of Communication Studies at the University of Michigan. She was a Lady Davis Fellow at the Truman Research Institute for the Advancement of Peace in Israel in 2014 and a Leibniz Fellow at the Center for Contemporary History in Germany in 2015. She is co-editor of Education and Social Media: Toward a Digital Future (forthcoming with MIT Press in 2016). She is author and co-author of articles published in journals including Journalism Studies, Columbia Journalism Review and The New Everyday. Her work also appears in edited collections including Digital Keywords: A Vocabulary of Information Society and Culture (Ed. Benjamin Peters, Princeton University Press, forthcoming in 2016), Iconic Power: Materiality and Meaning in Social Life (Eds. Jeffrey C. Alexander et al, Palgrave Macmillan, 2012) and Theorizing Visual Studies: Writing Through the Discipline (Eds. James Elkins et al, Routledge, 2012). She received her Ph.D. in Communications from Columbia University, her Master of Laws degree from Yale Law School and her Juris Doctorate and Master of Arts degrees in German Studies and Aesthetics from Eötvös Loránd University in Budapest.\n\nWilliam Uricchio revisits the histories of old media when they were new; explores interactive and participatory documentary; writes about the past and future of television; thinks a lot about algorithms and archives; and researches cultural identities and the question of \"Americanization\" in the 20th and 21st centuries. He is Professor of Comparative Media Studies at MIT, Principal Investigator of the MIT Open Documentary Lab, and faculty director of the MISTI-Netherlands Program. He is also Professor of Comparative Media History at Utrecht University in the Netherlands and has held visiting professorships at the Freie Universität Berlin, Stockholm University, the Georg-August-Universität Göttingen (Lichtenberg-Kolleg), China University of Science and Technology, and in Denmark where he was DREAM professor. He has been awarded Guggenheim, Humboldt and Fulbright fellowships and the Berlin Prize; and is currently Holtzbrinck Fellow at the American Academy in Berlin. His publications include Reframing Culture (Princeton); We Europeans? Media, Representations, Identities (Chicago/Intellect); Media Cultures (Heidelberg); hundreds of essays and book chapters … and, timed to coincide with the Batman-Superman big screen face-off, a forthcoming collection entitled Many More Lives of the Batman (BFI/Palgrave). He is currently completing a book on new forms of documentary; and another on games and playing with history and historiography after post-structuralism.\n\n \nEvent date: \nThursday, November 3, 2016 - 7:00pm", "date": "2016-11-03T19:00:00-04:00", "name": "Julia Sonnevend with William Uricchio"}, {"url": "https://www.facebook.com/events/284880815244660/", "source": "Facebook", "description": "Flavors of Life (ISBN: 978-90-825238-0-5) is a collection of inspirational biographies, sharing the stories of 62 entrepreneurs from around the world. Ranging from a famous Swiss drummer to an American ballet dancer, they are connected by a common thread: all own a restaurant in Amsterdam. Discover how these diverse individuals landed in the same city, in the same industry, with a shared passion - a love for food. While the restaurateurs live in Amsterdam, the stories have universal themes. The book examines culture, lifestyle, entrepreneurship, food, and family values. Regardless or whether someone has visited Amsterdam or not, readers can find a piece of themselves in this book. If you’d like, you can read more on my website: https://jessicalipowski.com/\n\nJessica Lipowski is the author of Flavors of Life (2016). Jessica, originally from Troy, Michigan and a graduate of Michigan State University, moved to the Netherlands in February 2011. With previous journalistic work published on 10Best.com (part of USAToday) and in The Washington Times, she is now an author. She is also a permanent host of two travel-related Twitter chats, #TRLT (The Road Less Travelled) and #CultureTrav.The book, in combination with Jessica’s past work experience, travels, and life as an expat, has enabled her to view food, travel, and culture through a different lens.", "date": "2016-11-03T19:00:00-04:00", "name": "Meet Jessica Lipowski - Discussion & Signing 'Flavors of Life'"}, {"url": "https://www.facebook.com/events/1790249907853404/", "source": "Facebook", "description": "The Florence Flood happened 50 years ago on November 3 and 4, 1966. Although communication to the outside world was limited, Florentine film director Franco Zeffirelli, who was editing his Taming of the Shrew in Rome, heard about it and rushed to his beloved city to film the days immediately after the flood. His documentary is titled Per Firenze (For Florence), and the English version is Florence: Days of Destruction; both are narrated by Richard Burton. The English version will be shown at this event. A year after the flood, Roger Hill, instructor of film-making at the Royal College of Art, London, documented the conservation and restoration efforts at the National Library, Florence, where over a million books were damaged during the flood. Shown in this film are scenes of the conservation of mud-covered, battered books as well as demonstrations of a limp- vellum and a full-leather binding, the techniques and materials used to recover thousands of books missing their bindings. Hill's film is titled: The Restoration of Books, Florence, 1968.\n\nThis program is part of the national symposium, “The Flood in Florence, 1966: A Fifty-Year Retrospective” that explores the transformative effects of this disaster on the preservation field. The symposium is organized by the University of Michigan Library and the School of Information. For more information, please visit http://www.lib.umich.edu/flood-florence- 1966-fifty-year-retrospective.\n\nThanks to the University of Maryland–College Park for permission to show the Zeffirelli film, and to the University of Utah and Roger Hill for permission to show his film.", "date": "2016-11-03T19:30:00-04:00", "name": "The Florence Flood on Film: Days of Deconstruction and Restorati"}, {"url": "https://www.facebook.com/events/1819752938314291/", "source": "Facebook", "description": "Yes, it's true- Friday only, wine is 25% off! Here are some reasons you might want to stock up:\n\nThanksgiving is coming!\nWinter is coming!\nThe election is almost over!\nBecause wine!\n(Insert your own reason here)", "date": "2016-11-04T08:00:00-04:00", "name": "One Day Sale- 25% Off Wine"}, {"url": "https://www.facebook.com/events/261603764205728/", "source": "Facebook", "description": "Fri. November 4 | 8pm | $25 Cover | 18+\n\nThe Randy & Mr Lahey LIVE show is a silly, sexist, drunken hour and a half of songs and skits, audience participation, profanity, Shakespeare, and general hilarity. Over the past eight years it has developed into the fastest moving two man show in the known universe.\n\nFrom Newfoundland to Vancouver Island several hundred thousand people have thrilled to Randy and Lahey's shennanigins. It's a constantly moving showcase of two television icons who pull no punches when battering the audience with \"Batman and Robin\" or \"The Shit Rap.\" The innocent honesty of an out- of-control drunken ex-cop Trailer Park Supervisor and his side-kick Randybobandy the cheeseburger eating ex male prostitute, weekend Trailer Park Supervisor is pants pissing humour at its warmest.\n\nThe show itself is roughly based on the T.V. series and movies, but being live, necessitates a different format and different is the operative word here. There is nothing like it anywhere. Shit talk and poetry; sodomy and sweet talk all thrown together with music and mayhem. What more could a room full of fun seekers want.", "date": "2016-11-04T09:00:00-04:00", "name": "Randy & Mr. Lahey 11/4/16 at Blind Pig - Ann Arbor"}]