[{"source": "Facebook", "url": "https://www.facebook.com/events/1676692335988216/", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "name": "Maker Space Operations Bootcamp", "date": "2016-10-03T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/832373760197638/", "description": "Literati is pleased to welcome Katie Chase, reading from her story collection, Man and Wife.\n\nFiction. From Twilight Zone suburbia to cities on fire to post-Soviet Kyrgyzstan, these award-winning stories range over unexpected landscapes—and land squarely in the wildness of the human heart.\n\n\"Katie Chase's stories have a rhythm, a form, and a mesmerism all their own.\"—Kevin Brockmeier\n\n\"Toggling between the comic and the horrific, these brilliant stories rearrange the familiar into something more nuanced, fraught, and mysterious.\" —Edan Lepucki\n\n\"With sharp, confident consideration of what it takes to survive in the world as a woman, Man and Wife introduces an important new literary voice.\" —Danielle Evans\n\n\"Katie Chase's narrators sound like the girl-next-door…if you lived next door to a parallel universe.\"—Peter Ho Davies\n\n\"Captivating, haunting, and eerily smart. Every story in this collection gave me chills. Katie Chase is one of a kind.\" —Jennifer DuBois\n\n\"An imagination worth watching.\"—The New York Times\n\nKatie Chase's short fiction has appeared in the Missouri Review, Five Chapters, the Literary Review, Narrative, Prairie Schooner, ZYZZYVA, Mississippi Review, and the Best American Short Stories and Pushcart Prize anthologies. A graduate of the Iowa Writers' Workshop, she is the recipient of a Teaching-Writing Fellowship, a Provost's Postgraduate Writing Fellowship, and a Michener- Copernicus Award. She has also been a fellow of the MacDowell Colony and the Center for Steinbeck Studies at San José State University. Born and raised outside Detroit, Michigan, she lives currently in Portland, Oregon.", "name": "Fiction at Literati: Katie Chase", "date": "2016-10-03T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1676692335988216/", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "name": "Maker Space Operations Bootcamp", "date": "2016-10-04T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/368534780202162/", "description": "Free and open to the public. Seating is first come, first serve.\nChina Miéville lives and works in London. He is a three-time winner of the prestigious Arthur C. Clarke Award (Perdido Street Station, Iron Council, and The City & the City) and has also won the British Fantasy Award twice (Perdido Street Station and The Scar). The City & The City, an existential thriller, was published in 2009 to dazzling critical acclaim and drew comparison with the works of Kafka and Orwell (The Times) and Phillip K. Dick (The Guardian). The City & The City recently won the British Science Fiction Award, the Arthur C. Clarke Award, and tied with Paolo Bacigalupi's The Windup Girl for the 2010 Hugo Award. It was also shortlisted for the Nebula Award.\nReception at 5:30 p.m. Book signing to follow the reading.", "name": "Zell Visiting Writer Series: China Miéville, International Disti", "date": "2016-10-04T18:15:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/176158106121056/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nRyan Racine\nhttp://ryan-racine.squarespace.com/\nIt's been a twenty-plus year journey for Ryan Racine to get to where his music finds itself. Recording for the first time as a solo artist and writing without what he refers to as \"the shackles of genre\", the direction is really a culmination of the variety in his past projects. The sound is still very much grounded in American Roots music but is unbound by the narrow concepts he has applied to previous outings. \n\nRyan Racine first made a name for himself as the front man of Ann Arbor’s rockabilly outfit Lucky Haskins. Formed when he was only 15, the band burst onto the metro Detroit rockabilly scene and quickly garnered attention and a loyal fan base. Besides introducing the genre to a whole new generation in the area, they earned spots opening for legends like Carl Perkins, Johnny Cash, and Lee Rocker as well as a slot in the 1995 Detroit Music Awards.\n\nNever a cover\nAlways a good time", "name": "Acoustic Tuesdays: Ryan Racine", "date": "2016-10-04T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1332110540133224/", "description": "Literati is pleased to welcome Josh MacIvor-Andersen in support of his memoir, On Heights & Hunger.\n\nOn Heights & Hunger is a memoir of two professional and competitive tree-climbing brothers, both hungry for transcendence and adventure, coming to terms with their relationship to the divine, the family that first provided a framework for faith, and their own obsessions, victories, and failures. \n\n\"Written with a passion that burns into the page, Josh MacIvor-Andersen straps the pieces of his own story to his back and takes us up into the canopy above, into a 'tree hunger' where he shaves and prunes and cuts until he arrives at the many shimmering truths of this beautifully told profession of love: for his brother, for physical labor, for the earth we have abused, for the search for God, for beauty, for the right woman, for the way to live this one life we are all given. This is one of the finest memoirs I’ve read in quite a while.\"— Andre Dubus III\n\nJosh MacIvor-Andersen is a former Tennessee-state tree climbing champion, the author of the memoir On Heights & Hunger, and the editor of Rooted, An Anthology of Arboreal Nonfiction. His essays, reviews, and reportage have won numerous awards and nominations for the Pushcart Prize, and can be found in journals and magazines such as Gulf Coast, Paris Review Daily, Fourth Genre, Arts and Letters, Sycamore Review, Sojourners, Geez, Ruminate, Rock and Sling, National Geographic/Glimpse, Diagram, The Drum, The Collagist, Garden and Gun, Memoir (and), New Millennium Writings, Our State, Prism, and The Northwest Review, among others.", "name": "Josh MacIvor-Andersen", "date": "2016-10-04T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/143806542708744/", "description": "This is it! Our last food truck rally of the year! Help us end the season right and make this an event to remember! Delicious food, great music, wonderful community...we can't ask for a better way to greet the Fall. We'll see you there!", "name": "Wednesday Food Truck Rally", "date": "2016-10-05T17:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1825878380977818/", "description": "Watch, learn and experience extraordinary business stories of triumph, wonderment and joy. This light competition will feature Metro Detroit's top nine business retail, tech and social enterprise innovators.\n\nWednesday, October 5th\n6:00 - 9:00pm \nTechTown Detroit\n440 Burroughs St, Detroit, Michigan 48202\n\nSchedule\n6:00 - 7:00pm - Registration. Strolling Dinner. Connecting/Networking\n7:15 - 8:15pm - The business storytelling competition begins\n8:15 - 8:30pm - Winners are announced\n8:40 - onward - Celebration, S'mores and more . . .\n\nBenefits of Attending\n1. You'll capture tips for how to discover what makes your brand unique\n2. You'll receive multiple boosts of inspiration for ways to build the story about your brand\n3. You'll learn tips for how to be use storytelling to be smart marketer\n4. You'll play with ways to use storytelling to boost sales confidence\n5. You'll meet others who are like-minded, passionate and ready show up in authentic ways to share their stories\n\nHow to Register\nOnline: http://www.entreslam.com/showcase\nEventbrite: https://www.eventbrite.com/e/a-night-of-business-storytelling-dinner-tickets-27350028672\nBy phone: Iphone or Android\n\nProgram Highlight/Past Winner/Current Candidates\nWhat is Entre-SLAM? https://youtu.be/8x7tFMn3Z58\nVideo of one of the Past Winners (with judge's comments): https://youtu.be/OYPPLoaV1D0\n\nJudging Panel:\nNailah Ellis Brown - Ellis Island Tea\nMr. Lee Thomas - FoxTV 2\nStefan Sysko - Sysko Thinking\n\nCancellation Policy:\nRegistrants who cannot attend an event are encouraged to exercise the option of providing a substitute participant to attend in his/her place. A written notification of a substitution will be accepted by email up to the morning of the event. \n\nIf Entre-SLAM or its event partner cancels an event, all registrants will receive a full refund of fees paid (no administration charge) no later than two business days following the scheduled date of the event.\n\nAll refunds will only be made using the original form of payment. For example, if you registered using a Visa card, any refund will be credited back to that same Visa card.\n\nEntre-SLAM would not be possible without the support of our sponsors:\n\nTechTown Dinsmore Goldman Sachs Waterhill Creative", "name": "How to Use Storytelling to Boost Your Brand", "date": "2016-10-05T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1810203432597328/", "description": "We still have tickets available at Zingerman's Roadhouse for the My Beliefs about Cooking with Ari Weinzweig special dinner, #201! Join Ari as he talks about his beliefs on cooking from his new book, \"Zingerman's Guide to Good leading, Part 4: A Lapsed Anarchist's Approach to the Power of Beliefs in Business\". Chef Alex Young has prepared an approachable, uncomplicated menu that will highlight the quality of local, artisan ingredients, including beautiful autumn vegetables from Cornman Farms and his full-flavored pasture-raised beef. One of the beliefs about food that Ari will talk about at the dinner is that every single thing should be delicious on its own, but then develop even more character in combination. \"We define full flavor as complexity, balance and finish, and that's what each ingredient on the menu should bring.\" Don't miss out on this amazing opportunity to learn more about how beliefs can impact your own approach to food and cooking, and to taste the difference with our really good menu.", "name": "My Beliefs About Cooking Special Dinner #201, with Ari Weinzweig", "date": "2016-10-05T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1685511088438901/", "description": "Literati is thrilled to welcome Derek Palacio in support of his novel, The Mortifications.\n\nDerek Palacio’s stunning, mythic novel marks the arrival of a fresh voice and a new chapter in the history of 21st century Cuban-American literature.\n\nIn 1980, a rural Cuban family is torn apart during the Mariel Boatlift. Uxbal Encarnación—father, husband, political insurgent—refuses to leave behind the revolutionary ideals and lush tomato farms of his sun-soaked homeland. His wife Soledad takes young Isabel and Ulises hostage and flees with them to America, leaving behind Uxbal for the promise of a better life. But instead of settling with fellow Cuban immigrants in Miami’s familiar heat, Soledad pushes further north into the stark, wintry landscape of Hartford, Connecticut. There, in the long shadow of their estranged patriarch, now just a distant memory, the exiled mother and her children begin a process of growth and transformation.\n\nEach struggles and flourishes in their own way: Isabel, spiritually hungry and desperate for higher purpose, finds herself tethered to death and the dying in uncanny ways. Ulises is bookish and awkwardly tall, like his father, whose memory haunts and shapes the boy’s thoughts and desires. Presiding over them both is Soledad. Once consumed by her love for her husband, she begins a tempestuous new relationship with a Dutch tobacco farmer. But just as the Encarnacións begin to cultivate their strange new way of life, Cuba calls them back. Uxbal is alive, and waiting.\n\nBreathtaking, soulful, and profound, The Mortifications is an intoxicating family saga and a timely, urgent expression of longing for one’s true homeland.\n\n“A revelatory tale of Cuba and America, of faith and family, of the spirit and the flesh, The Mortifications is a debut remarkable for its wise and scrupulous insight into the human heart. Palacio feelingly reminds us that all immigrants are also exiles, wounded with loss, striving to make a home even as they yearn for the one they’ve left behind.” —Peter Ho Davies\n\n“A novel of stunning sweep and vision. The story of the Encarnación family plunges the reader into the dislocating heartache of life in exile, in the intermediary land between the home that has been forsaken and the one that might, in the future, await. Derek Palacio’s prose is so assured it’s hard to believe The Mortifications is his first novel—but it is, miraculously, and it is one magnificent debut.” —Laura van den Berg\n\nDerek Palacio received his MFA in Creative Writing from the Ohio State University. His short story “Sugarcane” appeared in The O. Henry Prize Stories 2013, and his novella How to Shake the Other Man was published by Nouvella Books. He lives and teaches in Ann Arbor, MI, is the co-director, with Claire Vaye Watkins, of the Mojave School, and serves as a faculty member of the Institute of American Indian Arts MFA program.\n\nEvent date: \nWednesday, October 5, 2016 - 7:00pm", "name": "Derek Palacio", "date": "2016-10-05T19:00:00-04:00"}]