[{"name": "Fresh + Fit!", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "url": "https://www.facebook.com/events/1573275812982685/", "date": "2016-04-25T12:00:00-04:00", "source": "Facebook"}, {"name": "Nick Tobier", "description": "Literati is pleased to welcome Nick Tobier in support of his book, written with Juliane Stiegele, Utopia Toolbox: An Incitement to Radical Creativity. Please note that this event will take place on our main floor.\n\nThe presentation will feature readings by featured contributors and Stamps faculty Irina Aristakhova and Stephanie Rowden, as well as special guests.\n\nThink of a hybrid between something like a how-to book and a theoretical framework that asks artists, designers, planners, architects and cultural producers to consider their actions in context. Utopia Toolbox contains an anthology of texts, quotations, interviews, documentation of art and design projects, and do-it-yourself actions and performances.\n\nThe contributions in practice and in text are from a broad array of disciplinary rubrics, including philosophy, art, science, technology, economics, and spirituality. They also provide perspectives from across the stages of life--from an 8 year-old child to octogenarian physicist Hans-Peter Duerr. In content and in proximity to one another, the wide-ranging contributions offer unexpected and fresh impulses, directions, estimations, suggestions and approaches to serve as a catalyst for creativity. The book encourages new and unknown combinations of thinking and also contains a number of empty pages for readers to sketch their own ideas and thinking processes.\n\nNick Tobier is an Associate Professor at the Stamps School of Art and Design and the Center for Entrepreneurship in the College of Engineering at the University of Michigan. His focus as an artist and designer is with the social lives of public places, both in built structures and events.", "url": "https://www.facebook.com/events/1579585742369724/", "date": "2016-04-25T19:00:00-04:00", "source": "Facebook"}, {"name": "Spring Beer Dinner", "description": "We're celebrating spring with two great things: food and beer! Join us on Tuesday, April 26th for four spring-themed courses plus a dessert course, each paired with a Wolverine State brew. Brewmaster Oliver Roberts and Chef Mark Grasso will be on hand to present and discuss the pairings. Ticket cost is $45 per person, and seating is limited, so don't delay! Tickets are available using the Eventbrite link above or in the Tap Room. The event is for ticket holders only and will take place in the Gulo Room. Seating and welcome beer at 6:30, and we roll from there. Call 734-369-2990 with questions, or email mackenzie@wolverinebeer.com.", "url": "https://www.facebook.com/events/103567850045837/", "date": "2016-04-26T18:30:00-04:00", "source": "Facebook"}, {"name": "Acoustic Tuesdays: Heather Schwartz", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1535746816722754/", "date": "2016-04-26T19:00:00-04:00", "source": "Facebook"}, {"name": "Club Above Presents: Hour 24 CD Release Tour/Stankface/Arson Party/Kid Grizzly", "description": "$5 cover, merch available, come have some fun. \n\nSing along: \n\nHour 24 (Toledo)\nWebsite: http://www.hour24band.com\nPre-Order the EP: https://itunes.apple.com/album/emergence-ep/id1091673720\n\nStankface (Ann Arbor) \nhttps://www.facebook.com/stankfacemusic/?fref=nf\n\nArson Party (Ann Arbor)\nhttps://itunes.apple.com/us/album/fall-of-the-rising-ii/id881628750?uo=4\n\nKid Grizzly (Detroit/Toledo)\nhttps://kidgriz.bandcamp.com/releases", "url": "https://www.facebook.com/events/1730384527194484/", "date": "2016-04-26T19:30:00-04:00", "source": "Facebook"}, {"name": "How to Photograph Your Artwork", "description": "Our April Artists' Meet & Greet topic is How to Photograph Your Artwork. Join us for this free event, connect with other artists and the Art Center staff.\n\nSpeaker: Nick Azzaro\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet events: http://www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/1668025760140932/", "date": "2016-04-27T18:00:00-04:00", "source": "Facebook"}, {"name": "Rev. Horton Heat & Company 4/27/16 @ Blind Pig - Ann Arbor", "description": "Wed. April 27 | 7:30pm | 18+ | $28 Cover\n\nReverend Horton Heat with: Unknown Hinson, Nashville Pussy & Lucky Tubb & the Modern Day Troubadours Live in Concert!\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/612", "url": "https://www.facebook.com/events/991272244292924/", "date": "2016-04-27T19:30:00-04:00", "source": "Facebook"}, {"name": "Northern Threat Entertainment Presents Wild and Out Wednesdays Ft. Nini D.", "description": "Nini D. And other mc's will be showing you what Michigan music is about.", "url": "https://www.facebook.com/events/1740012382900420/", "date": "2016-04-27T21:00:00-04:00", "source": "Facebook"}, {"name": "One Pause Poetry: Rickey Laurentiis, Gretchen Marquette, Airea D Matthews & Ladan Osman", "description": "Literati is pleased to partner with One Pause Poetry in showcasing the work of Rickey Laurentiis, Gretchen Marquette, Airea Matthews, and Ladan Osman.\n\nRickey Laurentiis is the author of Boy with Thorn, selected by Terrance Hayes for the2014 Cave Canem Poetry Prize and named one of the Top 16 Best Poetry Books by Buzzfeed. The recipient of a 2013 Creative Writing Fellowship from the National Endowment for the Arts and a 2012 Ruth Lilly Fellowship from the Poetry Foundation, his other honors include fellowships from the Atlantic Center for the Arts, the Bread Loaf Writers’ Conference, the Cave Canem Foundation, and the Civitella Ranieri Foundation in Italy.\n\nGretchen Marquette is the author of May Day, and has published poems in Harper’s, the Paris Review, and Tin House. She lives and teaches in Minneapolis, Minnesota.\n\nAirea D. Matthews is a 2015 Kresge Literary Arts Fellow and the executive editor of The Offing. She is currently the Assistant Director of the Helen Zell Writers’ Program at University of Michigan, Ann Arbor, where she earned her MFA. Her poems have appeared or are forthcoming in Best American Poetry 2015, American Poet,The Missouri Review, The Baffler, Callaloo, Indiana Review, WSQ and elsewhere. Her performance work has been featured at the Cannes Lions Festival, PBS’ RoadTrip Nation and NPR.\n\nLadan Osman is the author of The Kitchen-Dweller's Testimony. Her work has appeared in American Life in Poetry, Artful Dodge,Narrative Magazine, Prairie Schooner, RHINO, and Vinyl Poetry. Her chapbook, Ordinary Heaven, appears in Seven New Generation African Poets: A Chapbook boxed set. She lives in Chicago.", "url": "https://www.facebook.com/events/989287977824682/", "date": "2016-04-28T19:00:00-04:00", "source": "Facebook"}, {"name": "Frog & Toad Survey Halftime Kickoff", "description": "Learn to identify and record summer breeding frogs & toads by sight and sound in this second kick-off training. Surveys are fun, family-friendly, and require no previous experience. This event is optional for frog surveyers who attended the previous kickoff in March. Please register by April 26. For more information or to register, please call NAP at 734.794.6627, or send us an email at NAP@a2gov.org .", "url": "https://www.facebook.com/events/1806589649563182/", "date": "2016-04-28T19:00:00-04:00", "source": "Facebook"}]