[{"source": "Facebook", "url": "https://www.facebook.com/events/731926473638010/", "name": "Sunseed Farm CSA Pickup", "date": "2017-01-27T17:00:00-05:00", "description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1807445812843154/", "name": "Laith Al-Saadi / 1/27 FRI / Blind Pig / Ann Arbor / 2 Shows", "date": "2017-01-27T18:30:00-05:00", "description": "It's sad to hear the news that the Blind Pig is up for sale.  I am truly hoping this Ann Arbor iconic venue will remain a concert venue for many years to come.  I have made so many great memories at this venue as a musician and a fan.   I love playing theaters but there is something special about rocking a high energy club.  The thought of not being able to play here again with my busy schedule is alarming to say the least... so I am not going to let that happen.  I am happy to announce that I am going to rock the Blind Pig on January 27th and hopefully it won't be my last!   I am going to play two shows with doors at 6:30PM and at 10PM.  Tickets go on sale this Tuesday at 11AM.   \n\nEarly Show Doors 6:30PM (all ages w/ parent) \nLate Show Doors 10PM 18+\n$20ADV/$25Door \n\nOn Sale 1/10 at noon! \nhttp://www.blindpigmusic.com/calendar.html#!/events"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1194461353983196/", "name": "Poetry at Literati: Keith Taylor", "date": "2017-01-27T19:00:00-05:00", "description": "Literati is beyond delighted to celebrate Ann Arbor legend Keith Taylor and his latest collection of poems, The Bird-while, illustrated by Tom Pohrt.\n\n\"In a natural chronometer, a Bird-while may be admitted as one of the metres, since the space most of the wild birds will allow you to make your observations on them when they alight near you in the woods, is a pretty equal and familiar measure\" (Ralph Waldo Emerson’s Journal, 1838). Without becoming didactic or pedantic about the spiritual metaphor hidden in the concept of the \"bird-while,\" Keith Taylor’s collection evokes certain Eastern meditative poets who often wrote in an aphoristic style of the spirit or the mind mirroring specific aspects of the natural world.\n\nThe Bird-while is a collection of forty-nine poems that meditate on the nature—both human and non-human—that surrounds us daily. Taylor is in the company of naturalist poets such as Gary Snyder and Mary Oliver—poets who often drew from an Emersonian sensibility to create art that awakens the mind to its corresponding truths in the natural world. The book ranges from the longer poem to the eight line, unrhymed stanza similar to that of the T'ang poet Han-Shan. And without section breaks to reinforce the passing of time, the collection creates greater fluidity of movement from one poem to the next, as if there is no beginning or end, only an eternal moment that is suspended on the page. Tom Pohrt’s original illustrations are scattered throughout the text, adding a stunning visual element to the already vivid language. The book moves from the author’s travel accounts to the destruction of the natural world, even species extinction, to more hopeful poems of survival and the return of wildness. The natural rhythm is at times marred by the disturbances of the twenty-first century that come blaring into these meditations, as when a National Guard jet rumbles over the treeline upsetting a hummingbird, and yet, even the hummingbird is able to regain its balance and continue as before. At its core, Taylor’s collection is a reminder of Emerson’s idea that natural facts are symbols of spiritual facts.\n\nKeith Taylor teaches at the University of Michigan. He has published many books over the years: collections of poetry, a collection of very short stories, co-edited volumes of essays and fiction, and a volume of poetry translated from Modern Greek.\n\nTom Pohrt is a self-taught artist who has illustrated numerous books including The New York Times bestseller Crow and Weasel by Barry Lopez. He recently illustrated Terrapin and Other Poems by Wendell Berry and Careless Rambles, a selection of poems by John Clare. He lives in Ann Arbor, Michigan.\n\nEvent date: \nFriday, January 27, 2017 - 7:00pm"}, {"source": "Facebook", "url": "https://www.facebook.com/events/195810100885174/", "name": "Wine, Women, and Song XV", "date": "2017-01-27T20:00:00-05:00", "description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs."}, {"source": "Facebook", "url": "https://www.facebook.com/events/1390448460966857/", "name": "LIVE: Swordfish + Dogleg", "date": "2017-01-27T21:00:00-05:00", "description": "Live Music From:\n\nSwordfish (http://bit.ly/2ht39bI)\nDogleg (http://bit.ly/2hoGKcn)\nDrowned Out (http://bit.ly/2iEvzgA)\nBen Awrey From Young Pioneer (http://bit.ly/2iqKifP)\n\nFriday January 27th | 9pm | 18+ | $7 | Club Above | Ann Arbor"}, {"source": "Facebook", "url": "https://www.facebook.com/events/280243392370950/", "name": "10% For Good for Community Action Network", "date": "2017-01-28T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1257037607708983/", "name": "Constructing Gender: Origins of Michigan’s Union and League", "date": "2017-01-28T11:00:00-05:00", "description": "Ask U-M students, alumni, or fans what symbolizes the University of Michigan, and you’ll likely hear the Big House, the Diag, along with the Michigan Union and the Michigan League. Since they officially opened in 1919 and 1929, respectively, the Union and League have been destinations for generations of Wolverines yet few know the rich history of the buildings’ origins or about the architects who brought them both to life: brothers and U-M alums Irving K. and Allen Pond.\n\nThe exhibition, organized in celebration of the University of Michigan’s bicentennial in 2017, illuminates the architecture and bustling student life of these iconic buildings using original drawings, renderings, photographs, color studies, and even dance cards from the Bentley Historical Library, which serves as the University of Michigan archives. These fascinating documents reveal how the buildings were conceived, constructed, and first occupied by students and alumni. Guest curated by Nancy Bartlett of the Bentley Historical Library, the exhibition reveals how the Ponds meticulously conceived and constructed the two clubs—one for men, one for women—by weaving ideas about gender and society into the very fabric of the buildings themselves.\nLead support for this exhibition is provided by the Herbert W. and Susan L. Johe Endowment."}, {"source": "Facebook", "url": "https://www.facebook.com/events/1328285543896539/", "name": "Civic Improv Auditions!", "date": "2017-01-28T18:00:00-05:00", "description": "Audition Notice: Civic Improv Ensemble, Season 2\n\nThe Civic Improv Ensemble is excited to announce auditions for the second season of the new A2CT endeavor. The Ensemble is a great place for both new and experienced improvisers to form brand new troupes of enthusiastic actors who will spend a year developing their improv skills and performing together. Our previous troupes have performed around southeast Michigan, and former CIE members have been cast at Pointless Brewery & Theatre, Planet Ant Theatre, and Go Comedy! Improv Theater.\n\nAuditions will take place at the A2CT Studio (322 W. Ann St, Ann Arbor) on Saturday, January 28 from 6:00-9:00, and Sunday, January 29 from 3:00-6:00. Auditioners must be at least 18 years old, and need attend only one of the two audition days, but should plan to stay the entire time if possible. No pre-registration is required - please arrive a few minutes early to fill out an audition form.\n\nCallbacks for the long-form troupe only will take place Monday, January 30 from 7:00-10:00 at Brain Trainers (2900 S State St, Ann Arbor).\n\nNo preparation or previous experience is required for auditions, which will consist of a variety of short improv games and some basic two-person scene work. We are looking for actors with good energy, a willingness to take chances, and the ability to listen closely on stage and react honestly. Please wear comfortable clothes and be prepared to move. The only fee for Civic Improv is the standard membership fee for all A2CT actors - $25 per year.\n\nEach of our three coaches is looking to cast a troupe of 6 to 12 actors. The three troupes will be:\n\nShort-Form Troupe - coached by Shelly Smith\nThis troupe will focus on short-form games like those featured on Whose Line Is It Anyway or at ComedySportz. This is a great place for those brand new to improv to start out, as well as quick-witted quipsters and anyone who's a fan of fun.\n\nMid-Form Troupe - coached by Jen Delisi\nLearn to create longer scene-based stories in this troupe. Jen introduces improvisers to a variety of tools for bridging the gap between short-form games and long-form scene work. With a clap of their hands, your fellow improvisers will send your characters to unusual locations and hilarious new situations.\n\nLong-Form Troupe - coached by David Widmayer\nScene work is the core of long-form improv - improvisers will learn to walk onto a blank stage with nothing but a simple suggestion and create unique, complex characters and a whole world for them to inhabit. This troupe will be introduced to a variety of scenic forms, and ultimately choose and develop a signature format to bring to their performances.\n\nPlease email David Widmayer (djwidmayer@gmail.com) with any questions."}, {"source": "Facebook", "url": "https://www.facebook.com/events/195810100885174/", "name": "Wine, Women, and Song XV", "date": "2017-01-28T20:00:00-05:00", "description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs."}, {"source": "Facebook", "url": "https://www.facebook.com/events/1300798096618445/", "name": "Hiss Golden Messenger 1/28/17 at Blind Pig - Ann Arbor", "date": "2017-01-28T21:00:00-05:00", "description": "Sat. January 28 | 9pm | 18+ | $15 Cover\n\nHiss Golden Messenger\nThe writing of the songs that became Heart Like a Levee started in a hotel room in Washington, DC , in January of 2015 during a powerful storm that darkened the East Coast. At that time I was feeling-more acutely than I had ever felt before-wrenched apart by my responsibilities to my family and to my music. Forgetting, momentarily, that for me, each exists only with the other. How could I forget? Though maybe my lapse was reasonable: I had just quit my job, the most recent and last, in a series of deadend gigs stretching back 20 years, with the vow that my children would understand their father as a man in love with his world and the inventor of his own days. They would be rare in that regard. And then-driven by monthly bills and pure fear- I left for another tour, carrying a load of guilt that I could just barely lift. But in that snowy hotel room I found the refrain that became my compass: I was a dreamer, babe, when I set out on the road; but did I say I could find my way home?\n\nWSG: Scott Hirsch\n\nhttp://www.ticketweb.com/t3/sale/SaleEventDetail?eventId=7026525&pl=blindpig&dispatch=loadSelectionData"}]