[{"source": "Facebook", "date": "2016-07-22T10:00:00-04:00", "url": "https://www.facebook.com/events/994376950635153/", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "name": "The 2016 Ann Arbor Art Fair"}, {"source": "Facebook", "date": "2016-07-22T10:00:00-04:00", "url": "https://www.facebook.com/events/487403974717996/", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "name": "State Street Art Fair"}, {"source": "Facebook", "date": "2016-07-22T11:00:00-04:00", "url": "https://www.facebook.com/events/156107458129689/", "description": "It's Summer Beer Fest time, and the fun doesn't stop when Riverside Park shuts down for the evening! Six brews will be pouring ALL DAY at Ypsi's Tap Room, including an exclusive release of Eclipser Chestnut Lager! Come hang out -- the brewers and your favorite beer slingers will be at Tap Room post-festival to answer all your lager questions and throw you some swag! \n\nBeer list: \nVerano Mexican-style Amber Lager\nGulo Gulo India Pale Lager\nFaustian Baltic Porter\n**FIRST RELEASE OF SEASON** Eclipser Chestnut Lager\nCereza Rey Cherry Cream Stout Lager\nWest Side Wheat American Wheat Lager", "name": "Tap Takeover - Tap Room in Ypsi!"}, {"source": "Facebook", "date": "2016-07-22T15:00:00-04:00", "url": "https://www.facebook.com/events/1014329471948852/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe"}, {"source": "Facebook", "date": "2016-07-22T17:00:00-04:00", "url": "https://www.facebook.com/events/557283944443258/", "description": "Stop in to UMMA to enjoy special exhibitions, live music featuring Naked Ace, and engaging activities at this special Art Fair edition of Fridays After 5! With all of UMMA's galleries remaining open until 8 p.m., this exciting series provides an interactive atmosphere for all audiences. While you're here, browse the UMMA Store for a wide variety of specialty items. The Museum is always free.\n\nUMMA Fridays After 5 are generously supported by Comerica Bank and the State Street District. The media sponsor for Fridays After 5 is Michigan Radio.", "name": "Fridays After 5 – Special Art Fair Edition"}, {"source": "Facebook", "date": "2016-07-22T18:00:00-04:00", "url": "https://www.facebook.com/events/259022927807355/", "description": "Join us on FRIDAY, JULY 22 (6 - 9PM) for a new evening of unusual experiences at the Ann Arbor Art Center.\n\nFree and open to the public.\n\nWhat is POP•IN?\n\nInjecting the Art Center with a spirit of pop-up culture and by collaborating with diverse artists, we aim to attract intrepid young adults looking to explore and be excited by a city. \n\nCommunity members who attend POP•IN will be immersed in unusual, accessible experiences, whether they planned to attend the event or wandered in off the street.\n\nWhile POP•IN is free, we will allow visitors to buy tickets to reserve seating for performances, and make things they can take home.\n\nJoin us on Friday, July 22 and experience a new POP•IN! \n\nAnd don't forget POP·OFF! POP·IN's official after party...\n\nALL ATTENDEES receive coupons for discounts and freebies at several participating bars/restaurants within a block of the Art Center.\n\nOfficial page: http://www.annarborartcenter.org/events/popin/\n-------------------\nSponsored by \nMichigan Council for Arts and Cultural Affairs & PNC\n\n#POPIN", "name": "Pop•In"}, {"source": "Facebook", "date": "2016-07-22T19:00:00-04:00", "url": "https://www.facebook.com/events/1716328135295569/", "description": "Robin Gaines is the author of the novel-in-stories, Invincible Summers, forthcoming in May 2016 from ELJ Publications. Her short stories and essays can be found in Slice, Crack the Spine, Spindrift, Oasis: A Literary Magazine, Willard & Maple, The Homestead Review, Current Magazine, and Porcupine Literary Arts Magazine.\n\nRobin is a member of the Detroit Working Writers and the Metro Detroit Book & Author Society. Born in Detroit, she lives half the year outside of Ann Arbor and the other half on a lake in Petoskey, Michigan.", "name": "Robin Gaines - Michigan Author"}, {"source": "Facebook", "date": "2016-07-22T20:00:00-04:00", "url": "https://www.facebook.com/events/1421406094833176/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Improv Utopia\"\n\nGroup 2: \"Improv Utopia\"\n\nGroup 3: \"The League of Pointless Improvisers\" starring Arthur Brannon, Maggie O'Reilly, Emily Engelhart, Chris Moody, and Gary Lehman", "name": "Pointless Improv with Improv Utopia"}, {"source": "Facebook", "date": "2016-07-22T20:00:00-04:00", "url": "https://www.facebook.com/events/1164902786865018/", "description": "Magical Mitten Productions Presents: Michigan Bass Music Showcase \n\nCome out and experience some amazing local producers that have been putting in work to bring you their own original bass heavy tunes.\n\nDoors 8pm\n18+\n$5\n\n9 - 10 Tetra\nElectronic Live Music - Dance, Jazz, Deep House. Live Guitar and Vocals. Based in Michigan.\nhttps://soundcloud.com/tetra_music\n\n10 - 11 Tek - Mazter\nI like make music, I make it and play it in front of people, and they dance\nhttps://soundcloud.com/tek-mazter\n\n11 - 12 Humonix\nCreated in 2012. An In-depth, Immersive Auditory Experience\nElectronic Bass Glitch \nhttps://soundcloud.com/humonix\n\n12 - 1 Dawning Music\nIkonic Sound\nhttps://soundcloud.com/dawning-music\n\n1 - 2 Sektor Z\nGuitar-infused Electronic music producer \nZack Foerg\nDetroit, MI\nhttps://soundcloud.com/sektorzmusic", "name": "Michigan Bass Music Showcase: Sektor Z, Dawning Music, Humonix, Tek-Mazter and TETRA"}, {"source": "Facebook", "date": "2016-07-22T22:00:00-04:00", "url": "https://www.facebook.com/events/1776748882611699/", "description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring Arthur Brannon, Maggie O'Reilly, Emily Engelhart, Chris Moody, and Gary Lehman", "name": "A Pointless Display of Improvised Feats"}]