[{"source": "Facebook", "url": "https://www.facebook.com/events/158066451258466/", "description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: Strawberries & Cream - Cream soda meets fresh-picked strawberry in this juicy rendition of the infamous Strawberry Blonde. Smooth scents of vanilla flood the nose and taste buds at first sip, followed by the bite of strawberry and a satisfying finish.. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "date": "2016-05-22T11:30:00-04:00", "name": "American Craft Beer Week"}, {"source": "Facebook", "url": "https://www.facebook.com/events/498636503664121/", "description": "Our Bacon Mac and Cheese Poppers are already popping with flavor- add extras like jalepeno, bacon, or sriracha and you've pretty much got modern comfort food nirvana!\n\n3/$5\n\nSunday 12-2 and 5-7", "date": "2016-05-22T12:00:00-04:00", "name": "Magic Mac-n-Cheese Balls"}, {"source": "Facebook", "url": "https://www.facebook.com/events/482478311946576/", "description": "Friday’s win against Kalamazoo was a big result for the Mighty Oak, leaving AFC Ann Arbor on top of the National Premier Soccer League Great Lakes West Conference table. The Mighty Oak will be carrying that momentum forward to the next game, (AWAY) at Detroit City FC on Friday, May 20th at 7:30PM.   \n\nMighty Oak next home match is a matinee at Hollway Field with gates at 12PM and matchtime at 1PM. \n\nOnline Adult Ticket $8\nOnline Youth Ticket $5 (Ages 4-12) \nKids under 4 are FREE \nTickets at the gate: $10 adult / $6 youth\nhttp://www.afcannarbor.com/tickets/", "date": "2016-05-22T13:00:00-04:00", "name": "AFC Ann Arbor vs Michigan Sporting / 5/22 Sunday 1PM / Hollway Field"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1743789852500159/", "description": "Manuel Álvarez Bravo spent nearly his entire career photographing his native Mexico. His style drew upon numerous international influences including, among others, Modernism and Surrealism. Although not strictly Surrealist, many of Álvarez Bravo’s works manifest a similarly fantastical mood. One of the artist’s most arresting qualities is his ability to imbue scenes of everyday life with an otherworldly, metaphysical power. The photographs in the exhibition, from UMMA’s collections, show the artist using motifs drawn from Mexican religious and indigenous works as well as plant forms, in a Modernist approach to image making. UMMA docents will discuss these motifs and the artist’s use of light as a metaphor and revealer of life, animating even the emptiest and most silent of Álvarez Bravo’s scenes.\n\nPublic exhibition tours are generously supported by the Richard and Rosann Noel Fund for Museum Education.", "date": "2016-05-22T14:00:00-04:00", "name": "Guided Tour: Manuel Álvarez Bravo - Mexico's Poet of Light"}, {"source": "Facebook", "url": "https://www.facebook.com/events/802681199864980/", "description": "A tasting featuring two of Ann Arbor's favorite artisan food producers. White Lotus Farms Creamery and Mindo Chocolate Makers.\n\nIf you've liked our chocolate truffles you're in for a real treat...\n\nFeatured cheeses and chocolates will be for sale following the event.  Advanced ticket purchase required.", "date": "2016-05-22T14:00:00-04:00", "name": "Cheese and Chocolate Pairing"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1012949662130020/", "description": "Settle in for an afternoon of creative audio stories and memorable radio documentary as part of Radio Campfire, a series of listening events curated by radio producers and audio artists in Detroit and Ann Arbor.  Think magical, relaxed and intimate like the campfire (minus the burnt marshmallows.)\n\nThis month's theme is Lost in the Woods: stories with big questions about entering and leaving the world. You’ll hear an episode of a brand new podcast called Pregnant Pause by Detroit based radio producer Zak Rosen and a sound-rich documentary tale by Stamps School of Art & Design professor Stephanie Rowden, among others.\n\nAmanda Krugliak, Arts Curator for the UM Institute for the Humanities, will host the afternoon with a Q&A discussion.\n\nFree and open to the public.\n\nSupport for this afternoon is from the University of Michigan’s Stamps School of Art & Design, the Institute for the Humanities, and the University of Michigan Museum of Art.", "date": "2016-05-22T15:00:00-04:00", "name": "Lost in the Woods: Radio Stories about Birth, Death, and Nature"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1584384978543208/", "description": "Shelley Schanfield’s fascination with Buddhism and yoga arose fifteen years ago, when she and her son were pursuing black belts in Tae Kwon Do in Ann Arbor, Michigan.\n\nTae Kwon Do, like all the Eastern martial arts, includes techniques developed by Buddhist monks to calm and focus the mind. These techniques provided a source of physical and spiritual strength when devastating illness struck her family. Inspired by the Buddha’s transformational teachings, she set out to learn as much as she could about who he was. By profession a librarian, Shelley immersed herself in research on the time, place, and spiritual traditions that 2500 years ago produced Prince Siddhartha, who became the Buddha. Yoga, in some form, has a role in all of these traditions. While studying yoga’s history, Shelley began her own practice, which proved as transformational as Buddhist meditation.\n\nBecause she loves historical fiction, Shelley looked for a good novel about the Buddha. Unsatisfied with what she found, she decided to write her own. Her research had sparked her curiosity about Yasodhara, the woman who became Siddhartha’s wife, and she became inspired by the personal and spiritual struggles of women who knew him. She began to write the Sadhana trilogy, three novels that tell their stories.\n\nShelley hung up her black belt to practice Iyengar yoga. Both disciplines have enriched her world and the world of her books.\n\n'The Tigress and the Yogi'\n\nA talking tigress...a wandering yogi...\n\nWhen the outcaste girl Mala meets these two, it sets her on a journey from slavery to freedom through an ancient land where chaos threatens gods and mortals alike. She meets gods and goddesses, outlaws and kings, and the young prince Siddhartha, who is prophesied to become the Buddha.\n\n“…fascinating reading for anyone remotely interested in Eastern religion and culture…With a strong and graceful writing style, Schanfield combines spirituality and action in a way that’s consistently compelling…an impressive debut…” Blue Ink Reviews\n\n“With its violent, pulsating, and raw sensuality, this story of a heroine from the edges of Buddhist traditions appeals to the senses…Schanfield’s portrayal of the feminine aspects of the divine is highly potent…” Patty Comeau, five stars, Foreword Clarion Reviews", "date": "2016-05-22T15:00:00-04:00", "name": "Meet Local Author Shelley Schanfield for a Discussion & Signing of Her Debut Novel, 'The Tigress & the Yogi'"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1707903572805182/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "date": "2016-05-22T16:00:00-04:00", "name": "Beer and Board Games"}, {"source": "Facebook", "url": "https://www.facebook.com/events/193194074399065/", "description": "Strayaway Child Concert Series proudly presents legendary uilleann piper Paddy Keenan in concert!\n\n<>Show at 5:30pm <> Doors open 5:00pm<>\n\n<>Admission<>\nGeneral: $18  \nStudents: $16\nKids under 10: free\n\nGenerally acknowledged as the most accomplished uilleann piper performing today and a living legend, Paddy is one of the most brilliant musicians of his generation. Born in Trim, Co. Meath, to John Keenan, Sr. of Westmeath and the former Mary Bravender of Co. Cavan. The Keenans were a Travelling family steeped in traditional music; both Paddy's father and grandfather were uilleann pipers. Paddy himself took up the pipes at the age of ten, playing his first major concert at the Gaiety Theatre, Dublin, when he was 14. He later played with the rest of his family in a group called The Pavees. At 17, having fallen in love with the blues, Paddy left Ireland for England and Europe, where he played blues and rock. Returning to Ireland after a few years, he began playing around Dublin with singer/keyboardist Triona Ni Dhomhnaill and singer/guitarist Micheal O Dhomhnaill. Fiddler Paddy Glackin joined the three, then flute player Matt Molloy, accordionist Tony MacMahon, and guitarist Donal Lunny. Thus was born one of the most influential bands of the 1970s, The Bothy Band. Paddy was one of the band's founding members, and his virtuosity on the pipes combined with the ferocity of his playing made him, in the opinion of many, its driving force. Bothy Band-mate Donal Lunny once described Paddy as \"the Jimi Hendrix of the pipes\".\n\nSince the breakup of The Bothy Band in 1979, Paddy has toured as a soloist, bringing the finest example of traditional Irish music and uilleann piping to audiences around the globe, performing in Japan, Malaysia, Mali, Australia, across Europe, Russia, and of course America.\n\nVisit Paddy on the web here: http://www.paddykeenan.com/", "date": "2016-05-22T17:30:00-04:00", "name": "Paddy Keenan- In Concert"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1701076670149792/", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "date": "2016-05-22T19:00:00-04:00", "name": "Open Stage"}]