[{"date": "2016-11-11T08:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/144098819397112/", "description": "All week, all Garden of Life products are 35% off! That includes plant-based protein supplements, vitamins, and even special products just for kids. Stop in to chat with our friendly and knowledgable Natural Living team, and stock up on wellness!", "name": "35% Off Garden of Life"}, {"date": "2016-11-11T08:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1090878344334512/", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "name": "Sweetwaters Westgate Grand Opening!"}, {"date": "2016-11-11T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/366891516989885/", "description": "Beginning November 4th, GameStart will be hosting a six-week series of Open House workshops called GameLab. Each week will feature a FREE to participate class, rotating* between two of GameStarts most popular courses: Game Creation with Unity and Minecraft Python Programming. Students are invited to try out and retake each class as often as they'd like during the six-week term.\n\nGameLab Course Schedule:\nNovember 4th, 4:00pm - 5:00pm: Minecraft Python Programming\nNovember 11th, 4:00pm - 5:00pm: Game Creation with Unity\nNovember 18th, 4:00pm - 5:00pm: Minecraft Python Programming\nNovember 25th, 4:00pm - 5:00pm: Game Creation with Unity\nDecember 2nd, 4:00pm - 5:00pm: Minecraft Python Programming\nDecember 9th, 4:00pm - 5:00pm: Game Creation with Unity\n \n*Note: Course topics will be repeated between each rotating week, but students are invited to experiment with the material in as many ways as they'd like during each visit.", "name": "GameLab: Open House Events"}, {"date": "2016-11-11T17:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/212486835831701/", "description": "Stop in to UMMA on select Friday evenings to enjoy special exhibitions and engaging activities at Fridays After 5! With all of UMMA's galleries remaining open until 8:00 p.m., this exciting series provides an interactive atmosphere for all audiences. While you're here, browse the UMMA Store for a wide variety of speciality items. Park in the Maynard Structure (between Liberty and William) and receive free, validated parking. The Museum is always free.\nFrom 6-7:30 p.m. Artist Khaled al-Saa'i will lead a hands-on demonstration that introduces traditional and modern Arabic calligraphy and discuss the ways in which he uses calligraphic forms in his own work. Works in UMMA’s collection by Mr. al-Saa’i will be on view on the Lower Level. \n\nRegistration is required please email: umma-program- registration@umich.edu\n\nUMMA Fridays After 5 are generously supported by Comerica Bank and the State Street District. The media sponsor for Fridays After 5 is Michigan Radio.\n\nAlso, be sure to save the date for our upcoming Fridays After 5: December 9\nFebruary 17, 2017\nApril 7, 2017\nMay 12, 2017 June 9, 2017", "name": "Fridays After 5"}, {"date": "2016-11-11T18:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/137902746676133/", "description": "This program is free and open to the public, but seating is limited. Please register to secure your space by emailing umma-program-registration@umich.edu.\n\nArtist Khaled al-Saa'i will make a special appearance at UMMA's November Fridays After 5 event. The Syrian born artist will discuss the ways in which he uses calligraphic forms is his own work and lead a hands-on demonstration that introduces traditional and modern day Arabic calligraphy.\n\nMr. al-Saa'i will introduce variations of traditional Arabic calligraphic scripts, the function and quality of each one, and the traditional tools used to create them. He will also introduce Sunbuli script, the late Ottoman cursive known for its compact combinations, by demonstrating individual letters and words. Audience members will have the chance to try their hand at creating this unique style of script.\n\nMr. al-Saa'i will also explore the expressive possibilities of calligraphic lettering, moving beyond the rules of writing and language, and highlighting his own historic and recent work.\nWork in UMMA’s collection by Mr. al-Saa’i will be on view on the Lower Level for browsing before and after the program until 8:00 p.m.\n\nThis program is co-sponsored by the University of Michigan History of Art Department, the Institute for the Humanities, and UMMA.", "name": "Artist Talk and Demonstration: Calligraphy Expressive Language"}, {"date": "2016-11-11T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/873403332796336/", "description": "Literati is pleased to partner with One Pause Poetry to celebrate the recent work of Rochelle Hurt, Sarah Rose Nordgren, and Michael O'Leary.\n\nRochelle Hurt is the author of two collections of poetry: In Which I Play the Runaway (2016), winner of the Barrow Street Book Prize, and The Rusted City (2014), published in the Marie Alexander Series from White Pine Press. Her writing has been included in the Best New Poets anthology series and awarded prizes from Crab Orchard Review, Arts & Letters, Hunger Mountain, Poetry International, and the Dorothy Sargent Rosenberg Fund. She is a PhD student at the University of Cincinnati. \n\nSarah Rose Nordgren is the author of the poetry collections Best Bones (University of Pittsburgh Press, 2014), winner of the Agnes Lynch Starrett Prize, and Darwin’s Mother, which is forthcoming from University of Pittsburgh in fall 2017. Her poems and essays appear widely in journals such as Ploughshares, American Poetry Review, Agni, The Kenyon Review Online, and Copper Nickel. Among her awards are two fellowships from the Fine Arts Work Center in Provincetown, an Individual Excellence Award from the Ohio Arts Council, and fellowships and scholarships from the Sewanee and Bread Loaf Conferences, the Vermont Studio Center, and the Virginia Center for Creative Arts. Native to North Carolina, Nordgren is currently a doctoral student in poetry at the University of Cincinnati and Associate Editor at 32 Poems.\n\nA founding editor of both LVNG and Flood Editions, Michael O'Leary works as a structural engineer and lives with his family in Chicago.", "name": "Rochelle Hurt, Sarah Rose Nordgren, Michael O'Leary"}, {"date": "2016-11-11T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/243866962676949/", "description": "Fri. November 11 | 9pm | 18+ | $10 Adv. / $12 Day of\n\nThe Timbre of Cedar is an alternative indie rock outfit based in the mitten of Michigan. With a variety of sounds ranging from a driving full band, to hushed vocals and subtle piano tones, the group displays a versatility that keeps you guessing what's next. Front woman, Marrissa Parham, has strong vocals that stand out beautifully over the clean-cut, refined sound of her band, and her words reveal a transparency of the soul and yearning for grace. WSG: Rival Summers & Watching for Foxes", "name": "The Timbre of Cedar 11/10/16 at Blind Pig - Ann Arbor"}, {"date": "2016-11-11T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/684560311708488/", "description": "Aeronautic Records presents...\nAn evening of original local music celebrating our first release Aeronautic Vol. 1 with a wide range of futuristic sounds and visuals from producers...\nAceMyth\nEpicure\nDayggs aka Diego Aliste\nDJ FLP\nMonsuun\ndreSKEEZUS\nJason Hogans AKA :brownstudy\nSatta Don Dada\n(We'll be giving away free copies of the compilation to the first 25 peeps)\n\n9pm\n18+\n$5", "name": "Aeronautic Volume 1 (Launch Party)"}, {"date": "2016-11-12T08:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/324709987912141/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network"}, {"date": "2016-11-12T09:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/625992070896001/", "description": "Dr. Sally Cornelison, Professor of Italian Renaissance art at Syracuse University, will provide the keynote talk for this U-M History of Art Graduate Student Symposium. Eight graduate students in Art History and related fields from the University of Michigan and other institutions will present papers that examine the visual implications of magnificence and display from a broad range of theoretical and methodological approaches. These graduate student presentations vary widely in geographic locations and historical time periods.", "name": "U-M History of Art Graduate Student Symposium"}]