[{"url": "https://www.facebook.com/events/1251287781589750/", "source": "Facebook", "date": "2016-11-19T07:00:00-05:00", "description": "Plead read ALL and SHARE WIDELY:\r\n\r\nSummary: This is a basic self defense class for folx whose visible identities make them suscpetible to hate crimes. Specifically, this space if for anyoen who feels unsafe given the hate crimes that have been happening over the past 500 years as well as the last week. That said, this space prioritizes those with the identities that have been attacked the most since November 8th: Black, Muslim, Immigrant, or related identties (i.e. anyone who is affected by Islamophobia or Xenaphobia where or not they are a Muslim or an immigrant). You will learn basic self defense techniques that are readily applicable, easy to share, and can still be practiced without an instructor present. The class will focus on creating a space to allow its participants to empower themselves by learning universally effective martial arts techniques. Participants ways of defending themselves from attacks that are common in hate crime and Islamophobic harassment, such as shoves, multiple strikes to the face, and scarf grabs. Participants should come dressed in regular clothing rather than loose gym outfits. This space IS Queer friendly, trans friendly, and open to folx of all genders.\r\n\r\nTimes:\r\n\r\nSaturday: \r\nSession 1:  11:45am-1:00pm\r\nSession 2: 1:15pm-2:30\r\nSession 3: 2:45pm-3:30pm\r\n\r\nSunday:\r\nSession 1: 9:00am-10:45am\r\nSession 2: 11:00am-12:45pm\r\n\r\nRSVP Link: https://docs.google.com/forms/d/e/1FAIpQLSdXRFrQ8ms0U-_dF0mIcLzm7PIT_mWa1of7VSmy9PaO-eE5qA/viewform\r\n\r\nPrice: Suggested $5-$8 donation to help compensate the instructor. If you are not able to give this, we still invite you to come. Affirmations also accepted.\r\n\r\nInstructor Bio: Maryam Aziz is an organizer with A3BL and the chief self defense instructor for the Women's Initiative for Self-Empowerment (W.IS.E). She is a 2nd Degree Black Belt in Goju Ryu Karatedo under the New Jersey State Black Belt Association (NJBBA) run by Hanshi Anthony D. Lingo. She has been practicing martial arts for over 13 years. She was an assistant for 10 years instructor for the NJBBA and the Columbia University Kon Do Goju Ryu Karate Club before becoming W.I.S.E’s chief self-defense instructor.She specializes in Anti-Hate Crime/Anti-Islamophobia and Self-Esteem and Mind/Soul Enhancement self defense seminars and teaches classes throughout the continental United States and aboard. She is currently working on a self-defense handbook to help community organizations safely teach self-defense to communities affected by Islamophobia. She uses a martial arts pedagogy that is degendered, desexualized, and that accounts for racialzed violence and is capable of working with people of different abilities.\r\n\r\nCosponred by the Women's Iniative for Self-Empowerment:\r\nhttp://www.wise-woman.org/", "name": "Anti Hate Crime Self Defense Class This Saturday!"}, {"url": "https://www.facebook.com/events/324709987912141/", "source": "Facebook", "date": "2016-11-19T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network"}, {"url": "https://www.facebook.com/events/661547900690547/", "source": "Facebook", "date": "2016-11-19T10:00:00-05:00", "description": "Do you have a local comic shop? Do you LOVE your local comic shop? Probably you do, but hear me out anyway.\n\nOn November 19th, take a moment to celebrate and acknowledge independent, locally owned comic shops with Local Comic Shop Day. In a world turning increasingly digital, turning more and more to our various screens for entertainment and shopping, there are still thousands of brick and mortar establishments run by actual human beings who want to talk to you about--and provide you with--the stuff you love. The excellent folks at an organization called ComicsPro have rallied comic readers all over the world to establish a holiday celebrating local comic book retailers and we are proud to be a part of their efforts.\n\nVault of Midnight will be celebrating LCSD by offering super-limited, ultra-exclusive Local Comic Shop Day merchandise. These will vary by store, so visit your local Vault (or all three, perhaps?) to see everything on offer.\n\nThat's not even everything. Let me finish.\n\nOn this day and this day only, we will be giving away an absurd bevy of graphic novels courtesy of Double Take Comics -  the same brains that brought you Grand Theft Auto. Each and every one of you can choose up to three of the available 10 Double Take Graphic novels to take home with you while supplies last.\n\nWe positively cannot wait to see all of you handsome devils there. We hope that if you can't spend the day with us that you'll find the nearest comic shop you can and give them a high five. Or a grateful nod of some kind, exclaiming clearly and with pride, \"You Are Acknowledged.\"", "name": "Local Comic Shop Day 2016"}, {"url": "https://www.facebook.com/events/1338809966143346/", "source": "Facebook", "date": "2016-11-19T10:00:00-05:00", "description": "It's the last home game, and we are tailgating inside this week! We've got your parking spot and a brat for $25, or just come in for our $2 pints and $5 mimosas. Brats without the spot are $5, and we're doing a special pork fritter sandwich for $5, too. Go Blue!", "name": "Spot and a Brat"}, {"url": "https://www.facebook.com/events/290525788013144/", "source": "Facebook", "date": "2016-11-19T10:30:00-05:00", "description": "Join our Little Peeps crew for a celebration of Harvest time. The morning will include a short interactive performance, drama activities, and a harvest craft. \nRecommended for pre-k through grade 5.\nTickets: $7 for one child, $5 for each additional child. Adults are free.", "name": "Little Peeps \"Harvest\""}, {"url": "https://www.facebook.com/events/344302899237534/", "source": "Facebook", "date": "2016-11-19T12:30:00-05:00", "description": "In this kid friendly workshop you will build a birdhouse suitable for chickadees, nuthatches, downy woodpeckers and other small birds. Interactive instruction regarding wood, tools, and safety will be followed by guided use of a hand saw, rasp, power drill and hammer to assemble your birdhouse. We will end the workshop with finishing options that provide healthy homes for birds.\n\nCost is $45. This includes materials, tools, and instruction for one Birdhouse. No prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.\n\nCall Maker Works at 734-222-4911 or sign up here: http://www.supersaas.com/schedule/makerworks/CheckOut?day=19&month=11&year=2016&view=day", "name": "Birdhouse Make & Take"}, {"url": "https://www.facebook.com/events/251161041937218/", "source": "Facebook", "date": "2016-11-19T13:00:00-05:00", "description": "Stewardship Workday\nSaturday, November 19\nBarton Nature Area\n1 to 4 p.m.\nBarton Nature Area is a very popular location for many different bird species throughout the year. Help us provide better native habitat for the birds and other wildlife by removing invasive shrubs. Learn to identify and remove honeysuckle and buckthorn while also collecting native seeds in the vast prairies. Please meet at the Barton Dam parking lot off of Huron River Drive. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Stewardship Workday-Barton Nature Area"}, {"url": "https://www.facebook.com/events/366351347038113/", "source": "Facebook", "date": "2016-11-19T16:00:00-05:00", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2"}, {"url": "https://www.facebook.com/events/1807900772828520/", "source": "Facebook", "date": "2016-11-19T18:00:00-05:00", "description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "name": "Art Off The Wall Holiday Exhibition & Shopping Event"}, {"url": "https://www.facebook.com/events/332907297072483/", "source": "Facebook", "date": "2016-11-19T18:30:00-05:00", "description": "Climb on up to the Club Above and get down with The SWITCHBACKS for a good-ole time! No cover charge, food, drink, dance floor, groovin' music... aw yeah!", "name": "Switchbacks at Club Above"}]