[{"date": "2016-09-10T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/584832978387396/", "description": "Stewardship Workday-National Day of Service\nSaturday, September 10\nStapp Nature Area\n9 a.m. to noon\nStapp Nature Area is one of our more pristine natural areas, with native plants composing nearly eighty percent of the total flora. The park’s mature oak-hickory forest is home to deer and several cavity-dwelling bird species, while a vernal pool draws frogs, toads, and salamanders. Volunteers and NAP staff have worked hard throughout the years to maintain the high environmental quality of this park, but invasive shrubs are threatening to undo these efforts! Join us to cut back invasive honeysuckle and buckthorn to make room for our native plants to flourish. Please meet us at the park entrance on the corner of Huron Parkway and Tuebingen Parkway. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Stewardship Workday-National Day of Service-Stapp Nature Area"}, {"date": "2016-09-10T10:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1824235374473797/", "description": "\"The Spunky Sprite and the Endless Night\" follows a plucky young sprite who is desperate to learn how Mother Nature brings the world to life each day. Caught up in her desire to do everything by herself, the sprite unwittingly lets a darkness into the land that threatens their very way of life. Only by finally accepting help is she able to return nature back to full health. It is then that she realizes working together makes us stronger.\n \n\"The Spunky Sprite and the Endless Night\" is an original play, developed specifically for babies through elementary school children. Told largely through music and movement, this show speaks the language of our youngest theatre-goers. Highly interactive, \"The Spunky Sprite and the Endless Night\" welcomes the audience into the world of the play, and encourages them to wiggle, make noise, clap, and sing.\n\nTickets: $10 for adults, $5 for children\n\nStarring:\nTyler Calhoun as Earth\nAshley Davis as Light\nGeoff Grecynski as Air\nHavah Roussel as Mother Nature\nMichelle Weiss as Water\nLauren Zamiska as The Spunky Sprite\nMusic composition and direction: Christian James\nDirected by Tori Tomalia\nCostume Design: Ashley Davis\nThe show was devised by the ensemble.", "name": "The Spunky Sprite and the Endless Night"}, {"date": "2016-09-10T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1961357197423880/", "description": "When you see our Lucky's Market logo on products throughout our store, you can feel secure in knowing that they have all natural ingredients, taste great, and are a fantastic value. We'll be showing off some of our favorites, so be sure to join us for samples! We'll be giving away a special basket of our Private Label products to one Lucky's winner, so make sure you sign up at the table for a chance to win!", "name": "Private Label Tasting"}, {"date": "2016-09-10T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1140185116037592/", "description": "Rikki the Golden Retriever loves to have kids read to her according to her owner, special education teacher Shelly Schwartz.  If your child has a difficult time reading outloud in class or reading in general bring them to the store to read to Rikki.  Experience has shown that reluctant readers are more comfortable reading to a dog than to another person. \nOr just bring your kids if they would like to read to Rikki!  \nNicola’s Books is pleased to have Rikki as part of the staff!", "name": "Read to Rikki the Reading Therapy Dog"}, {"date": "2016-09-10T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/512096392314717/", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2"}, {"date": "2016-09-10T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/318769471800834/", "description": "Please join us at the 9th annual HomeGrown Festival!  It is a grassroots community celebration of our region’s locally grown food, drink, music and fun. \n\nThis years festival will include:\n- Tasty locally sourced food prepared by some of your favorite local chefs\n- Beer, wine, mead, kombucha, and more, from some of Michigans greatest brewers and fermentors\n- Three popular local bands providing live music on the Main Stage\n- Local vendors promoting their products\n- A silent auction\n- Hands-on and educational activities for kids \n\nPlus much more!  Please bring your friends and family and enjoy a great night celebrating all things Local!\n\nThis is a FREE event!  Can't wait to see you there!", "name": "Homegrown Festival"}, {"date": "2016-09-10T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1859210240979940/", "description": "Celebrate all things local with HomeGrown Festival! Held in Kerrytown, this festival brings together local beer, food, and music for one awesome September night. Don't miss it! For more info, check out the website. http://hgfest.blogspot.com/", "name": "HomeGrown Festival"}, {"date": "2016-09-10T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/995844083846145/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Green Gables\nGroup 2: Moxie by Proxy\nGroup 3: The League of Pointless Improvisers", "name": "Pointless Improv with Green Gables and Moxie by Proxy"}, {"date": "2016-09-10T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1745875622317080/", "description": "Saturday, Sept. 10 | 9pm | $10 Cover | 18+\n\nCountry Club Disco \n\nGolf Clap\nwww.countryclubdisco.com\nhttps://twitter.com/golfclapdet\nhttps://soundcloud.com/golfclapdet\n\nw/ \n\nTwin Cousin\nhttps://soundcloud.com/twincousinmusic\n\nJoshua Elias (Music Page)\nhttps://soundcloud.com/joshelias\n\n:: Golf Clap ::\nDJs; producers; club headliners; after-party enthusiasts: Golf Clap are Hugh Cleal and Bryan Jones, a Detroit duo with an unmatched passion for house music and a seemingly endless supply of studio and club-focused creativity. And with releases on some of the world’s most influential house labels already under their belts, along with a lauded Boiler Room session and beyond, they’re only just getting started.\n\nWith roots in the Detroit underground, booking local and international DJs to play at their own parties, Golf Clap have established themselves as in-demand artists and performers in their own right, via an irresistible combination of hard work, talent and consistently being the last guys standing, wherever the party ends up.", "name": "Country Club Disco - Golf Clap w/ Twin Cousin & Joshua Elias 9/10/16 at Blind Pig - Ann Arbor"}, {"date": "2016-09-10T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1610122749288632/", "description": "Join us in celebrating an amazing run from Scout who has killed it since day 1 as our resident DJ on Saturday nights! Scout will be hosting #Voyager for the last time as she's taking her talents to LA in pursuit of what we know will be a wonderful career! Be here Saturday night and help us send her off the right way!\n\nOpening set by aria.", "name": "Scout's Final Voyager"}]