[{"source": "Facebook", "description": "This large park (almost 90 acres) is next to natural areas some owned by the County and the University of Michigan. The large area of natural habitat makes each part of it that much more valuable for conservation. Volunteers are needed to help close a section of trail in order to decrease erosion and increase park user experience. Meet in the parking lot off Dixboro Road, north of Plymouth Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/2028242233962716/", "name": "Marshall Nature Area Stewardship Workday", "date": "2016-08-20T09:00:00-04:00"}, {"source": "Facebook", "description": "You've come to your local theatre/brewery to see the premiere of \"Happy Hour,\" a brand new play, only to find that you've stepped right into a space-time anomaly. The actors are all missing and the oblivious bartender doesn't know he's caught in a time loop - but he'll still serve you drinks! You and your team have one hour to find clues and solve puzzles in order to repair the timeline and, more importantly, escape the room. \n\nAdventure Lab is a new business specializing in escape rooms and other live-action puzzle games. If you enjoy puzzles, fun, adventures, games, or improving your small group communication skills, then you won't want to miss this unique event at Pointless!\n\nSelect the time and date you would like to attend. Each time slot is limited to 3-6 people.\nAdventures are:\nSaturday, August 20 @ 10 am\nSaturday, August 20 @ 12 pm\nSaturday, August 20 @ 2 pm", "url": "https://www.facebook.com/events/1072810779472102/", "name": "Trappy Hour! A brand new escape room adventure", "date": "2016-08-20T10:00:00-04:00"}, {"source": "Facebook", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/812214962144078/", "name": "Icebreakers^2", "date": "2016-08-20T16:00:00-04:00"}, {"source": "Facebook", "description": "Shakespeare is back at Pointless Brewery & Theatre this August!  \n\nAfter May's sellout performance of MUCH ADRINK ABOUT NOTHING, Ann Arbor's original Shakespeare performance/drinking game is back this time with four performances, over two weekends, with entirely new shows.  Not above taking on low-hanging fruit, we're presenting two of the Bard's most popular and most overdone plays with A MIDSUMMER NIGHT'S DRINK and THE LAMENTABLE DRINK OF ROMEO & JULIET.  \n\nShakespeare at Pointless looks to revive a bit of vibrant raucous nature of Shakespeare's early modern theater. Honoring the in-house brewery, the actors will and audience can partake in a drinking game over the course of the plays with specific rules for each play.\n\nAll shows are at 8 pm.\n\nFriday, August 19th: The Lamentable DRINK of Romeo & Juliet\nSaturday, August 20th: A Midsummer Night's DRINK\n\nFriday, August 26th: A Midsummer Night's DRINK\nSaturday, August 27th: The Lamentable DRINK of Romeo & Juliet", "url": "https://www.facebook.com/events/1067779289943177/", "name": "Shakespeare & Beer: A Midsummer Nights DRINK", "date": "2016-08-20T20:00:00-04:00"}, {"source": "Facebook", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Natural Born Killaz\" \n\nGroup 2: \"Butt Sweatin' Tears\"\n\nGroup 3: \"The League of Pointless Improvisers\" starring Steve Oliver, Jake Russell, Moni Jones, Matt Swartz, and Arthur Brannon III", "url": "https://www.facebook.com/events/1138288022895647/", "name": "Pointless Improv with Natural Born Killaz and Butt Sweatin' Tears", "date": "2016-08-20T22:00:00-04:00"}, {"source": "Facebook", "description": "Reggae, dancehall. Hip hop\nFree before 11pm.\nDrink specials.", "url": "https://www.facebook.com/events/1758566627720889/", "name": "Reggae Rebel Alliance -7", "date": "2016-08-20T22:00:00-04:00"}, {"source": "Facebook", "description": "Before joining the faculty of the Southern California Institute of Architecture in Los Angeles (Sci-Arc), Mira Henry spent several years as a project architect, immersed in the everyday, banal details of how buildings get built such as construction drawings and material specs. But as a progressive architectural thinker, her inspiration has been to “unsee” the very forms and representations that constitute an architect’s basic language. For example, through speculative experiments and conceptual drawings Henry discovers in static architectural details an unsettling range of figurative expression, such as the way the profiles of roof eaves resemble human heads. Join UMMA docents as they explore how these features animate our subjective experience–what she calls our “shifting fantasies”–of architectural space.", "url": "https://www.facebook.com/events/165758127167249/", "name": "Guided Tour Mira Henry: The View Inside", "date": "2016-08-21T14:00:00-04:00"}, {"source": "Facebook", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "url": "https://www.facebook.com/events/153207758446964/", "name": "Beer and Board Games", "date": "2016-08-21T16:00:00-04:00"}, {"source": "Facebook", "description": "Ann Arbor Poetry Slam is back this Sunday with another all ages open community free-speech event! To read or perform, sign up between 6:30 & 7:00. The show starts at 7. There is a five dollar suggested donation at the door. All proceeds go to send winning poets to National and International poetry tournaments. DIY. Grass-roots. Since 1987. Come early. Stay late. Bring the world. Bring your words. Your host this week is Luis Anderson!", "url": "https://www.facebook.com/events/165685407192756/", "name": "Ann Arbor Poetry Open Mic & Slam", "date": "2016-08-21T18:30:00-04:00"}, {"source": "Facebook", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/1327336580627572/", "name": "The Arcade - A Pointless Improv Jam", "date": "2016-08-21T19:00:00-04:00"}]