[{"date": "2017-07-26T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1919911221367609/", "name": "Full Metal Jokers presents: An Indoor Standup Comedy Showcase", "description": "The Mayo Clinic states that laughter is a great form of stress relief.*  Come to Pointless Brewery & Theater for some stress relief.  Four very unique future stand up comedy headliners from multiple states will be performing and are guaranteed to get the crowd laughing.  Humor will range from topical to observational to introspective to surreal.\n​\nThe show is presented by Full Metal Jokers which started as (and still is) an outdoor comedy show that pops up around Ann Arbor and the Metro Detroit area.  Pointless Brewery & Theater is known for top notch improv and excellent beer.  \n \nWednesday, July 26th.\nDoors open at 7:00pm, show starts at 7:30pm.\nTickets are only $7. \nAdult content advisory.\n \n*http://www.mayoclinic.org/healthy-lifestyle/stress-management/in-depth/stress-relief/art-20044456"}, {"date": "2017-07-26T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/662898720567876/", "name": "L'Amour Toujours: La Musique Magnifique de France", "description": "Just as the myriad offerings at Ann Arbor’s famous Art Fair span a gloriously large variety of visual art genres, Kerrytown’s Week After Art Fair Song Fest spans an equally large variety of musical genres between July 26th and July 28th.\n\nWednesday's program will feature works from various composers in the classical genre.\n\nKevin Bylsma\n\nKevin Bylsma is an accomplished pianist and vocal coach and is well-known in the Midwest for his work in art song, opera and oratorio. As head of music preparation for the Toledo Opera, he had coached productions of Tosca, The Tales of Hoffmann and The Magic Flute. He has served as music director of the Department of Community Programs for the Michigan Opera Theatre from 1993–97 and was vocal coach, accompanist and chorus master for OPERA! Lenawee from 1992 to 1997. Other music directing credits include the Lyric Chamber Ensemble of Detroit and the Papagena Opera Company of Ann Arbor. He has appeared throughout the United States, Canada and Europe as an organist, pianist and accompanist. In the summer of 1996, he toured Germany, Poland and the Czech Republic with tenor Robert Mirshak. Most recently, he has appeared in master classes and recitals with soprano Diana Soviero and mezzo-soprano Irina Mishura. He has served as principal keyboardist with the Adrian and Greater Lansing Symphony Orchestras and was the winner of a number of competitive awards, including the Robert Glasgow Organ Scholarship from the University of Michigan and the Lucille Mehaffie Young Artist Award. He currently serves as an instructor at Bowling Green State University and assistant organist at the historic Mariner’s Church in Detroit.\n\nJane Schoonmaker Rodgers\n\nSoprano Jane Schoonmaker Rodgers’ concert, recital, choral, and stage engagements have taken her around the world: New York, London, Vienna, and Prague, as well as to Chicago, Detroit, Toledo, Syracuse, and other Great Lakes cities. Recent activities have included performances and recordings with the Great Lakes Chamber Music Festival, Toledo and National Polish Radio Symphonies, Moravian Philharmonic, American Composers’ Alliance, Mid-American Center for Contemporary Music, and the Society for New Music. She appears frequently at KCH, including the annual Wine, Women and Song concerts. She is currently an associate professor of voice at Bowling Green State University."}, {"date": "2017-07-26T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/387997224927492/", "name": "Movie Heroes", "description": "A musical salute to movie heroes.\nRaider's March\nLawrence of Arabia\nWho's That Masked Man\nPirates of the Caribbean\nCaptain America March\nBond... James Bond\nStar Wars\nStars and Stripes Forever"}, {"date": "2017-07-27T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/302304803527970/", "name": "Sonic Lunch / NOMO July 27th / Free Noon", "description": "Bank of Ann Arbor's Sonic Lunch is an awesome outdoor summer concert series that rocks Ann Arbor's Liberty Plaza Thursdays at lunch time each summer. Look for news and announcements year-round and concerts to kick off in June 1, 2017. Sonic Lunch is free and open to all ages! Lawn chairs and furry friends are welcome.\nTell all your friends about one of the events that make summer in Ann Arbor super cool! \nBank of Ann Arbor appreciates the support of Ann Arbor’s 107one fm and Perich Advertising + Design.\n\nJuly 27th \nNOMO\nNomomusic.com \nNOMO were conceived in 2003 when University of Michigan jazz studies graduate and multi-instrumentalist (tenor sax, keyboards, electric mbiri) Elliot Bergman and some of his acquaintances began jamming at an Ann Arbor, MI, house where many of them lived. This led to the eventual formation of the group, which recorded its self-titled EP on Ypsilanti Records that same year, after producer Warn Defever dared Bergman to bring as many people as he could to the studio. In 2004 the band (which, with album and live appearances combined, has had over 60 contributors) issued a full-length record of the same name. NOMO's mix of African beats, avant-garde jazz, and funk caught the attention of California's Ubiquity Records, who soon signed them.  The founding members of NOMO also currently play in Wild Belle."}, {"date": "2017-07-27T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/452558968439401/", "name": "Cantina Thursdays", "description": "Thursdays this summer, join us for our made in-house tacos and great craft beer! \n\nBeer- $1.50 a pint\nChicken Tacos- 3/$6.99\nChicken Quesadillas- $4.99"}, {"date": "2017-07-27T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/317787695329400/", "name": "90's Trivia Night Presented by AADL", "description": "Remember the 90's? Oh...you remember ALL the (small) things from the 90's?! For once this incredible wealth of knowledge comes in handy for winning FREE STUFF! Come on down to LIVE for a full evening of exciting trivia and relics from back in the day. It's about to get nostalgic up in here.\n\nDoors open at 6:30, and trivia begins at 7 pm.\n\nAADL is sponsoring this event, so there will be NO COVER!\n\nMark your calendars and spread the word! Whether you're a wannabe, an all star, or hey- even a wonderwall- you're welcome to come join us!\n\nhttp://www.aadl.org/node/359916"}, {"date": "2017-07-27T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/565303913859030/", "name": "This Time of Year Thou Mayst in Me Behold", "description": "Just as the myriad offerings at Ann Arbor’s famous Art Fair span a gloriously large variety of visual art genres, Kerrytown’s Week After Art Fair Song Fest spans an equally large variety of musical genres between July 26th and July 28th.\n\nWednesday's program will feature works from various composers in the classical genre.\n\nKevin Bylsma\n\nKevin Bylsma is an accomplished pianist and vocal coach and is well-known in the Midwest for his work in art song, opera and oratorio. As head of music preparation for the Toledo Opera, he had coached productions of Tosca, The Tales of Hoffmann and The Magic Flute. He has served as music director of the Department of Community Programs for the Michigan Opera Theatre from 1993–97 and was vocal coach, accompanist and chorus master for OPERA! Lenawee from 1992 to 1997. Other music directing credits include the Lyric Chamber Ensemble of Detroit and the Papagena Opera Company of Ann Arbor. He has appeared throughout the United States, Canada and Europe as an organist, pianist and accompanist. In the summer of 1996, he toured Germany, Poland and the Czech Republic with tenor Robert Mirshak. Most recently, he has appeared in master classes and recitals with soprano Diana Soviero and mezzo-soprano Irina Mishura. He has served as principal keyboardist with the Adrian and Greater Lansing Symphony Orchestras and was the winner of a number of competitive awards, including the Robert Glasgow Organ Scholarship from the University of Michigan and the Lucille Mehaffie Young Artist Award. He currently serves as an instructor at Bowling Green State University and assistant organist at the historic Mariner’s Church in Detroit.\n\nJane Schoonmaker Rodgers\n\nSoprano Jane Schoonmaker Rodgers’ concert, recital, choral, and stage engagements have taken her around the world: New York, London, Vienna, and Prague, as well as to Chicago, Detroit, Toledo, Syracuse, and other Great Lakes cities. Recent activities have included performances and recordings with the Great Lakes Chamber Music Festival, Toledo and National Polish Radio Symphonies, Moravian Philharmonic, American Composers’ Alliance, Mid-American Center for Contemporary Music, and the Society for New Music. She appears frequently at KCH, including the annual Wine, Women and Song concerts. She is currently an associate professor of voice at Bowling Green State University."}, {"date": "2017-07-27T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1910282372573171/", "name": "Jamie Regiester - Scars of Funkenstein EP Release at Blind Pig", "description": "Jamie Register  will be releasing The Scars of Funkenstein at the Blind Pig wsg Nicole De'Sales Myint & Friends!\n\nThu. July 27 | 9pm | $10/under 21 $13"}, {"date": "2017-07-27T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1428470157216909/", "name": "TBT : 21+ get in Free", "description": "THROWBACK THURSDAY \nAll Your Favorite Music from the 80's, 90's & early 00's\n\nwith DJ\nNick Donovan\n\n• FREE cover for 21 & over. $10 for 18-20.\n\n• INCREDIBLE Drink Specials: $3.50 Well drinks, $2.50 Fireball shots, 3 for $10 Jaeger Bombs, $2 Miller Lite Bottles.\n\nLet's party like it's 1999."}, {"date": "2017-07-28T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/707503319446588/", "name": "Drink & Draw / Imbibe & Inscribe", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor."}, {"date": "2017-07-28T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/275887052817998/", "name": "Drag Bingo Friday July 28th Food Drinks Fun!", "description": "Come out and join Ypsilanti's hilarious Boylesque Bingo & Drag! You'll play 7 games of bingo and see fabulous performances by drag queens!\n\nBingo is $20 for seven games.\n\nFull dinner and drink menu with table service.\n\nFor reservations email jadeinblack@gmail.com\n\nWe will be raising money for an Amazing Gender Discussion Group for middle and high school kids who are gender nonconforming or transgender, and parent support group that run every 4th Tuesday of the month. These groups are free so we are trying to raise money to be able to have snacks availble for them! It's all done and paid for by volunteer parents and professionals\n\nHosted by Jadein Black Chanel Hunter\nMaxi Chanel, Ani Briated, and Tedi Rhinestone\n\nWith our amazing dj Edward Alan Wilcox!"}, {"date": "2017-07-28T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1904055123181927/", "name": "Fiction at Literati: Tal M. Klein", "description": "Literati is delighted to launch Tal Klein's debut novel, The Punch Escrow.\n\nIt’s the year 2147. Advancements in nanotechnology have enabled us to control aging. We’ve genetically engineered mosquitoes to feast on carbon fumes instead of blood, ending air pollution. And teleportation has become the ideal mode of transportation, offered exclusively by International Transport—a secretive firm headquartered in New York City. Their slogan: Departure... Arrival... Delight!\n\nJoel Byram, our smartass protagonist, is an everyday twenty-fifth century guy. He spends his days training artificial-intelligence engines to act more human, jamming out to 1980’s new wave—an extremely obscure genre, and trying to salvage his deteriorating marriage. Joel is pretty much an everyday guy with everyday problems—until he’s accidentally duplicated while teleporting.\n\nNow Joel must outsmart the shadowy organization that controls teleportation, outrun the religious sect out to destroy it, and find a way to get back to the woman he loves in a world that now has two of him.\n\n\"An alt-futuristic hard-science thriller with twists and turns you'll never see coming. I couldn't put it down.\" —Felicia Day\n\nTal M. Klein was born in Israel, grew up in New York, and currently lives in Detroit with his wife and two daughters. When she was five years old, his daughter Iris wrote a book called I'm a Bunch of Dinosaurs that went on to become one of the most successful children's book projects on Kickstarter --something that Tal explained to Iris by telling her, \"Your book made lots of kids happy.\" Iris then asked Tal, \"Daddy, why don't you write a book that makes lots of grownups happy?\" Tal mulled this over for a few years, and eventually wrote his first book, The Punch Escrow. It won the Inkshares Geek & Sundry Hard Science Fiction publishing contest, and will be the first book published on the Geek & Sundry imprint."}, {"date": "2017-07-28T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1796051343972754/", "name": "Bike-in :: Mark's & Bill's", "description": "Come join friends & neighbors for a fun, slow, community bike ride through Ann Arbor.\n\nThe fun starts at the Kerrytown Farmers Market and will continue at a leisurly pace around town, where we will \"bike-in\" to Mark's Carts and Bill's Beer Garden (https://goo.gl/maps/QxaxTTR172T2). After our ride, we'll enjoy some tasty food and/or beer.\n\nMeet up time is 7:00 PM (departing 7:15 PM). Plan on a nice & easy route, 10 miles or less, within city limits and a mid-ride stop. Check back later this month for route & other details to come. Until then, ride safe, be friendly, and have fun!\n\nIf you have further questions about BIke-in, please see the community page: https://www.facebook.com/bikeinannarbor/info?tab=page_info or ask below."}, {"date": "2017-07-28T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1719790804717129/", "name": "Acoustic Music Night w/ Emma Treganowan", "description": "The stage is yours! Sweetwaters is resuming Acoustic Music Nights, which are FREE performances by amazing local musicians. \n\nJoin us for an evening of classical and modern music from guitarist, Emma Treganowan! Emma has graduated from Interlochen Center for the Arts and currently attends the University of Louisville.\n\nLove live music? Support local artists and check out the performance over a nice cup of coffee or tea ☺\n\nIf you're interested in performing at the cafe, contact joshs@sweetwaterscafe.com"}, {"date": "2017-07-28T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/239779833186954/", "name": "Pointless Improv with Fat Man and Big Tom and Brenda", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Fat Man and Big Tom\nGroup 2: BRENDA (FKA Shadow League)\nGroup 3: The League of Pointless Improvisers"}, {"date": "2017-07-28T21:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1569661643084466/", "name": "The Cult Heroes / Human Skull at Blind Pig 7/28/17", "description": "Original Ann Arbor/Detroit punk rock and roll from The Cult Heroes wsg Human Skull & The Stains\n\nFri. July 28 | 9:30pm | $8/ under 21 $11"}, {"date": "2017-07-28T22:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/786589158181026/", "name": "A Pointless Display of Improvised Feats", "description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\nNo two shows are the same!\nTickets are $10."}, {"date": "2017-07-29T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/110325562894453/", "name": "Stewardship Workday", "description": "Volunteers are needed to remove invasive plants that provide little food for wildlife and crowd out native wildflowers. This park offers some interesting views of the river and has a small hidden prairie. Meet at the entrance on Sunset Road near Wildt Street. Please wear long pants and closed-toe shoes. Every participant must present a completed release form, and all minors should be accompanied by a guardian. Tools, snacks, and know-how provided."}, {"date": "2017-07-29T11:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1284193208358401/", "name": "Moving Image: Portraiture", "description": "Moving Image: Portraiture presents a contemporary spin on traditional notions of portraiture. In the video Towards An Architect, Hannu Karjalainen portrays a fictional architect who is experiencing the response of people living in the structures he designed. Daniel Rozin’s Mirror No. 10 is driven by software, written by the artist, that generates a real-time reflection of the environment the screen is displayed in—specifically a live sketch of the viewer approaching the frame. Mesocosm (Northumberland, UK) is an algorithmic work by Marina Zurkow that depicts the passage of time on the moors of Northeast England.\n\nMoving Image: Portraiture is the third of three exhibitions drawn from the collection of the Borusan Contemporary, Istanbul, which since 2011 has been focused on media arts. The works in this series address both formal concerns and conceptual topics; many represent traditional categories such as portraiture and landscape that find new resonance when explored through the strategies of dynamic technology.\n\nLead support for Moving Image: Portraiture is provided by the Herbert W. and Susan L. Johe Endowment and the University of Michigan Institute for the Humanities and Penny W. Stamps School of Art and Design."}, {"date": "2017-07-29T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/215961302258369/", "name": "WSBC Summer Party", "description": "Come celebrate summer at the tap room! Sample beers from our staff brew-off, post up in the beer garden, and enter our cornhole tournament! Live music will be rocking all day (Michael May and the Messarounds on the day-side from 1-3; Third Coast Kings on the night-side from 8-10 pm). We'll have outdoor games, a service station (read: tiki bar) in the beer garden, and a pig roast to keep your bellies happy! \n\nAll spring and summer, staff have been brewing beers on our pilot system to debut at the Summer Party! Vote for your favorite with tokens (available for purchase at $1 apiece). ALL proceeds benefit Food Gatherers and their mission to help make sure kids don't go hungry this summer! \n\nAdmission is free, and kids are welcome! Don't miss this summer celebration!"}, {"date": "2017-07-29T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/492964431039155/", "name": "Improv Workshop: Slow Down! Objects at Work", "description": "Performing object work is as important to improv as speaking to your scene partner. In this workshop, we'll make the objects work for us as an extension of our scene work. We'll help you communicate to the audience and your scene partners what the heck you're doing with your hands and why slowing the process down will make your actions more believable.\n\nInstructor: Chris Moody\nPrerequisite: All levels welcome\nWorkshop Length: 3 Hours\nWorkshop Size: Maximum of 16 students\nCost: $30"}, {"date": "2017-07-29T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/326901677723970/", "name": "Icebreakers^2", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor."}, {"date": "2017-07-29T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/348925108860901/", "name": "July Picnic ", "description": "If you had fun in June, come back for July! The 2nd Biergarten festival of the season is set for Saturday, July 29th. Gates open at 4pm! Admission is $5 (we now have an ATM available!). 21 and older unless with a parent. Hope to see you!"}, {"date": "2017-07-29T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/912523245566923/", "name": "Joan Belgrave and Kirk Lightsey: Marcus Belgrave 60th Birthday", "description": "Ann Arbor Native, vocalist Joan Belgrave first started singing at Ann Arbor's Second Baptist church, went on to study classical voice, and is now known in jazz, blues, gospel, and R&B circles. A versatile singer and natural entertainer, Belgrave is a proven crowd-pleaser with original compositions and new takes on classics—including a recent Dinah Washington tribute.  \n\nJoan Belgrave, voice\nKirk Lightsey, piano\nIbrahim Jones, bass\nAlex White, drums\n\nThe widow of Jazz Legend Marcus Belgrave, this show will include music celebrating the legacy of her late husband.\n\nTonight she is joined by their good friend, 80-year-old piano legend Kirk Lightsey, who has worked with such greats as Dexter Gordon, Pharoah Sanders, and Kenny Burrell and has accompanied vocalists like Betty Carter and Gregory Porter. Joan and Kirk will be fresh off their performance at New York's Dizzy's Club Coca Cola.\n\n$35 Assigned Rows 1-2\n$25 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\n*As a special gift, every assigned seat ticket holder will receive a copy of Marcus Belgrave’s 2009 Kresge Eminent Artists profile book and CD."}, {"date": "2017-07-29T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/321295184966981/", "name": "Pointless Improv with Hot Gold and Break Time Lab Rats", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Hot Gold\nGroup 2: Break Time Lab Rats \nGroup 3: The League of Pointless Improvisers"}, {"date": "2017-07-29T21:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1379907578783344/", "name": "Tru Klassick At The Blind Pig", "description": "Tru Klassick Live At Blind Pig - Ann Arbor, MI\n(Also Celebrating The Birthdays of Tru Klassick & Sigidy)\n\nw/ Special Guests:\nBully Camp\nE-Fav & Ilajide of Clear Soul Forces\n\nPlus Performances by:\nSigidy\nSoulO Sound\nJ-Classic\nBlas FaMe\nIam Ryan Raw\n\nSounds by Dante LaSalle & Jimbo Jones\n\nFriday July 29th @ The Blind Pig\n208 S. 1st St. Ann Arbor, MI\nDoors@930PM $8 for 21+/$11 for 18-20"}, {"date": "2017-07-29T22:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/833676543464265/", "name": "Pointless Improv with Break Time Lab Rats and Hot Gold", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Break Time Lab Rats \nGroup 2: Hot Gold\nGroup 3: The League of Pointless Improvisers"}, {"date": "2017-07-30T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/844217169074676/", "name": "Things with Wings", "description": "An afternoon of free family fun! Learn about our winged friends and interact with them, too. Drop in for one event or stay for the afternoon. Featuring: Leslie Science & Nature Center with live birds of prey; Ann Arbor Backyard Beekeepers; face painting by Doodlebug Ink; Monarch Watch with live butterflies and information on monarchs; crafts. All events are free."}, {"date": "2017-07-30T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/241662302979934/", "name": "Stewardship Workday", "description": "This large park (almost 90 acres) is next to natural areas owned by the County and the University of Michigan. The large area of natural habitat makes each part of it that much more valuable for conservation. Volunteers are needed to help remove invasive plant species that are invading the open woodlands and meadows here. Meet in the parking lot off Dixboro Road, north of Plymouth Road. Please wear long pants and closed-toe shoes. Every participant must present a completed release form, and all minors should be accompanied by a guardian. Tools, snacks, and know-how provided."}, {"date": "2017-07-30T14:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1358931210851816/", "name": "Guided Tour - Victors for Art: Michigan Alumni Collectors Part 2", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni on the global art world. This exhibition features works collected by a diverse group of alumni and the artworks themselves span 3,500 years of art making. Victors for Art offers visitors an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not together. \n\nPresented in two parts—Figuration (February 18-June 11, 2017) and Abstraction (July 1-October 29, 2017), this second part, Abstraction, invites visitors to explore the pleasures of abstraction across a wide range of media, eras, and\ngenres. UMMA docents will explore the work of artists such as Pablo Picasso, Alberto Giacometti, Louise Nevelson, Christo, Lorna Simpson, José Parlá, Kenojuak Ashevak, and Do Ho Su, as well as other treasures such as a fifth-century Korean roof end tile, and an Amish quilt.\n\nLead support for Victors for Art: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, Michigan Medicine, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office."}, {"date": "2017-07-30T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/143926156169559/", "name": "Meet Me at UMMA: A Museum Arts Experience", "description": "Meet Me at UMMA invites people with mild memory loss to enjoy a guided gallery experience along with family members or care partners. This program is designed for people who live at home and their companions.\n\nIf you or someone you care about is experiencing mild memory loss, research has shown that the visual and expressive arts can be good for your mind. In addition, great enjoyment is to be found in seeking out the sights, sounds, textures, and good feelings that come with looking at, learning, and sharing feelings about paintings, music, and other creative arts. UMMA's trained docents will accompany small groups for a guided tour and provide the opportunity for everyone to experience different kinds of art and share their responses.\n\nMeet Me at UMMA is generously supported by the Monroe-Brown Foundation Discretionary Fund for Outreach to the State of Michigan and individual donors.\n\nTo register for this program, email kmpeil@alz.org, or call the local Alzheimer’s Association 800.272.3900 at any time. For more information, please contact UMMA at 734.647.0522 during normal business hours."}, {"date": "2017-07-30T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/324366624667653/", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor."}, {"date": "2017-07-30T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/100636800570173/", "name": "The Arcade - A Pointless Improv Jam", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play, pay-what-you-can."}, {"date": "2017-08-02T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/285106655298182/", "name": "Family Fun Day", "description": "Join us for family fun at the Farmers Market! Volunteers are needed for kid’s activities, a water station, set up, and take down. We are looking for volunteers who might want to face paint or run games for kids. We currently have the morning market available during 10am-12pm. Let us know if you are interested: volunteer@a2gov.org or 734-794-6445."}, {"date": "2017-08-02T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/336063620159588/", "name": "“Emerging”, Artists of Hannan Center Detroit- Gallery Reception", "description": "The mission of Detroit's Luella Hannan Center for Creative Aging is to foster a community of shared learning and support, encouraging older adults to contribute their knowledge, skills and perspective in a variety of ways to benefit themselves and the greater community.\n\nArtists Featured: \n\nCharlene Whittle\nBetty J. McGraw\nJoya Rush-Keli\nGayle Watson\nShirley Pope Lolles\nMichelle Lawhorn\nJulie Baker\nLammie Mitchell\nRandy \"Karaga\" Chatman\nBarabara Jones\nIrene \"Nishkama\" Ryke\nMiguel Pope\nNancy Wolfe\n\n\n“Emerging”\nby Nancy Wolfe\n\nFirst step: Accept your status as a caterpillar,\nno matter your age.\nSecond step: Spin your cocoon in a space not easily found.\nTune your instrument, develop your wings and\ntrust who you have become.\nThird step: Take flight - accept your lines, shapes, bumps, and squiggles.\nAll will follow your path with a sigh\nand see music with their eyes.\nYes Butterfly,\n“Emerged”\n\nGallery Reception: Wednesday, August 2nd from 4-7 PM\nExhibit showing Friday, July 28th - Friday, September 1st\n\nThis exhibit will be available for viewing Monday – Friday, 10:30 am to 4 pm; during public concerts, and by appointment. For more information or to make an appointment, call 734-769-2999."}, {"date": "2017-08-02T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/826855297478883/", "name": "Oneita Jackson", "description": "Literati is pleased to host Oneita Jackson in support of her books, Letters from Mrs. Grundy and Nappy-Headed Negro Syndrome.\n\nOneita Jackson is a satirist and Detroit cab driver who has an English degree from Howard University.  She was a copy editor for 11 years at the Detroit Free Press.  During that time, she served as public editor, wrote music reviews, edited on the Features, Nation/World, and Web desks, and received awards for her headlines.  She was a member of the Accuracy and Credibility Committee and the Editorial Endorsement Board for the 2008 City of Detroit mayoral and City Council elections.   She also wrote the “O Street” column for three years; it received the newspaper’s 2008 Columnist of the Year award.  She stopped writing the column in May 2010 and returned to the News Copy Desk, where she stayed until August 2012.  Her next adventure was driving a yellow cab.  Her book, Nappy-Headed Negro Syndrome,  features observations and commentary on people and culture.  These stories about identity are written by a woman who is uniquely, unabashedly, and extraordinarily herself. A native of Dayton, Ohio, Oneita spent her summers in New York City and has lived in Washington, D.C., and Albany, N.Y.  She now lives in Detroit. Oneita was recently profiled by Mercedes-Benz."}, {"date": "2017-08-02T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1585489868138543/", "name": "Hashtag Comedy Showcase", "description": "Hashtag Comedy Showcase combines stand-up comedy, sketch and multimedia to make this an engaging dynamic show.   Featuring some of Metro Detroit's finest comedians and lovable hosts Darnell Anderson and KJ.\n\nWednesday, August 2nd\nDoors open at 7:00pm, show starts at 7:30pm\nTickets: $10"}, {"date": "2017-08-03T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/218397305328984/", "name": "The Record Company / Sonic Lunch / August 3rd / Noon Free", "description": "Bank of Ann Arbor's Sonic Lunch is an awesome outdoor summer concert series that rocks Ann Arbor's Liberty Plaza Thursdays at lunch time each summer. Look for news and announcements year-round and concerts to kick off in June 1, 2017. Sonic Lunch is free and open to all ages! Lawn chairs and furry friends are welcome. Tell all your friends about one of the events that make summer in Ann Arbor super cool!  Bank of Ann Arbor appreciates the support of Ann Arbor’s 107one fm and Perich Advertising + Design.\nhttp://www.soniclunch.com \n\nThe Record Company write and play raw, sincere rock n' roll. Influenced by the rough honesty of their heroes--bluesmen like John Lee Hooker, early punk bands like The Stooges, and rock greats like The Rolling Stones--their sound incorporates slide guitar, distorted bass, a garage-sale Ludwig drum kit and the heartland-hued voice of Chris Vos, who grew up on a Wisconsin dairy farm. The three-man group started in late 2011, hanging up some old mics and recording live in the bass player's living room in Los Feliz, CA. The Record Company have since played concert halls across North America, opening for acts as diverse as B.B. King, Social Distortion, Buddy Guy, Grace Potter, and Trombone Shorty. The band toured Europe supporting Blackberry Smoke in Oct-Nov 2015, and their first full-length album came out on Concord Records on February 12, 2016."}, {"date": "2017-08-03T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1387963634606317/", "name": "Brass Tacks Ensemble presents The Merchant of Venice", "description": "Artistic Director James Ingagiola and Executive Director Isaac Ellis are pleased to announce The Brass Tacks Ensemble will be presenting The Merchant of Venice by William Shakespeare from August 3 through 5, 2017 at the Kerrytown Concert House (415 N. 4th Ave in Ann Arbor).\n\nThu - 8/3/2017 - 8:00pm\nFri - 8/4/2017 - 8:00pm\nSat - 8/5/2017 - 2:00pm\nSat - 8/5/2017 - 8:00pm\n\n$15 General Admission\n$5 Student\n\nJames Ingagiola, director\nWilliam Shakespeare, playwright\nBrittany Batell\nMary Conley\nIsacc Ellis\nEthan Gibney\nSara Long\nVeronica Long\nKathleen E. Marinan\nAmanda Photenhauer\nAnne S. Rhoades\nRuss Schwartz\nKate Topham\nElizabeth Wagner\n\nSince 1999, with their inaugural production of King Lear, The Brass Tacks Ensemble has been dedicated to producing shows that strip away the excess and focus on the essentials of theater: Actor. Text. Audience. The Brass Tacks Ensemble is devoted to connecting to the audience through the essential elements of theater to spark the imagination; presenting established and original works with a focus on clarity, universality, and entertainment; and providing actors, directors, designers, and writers opportunity to develop as artists."}, {"date": "2017-08-03T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1116234321853953/", "name": "Michelle Kuo: Reading with Patrick", "description": "Literati is pleased to welcome Michelle Kuo in support of her memoir, Reading with Patrick.\n\nA memoir of race, inequality, and the power of literature told through the life-changing friendship between an idealistic young teacher and her gifted student, jailed for murder in the Mississippi Delta. \n\nRecently graduated from Harvard University, Michelle Kuo arrived in the rural town of Helena, Arkansas, as a Teach for America volunteer, bursting with optimism and drive. But she soon encountered the jarring realities of life in one of the poorest counties in America, still disabled by the legacy of slavery and Jim Crow. In this stirring memoir, Kuo, the child of Taiwanese immigrants, shares the story of her complicated but rewarding mentorship of one student, Patrick Browning, and his remarkable literary and personal awakening.\n\nConvinced she can make a difference in the lives of her teenaged students, Michelle Kuo puts her heart into her work, using quiet reading time and guided writing to foster a sense of self in students left behind by a broken school system. Though Michelle loses some students to truancy and even gun violence, she is inspired by some such as Patrick. Fifteen and in the eighth grade, Patrick begins to thrive under Michelle’s exacting attention. However, after two years of teaching, Michelle feels pressure from her parents and the draw of opportunities outside the Delta and leaves Arkansas to attend law school.\n\nThen, on the eve of her law-school graduation, Michelle learns that Patrick has been jailed for murder. Feeling that she left the Delta prematurely and determined to fix her mistake, Michelle returns to Helena and resumes Patrick’s education—even as he sits in a jail cell awaiting trial. Every day for the next seven months they pore over classic novels, poems, and works of history. Little by little, Patrick grows into a confident, expressive writer and a dedicated reader galvanized by the works of Frederick Douglass, James Baldwin, Walt Whitman, W. S. Merwin, and others. In her time reading with Patrick, Michelle is herself transformed, contending with the legacy of racism and the questions of what constitutes a “good” life and what the privileged owe to those with bleaker prospects.\n\nReading with Patrick is an inspirational story of friendship, a coming-of-age story of both a young teacher and a student, a deeply resonant meditation on education, race, and justice in the rural South, and a love letter to literature and its power to transcend social barriers.\n\n“This book is special and could not be more right on time. It’s an absorbing, tender, and surprisingly honest examination of race and privilege in America that helps articulate what is often lost, seemingly intentionally, in national debates over criminal justice and education: the inner life and imagination of a young person.”—Wes Moore, author of The Other Wes Moore \n\nMichelle Kuo taught English at an alternative school in the Arkansas Delta for two years. After teaching, she attended Harvard Law School as a Paul and Daisy Soros Fellow, and worked legal aid at a nonprofit for Spanish-speaking immigrants in the Fruitvale district of Oakland, California, on a Skadden Fellowship, with a focus on tenants’ and workers’ rights. She has volunteered as a teacher at the Prison University Project and clerked for a federal appeals court judge in the Ninth Circuit. Currently she teaches courses on race, law, and society at the American University in Paris."}, {"date": "2017-08-03T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1833531226961835/", "name": "Punk and Doom (II) at the Pig", "description": "Terrible as the Dawn -- chimeric experimental hardcore\nhttps://terribleasthedawn.bandcamp.com/releases\nhttps://www.facebook.com/terribleasthedawn/\n\nKing Under the Mountain -- fuzzy instrumental doom\nhttps://www.facebook.com/King-Under-the-Mountain-257361774605095/\n\nDaisys -- catchy, melodic punk rock\nhttps://www.facebook.com/daisystheband/\n\nNormal Park -- clean guitar emo/indie\nhttps://www.facebook.com/normalparkband/\n\ndoors at 9pm \n$7 ($10 under 21)"}, {"date": "2017-08-03T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/156257121611842/", "name": "TBT : 21+ get in Free", "description": "THROWBACK THURSDAY \nAll Your Favorite Music from the 80's, 90's & early 00's\n\nwith DJ Nick Donovan\n\n• FREE cover for 21 & over. $10 for 18-20.\n\n• MAGNIFICENT Drink Specials: $3.50 Well drinks, $2.50 Fireball shots, 3 for $10 Jaeger Bombs, $2 Miller Lite Bottles.\n\nMake sure to get your old school fix in before it's too late - this is LAST tbt of the summer!"}, {"date": "2017-08-04T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/431795093852172/", "name": "OUTFest & Pride Picnic 2017", "description": "Join us for OUTFest 2017 -- Ann Arbor's LGBTQ Pride Celebration. \n\nOUTFest, an annual pride celebration hosted by Jim Toy Community Center, returns to Ann Arbor's Kerrytown District with an array of activities for the lesbian, gay, bisexual, transgender, queer (LGBTQ) and allied communities. Weekend events are open to all attendees!\n\n~Friday, August 4~\nMovie Night at Braun Court (Hairspray): 9:00 PM\nNecto Pride w/ Katya at Necto: 9:00 PM - 2:00 AM\n\n~Saturday, August 5~\nStreet Festival & Vendors: 10:00 AM - 8:00 PM\nUnderground Yoga: 10 - 11:00 AM\nKid Zone: 10:00 AM - 6:00 PM\nDJ Selina Style: 11:00 AM - Noon\nBeverage Area: Noon - 11 PM\nRedi & the Midnight Hour: 1 - 2:00 PM\nDrag Revue: 3 - 4:00 PM\nOut Loud Chorus: 4:30 - 5:00 PM\nBurlesque Show: 6 - 7:00 PM\nDrag Revue: 7 - 8:00 PM\nTodrick Hall: 8 - 9:00 PM\nNecto's DJ Digi Mark: 9 - 11 PM\nAfter Party at Aut Bar: 11PM\n\n~Sunday, August 6~\nPride Picnic at Wheeler Park: Noon - 4:00 PM\n\nPresenting Sponsor: Necto Nightclub\nMain Stage Sponsor: Comcast\nKid Zone Sponsor: Duo Security\nOfficial Wine Sponsor: Barefoot Wine & Bubbly\n\nFor more info visit: www.a2outfest.com"}, {"date": "2017-08-04T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1357490684326501/", "name": "Arbor Brewing Company 22nd Anniversary Party", "description": "We're turning the Olde No. 22 this year, and to celebrate we're throwing a party! We'll be bringing back Olde #22 for this one, along with a couple other special beers for you. \n\nParty and lawn games will also be happening, cornhole, giant jenga, and other fun backyard games. \n\nFor entertainment we'll have: \n- Halcyon Sound DJ set (Our own Dannyboy Perron): 5pm-7pm\n- Mr. Largebeat's Rockasaurus (The Historic Return) 7:15pm-8:15pm\n- Isaac Ryder (formerly Joel Rydecki Band) 8:30pm-11:30pm"}, {"date": "2017-08-04T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/968451083297528/", "name": "Game Night at the Ultralounge", "description": "Game Night returns to the historic Ultralounge in this throwback event on Friday August 4th from 6:00pm to 9:00pm! Our expert Game Masters will be on hand and ready to introduce you to a stack of the best board games available at Vault of Midnight! Whether you are a first time gamer or a seasoned mage, Vault of Midnight's Game Night is a great way to discover new games! A ticket for the event not only reserves your space at Game Night, it also gets you 10% off any game in the store on the day of the event. Act fast because space is limited and will sell out! Bring a friend or come alone, Game Night is a great way to meet new people!\n\nBuy Tickets: http://buytickets.at/vaultofmidnight1/107657"}, {"date": "2017-08-04T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/411880499206318/", "name": "Movie Night: Hairspray", "description": "Join us for our OUTFest outdoor movie night on Friday, August 4 at 9:00 p.m. in Ann Arbor's Kerrytown District near Braun Court! We'll be showing Hairspray, staring John Travolta, Zac Efron, Queen Latifa, Michelle Pfeiffer, Christopher Walken, Amanda Bynes and more. We'll have a giant blowup movie screen to watch this 2007 musical!\n\nWe'll have Domino's Pizza, popcorn, pop and water available!\n\nSuggested Donation: \nAdults - $5.00, Children (18 and under) - Free\nAll proceeds benefit the Jim Toy Community Center."}, {"date": "2017-08-05T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1184632544982011/", "name": "Stewardship Workday", "description": "This park has come a long way from its past as a gravel quarry. Now bicyclists, dog owners, soccer players and hikers all use it. Volunteers are needed to hand-pull invasive weeds where they are invading open meadows. There are several uncommon species of butterflies in this park that use these open spaces. Meet at the entrance on Dhu Varren Road, just east of Pontiac Trail. Please wear long pants and closed-toe shoes. Every participant must present a completed release form, and all minors should be accompanied by a guardian. Tools, snacks, and know-how provided."}, {"date": "2017-08-05T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/131524214079602/", "name": "Stewardship Workday", "description": "Come on out to experience a woods filled with oak, hickory, maple and dogwood. Volunteers will work on removing summer invasive plant species, like Japanese hedge parsley, which have a negative impact on wildlife habitat. This is a great park to bring families out to enjoy a day outdoors. Meet us on Tibbits Ct, off of Pontiac Trail. Please wear long pants and closed-toe shoes. Every participant must present a completed release form, and all minors should be accompanied by a guardian. Tools, snacks, and know-how provided."}, {"date": "2017-08-05T17:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/466725167033212/", "name": "Ann Arbor Roller Derby Presents: Derby Double-Header, Bout 4", "description": "Join Ann Arbor Roller Derby at Buhr Park on August 5th for a Derby Double Header! Two great roller derby mash ups for one low price! \n\n6:00 - Arbor Bruising Co. vs. Team Michigan. The Bruisers will test their skills against Team Michigan, a state-wide team consisting of some of the best derby skaters in Michigan. Come find out who will be victorious! \n\n7:30 - Ypsilanti Vigilantes vs. Shipwreck Alley Rollers. Hailing from Alpena, Michigan, the Shipwreck Alley Rollers are visiting Ann Arbor to play in their first ever away bout. Come see what these teams can do!  \n\nBouts include kid-friendly activities, half-time entertainment, sponsored concessions, and merchandise from both teams. Enjoy locally-brewed beer and cider from the Ypsi Alehouse while you watch the games! \n\nDoors open at 5:30, first whistle at 6:00!\n\nAdmission \n$12 pre-sale (see link below)\n$20 season pass (includes this bout and September 16th bout - http://bpt.me/2984901)\n\nAt the door\n$12 for students/seniors/military with I.D.\n$15 at the door \nKids under 12 get in FREE with paid admission (2 for each paying adult).\n\nJoin us for the after party at Ypsi Alehouse!\n124 Pearl St\nhttp://ypsialehouse.com/"}, {"date": "2017-08-05T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1900688943553735/", "name": "Kevin Devine & the God*amn Band at Blind Pig 8/5/17", "description": "Sat. August 11 | 9pm | $14 adv./ $16 day of | 18+\n\nKevin Devine & the God*amn Band\nwith: The Dig\n\nKEVIN DEVINE is used to living life in the gray. For the past 14 years, the Brooklyn-based singer/songwriter has oscillated between As and Bs: intimate acoustic moments and bombastic rock songs; deeply introspective lyrics and sociopolitical charges; the storm cloud and its silver lining.\n\nTickets:  https://goo.gl/Q2aEvW"}, {"date": "2017-08-05T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/490178644662668/", "name": "The Backeddies at Crazy Wisdom!", "description": "Please join us for our debut appearance at one of the best listening rooms in Ann Arbor, Crazy Wisdom Tearoom!  \n\nWe (Shannon, Janet & John) are excited to bring our acoustic Americana collection of originals and covers to your listening ears!  We all trade leads and sing harmony for each other, bringing you three part harmonies and killer guitar solos, by the one and only, John Baltic!  Hope to see you there! \n\n-The Backeddies"}, {"date": "2017-08-05T20:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/115764142377952/", "name": "Bad Television / Convenient, Trash. & More!", "description": "Come hang out and support some killer locals!\n\nDoors at 8:30 pm\nMusic at 9:00 pm\n\n$8 for 21+\n$10 for under 21\n\nBad Television:\nhttps://badtelevision.bandcamp.com/releases\n\nConvenient, trash. :\nhttps://convenienttrash.bandcamp.com/album/convenient-trash\n\nConway:\nhttps://conwayband.bandcamp.com\n\nFallow Land:\nhttps://fallowland.bandcamp.com/\n\nBleak Falls:\nhttps://itsbleakfalls.bandcamp.com/"}, {"date": "2017-08-05T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/767832443341688/", "name": "Blue Walls (Toledo OH) Human Skull Cig Butts Curfews", "description": "Blue Walls\n(Young gents from Toledo, OH )\nwww.facebook.com/bluewalls419/\nm.soundcloud.com/blue-walls\n\nHuman Skull\n(We all got one, amiright?)\nwww.facebook.com/humanskullband/\nhumanskull.bandcamp.com\n\nCig Butts \n(More than enough to fill an old coffee can, you're gonna love it!)\nwww.facebook.com/cigbuttsmusic/\nwww.cigbutts.com\n\nCurfews\n(Marquette, MI They can't stay late)"}, {"date": "2017-08-06T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/160260747855619/", "name": "Pride Picnic!", "description": "Join us for the 2017 Washtenaw County Pride Picnic on Sunday, August 6 from noon to 4:00 p.m. at Wheeler Park! Each year, the Jim Toy Community Center brings together families and friends to celebrate our amazing community. We'll have food, fun, games, bubbles, music, yoga and even a bounce house! \n\nPicnic Meal\nIncludes veggie and meat brats from The Wurst Bar, hot dogs, and delicious sides as well. \n\nMimosa station for adults 21+! \n\nSuggested Donation: \nAdults - $5.00\nChildren (18 and under) - Free\nAll proceeds benefit the Jim Toy Community Center"}, {"date": "2017-08-07T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1886522101666582/", "name": "Global Spark! Camp", "description": "Spinning Dot Theatre is excited to bring you this interdisciplinary and interactive camp! In collaboration with A2CT, Global Spark! combines theater arts, movement, music and visual arts as well as language skills in multiple foreign languages. The culmination of the camp is a performance crafted from top to bottom by the young people - thus providing them learning experiences in not only acting but choreography, directing, costumes, lighting, set design, producing, etc.\n\nAugust 7-18, 2017 \nMonday-Friday, 9am-12pm \nFor kids in GRADES 2-7 (in the fall of 2017)\nCOST: $270 before June 1, 2017; $290 after June 1, 2017"}, {"date": "2017-08-07T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/826314904217133/", "name": "Lynne Cox: Swimming in the Sink", "description": "Literati is thrilled to welcome Lynne Cox in celebration of the paperback release of her latest memoir, Swimming in the Sink.\n\nIn this stunning memoir of life after loss, open-water swimming legend and bestselling author of Grayson and Swimming to Antarctica Lynne Cox tells of facing the one challenge that no amount of training could prepare her for.\n\nA celebrated athlete who set swimming records around the world, Lynne Cox achieved astonishing feats of strength and endurance. She was the first to swim the frigid waters of the Bering Strait, the Strait of Magellan, and the coast of Antarctica, and she was the fastest to swim the English Channel. But it is a different kind of struggle that pushes her to the brink. In a short period of time, Lynne loses her father, and then her mother, and then Cody, her beloved Labrador retriever. Soon after, Lynne herself is diagnosed with a life-threatening heart condition that leaves her unable to swim and barely able to walk. \n\nBut against all odds, and with the support of her friends and family, Lynne begins the slow pull toward recovery, reaching always for the open waters that give her the freedom and mastery that mean everything to her. What follows is a beautifully poignant meditation on loss and an exhilarating celebration of life as, to Lynne’s surprise, she begins to find, within the unfamiliar space of vulnerability, the greatest treasures—like falling in love.\n\nLYNNE COX was born in Boston, Massachusetts, and grew up in Los Alamitos, California. She has held open-water swimming records all over the world, swimming without a wetsuit. Cox has been inducted into the International Swimming Hall of Fame. Her articles have appeared in many publications, among them The New Yorker, The New York Times, and the Los Angeles Times Magazine. Cox lives in Long Beach, California."}, {"date": "2017-08-08T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/131719674074191/", "name": "BBQ Special Dinner: A Meditation on Tennessee Tradition", "description": "Whole hog bar-b-que is a craft, and the mindfulness for perfecting the method is not gained overnight. That’s why we’re so excited to welcome Pat Martin of Martin’s Bar-B-Que Joint in West Tennessee to the Roadhouse.\n\nWith over 25 years of hands-on experience and focus, Pat creates falling-off-the-bone tender, moist, and smoky meat. His technique involves smoking hogs for a full 24 hours!\n\nPat and his apprenticed crew of pitmasters come into Martin’s at 5am, seven days a week, to start their pigs a full day ahead of service. Everything they make, including their sauces, is cooked from scratch—and passion. Now that’s dedication to full flavor!\n\nJames R. Veteto and Ted Maclin, co-authors of The Slaw and the Slow Cooked: Culture and Barbecue in the Mid-south, say this about the Tennessee tradition: “The act of smoking barbecue has a certain Zen-like quality: minimalist, with an abiding awareness of temperature, smoke concentration, and the particulars of the meat. It is a meditation on time, smoke, and flesh that requires non-action as much as decisiveness.”\n\nPat Martin opened the first Martin's Bar-B-Que Joint in October of 2006 in Nolensville, Tennessee, just south of Nashville. Today, there are four locations in the area, and they’ve been featured on the Food Network, Travel Channel, Cooking Channel, and The Today Show and in publications such as Bon Appetit, Esquire, Conde Nast Traveler, and Men’s Journal.\n\nWe welcome Pat to Zingerman’s Roadhouse on Tuesday, August 8th, to enlighten us on how the tradition of slow-process bar-b-que can transform your palate. Don’t miss out on experiencing a new regional barbecue technique and the discovery of transcending what we know about flavor!"}, {"date": "2017-08-08T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1978674785699472/", "name": "Ben Jansson Quartet", "description": "Ben Jansson, tenor saxophone\nRick Roe, piano\nPaul Keller, bass\nSean Dobbins, drums\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nThis all-star group showcases compositions by Michigan native Jansson, who combines modern harmonic and rhythmic ideas within a traditional jazz quartet setting. The group's sound is inspired by the early style of the Stan Getz Quartet, as well as the quartets of Joe Henderson and John Coltrane.\n\nThis performance is made possible through the generous support of John Lilley & Connie Cronenwett.\n\nOriginally from Ann Arbor, MI, jazz saxophonist Ben Jansson has been living in Japan for the past three years. Jansson has played jazz festivals and clubs throughout the country on a steady basis. As well, Ben has accompanied American musicians playing in Japan including playing with Americans: NYC drummer Gene Jackson and trumpeter Neil Stalnaker. In Michigan, Ben has played gigs with bassist Paul Kellers ensemble, PKO big band, Randy Napoleon Sextet, John Shea trio, Pete Siers “Organic Roots” band, Sean Dobbins, Johnny Trudell. As well Jansson has played gigs backing up Aretha Franklin, Freddy Cole, Johnny Mathis. He has two CD’s “Your Soul”, 2012 and “Sweetie Pie”, 2006 and has appeared on recordings by Paul Keller, Pete Siers, Randy Napoleon, and the “Masters of Music” big band featuring Peter Erskine."}, {"date": "2017-08-09T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/660329630830992/", "name": "Fiction at Literati: Molly Patterson", "description": "Literati is delighted to welcome Molly Patterson in support of her debut novel, Rebellion. \n\nA sweeping debut that crosses continents and generations, Rebellion tells the story of Addie, Louisa, Hazel, and Juanlan: four women whose rebellions, big and small, are as unexpected as they are unforgettable.\n\nAt the heart of the novel lies a mystery: In 1900, Addie, an American missionary in China, goes missing during the Boxer Rebellion, leaving her family back home to wonder at her fate. Her sister Louisa—newly married and settled in rural Illinois—anticipates tragedy, certain that Addie’s fate is intertwined with her own legacy of loss.\n\nIn 1958, Louisa’s daughter Hazel has her world upended by the untimely death of her husband. It’s harvest time, and with two small children and a farm to tend, she is determined to keep her land and family intact. Yet even while she learns to enjoy her independence, Hazel realizes that the tradeoff for some freedoms is more precious than expected.\n\nNearly half a century later, Juanlan has returned to her parents’ home in Heng’an. With her father ill, her sister-in-law soon to give birth, and the construction of a new highway rapidly changing the town she once knew, she feels pressured on every side by powers outside her control. Frustrated by obligation and the smallness of her own dreams, Juanlan at last dares to follow desire, only to discover an anger that cannot be contained.\n\nMoving from rural Illinois to the far reaches of China, Rebellion brilliantly links through action and consequence the story of four women, spanning more than a century. From the secrets they keep and the adventures they embark on, to the passions that ultimately drive them forward, the characters at the center ofthis electric debut dramatically fight against expectation in pursuit of their own thrilling fates.\n\n\"Molly Patterson is a writer of the first order, and her debut novel is a revelatory, immersive miracle. Ambitious in scope and exacting in its language, Rebellion becomes a grand exploration of fate and circumstance.\"—Claire Vaye Watkins, author of Gold Fame Citrus\n\nMolly Patterson was born in St. Louis and lived in China for several years. The winner of a 2014 Pushcart Prize, she was also the 2012-2013 writer-in-residence at St. Albans School in Washington, DC. Her work has appeared in several magazines, including the Atlantic and the Iowa Review. Rebellion is her first novel."}, {"date": "2017-08-09T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1024763767658923/", "name": "Mike Felten, Secret Emchy Society, & Ryan A Roth & the Sideshow!", "description": "Twang-Fueled Indie Rocker CINDY EMCH, Folk Troubadour MIKE FELTEN, and Boot Stompers Ryan A Roth and the Sideshow Are Coming to The Heidelberg\n\nCindy Emch, the “Emchy” at the heart of the “Secret Emchy Society,” writes and performs “heartbreakin' footstompin' old-school country music.” With turns that are happy, sad, heartbreaking and humble, her new album The Stars Fall Shooting Into Twangsville will be released on July 21. Yahoo! Music recently premiered the New Orleans/Carter Family-inspired, \"Two Feet and a Dream,” the album’s lead track and first single. “Jagged Edges,” a duet with Canadian alt-country singer Tolan McNeil, will be released as the second single on July 13.\n\nChicago-based Felten, who hit #1 on the ReverbNation singer-songwriter chart in 2016, issued Diamonds and Televisions on St. Patrick’s Day. Dubbed “Outsider Americana,” Felten draws Comparisons to John Prine, Steve Goodman, Woody Guthrie and early Bob Dylan. On Diamonds, echoes of Bo Diddley’s primal shave-and-a-haircut rhythm careen through the opening “It All Ends Here” while “Statue Of Liberty” makes a very belated debut on record as the song was written 50 years ago. Rural Roots Music Commission anointed Diamonds and Televisions its “Album of the Year.\"\n\nMichigan based troupe Ryan A Roth and the Sideshow perform music born from the midnight rambles and southern gospel tent revivals riding up through the Mississippi delta into the heartland. Rumbling like a tornado twister, steam train rumbling down the line pulling a load of scrap steal to be thrown into the furnaces of the rustbelt pounded out by the hands sweat and blood of the working man."}, {"date": "2017-08-10T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1923651817875545/", "name": "Sonic Lunch / May Erlewine & The Motivations August 10th / Free", "description": "Bank of Ann Arbor's Sonic Lunch is an awesome outdoor summer concert series that rocks Ann Arbor's Liberty Plaza Thursdays at lunch time each summer. Look for news and announcements year-round and concerts to kick off in June 1, 2017. Sonic Lunch is free and open to all ages! Lawn chairs and furry friends are welcome.\nTell all your friends about one of the events that make summer in Ann Arbor super cool! \nBank of Ann Arbor appreciates the support of Ann Arbor’s 107one fm and Perich Advertising + Design.\n\nAugust 10th \nMay Erelwine & The Motivations \nhttp://www.mayerlewine.com \nMay’s big band soul project has Michigan dancing in the streets! \nSome people might call May Erlewine “Michigan’s darling songbird”, but her songs have traveled far beyond her home state. One of the most prolific and passionate songwriters of her generation, May’s music has touched the hearts of people all over the world. Her words have held solace for weary hearts, offered a light in the darkness and held a lot of space for the pain and joy of being alive in these times. When she starts to sing, there’s no way around it. Welcome to the moment, everyone.\nRaised in a family rich with art and music, May began writing songs and playing them for the people at a very young age. Her journeys have taken her all over the world, from street corners to renowned stages, May has performed for all walks of life. In her travels Erlewine came to know the land and the pulse of the people. Her songs show a very real connection and concern with everyday folk.\nMay pulls from a wide variety of sounds and influences to create her unique musical landscape. You’ll hear traditional folk roots, old time country swing, soul and rock and roll but mostly she’s inspired by the hearts of the people and the one in her chest. This music is about feeling and it’s about telling life’s stories."}, {"date": "2017-08-10T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1904983453047271/", "name": "Dragonette at Necto", "description": "Necto presents...\n\nDRAGONETTE\n\nwith opening artist... \nOctober Babies\nhttp://www.octoberbabies.net/\n\nDragonette is a Canadian electronic music band from Toronto, Ontario, formed in 2005. The band consists of singer-songwriter Martina Sorbara, bassist and producer Dan Kurtz (also in The New Deal), and drummer Joel Stouffer.\n\nDragonette released a self-titled EP in 2005 before being signed to Mercury Records and relocating to London, where they recorded and released their debut studio album, Galore, in August 2007 to moderate critical appreciation. A second studio album, Fixin to Thrill, was released in September 2009. The group's third studio album, Bodyparts, was released in September 2012 and their current release Royal Blues is out now.\nhttp://www.dragonetteonline.com/\n\nWatch: https://www.youtube.com/user/DragonetteBand\nListen: https://soundcloud.com/dragonette\nTalk: https://twitter.com/dragonette\nMeet: https://www.facebook.com/dragonette/\nPeek: https://www.instagram.com/dragonette/\n\nDoors at 7:30pm • 18 & over welcome with valid proper ID • VIP services available, contact: VIP@necto.com"}, {"date": "2017-08-10T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/240299056476559/", "name": "Scary Women, Daughters of Eternity, Scarlet Lies, Luxury Flux", "description": "Scary Women- Lansing Rock\nhttps://www.facebook.com/scarywomenband/\n\nhttps://www.youtube.com/channel/UCtbHGy4ssK8oGC-AOE0MDng\n\nDaughters of Eternity - SciFi/Thrash Punk from Ypsilanti\nhttps://www.facebook.com/daughtersofeternity/\n\nLuxury Flux - Indie Art Rock from Lansing\nhttps://www.facebook.com/Luxuryflux/\n\nScarlet Lies - Detroit Glam Rock \nhttps://www.facebook.com/scarletlies/"}, {"date": "2017-08-12T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/149005242317502/", "name": "Ann Arbor Roller Derby Meet and Greet", "description": "Do you have derby dreams of your own? Are you dying to ask our skaters about this crazy sport we play? Do you have endless questions about roller derby? \n\nWell folks, it's your lucky day! The Ann Arbor Derby Dimes will all be in one place and answering any and all questions you may have about roller derby and how to get involved! \n\nWhile we're always looking for new skaters, don't forget we're also looking for Refs and non-skating officials (NSOs). There is a place for everyone in roller derby!\n\nJoin us August 12th at the Buffalo Wild Wings in Ypsilanti (216 James L Hart Parkway #1, Ypsilanti MI 48197) from 3pm-5pm and talk derby with us! Don't be shy, we don't bite!"}, {"date": "2017-08-12T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/617185878484794/", "name": "Zingerman's 35th Anniversary Street Fair", "description": "We’re throwing a huge street fair party—and you’re invited!\n \nCome celebrate Zingerman's 35th Anniversary at the Ann Arbor Farmers' Market Saturday, August 12th. \n \nThe evening will feature some of the world’s most famous food makers, lots of great food and awesome music from DJ Jeremy Wheeler –all for free! Everyone is welcome.\n\nWe'll also have food, beer and swag for purchase, including locally screen printed posters of our most iconic Deli imagery, which our staff artists will be customizing on the spot—with our classic Muno font. \n\nWe’re excited to bring together the people who make great food and the people who love to eat it. Meet the makers of your favorite cheeses, salamis, chocolates, and tons more. You’ll have the chance to hear the stories direct from the people who make the foods, plus sample tons of tasty treats.\n \nBut the real reason for our celebration is to appreciate you! Without the support of the Ann Arbor community, we wouldn’t be here. Thank you for helping to make the last 35 years so remarkable."}, {"date": "2017-08-12T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1734428526855777/", "name": "Klezmephonic", "description": "Rollicking freylakhs, sweet cradle songs, and hot American vaudeville tunes are brought to life by the Ann Arbor-based band KLEZMEPHONIC.  Their sound stems from the Eastern European Jewish folk music of the 19th and 20th centuries, sprinkled with swing and Roma Gypsy stylings.  The clarinet (Jennie Lavine) and violin (Henrik Karapetyan) sing, wail and moan over the driving, dance-inducing rhythms of bass (Dave Sharp), accordion (Will Cicola), guitar and banjo (Alex Belhaj). \n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nDave Sharp, bass/compositions\nWill Cicola, accordion\nJennie Lavine, clarinet\nHenrik Karapetyan, violin\nAlex Belhaj, guitar/banjo"}, {"date": "2017-08-13T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/431923313860122/", "name": "A2 Float Fest 2017", "description": "City Beautification Bureau Proudly Presents:\n\nFOURTH ANNUAL ANN ARBOR FLOAT FEST \n\n^^^^^^^^^^^^^HECK ON EARTH^^^^^^^^^^^^^^\n\nNOON-2PM +JUMP OUR BIKE THROUGH THE GATES OF HECK INTO THE HURON RIVER!!\n\n2:30-4:15 +DIY RAFT RACE - DEMONS RACE TO THE FINISH LINE FOR EXCITING PRIZES!! \n ----> https://www.facebook.com/events/1805816136412800/ for rules, build guidelines and support for those interested in competing.  \n\n4:15-4:30 +PRIZES AND AWARD CEREMONY, HOLY HECK \n\n4:30-6:66 +FLOATING STAGE SHOW - MUSICAL ARTISTS PERFORM ON THE HURON RIVER FOR YOUR VIEWING AND LISTENING PLEASURE!!\n\nALL INVITED!  ALL WELCOME!  FAMILY FRIENDLY! \n\nBE RESPECTFUL TOWARD EACH OTHER, THE PARKS AND THE RIVER.  IF YOU LITTER, THE RIVER DEMONS WILL DRAG YOU DOWN INTO THE DEEPEST REGIONS OF HECK FOR ETERNAL PUNISHMENT AND CONSERVATION PSA'S.  DEMONS HATE LITTERING!!\n\nMORE INFO TBA"}, {"date": "2017-08-13T14:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1805816136412800/", "name": "Heck on Earth Raft Race", "description": "HECK ON EARTH RAFT RACE!!! \n\nThis page is for those who plan on competing in the HECK ON EARTH RAFT RACE portion of the Fourth Annual A2 Float Fest.  It is free to compete and we've got the greatest prizes that Heck has to offer.  If you're not interested to competing but would like to jump bikes into the river, paddle along with the racers and/or watch the floating concert, please follow the link at the bottom to our main event page!\n\nRacers should use this page to share design ideas, materials, find teammates and/or fuel some (healthy) competition.  POST ANY COOL IDEAS YOU COME ACROSS unless you don't wanna give away your secret weapon. \n\nWhile we encourage folks to come out, rip the river and have a fantastic day in any and every way possible, in order to quality for the REALLY AWESOME, BETTER AND BETTER EVERY YEAR PRIZES, there are some rules ya gotta follow!\n\nHere are the rules:\n1) Rafts must not litter or pollute the river\n2) No motors!\n3) Team must have at least two members.\n4) All team members must be on their raft at the finish line to qualify.\n5) Unmodified inflatable rafts and tubes do not qualify was DIY rafts.\n\nWe love to see some creativity!  Costumes, Flair, Pizzazz!  \n\nViolations will lead to disqualification, so keep your teammates on your environmentally friendly human/wind/bicycle/wishes-and-dreams powered raft to stay in the running for a boat load of crazy cool prizes!   We highly recommend taking your DIY raft on a test run before the competition to ensure a stable ride.\n\nGoal: \nBe the first to cross the finish line at Huron Bridge Park!\nThere will be prizes for 1st, 2nd and 3rd place as well as Most Creative!\n\nVERY IMPORTANT ----> The race will start PROMPTLY at 2:30.  Be sure to have your raft at the starting point near Barton Dam at or before 2:30pm if you want to participate. <------VERY IMPORTANT\n\nHere is a link to the route: http://www.mapmyride.com/routes/view/1136845228\n\n\nMAIN EVENT PAGE https://www.facebook.com/events/431923313860122/"}, {"date": "2017-08-13T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/114698482509858/", "name": "The Matisse Jazz Project", "description": "$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nTeaching the Eye to Hear: Musical Reflections on Henri Matisse’s Jazz\n\nIn 1941 the artist Henri Matisse found himself ill, bedridden, and unable to pick up a paint brush. He found, however, that he could maneuver scissors through prepared sheets of brightly colored paper. He referred to this technique as “painting with scissors.” Among his first adventures with paper cutouts was a book called Jazz, which Matisse prepared in 1942 and published in 1947. The book containing twenty color plates as well as his written thoughts was initially only printed in a hundred copies. Matisse viewed jazz as a “chromatic and rhythmic improvisation.” The title Jazz evoked for Matisse the idea of a structure of rhythm and repetition broken by the unexpected action of improvisations. He wrote, “There are wonderful things in real jazz, the talent for improvisation, the liveliness, the being at one with the audience.”\n\nChristopher Bakriges, piano/composer\nGwen Laster, violin\n\nChristopher Bakriges\n\nBakriges is of Greek American decent, born in Detroit. The rich cultural firmament of Motown cultivated his taste for music as an expression of emotion, communication, and social change. Bakriges graduated with degrees in world music from Wesleyan University in Middletown, Connecticut and in ethnomusicology from York University in Toronto, Canada. His teachers have included Oscar Peterson, Harold Danko, Nadi Qamar, Jimmy Giuffre, Dr. Billy Taylor, Tanjore Vishwanathan, Pandit Sushil Mukherjee, Frederick Simmons, and Alvin Lucier. His repertoire has forged a unique path that embodies the essence of jazz exploration, global influences and pure improvisation.\nBakriges is artist in residence at two Massachusetts schools, MassArt in Boston and Elms College in Chicopee. His most recent album, Clear and Present, is a quartet with Jay Hoggard, Avery Sharpe, and Billy Arnold. He has performed with wide array of international artists, including Bobby McFerrin, David Darling, Anthony Braxton, Raphe Malik, Motown’s Norris Kasuku Mafia Patterson, Korean ajeng master Hyun Sik Shin, Indian percussionist Sivamani, and PakistanI qawwali legends, the Sabri Brothers. He made his international debut at India’s Jazz Yatra Festival and has since performed in Pakistan, Turkey, France, England, the Czech Republic, and throughout Canada and North America.\n\nGwen Laster\n\nLaster is a native Detroiter whose creative influences come from the Motor City’s exciting urban and classical music culture. Laster studied with Joe Striplin, the first African American in the Detroit Symphony, and after earning bachelor’s and master’s degrees from the University of Michigan, moved to New York. She has performed with Anthony Braxton, Nona Hendryx, Aretha Franklin, Hatian vocalist Emeline Michel, Alicia Keys, Rhianna, Natalie Cole, and with Shakira at President Obama’s Neighborhood Ball Inauguration. She has won major performance, composition and teaching grants from the NEA, ASCAP, Lila Wallace, Arts Mid-Hudson, and a first place award from Cognac Hennessey Jazz. She is founder of the Creative Strings Improvisers Orchestra, Sphinx Symphony, Go: Organic Orchestra and leads the New MUSE4tet. Gwen is featured in Chamber Music America for her Black Lives Matter Suite."}, {"date": "2017-08-13T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/417743238626732/", "name": "Daddy and the Long Legs / Short Handed / Get Tall / Runt", "description": "Wow! What a ~cool~ gig! \n\nDADDY AND THE LONG LEGS: hey marco\nhttps://daddyandthelonglegs.bandcamp.com/\n\nSHORT HANDED: Chi-town pop punk\nhttps://shorthandedil.bandcamp.com/track/mans-best-friend\n\nGET TALL: Skramz revival from Ferndale\nhttps://gettall.bandcamp.com/releases\n\nRUNT: \"Emotional\" garage rock from the Chi\nhttps://runtchi.bandcamp.com/releases\n\nDoors @ 8PM\nPrice TBA\nRespect yr friends + No hate allowed"}, {"date": "2017-08-14T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/116324595588402/", "name": "Metal Sculptures Summer Camp - Session II", "description": "Do you want to harness the power of the sun to cut metal? Shape that metal with your mind and hands? Join Maker Works for an exciting metal workshop for kids. Students will be introduced to a variety of metalworking methods including forging, casting pewter, plasma cutting, and using various other tools. Students will learn about design and tool skills, which will allow them to create their own custom sculptures.\n\nStudents must wear closed toe shoes and natural fiber clothing (cotton, denim). Avoid loose/baggy items. Long hair must be pulled back from the face. Leather gloves are encouraged.\n\nPrerequisites: None\n\nPlease pack a bagged lunch, we will provide light snacks.\n\nAges 13-16"}, {"date": "2017-08-14T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/113160355995479/", "name": "Paul Dimond & Martha Buhr Grimes", "description": "Literati is pleased to welcome Paul Dimond and Martha Buhr Grimes in support of their novel, The Belle of Two Arbors.\n\nBorn at the turn of the twentieth century in Glen Arbor, near the dunes of Northern Michigan, young Belle is the first child of a gruff stove works boss and a crippled mother who weaned Belle on the verse of Emily Dickenson. When a natural disaster results in her mother’s death and nearly takes the life of her younger brother Pip, Belle creates a fierce, almost ecstatic farewell song.  Thus begins her journey to compose a perfect Goodbye to Mama.\n\nAt 21, Belle ventures south to Ann Arbor for university, with teenaged Pip in tow. There, she befriends Robert Frost, Ted Roethke and Wystan Auden and finds that her poetry stands alongside theirs, and even with that of her hero, Dickinson. Her lyrics capture the sounds, sights, and rhythms of the changing seasons in the northern forests, amidst the rolling dunes by the shores of the Great Lake. \n\nDespite the peace she finds, Belle also struggles in both homes. Up north, she battles her father who thinks a woman can’t run the family business; and clashes against developers who would scar the natural landscape. In Ann Arbor, she challenges the status quo of academic pedants and chauvinists.\n\nBelle’s narrative brings these two places to life in their historic context: a growing Midwestern town driven by a public university, striving for greatness; and a rural peninsula seeking prosperity while preserving its natural heritage. Through the Roaring Twenties, the Great Depression, World War II, and the Post-War Boom, Belle’s story is hard to put down. Her voice and songs will be even harder to forget.\n\nFor more than 70 years Paul Dimond has split most of his time between Ann Arbor, home of the University of Michigan, and Glen Arbor, amidst Sleeping Bear Dunes National Lakeshore. Prior to researching and writing The Belle of Two Arbors, Paul Dimond served as the Director of the Lawyers Committee for Civil Rights under Law, tried several major race cases that challenged a divided Supreme Court, became a Professor Law, and served as Special Assistant to President Clinton for Economic Policy. He has also practiced law, chaired a national real estate firm and continues to spend his time between his two Arbors. Currently, he works on behalf of several non-profits in Michigan so the heart of the Great Lakes can once again become a thriving home for fresh water and fresh ideas. He is the author of numerous articles and three books on policy, law and history, including Beyond Busing, recipient of the Ralph J. Bunche Book of the Year in 1986, as well as the author of three novels, including the youth title North Coast Almanac. He is an alumnus of Amherst College and the University of Michigan Law School.\n\nMartha (Marty) Buhr Grimes, a lifelong resident of Ann Arbor, also summered at her family cottage up north near Lake Michigan. She taught English, creative writing and poetry at secondary schools for 24 years, co-authored Summerskills language arts workbooks, and shared many hundreds of poems with her Paper Kite poetry group. Marty earned a BA in English and an MA in English and Education from the University of Michigan."}, {"date": "2017-08-15T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/230860050755857/", "name": "Poto MBA Video Challenge", "description": "Join the Poto MBA Video Challenge now through August 15th!\n\nHow do I participate in the Poto MBA Video Challenge?\n\n1. ACCEPT: Accept the challenge;\n2. RECORD: Take a video of yourself riding and/or talking about your favorite Poto MBA chapter trail to increase awareness of the Potawatomi Mountain Biking Association;\n3. UPLOAD: Upload your video to social media, tagging/challenging three or more of your friends. Be sure to also share your post and video on our Poto MBA Group Discussion Facebook group. \n4. GIVE: Make a donation to support the Potawatomi Mountain Biking Association.\n\nDonate through PayPal directly here: https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=YZT2N2YB2RDUJ. \n\nDo I have to donate if I take the challenge?\n\nNo, by participating in the Poto Chapter Video Challenge you’re already increasing awareness of the chapter! Making a donation, however, will help fund the purchase of two new chapter pop up tents with our logos (one with Poto logos and one with DTE Energy Foundation Trail logos). Our current tent is very weathered and is damaged. It has seen better days.  Our goal is to have a brand new tent before the 2017 Triple Trail Challenge on September 16th. Donating as part of the challenge is encouraged, and is appreciated! \n\nDo I have to be tagged or challenged to participate in the Poto MBA Video Challenge? \n\nNo. If you want to participate in the Poto MBA Video Challenge, please do so. Be the first person to get the challenge going in your community by challenging your personal network of friends and family to participate as well. \n\nWhat trails are part of the Poto MBA Video Challenge?\n\nPotawatomi Trail - Pinckney State Recreation Area\nDTE Energy Foundation Trail - Waterloo Recreation Area in Chelsea\nBrighton Recreation Area - Brighton\nRolling Hills County Park - Ypsilanti\nHewen's Creek Park - Ypsilanti\nHeritage Park - Adrian\nMorton-Taylor Mountain Bike Trails - Canton\nSharon Mills County Park - Manchester\n\nPlease direct any questions to info@potomba.org \n\nMountain biking has inherent risks and can be a dangerous activity. Challenge participants are to proceed at their own risk. \n\nThis challenge is being brought to you by the Potawatomi Mountain Biking Association."}, {"date": "2017-08-16T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/964781703663923/", "name": "Kristina Riggle & Jacquelyn Vincenta", "description": "Literati is pleased to welcome Kristina Riggle and Jacquelyn Vincenta in support of their recent novels.\n\nAbout Kristina's Vivian in Red: Famed Broadway producer Milo Short may be eighty-eight but that doesn’t stop him from going to the office every day. So when he steps out of his Upper West Side brownstone on one exceptionally hot morning, he’s not expecting to see the impossible: a woman from his life sixty years ago, cherry red lips, bright red hat, winking at him on a New York sidewalk, looking just as beautiful as she did back in 1934.\n\nThe sight causes him to suffer a stroke. And when he comes to, the renowned lyricist discovers he has lost the ability to communicate. Milo believes he must unravel his complicated history with Vivian Adair in order to win back his words. But he needs help—in the form of his granddaughter Eleanor— failed journalist and family misfit. Tapped to write her grandfather’s definitive biography, Eleanor must dig into Milo’s colorful past to discover the real story behind Milo’s greatest song Love Me, I Guess, and the mysterious woman who inspired an amazing life.\n\nA sweeping love story, family mystery and historical drama set eighty years apart, Vivian in Red will swell your heart like a favorite song while illuminating Broadway like you’ve never seen before.\n\nKristina Riggle lives and writes in West Michigan. Her debut novel, Real Life & Liars, was a Target “Breakout” pick and a “Great Lakes, Great Reads” selection by the Great Lakes Independent Booksellers Association. Her other novels have been honored by independent booksellers, including an IndieNext Notable designation for The Life You’ve Imagined. Kristina has published short stories in the Cimarron Review, Literary Mama, Espresso Fiction, and elsewhere, and is a former co-editor for fiction at Literary Mama. Kristina was a full-time newspaper reporter before turning her attention to creative writing. She likes to run and read, though not at the same time.\n\n*\n\nAbout Jacquelyn's The Lake and the Lost Girl: On a stormy night in 1939, Mary Stone Walker disappears from her home in White Hill, Michigan. Everyone knew the talented poet was desperate to escape her demons, but when Mary goes missing without a trace, one question lingers in the small town: Did Mary successfully break free of her troubled past and flee, or did her life end that night?\n\nSixty years later, Lydia Carroll's husband is still fixated on the local mystery. English Professor Frank Carroll has invested years in the search for local poet Mary Stone Walker and her lost works, sacrificing his family, his reputation, and even Lydia for the ever-more unlikely discovery. As Frank's behavior grows more erratic, Lydia sees that his interest in Mary has evolved into an obsession-one that threatens to destroy the family they have built together, and which can only be undone by solving the mystery of what happened to Mary on that rainy night in 1939.\n\nThe Lake and the Lost Girl tells the riveting story of secrets from the past unraveling one family from the inside out, and two women, separated by sixty years of history, determined to pursue their dreams.\n\nJacquelyn Vincenta spent her childhood in the suburbs of Washington, DC where she discovered the alchemy of language and imagination at a young age. After graduating from the University of Iowa with a B.A. in English Literature she started her writing life as a police beat reporter for a daily newspaper near New Orleans. While raising a family in Texas and Michigan she worked as managing editor of the publishing company she and her then-husband owned, wrote magazine articles, and became involved with non-profit organizations dedicated to the arts and environmental issues. Jacquelyn works part-time for a translation company based in Prague, and devotes herself to her writing. She lives in Kalamazoo, Michigan, where she is currently at work on her next novel."}, {"date": "2017-08-17T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1221254407982977/", "name": "Sonic Lunch / The Stellars & Jacob Sigman August 17th / Free", "description": "Bank of Ann Arbor's Sonic Lunch is an awesome outdoor summer concert series that rocks Ann Arbor's Liberty Plaza Thursdays at lunch time each summer. Look for news and announcements year-round and concerts to kick off in June 1, 2017. Sonic Lunch is free and open to all ages! Lawn chairs and furry friends are welcome.\nTell all your friends about one of the events that make summer in Ann Arbor super cool! \nBank of Ann Arbor appreciates the support of Ann Arbor’s 107one fm and Perich Advertising + Design.\n\nAugust 17th  Jacob Sigman & The Stellars \nBoth Artists to play 30 minutes\nJacob Sigman \nhttps://jacobsigman.bandcamp.com\nBorn and raised in the Mid West, Singer/Songwriter/Multi-Instrumentalist Jacob Sigman combines influences of Motown, Soul, and Contemporary Pop music to create something both new and familiar.\nThe Stellars\nhttps://the-stellars.bandcamp.com/\nThe Stellars are an Ann Arbor-based rock band that bring a refreshing brand of rock'n'roll that harkens back to the 70’s, 80’s, and 90’s, while retaining a unique modern sound."}, {"date": "2017-08-17T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/157140574835014/", "name": "Larval with Utica & DJ Sean Westergaard", "description": "Necto presents...\nLARVAL\nwith Utica & DJ Sean Westergaard\n\nDetroit avant-garde art rock with New York City origins. Formed in 1995 by Bill Brovold (NYC) and Erik Gustafson (Detroit), the original lineup reunites (guitars: Brovold, Gustavson, and Beth Wilusz, bass: Dean Western, violin: Mary Alice, saxophones: John Evans, drums: Will Osler).\n\nDoors open at 7pm • 18 & over welcome with proper valid ID • VIP services are available. Contact: VIP@necto.com"}, {"date": "2017-08-17T21:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/189254144941867/", "name": "Paddlebots with Big Sherb, Melophobix, and Act Casual", "description": "We are so excited to be coming through Ann Arbor joined by the FUNKIEST bands we know around Michigan! This is guranteed to be an AWESOME time of super tasty groove music.\n\nPaddlebots:\nPaddlebots' unique sound of head-bobbing grooves, soulful vocals, soaring solos, and righteous horns has been coined as Progressive Soul-Pop, and they cannot wait to share their passion with audiences everywhere.\n\nListen on Spotify:\nhttps://open.spotify.com/album/0ur540wTiqUsuyt2TuWtJv\n\n\nBig Sherb:\nBig Sherb’s growing fan base has remained “Intact,” as the band continues to bring their danceable funk-fusion to venues around their home state of Michigan and beyond. Their aptitude for effortlessly blending multiple genres has helped land them on stages with Dopapod, The Nth Power, Moon Hooch, Joe Hertler & The Rainbow Seekers, The Main Squeeze and many others. \n\nListen on Spotify:\nhttps://open.spotify.com/artist/3Jrl4MiIS2oOa4x1Prb9oZ\n\n\nMelophobix:\nMelophobix formed in November of 2015 in Grand Rapids, MI. We play groovy music.\n\nListen on Spotify\nhttps://open.spotify.com/artist/7rSaQ1HBuYvI71Lid4Wb9s\n\n\nAct Casual:\nWhat originally started as a group of close friends getting together to jam in a basement has grown and evolved into a musical force to be reckoned with. By combining various elements of the blues, funk, long instrumental jams and catchy 3-minute songs, there is something for everyone within the sound that is Act Casual.\n\nListen here:\nhttps://www.actcasual.org/music/"}, {"date": "2017-08-18T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/332020520569354/", "name": "S. Margot Finn", "description": "Literati is delighted to celebrate the publication of Discriminating Taste: How Class Anxiety Created the American Food Revolution by S. Margot Finn.\n\nFor the past four decades, increasing numbers of Americans have started paying greater attention to the food they eat, buying organic vegetables, drinking fine wines, and seeking out exotic cuisines. Yet they are often equally passionate about the items they refuse to eat: processed foods, generic brands, high-carb meals. While they may care deeply about issues like nutrition and sustainable agriculture, these discriminating diners also seek to differentiate themselves from the unrefined eater, the common person who lives on junk food.\n\nDiscriminating Taste argues that the rise of gourmet, ethnic, diet, and organic foods must be understood in tandem with the ever-widening income inequality gap. Offering an illuminating historical perspective on our current food trends, S. Margot Finn draws numerous parallels with the Gilded Age of the late nineteenth century, an era infamous for its class divisions, when gourmet dinners, international cuisines, slimming diets, and pure foods first became fads.\n\nExamining a diverse set of cultural touchstones ranging from Ratatouille to The Biggest Loser, Finn identifies the key ways that “good food” has become conflated with high status. She also considers how these taste hierarchies serve as a distraction, leading middle-class professionals to focus on small acts of glamorous and virtuous consumption while ignoring their class’s larger economic stagnation. A provocative look at the ideology of contemporary food culture, Discriminating Taste teaches us to question the maxim that you are what you eat.\n\n\"Finn's compelling argument about the role of class in today's food culture is sure to have a major impact on how both scholars and foodies think about the food revolution.\"--Charlotte Biltekoff, author of Eating Right in America: The Cultural Politics of Food and Health\n\n\"Finn offers an engaging and compelling explanation for the rise of the modern food movement. It's one that the leaders of the movement will no doubt find unsettling.\"--Jayson Lusk, author of Unnaturally Delicious and The Food Police\n\nS. Margot Finn is a lecturer in literature, science, and the arts at the University of Michigan, Ann Arbor."}, {"date": "2017-08-19T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1816943561954084/", "name": "Stewardship Workday", "description": "The 3 miles of trails in Bird Hills give some lovely views of the Huron River. This is the largest Nature Area in Ann Arbor, and provides a great space to get out and see wildlife and wildflowers. Volunteers are needed to help remove invasive weeds like Japanese hedge parsley throughout the park. This is a great workday for the family. Join us at the Bird Road entrance to this park, west of Huron River Drive (additional parking in Barton Nature Area-Dam Entrance). Please wear long pants and closed-toe shoes. Every participant must present a completed release form, and all minors should be accompanied by a guardian. Tools, snacks, and know-how provided."}, {"date": "2017-08-20T13:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/311898775915568/", "name": "Stewardship Workday", "description": "Walk along Malletts Creek, watch the birds at the pond, play a game of disc golf, or ride your bike on the paved path – no matter what you’re doing in this park, you’re sure to see the effects of ongoing restoration work. Mary Beth Doyle Park has been transformed by volunteers! Help continue the effort by removing invasive weeds in the open areas of this park. Meet us on Verle Ave, off of Platt Road. Please wear long pants and closed-toe shoes. Every participant must present a completed release form, and all minors should be accompanied by a guardian. Tools, snacks, and know-how provided."}, {"date": "2017-08-20T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/424839734576278/", "name": "Auditions for Cabaret", "description": "Ann Arbor Civic Theatre announces auditions for its main stage production of Cabaret, directed by Kat Walsh, with musical direction by Jennifer Goltz-Taylor, and choreography by Tyler Stickel. Auditions will take place Sunday and Monday, August 20 and 21, at 7:00 PM at Studio 3 Performing Arts Center, located at 6885 Jackson Rd., Ann Arbor, MI 48103. PLEASE NOTE: GENERAL AUDITION SESSIONS ARE OFFSITE. A map of the location may be found HERE. Callbacks will be Tuesday, August 22, at 7:00 at the A2CT Studio (322 W. Ann Street, Ann Arbor, MI 48104). Actors need only attend one of the general sessions (Sunday or Monday), and should plan to arrive just before 7:00 to fill out audition paperwork. Actors should be available for callbacks.\n \n\nIn a Berlin nightclub, as the 1920’s draw to a close, a garish Master of Ceremonies welcomes the audience and assures them they will forget all their troubles at the CABARET. With the Emcee’s bawdy songs as wry commentary, CABARET explores the dark, heady, and tumultuous life of Berlin’s natives and expatriates as Germany slowly yields to the emerging Third Reich. Cliff, a young American writer newly arrived in Berlin, is immediately taken by English singer Sally Bowles. Meanwhile, Fräulein Schneider, proprietor of Cliff and Sally’s boardinghouse, tentatively begins a romance with Herr Schultz, a mild-mannered fruit seller who happens to be Jewish.\n\n \nAUDITIONS are open to those 18 and older, due to the adult nature of the show. Auditions will begin promptly at 7:00 PM, so please plan to arrive a few minutes early to fill out audition information, most importantly a conflict calendar. Make sure you are prepared to note all your conflicts during the rehearsal period.\n\nVOCAL: Those auditioning should prepare 32 bars of a song that best demonstrates your range - please do NOT audition with songs from the show. Auditioners must provide sheet music, with cuts and necessary key clearly marked, for the accompanist.\n\nDANCE: You will learn four to eight 8-counts of a dance. Please be warmed up, ready to move when audition begins. Please wear clothing that you'll be able to move in. Preferably form fitting clothing that shows off your silhouette, or in style of the show. (Note: Form fitting clothing allows us to see the execution of the choreography better)\n\n\nWomen: Character shoes are preferred. No sneakers.\nMen: Jazz flats or Character shoes. No sneakers.\n*If you have neither, we will ask you to dance barefoot.\n\nPlease plan to stay for the duration of the general audition session.\n\nREHEARSALS will be Sunday-Thursday from 6:30-9:30 and will begin on August 31, with no rehearsal labor day weekend. \n\nThere will be a MANDATORY workshop for all those cast on Saturday, September 9 from 12-6 PM - actors MUST be available for this in order to be cast. Please note: no conflicts will be allowed from October 15 – October 29. NO EXCEPTIONS.\n\nPERFORMANCES are Thursday, October 26 – Sunday, October 29 at the Arthur Miller Theatre on UM’s North Campus.\n\nMORE INFO AND CHARACTER DESCRIPTIONS AT www.a2ct.org/audition"}, {"date": "2017-08-21T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1882911461961745/", "name": "Upcycled Fashion Summer Camp - Session 2", "description": "“The name of the Game is re-use.”\n\nGet your kids thinking outside the box when it comes to self-expression through everyday fashion. While we will use basic hand and machine sewing, students will be introduced to bigger tools like the laser cutter, vinyl cutter, and heat press to help achieve their creative visions. Students will be exploring T-shirt and denim reconstruction, plus the art of accessorizing. Transform “hand-me-downs” into runway-ready style for the new school year! Students will create several garments and accessories. All materials included.\n\nPrerequisites: Basic familiarity with hand and machine sewing (thread a needle, thread a machine, wind a bobbin).\n\nPlease pack a bagged lunch, we will provide light snacks.\n\nAges 10-16"}, {"date": "2017-08-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/430017790726815/", "name": "Danya Kukafka", "description": "Literati is pleased to welcome Danya Kukafka in celebration of her debut novel, Girl in Snow, named a Best Beach Read of 2017 by Elle, Yahoo, and Refinery 29. \n\nWhen a beloved high schooler named Lucinda Hayes is found murdered, no one in her sleepy Colorado suburb is untouched—not the boy who loved her too much; not the girl who wanted her perfect life; not the officer assigned to investigate her murder. In the aftermath of the tragedy, these three indelible characters—Cameron, Jade, and Russ—must each confront their darkest secrets in an effort to find solace, the truth, or both. In crystalline prose, Danya Kukafka offers a brilliant exploration of identity and of the razor-sharp line between love and obsession, between watching and seeing, between truth and memory.\n\nCompulsively readable and powerfully moving, Girl in Snow offers an unforgettable reading experience and introduces a singular new talent in Danya Kukafka.\n\n“From its startling opening line right through to its stunning conclusion, Girl in Snow is a perfectly paced and tautly plotted thriller. Danya Kukafka’s misfit characters are richly drawn, her prose is both elegant and eerie—this is an incredibly accomplished debut.”—Paula Hawkins, #1 New York Times bestselling author of The Girl on the Train and Into the Water \n\nDanya Kukafka is a graduate of New York University’s Gallatin School of Individualized Study. She currently works as an assistant editor at Riverhead books. Girl in Snow is her first novel."}, {"date": "2017-08-22T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1149522798527907/", "name": "Atlas Genius at the Blind Pig - Ann Arbor 8/22/17", "description": "Tue. August 22 | 7pm | All Ages | Tickets: $18\n\nThe Blind Pig Presents: Atlas Genius\n\nTickets: https://goo.gl/na34LY"}, {"date": "2017-08-24T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/240568093086414/", "name": "Sonic Lunch / Joshua Davis - August 24th / Free 12PM", "description": "Bank of Ann Arbor's Sonic Lunch is an awesome outdoor summer concert series that rocks Ann Arbor's Liberty Plaza Thursdays at lunch time each summer. Look for news and announcements year-round and concerts to kick off in June 1, 2017. Sonic Lunch is free and open to all ages! Lawn chairs and furry friends are welcome.\nTell all your friends about one of the events that make summer in Ann Arbor super cool! \nBank of Ann Arbor appreciates the support of Ann Arbor’s 107one fm and Perich Advertising + Design.\n\n8/24 Joshua Davis \nJoshua Davis was raised in the folk tradition: the music, the social movements, the land. He writes songs that blend the roots of American music with gritty rock n’ roll and vintage soul. Performing Songwriter Magazine called the result, \"Some of the liveliest and most rocking roots music around. \nFor over 15 years Joshua has made his living sharing his songs, stories and knowledge across the US and Canada at festivals, concert halls, coffeehouses and dives – as a solo act, front man for roots ensemble \"Steppin’ In It\", classic swing band \"Shout Sister Shout\", songwriter showcase band \"The Starlight Six\" and frequently as a workshop facilitator, presenter or instructor. \nHis music is steeped in ragtime blues, sweet jazz and real country but Davis’s broad schooling in the cultural, political and musical roots of American tradition has resulted in more than a simple retelling of universal themes. Dubbed, \"the Michigan version of the Great American Songscape\" (Chris Reitz, Elderly Instruments), his catalog is a seamless snapshot of American past and present. Joshua has shared stages with a diverse list of luminaries, such as Tim O’Brien, Greg Brown, The Indigo Girls, Leftover Salmon, The Dixie Hummingbirds, Corey Harris, John Gorka, Jeff Daniels, Ellis Paul, The Blind Boys of Alabama, Jimmy LaFave, Ray Bonneville, Arlo Guthrie, Abigail Washburn, Larry McCray, Sunny Wilkinson, Catie Curtis, Bill Kirchen, Peter \"Madcat\" Ruth, Bernie Leadon, Wayne Hancock, The Verve Pipe, John Hammond, Pete Seeger and Preservation Hall Jazz Band.  Davis has released three critically acclaimed solo albums, five albums with Steppin’ In It, a record of jazz standards with Shout Sister Shout, and has appeared on too many albums to count. His most recent album, \"A Miracle of Birds\" is inspired by his travels in the Palestinian West Bank with non-profit organization On the Ground. About the album, Revue magazine says, \"His heartfelt documentation of 'people as people' offers up compassionate songs of hope, darkness and perseverance.\" \n\nJoshua has performed live on the internationally syndicated programs Mountain Stage, Woodsongs Old-Time Radio Hour and Backstage Pass. His songs have been featured on NPR’s All Songs Considered, Folk Alley and The Mix and he has played scores of prestigious festivals and venues not to mention every festival Michigan has to offer."}, {"date": "2017-08-24T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/154052318488192/", "name": "Sherry Stanfa-Stanley: Finding My Badass Self", "description": "Literati is pleased to welcome Sherry Stanfa-Stanley in support of her memoir, Finding My Badass Self: A Year of Truths and Dares.\n\nFighting midlife inertia, Sherry Stanfa-Stanley chose to stare down fear through The 52/52 Project: a year of weekly new experiences designed to push her far outside her comfort zone. These ranged from visiting a nude beach with her seventy-five-year-old mother in tow to taking a road trip with her ex-husband--and then another one with his girlfriend. She also went on a raid with a vice squad and SWAT team, exfoliated a rhinoceros (inadvertently giving him an erection), and crashed a wedding (where she accidentally caught the bouquet). While finding her courage in the most unlikely of circumstances, Sherry ultimately found herself. \n\nFor midlifers, fatigued parents, and anyone who may be discontent with their life and looking to shake things up, try new things, or just escape, Finding My Badass Self is proof it's never too late to reinvent yourself--and that the best bucket list of all may be an unbucket list.\n\nSherry Stanfa-Stanley is a writer, humorist, and squeamish adventurer. She writes about her midlife escapades and other topics on Facebook (The 52 at 52 Project) and also blogs at www.sherrystanfa-stanley.com. By day, Sherry attempts to respectably represent her alma mater as a communication director at The University of Toledo. An empty nester after raising Son #1 and Son #2, she now indulges a menagerie of badly behaved pets."}, {"date": "2017-08-24T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/121863461765070/", "name": "Grown Folks Story Time", "description": "***NOT FOR CHILDREN!!***\n\nThere may be PROFANITY, WRY HUMOR, AND PSEUDO-INTELLECTUAL BANTER!\n\nRemember being cozy under a blanket or cuddled up in your favorite library corner, listening while your teacher or librarian or parent read a book to you? We never really outgrow our love of hearing a good story read aloud. Some local authors want to bring that feeling back with GROWN FOLKS STORY TIME! \n\nLocal authors will read from books they enjoyed as kids (or whatever other books they feel like reading from) while you hunker down in your blanket (we'll keep the A/C humming!) and enjoy some snacks. \n\nPatti Smith, Ken MacGregor and David Pratt will choose books based on the theme of CHILDHOOD. And since this is Ann Arbor, maybe we will have a discussion too. Come join us and see what happens – your guess is as good as ours!"}, {"date": "2017-08-24T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/766479213523337/", "name": "Test Batch", "description": "Test Batch features the newest crop of improv groups in our community. Come and watch these troupes test their chops on the Pointless stage. When they are all inevitably famous, you can say \"I saw them way back when….\"\n\nHey improvisers - here's the link to sign up. The first 6 groups to sign up will get a 15 minute performance slot.\n\nhttps://goo.gl/forms/jAePm3GzZGg7bOO52"}, {"date": "2017-08-24T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/597932630330992/", "name": "Gigamesh at Necto", "description": "React Detroit presents...\n\n:: Gigamesh ::\n\nSupport:\nRoman Martinez\nJonny Sum\n\nNecto Nightclub\n516 E. Liberty Street\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-08-26T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/481059208910653/", "name": "Stewardship Workday", "description": "A patch of dry prairie lines the Border-To-Border Trail in this park along the river, with many plants that are uncommon in our area. Help maintain this patch of special habitat by hand-pulling exotic weeds. We will meet at the main parking area off Barton Drive. Please wear long pants and closed-toe shoes. Every participant must present a completed release form, and all minors should be accompanied by a guardian. Tools, snacks, and know-how provided."}, {"date": "2017-08-26T15:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/444506292602224/", "name": "Improv Workshop: Get Out of Your F***ing Head!", "description": "This mega fun workshop is centered on quieting the mind, relieving anxiety, and learning how to relax while improvising. We'll focus less on the practice of improv and more on dealing with that nagging voice in your head. You'll have a blast as you explore simple tools and exercises to combat show stress and stay more focused on stage. I'll teach you how to push aside nerves to get the most out of your performance. Great for newbies as well as seasoned improv veterans!\n\nInstructor: Cara Trautman\nPrerequisite: All levels welcome\nWorkshop Length: 3 Hours\nWorkshop Size: Maximum of 16 students\nCost: $30"}, {"date": "2017-08-27T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/149997122211288/", "name": "God Module : Does this Stuff Freak You Out? US Tour- ANN ARBOR", "description": "Factory presents...\n\nGOD MODULE : Does this Stuff Freak You Out? US Tour\n\nwith Blakk Glass, Midnight Myth & Visions in Black\n\nGod Module combines elements of harsh Techno, Darkwave, Goth and Industrial. Pounding beats mix with hypnotic synth hooks, deranged film samples and psychotically-effected vocals to make up a sound that is as disturbing as it is danceable.\n\nWatch: https://www.youtube.com/channel/UCqb8c0OWuMAMIzIaLcv1w6A\nListen: https://soundcloud.com/god-module\nTalk: https://twitter.com/God__Module\nMeet: https://www.facebook.com/godmodule/\nPeek: https://imgrum.me/user/Godmodule\n\nDoors at 7pm • 18 & over welcome with valid proper ID • VIP services available, contact: VIP@necto.com"}, {"date": "2017-08-28T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1699072953727875/", "name": "Harvest Special Dinner #213: An Evening with Joan Nathan", "description": "Cookbook author Joan Nathan sows seeds of tradition, right here at Zingerman’s Roadhouse!\n\nJoan is a James Beard Award-winning cookbook author (and a University of Michigan grad), and with her 11 books has gathered timeless and delicious experiences from the far corners of the world. She will share the bounty of her latest collection with us as we recreate several recipes from her latest book, King Solomon's Table: A Culinary Exploration of Jewish Cooking from Around the World. Inside, readers will find more than 170 recipes, from Israel to Italy to India and beyond.\n\nWe will not only taste recipes that have planted the seeds for Jewish cuisine, but the “queen of American Jewish cooking” (Houston Chronicle), will weave rich stories from across the ages as we explore the treasure that is King Solomon's Table. Don’t miss out on this incredible dinner, and a one-of-a-kind opportunity to purchase a signed copy of Joan’s nationally acclaimed new  book!"}, {"date": "2017-08-31T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/809120869256993/", "name": "Sonic Lunch / Joe Hertler & The Rainbow Seekers August 27th", "description": "Bank of Ann Arbor's Sonic Lunch is an awesome outdoor summer concert series that rocks Ann Arbor's Liberty Plaza Thursdays at lunch time each summer. Look for news and announcements year-round and concerts to kick off in June 1, 2017. Sonic Lunch is free and open to all ages! Lawn chairs and furry friends are welcome.\nTell all your friends about one of the events that make summer in Ann Arbor super cool! \nBank of Ann Arbor appreciates the support of Ann Arbor’s 107one fm and Perich Advertising + Design.\n\n8/31 Joe Hertler & The Rainbow Seekers\nhttp://www.joehertler.com \nJoe Hertler & The Rainbow Seekers will make a sprightly young groove doctor out of anyone. With spectacular energy pulsating from every member of the band, the Rainbow Seekers could illuminate the very chambers of Heaven. Lead singer Joe Hertler splashes through lyrical puddles of golden rain, leaving his audience wearing flowery headdresses and bubbling smiles. A ride on the Rainbow will take you across the mountains of Motown, through the fjords of folk, over the archipelagos of Americana, and—at last—into a funky firth, where only the fiercest of friendships can be found.\n\nThe Rainbow Seekers began their quest beneath the fingertips of songwriter Joe Hertler. Bassist and producer Kevin Pritchard, recently thawed from an extremely rare prehistoric groove glacier, discovered the forlorn Hertler in a twinkling, mysteriously fortuitous place called The Quilted Attic. Alongside legendary glacier-hunter Rick Hale—who would later spend decades forging a drumset from pure, white-hot, ancient stardust to mark the occasion—Pritchard changed the world: He wrangled Hertler into musical collaboration. And the lonely little songsmith, it turned out, was not quite as alone as he seemed: With him came the irresistibly sexy blues guitar prodigy who is now known to the world as Ryan Hoger.\n\nThe core of the Rainbow was thereby established, and it didn’t take long for the Rainbow Seekers to continue their expansion. Multi-instrumentalist and notable auxiliary percussion maestro Micah Bracken journeyed from the bowels of Atlantis when he heard tell of the Rainbow, and the earth trembled as saxophonist and all-around bad ass Aaron Stinson descended from Olympus on a golden rainbow of his own. Then came Stinson's little-known winged companion from the Far East, the debonair violist Joshua Barber Holcomb—When he saw the pure, unadulterated joy the Rainbow Seekers sprinkled on every crowd they happened upon, he had no choice but to join them on their quest. As you'll know if you've seen the band, seeking the proverbial Rainbow is all about the live performance. \"The live show is the purpose of the band. This is why we make music. Playing music is a symbiotic process, and without a crowd it is just a bunch of guys jamming,\" says Hertler. \"We believe that performance is not a High Art operation, and that you should do anything you can to ensure that the crowd is having a good time. From piñatas to confetti, to fog, to flowers, to drum solos, to strobe lights, to Thor, to sword battles—literally anything goes.\"  If you're still reading this, at least one thing is true: The Rainbow Seekers have been waiting for you. If you'll only let them, they will shake the dust from your wildest expectations. They will roar into your life with rapturous frequencies, exuberant tone, and a joyfulness of purpose that has truly become a rare sight on stage. Join them in their celebration, and they will take you on a never-ending journey to a place you'll never be able to describe in words."}, {"date": "2017-08-31T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/118227762130905/", "name": "Ghastly at Necto", "description": "React Detroit presents...\n\n:: Ghastly ::\nWelcome Week Bash\n\nSupport by:\nMielo\n\nNecto Nightclub\n516 E. Liberty St.\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-09-03T17:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1201050600040610/", "name": "Paddy Keenan - In Concert", "description": "Strayaway Child Concert Series presents legendary uilleann piper Paddy Keenan in concert!\n<><><><><>\n\nThe Celtic Room at Conor O'Neill's Pub\n318 South Main St, Ann Arbor, MI 48104\nShow starts at 5:30pm - Doors at 5:00pm\nGeneral: $18 | Students: $16 | Kids under 10 free \nTickets at door only\n\n<><><><><>\nGenerally acknowledged as the most accomplished uilleann piper performing today and a living legend, Paddy is one of the most brilliant musicians of his generation. Born in Trim, Co. Meath, to John Keenan, Sr. of Westmeath and the former Mary Bravender of Co. Cavan. The Keenans were a Travelling family steeped in traditional music; both Paddy's father and grandfather were uilleann pipers. Paddy himself took up the pipes at the age of ten, playing his first major concert at the Gaiety Theatre, Dublin, when he was 14. He later played with the rest of his family in a group called The Pavees. At 17, having fallen in love with the blues, Paddy left Ireland for England and Europe, where he played blues and rock. Returning to Ireland after a few years, he began playing around Dublin with singer/keyboardist Triona Ni Dhomhnaill and singer/guitarist Micheal O Dhomhnaill. Fiddler Paddy Glackin joined the three, then flute player Matt Molloy, accordionist Tony MacMahon, and guitarist Donal Lunny. Thus was born one of the most influential bands of the 1970s, The Bothy Band. Paddy was one of the band's founding members, and his virtuosity on the pipes combined with the ferocity of his playing made him, in the opinion of many, its driving force. Bothy Band-mate Donal Lunny once described Paddy as \"the Jimi Hendrix of the pipes\".\n\nSince the breakup of The Bothy Band in 1979, Paddy has toured as a soloist, bringing the finest example of traditional Irish music and uilleann piping to audiences around the globe, performing in Japan, Malaysia, Mali, Australia, across Europe, Russia, and of course America.\n\nVisit Paddy on the web here: http://www.paddykeenan.com/"}, {"date": "2017-09-06T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1453175954726093/", "name": "Pigeons Playing Ping Pong with Flamingosis at Blind Pig", "description": "Pigeons Playing Ping Pong\n\nwith Special Guest Flamingosis\n\nWed. 09.06.15 @ Blind Pig - Ann Arbor, MI\n\n$14 Adv.// $16 Day of \n\n18+\n\nDoors 9pm / Show 10pm\n\n “Somethin For Ya” Pro-Shot Live Video: https://www.youtube.com/watch?v=fIGTyR-iD-w\n\nPigeons Playing Ping Pong brings end-of-the-world enthusiasm to their high-energy psychedelic funk. Their infectious electro-funk grooves, undeniable live energy and contagious smiles have their rabid fanbase “The Flock” growing exponentially. Based out of Baltimore, MD, this animated quartet has been scorching up the country with their explosive performances and danceable peaks… and they’re loving every minute of it."}, {"date": "2017-09-08T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/305214543225261/", "name": "Ron Coden at Green Wood Coffee House"}, {"date": "2017-09-13T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1935500866728403/", "name": "Overcoats at Blind Pig 9/13/17", "description": "Overcoats is the New York-based female duo of Hana Elion and JJ Mitchell. Their debut album YOUNG captures a sound rich in minimalism and melody: songs of connection and tension, on the depths of love and challenges of family.\n\nWed. September 13 | 18+ | 8pm | Tix: https://goo.gl/Q5L1Cq"}, {"date": "2017-09-14T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/665890496945024/", "name": "90s DANCE PARTY at Blind Pig w/ Fool House", "description": "Fool House is bringing the '90s to Ann Arbor! Make sure you wear your best track suits and fanny packs! \n\nWe'll be playing all of the bangerzzzz from NSYNC, Blink 182, Britney Spears, all the way to Ricky Martin ;)\n\n$5 ADV // $8 DOS\nDoors // 8pm\nShow // 10pm\n\nHope you're ready to party!!!\n\nwww.FoolHouseBand.com"}, {"date": "2017-09-14T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1874558196199787/", "name": "Henry Fong x Bad Royale at Necto", "description": "React Detroit presents...\n\n:: Henry Fong x Bad Royale ::\n\nNecto Nightclub\n516 E. Liberty St.\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-09-15T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/462461930773054/", "name": "Suzzy Roche and Lucy Wainwright Roche at Green Wood Coffee House"}, {"date": "2017-09-20T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/755238804656105/", "name": "Com Truise + Nosaj Thing at the Blind Pig 9/20/17", "description": ":: Com Truise + Nosaj Thing ::\n\nWed. September 20 | 9pm | 18+ | Tix: https://goo.gl/TfUbBh"}, {"date": "2017-09-21T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1878374215761529/", "name": "DJ Jazzy Jeff at Necto", "description": "Necto proudly presents....\nThe Magnificent... DJ JAZZY JEFF\n\nwith opening sets by\nERNO THE INFERNO\nMichael Fotias\nTwo Can Win!\n\nNow this is a story all about how My life got flipped - turned upside down... \n\nDJ Jazzy Jeff was born in West Philadelphia and developed a love of music at an early age. Jeff was just 10 years old when he started spinning records at parties using his family’s basement as a training ground for his expert mixing. Since 1985, DJ Jazzy Jeff has wowed us with his flawless turn- table skills, innovative production and musical versatility.\n\nFrom the success of “DJ Jazzy Jeff and the Fresh Prince” with partner Will Smith, to the critical acclaim of his production company “A Touch of Jazz”, Jeff proved time and time again that he would always be a force to be reckoned with. And he continues to represent with his solo projects, collaborations, mixtapes and live shows. His love of music shines through in everything he does.\n\nOver the course of his career, DJ Jazzy Jeff has achieved many accomplishments including a DMC Championship and multiple GRAMMY and American Music Awards and nominations. But he is a humble man who is still doing it as his 2002 hit said: “For Da Love of Da Game.”\n\nWatch: https://www.youtube.com/user/jefftownes\nListen: https://soundcloud.com/djjazzyjeff\nTalk: https://twitter.com/djjazzyjeff215\nMeet: https://www.facebook.com/djjazzyjeff/\nPeek: https://www.instagram.com/djjazzyjeff/\n\nDoors at 9pm. 18 + welcome with proper ID. \nVIP Services available. Contact VIP@necto.com"}, {"date": "2017-09-22T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/217245968802454/", "name": "The Get Up Kids at the Blind Pig 9/22/17", "description": "The Get Up Kids live at the Blind Pig\nwsg: Pet Symmetry\n\nDoors 7pm | All Ages | Tix: https://goo.gl/3j2SgG"}, {"date": "2017-09-24T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/483732111962088/", "name": "ModernLadyFitness, North by North, Gruesome Twosome at Blind Pig", "description": "Modern Lady Fitness\nhttps://modernladyfitness.bandcamp.com/\n\nNorth By North (Chicago, IL)\nwww.northbynorth.bandcamp.com\nhttps://open.spotify.com/artist/5IoXcA5DIDSG0QlNNoqQdZ\n\nThe Gruesome Twosome\nhttps://gruesometwosomeypsi.bandcamp.com/releases"}, {"date": "2017-09-27T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/623137087881736/", "name": "Poto Chapter Meeting - Brighton Rec", "description": "Join us at Brighton Recreation Area for a Poto Chapter meeting. Social ride 5:00 – 7:00pm. Casual chapter meeting from 7:00pm - 7:30pm followed by a pot luck (bring something to throw on the grill and something to share). Please contact info@potomba.org with any questions.\n\nThis event is being brought to you by the Potawatomi Mountain Biking Association."}, {"date": "2017-09-27T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1875491562692086/", "name": "That 1 Guy at the Blind Pig 9/27/17", "description": "Imagine the brainchild of Dr. Seuss, Captain Beefheart, Frank Zappa, Stanley Kubrick and Rube Goldberg, and you begin to understand the spectacle of a That 1 Guy performance by Berkeley, CA-based, classically trained musician Mike Silverman. As inventor and player of The Magic Pipe, That 1 Guy’s show has to be seen to be believed, as he single-handedly (and foot-edly) plays his amazing instrument, made out of miked steel pipes with a single, thick bass string wired from top to bottom, not to mention an Appalachian handsaw, an electric cowboy boot and belching smoke.\n\n9pm | 18+ | Tix: https://goo.gl/ZjQNDh"}, {"date": "2017-09-28T17:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1876999832517021/", "name": "A2 Art & Brew", "description": "Join us for this year’s A2 Art & Brew, a fundraiser benefiting the Ann Arbor Art Center! This year each participating venue will feature three different pairings (beer tasting and one-bite snack); try all three at a few locations or try one at each location. Guests will visit participating establishments and taste these well-crafted pairings to see how different beers and food work together.\n\nIn connection with the exhibition, In Transit, guests will have the chance to view select pieces of art from the exhibition in the restaurants.\n\nA2 Art & Brew guests have the opportunity to choose the Best Brew, Best Bite, and Best Pairing during the event and the winner(s) will be announced following the event!\n\nTickets on sale for Art Center members on August 3 and open to the public on August 8 and are $45.\n\nAttendees must be 21 or older by 9/28/2017.\n\nBe sure to follow us on Facebook, Twitter, and Instagram to join in on the fun! #a2artandbrew #a2artcenter\n\nLear more: https://goo.gl/Y2V4Wx"}, {"date": "2017-09-28T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1866456523676680/", "name": "Grieves at the Blind Pig - September 28th", "description": "GRIEVES\nRUNNING WILD TOUR 2017\n\n$15\nDoors 9:00pm\n18+\n\n\nhttp://grievesmusic.com\nhttps://facebook.com/Grievesmusic\nhttps://twitter.com/grievesmusic\nhttps://instagram.com/grieves/"}, {"date": "2017-09-28T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1570984809621394/", "name": "Grieves at the Blind Pig 9/28/17", "description": "Grieves just announced his new album, Running Wild, is set for release on August 25th, and just dropped the first single, \"RX\"!\n\nIt's been over three years since his last album, Winter & The Wolves, but Grieves has re-emerged with a modernized sound that is lush and intoxicating, pairing punchy drums with thick layers of synths and warm bass lines. Whether dark and moody, or bright and upbeat, Grieves smoothly navigates the new soundscape, penning verses that range from confessional to carefree.\n\n9pm | 18+ | Tix: https://goo.gl/hFoQ8S"}, {"date": "2017-09-28T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/664957517040960/", "name": "Claptone at Necto", "description": "React Detroit presents...\n\n:: Claptone ::\n\nSupport by:\nSonya Alvarez\nIota\n\nNecto Nightclub\n516 E. Liberty Street\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-09-29T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1126347097471880/", "name": "Reggie Harris and David Roth at Green Wood Coffee House"}, {"date": "2017-10-03T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1964652950436740/", "name": "Quinn XCII - The Story of Us Tour - Blind Pig", "description": "Quinn XCII live at the Blind Pig\nWith Special Guest: shallou\n\nDoors 9pm / 18+ / Tix: https://goo.gl/BJcyzn\n\n2017 continues to be a breakout year for the newcomer Detroit singer/songwriter, Quinn XCII.  With his ability to seamlessly blur the lines between pop, electronic, hip-hop, and soul music, he has quickly paved his own lane with his unique sound."}, {"date": "2017-10-05T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1794662000862849/", "name": "Matthew Dear (DJ Set) : Homecoming", "description": "Necto presents...\n\nMATTHEW DEAR (DJ Set) \n\nwith opening artist... TBA\n\nWe can't believe that it's been over 15 years since Matthew Dear was a resident here at Necto. Since then he has gone on to create amazing music & play all over the world. Please join us as we welcome Matthew back to Necto with a Very Special Homecoming! \nhttp://dj-kicks.com/matthewdear/\n\nWatch: https://www.youtube.com/channel/UCwrOfciTBb4zSninHNwQ-6Q\nListen: https://soundcloud.com/matthewdear\nTalk: https://twitter.com/matthewdear\nMeet: https://www.facebook.com/matthewdear/\nPeek: https://www.instagram.com/matthewdear/?hl=en\n\nDoors at 9pm • 18 & over welcome with valid proper ID • VIP services available, contact: VIP@necto.com"}, {"date": "2017-10-06T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/178735225989510/", "name": "Jonathan Edwards at Green Wood Coffee House", "description": "Warm as summer sunshine, real as the truth, intimate as a long overdue visit between old friends … such is a Jonathan Edwards concert. Four decades into a stellar career of uncompromising musical integrity, the man simply delivers, night after night – songs of passion, songs of isight, songs of humor, all rendered in that pure and powerful tenor which, like fine wine, has only grown sweeter with age.\nThis is one veteran performer who is neither grizzled nor nostalgic.\nJonathan's highly respected repertoire includes such classics as, “Sometimes,” “One Day Closer,” “Don’t Cry Blue,” “Emma,” “Everybody Knows Her,” “Athens County,” and everyone’s favorite ode to putting a good buzz on, “Shanty.” And then, of course, there’s the anthemic “Sunshine (Go Away Today),” that fierce proclamation of protest and independence that resonated with thousands and thousands of frustrated and angry young men and women when it was first released in 1971. Almost 40 years later, at show after show, the song continues to be embraced by faithful followers and new fans alike.\nSince 1971, Jonathan has released 15 albums, including \"Blue Ridge,\" his standard-setting collaboration with bluegrass favorites the Seldom Scene, and \"Little Hands,\" his collection of children’s songs, which was honored with a National Library Association award. His brand new album is, \"Tomorrow's Child.\"\nwww.jonathanedwards.net"}, {"date": "2017-10-13T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/136754983554255/", "name": "Batman Ride", "description": "Ride the Poto, backwards, at night on October 13th!  The Batman Ride will be staging at the Silver Lake Parking lot. Arrive at 7:00pm and ride at 7:30pm. We will have a first group of faster riders doing the full loop, and a second group of “normal” riders doing part of the trail. After the ride, we will have a campfire and typically riders bring food to share. Come out and ride the Poto backwards with lights!\n\nWhat you should bring:\n 1. light\n 2. back-up light\n 3. cell phone\n 4. trail map, tools, survival gear (just kidding – no man left behind!)\n 5. food/beverages/change of clothes for post ride"}, {"date": "2017-10-14T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1956825434554746/", "name": "Spafford at Blind Pig - Ann Arbor, performing 2 Sets!", "description": "Spafford fall tour is coming to Blind Pig - Ann Arbor, MI on 10.14.17. \n\n \nFan Club tickets available now - http://bit.ly/2rWwhxb\n\nTickets are on sale on Friday, July 14 @ 11:00 a.m. local time. \n\nMore info can be found at www.spafford.net"}, {"date": "2017-10-20T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/639471626252429/", "name": "Chuck Brodsky at Green Wood Coffee House"}, {"date": "2017-10-26T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1852026231754422/", "name": "Gorgon City presents Kingdom at Necto", "description": "React Detroit presents...\n\n:: Gorgon City ::\n\nOpeners - TBD\n\nNecto Nightclub\n516 E. Liberty\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-10-27T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1947918605489635/", "name": "Mary Gauthier at Green Wood Coffee House", "description": "Her songs? They’re about as idiosyncratic as anything in the wide world of “popular music.” They’re painfully personal, yet they somehow infiltrate the souls of her listeners, no matter how different the paths they’ve followed through their lives.\nSongs aren’t so much written as harvested by Gauthier. Though she lives not far from the hit-making mills of Music Row, she admits to knowing nothing about how to write on command.  She says, “I have to be called to write. The call comes from somewhere I don’t understand, but I know it when I hear it.”\nThat call first came to her a long time ago. Her life to that point had led her to extremes, plenty of negatives and a few brilliant bright spots. An adopted child who became a teenage runaway, she found her first shelter among addicts and drag queens. Eventually she achieved renown as a chef even while balancing her restaurant responsibilities with the demands of addiction to heroin.\nTwo more successful restaurants, an escalating addiction, and a subsequent arrest led her into sobriety. It was rehearsal for what was to follow, when she wrote her first song in her mid-thirties. From that point, Gauthier channeled a long line of eloquent works, including the achingly beautiful, \"Mercy Now.\" She says of her new CD, Trouble and Love, “I started the process in a lot of grief. I’d lost a lot. So the first batch of songs was just too sad. It was like walking too close to the fire. I had to back off from it. The truth is that when you’re in the amount of grief I was in, it’s an altered state. Life is not that. You go through that. We human beings have this built-in healing mechanism that’s always pushing us toward life. I didn’t want to write just darkness, because that’s not the truth. I had to write through the darkness to get to the truth. Writing helped me back onto my feet again. This record is about getting to a new normal. It’s a transformation record.” We are so pleased to welcome Mary Gauthier into our Series.\nmarygauthier.com"}, {"date": "2017-10-28T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/333454157089137/", "name": "Poto Singlespeed World Championship", "description": "The PSSWC is an unsupported group ride around the Potawatomi Trail. This is not a race."}, {"date": "2017-10-30T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/202046953649336/", "name": "Dave Alvin // Jimmie Dale Gilmore", "description": "Double bill!"}, {"date": "2017-11-01T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/446280222418620/", "name": "Bill Staines", "description": "A folk classic!"}, {"date": "2017-11-02T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1677173195911995/", "name": "Anne Hills // Cindy Mangsen & Steve Gillette", "description": "A classic folk double bill"}, {"date": "2017-11-03T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/101479843797890/", "name": "John McCutcheon", "description": "\"The most versatile and compelling performer this reviewer has ever seen\"—Pravda"}, {"date": "2017-11-03T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1863433740573875/", "name": "Danny Schmidt at Green Wood Coffee House"}, {"date": "2017-11-05T11:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/823808571129109/", "name": "2017 Michigan Tri-Chapter Ultimate Trail Challenge", "description": "Did you know there are over 30 different mountain bike trails in the metro Detroit area? \n\nThe Clinton River Area Mountain Biking Association (CRAMBA), Motor City Mountain Biking Association (MCMBA), and the Potawatomi Mountain Biking Association (Poto MBA) are teaming up this year to present the 2nd Annual 2017 Michigan Tri-Chapter Trail Challenge! The challenge involves riding all of the Metro Detroit IMBA chapter trails at least once during the 2017 season.\n\nWhat is the Tri-Chapter Trail Challenge?\n•\tThe Tri-Chapter Challenge: Complete a ride on all Metro Detroit IMBA trails (1 will be optional)\n\nCount me in! How do I participate?\n•\tJoin or renew your local IMBA chapter membership (CRAMBA, MCMBA or Poto MBA)\n•\tNot a member? Check out these websites:\n      o\tCRAMBA http://www.cramba.org/\n      o\tMCMBA http://site.mcmba.org/\n      o\tPoto MBA http://www.potomba.org/\n•\tRegister on BikeReg (https://www.BikeReg.com/michigan-tri-chapter-ultimate-trail-challenge ). Cost is $20\n•\tGo ride your bike! Ride the trails between January 1st and November 5th. Save a trailhead bike-selfie picture, Strava activity or other record from each ride.\n•\tTo accommodate all skill levels, it is not required to ride the entire trail network.  For example, blue loop at island lake, highland A loop, etc would all be acceptable.\n•\tSubmit your challenge summary by November 5th (Information will be emailed to you on how to track this, a template will be provided).\n\nChallenge riders unite!\n•\tJoin the Facebook group 2017 Michigan Tri-Chapter Ultimate Trail Challenge, link up with other Challenge participants and share pictures of your adventures.\n•\tWatch for group rides on the Tri-Chapter Challenge Facebook group and chapter Facebook groups. Join a ride that has been posted and meet other Challenge participants.\n•\tExercise your self-reliance and organize your own trail outing and invite others to join.\n•\tGet creative and combine multiple trails for some excellent endurance training rides (shut up, legs!)\n•\tJoin us at multi-trail ride events for a great opportunity to ride unique routes and check many trails off your list:\n      o\tMilford Trail Challenge Bike Fest (MCMBA) – June 3, 2017\n      o\tTriple Trail Challenge (Poto MBA) – September 16, 2017\n      o\tMassive Fallout (CRAMBA) –  September 30, 2017\n\nThis summer got busy, what if I can’t complete the whole thing?\n\n•\tWe will also recognize riders who complete all of the trails in their designated chapter.  You won’t be eligible for a shirt, but you can still claim a seat at the end of year gathering.\n\nClaim your Rewards!\n•\tStylish long-sleeve shirts are awarded for participants who complete the Tri-Chapter Challenge. (links to sizing at end of description)\n•\tJoin us for an exclusive post-season afterparty for participants who complete The Tri-Chapter Challenge or a Single Chapter Challenge (location and details to be announced later) with a chance for more swag!\n\nPlease contact Sarah Vano with any questions about the challenge (svano17@gmail.com).\n\nThe Details: List of Trails\n\nCRAMBA Chapter Challenge (14 trails - 1 optional)\n•\tAddison Oaks County Park (Leonard)\n•\tBald Mountain Recreation Area (Lake Orion)\n•\tBloomer Park (Rochester Hills)\n•\tClinton River Park Trails (Sterling Heights)\n•\tHolly-Holdridge Mountain Bike Trail (Holly)\n•\tHolly High School (Holly)\n•\tOrion Oaks County Park (Lake Orion)\n•\tOrtonville Recreation Area (Ortonville)\n•\tPontiac Lake Recreation Area (Waterford)\n•\tRiver Bends Park (Shelby Township)\n•\tRuby Campground (Avoca)\n•\tSeven Lakes State Park (Holly)\n•\tStony Creek Metropark (Shelby Township)\n•\tOptional - Stony Creek Trolley Trails and Skills Park (Shelby Township)\n\nMCMBA Chapter Challenge (11 trails):\n•\tHickory Glen Park (Commerce Township)\n•\tHighland Recreation Area (Highland Township)\n•\tHines Park (Plymouth Township)\n•\tIsland Lake Recreation Area (Brighton)\n•\tKensington to Proud Lake Connector (Milford Township)\n•\tLakeshore Park (Novi)\n•\tMaybury State Park (Northville)\n•\tMilford Trail (Milford)\n•\tMunson Park (Monroe)\n•\tProud Lake Recreation Area (Commerce Township)\n•\tRouge Park (Detroit)\n\nPotowatomi MBA Chapter Challenge (9 trails):\n•\tBrighton Recreation Area (Brighton)\n•\tDTE Energy Foundation Trail (Chelsea)\n•       Heritage Park (Adrian)\n•\tHewen’s Creek (Ypsilanti)\n•\tMorton – Taylor (Canton)\n•\tOlson Park (Ann Arbor)\n•\tPotawatomi (Pinckney)\n•\tRolling Hills (Ypsilanti)\n•\tSharon Mills (Manchester)\n\nshirt sizing:\nWomen's\nhttps://www.alphabroder.com/cgi-bin/online/webshr/prod-labeldtl.w?sr=B6500&currentColor=#tabs1-specs\nMen's\nhttps://www.alphabroder.com/cgi-bin/online/webshr/prod-labeldtl.w?sr=3501&currentColor=#tabs1-specs\n\n-----------------------------------------------------------------\n\n\n******UPDATED TRACKING INFO******\n\nWant to check your progress as you toil to complete the Tri-Chapter Ultimate Trail Challenge?  Want to see how you stack up across the competition?\n\nThen make sure to head over to the TCUTC Summary sheet to see how the field stacks up:\nhttps://docs.google.com/spreadsheets/d/1nyfd7CNDQ-kyRNqXrD0Fz_1_D1A7XUbPKgNMPVuapLE/edit#gid=143425007\n\nTo submit a trail, click on the link in the top left corner that says “CLICK HERE TO LOG A TRAIL!”.  Use this form to submit your progress as you ride; it’s mobile-friendly so that you can submit directly from the trailhead:  \nhttps://docs.google.com/forms/d/e/1FAIpQLSf53zYkjlquduiJALwCXWHAVfcS7Bty5ZRnNpPKUKNKYmYWJQ/viewform?c=0&w=1\n\nAfter you log a trail, you will see the status update on the summary sheet, provided two things are true: (1) you are registered for the challenge, and (2) you used the same email you used when you registered.  A copy of your submission will head to your inbox for your records.  Made a mistake when you hit “submit”?  Put the wrong trail name down, or need to update the completion evidence?  You can make edits to your submission using the email confirmation.\n\nDon’t see your ride show up?  Don’t worry, we will manually update the summary throughout the summer.  If you don’t see your progress logged within a few days, send us a gentle note and we’ll look into it.  Like you, we would rather be out riding our bikes than updating spreadsheets. . .\n\nOf course, this isn’t a race.  The challenge is to attempt all 33 trails listed across the 3 local chapters.  But whoever finishes first will sure have bragging rights over the rest of us!"}, {"date": "2017-11-05T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/278412142599224/", "name": "BeauSoleil", "description": "Legends of Louisiana music"}, {"date": "2017-11-07T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1371555482894314/", "name": "Zoe Speaks", "description": "Wonderful roots sounds and traditional songs from Kentucky"}, {"date": "2017-11-08T08:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/457860671225825/", "name": "The CGP & Dawg Tour: Tommy Emmanuel & David Grisman", "description": "Certified instrumental mastery!"}, {"date": "2017-11-08T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1208423229286648/", "name": "Steve Poltz", "description": "\"A master of darkly comic songwriting\" in a unique show"}, {"date": "2017-11-09T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/311070769323143/", "name": "Nora Jane Struthers", "description": "New music from one of Americana's most creative figures"}, {"date": "2017-11-10T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/144832839404479/", "name": "The Subdudes", "description": "The original New Orleans roots rockers"}, {"date": "2017-11-10T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1375065105913766/", "name": "Melanie at Green Wood Coffee House", "description": "At Woodstock, as a New York kid barely known outside the coffeehouse circuit in Greenwich Village, she sang her song, \"Beautiful People\" and inspired the first panorama of candles and cigarette lighters ever raised at a concert event. That, in turn, moved the young singer to write \"Lay Down (Candles in the Rain\"), which sold more than one million copies in 1970 and prompted Billboard, Cashbox, Melody Maker, Record World, and Bravo to anoint her as female vocalist of the year. Her single, \"Brand New Key,\" topped the charts in 1971.\nWith guitar in hand and a combination of amazing vocal talent, disarming humor, and a vibrant engagement with life, she was booked as the first solo pop/rock artist ever to appear at the Royal Albert Hall, Carnegie Hall, and the Metropolitan Opera House, and later opened the New Metropolitan Opera House in New York, the Sydney Opera House, and in the General Assembly of the United Nations, where she was invited to perform on many occasions as delegates greeted her performances with standing ovations.\nThe top television hosts of all time -- Ed Sullivan, Johnny Carson, and Dick Cavett -- battled to book her.\nUNICEF made her its spokesperson; Jimi Hendrix's father introduced her to the multitude assembled for the twentieth anniversary of Woodstock. Her records continued to sell -- more than eighty million to date. She's had her songs covered by singers as diverse as Cher, Dolly Parton, and Macy Gray. She's raised a family, won an Emmy, opened a restaurant, and written a musical about Wild Bill Hickok and Calamity Jane.\nThis is a rare opportunity to experience Melanie live and in person in an intimate venue. Don't miss it!\nwww.melaniesafka.com"}, {"date": "2017-11-11T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/430739813974178/", "name": "Joshua Davis", "description": "\"Some of the liveliest and most rocking roots music around\"—Performing Songwriter"}, {"date": "2017-11-12T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/465364813813526/", "name": "Dar Williams", "description": "In concert including a reading and discussion from her new book, What I Found In A Thousand Towns”"}, {"date": "2017-11-13T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/206311416562029/", "name": "Adrian Legg", "description": "A nonpareil guitar master"}, {"date": "2017-11-15T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1009126095943405/", "name": "Riders in the Sky", "description": "Get tickets early—it's the cowboy way!"}, {"date": "2017-11-16T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/345275675889853/", "name": "Loudon Wainwright III", "description": "\"In my head, Loudon Wainwright is Bono.\"—Judd Apatow"}, {"date": "2017-11-17T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/253675135089540/", "name": "Bruce Cockburn", "description": "A musical thinker and seeker"}, {"date": "2017-11-17T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/291030208004321/", "name": "Small Potatoes at Green Wood Coffee House", "description": "Small Potatoes is Jacquie Manning and Rich Prezioso. They describe their music as \"Celtic to cowboy,\" and say it's taken them \"years of careful indecision\" to develop a mix of music ranging from country, blues and swing to Irish ballads. You'll hear two great voices, fine guitar playing and a touch of tin whistle, flute, mandolin and bodhran. Small Potatoes' award-winning songwriting, close harmony and warm rapport with the audience makes for a wonderful evening. Their latest album is Christmas In The Cabin.\nwww.smallpotatoesmusic.com"}, {"date": "2017-11-18T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/237495930092984/", "name": "Cheryl Wheeler", "description": "Singer, songwriter, and comedienne extraordinaire"}, {"date": "2017-11-24T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1396121547124326/", "name": "Black-Friday MTB Ride", "description": "Join the POTO Chapter as they lead a fun group ride on black friday. After the ride Wheels In Motion will provide pizza and beer! Please meet at 9:30 as the ride will leave promptly."}, {"date": "2017-11-25T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/292015981259744/", "name": "Jeff Daniels", "description": "In 1976, Jeff Daniels bought a Guild D-40 from Herb David’s Guitar Studio in Ann Arbor, threw it in the back of his old Buick, and moved to New York City. That guitar led to a creative outlet, became a solace, a road into the artist that he didn’t know existed. Now, over 40 years later, he releases his 8th record, Simple Truths.\n\nSince 2000, Jeff has played venues such as The Barn at Wolf Trap in VA, New York City’s 54 Below, City Winery in Chicago, New York and Nashville, Austin’s Cactus Cafe, the Ram’s Head Tavern in Annapolis, MD, Mucky Duck’s in Houston, The Ark in Ann Arbor, MI, Chicago’s Old School of Folk Music, Seattle’s Third Door, Alaska’s Blue Loon in Fairbanks, as well as numerous opera houses and PACs throughout the country.\n\nHe has toured both coasts with his son’s band, the Ben Daniels Band, and has shared the stage with Lyle Lovett, John Hiatt, Joe Ely, Guy Clark, Keb' Mo’, and Bruce Hornsby."}, {"date": "2017-11-26T13:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1798907333469776/", "name": "Gemini", "description": "Wonderful songs for the family—a Michigan family tradition"}, {"date": "2017-11-30T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1487171348018472/", "name": "Cold Tone Harvest", "description": "\"The real deal\"—WNMC, Traverse City"}, {"date": "2017-12-01T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/245006222671456/", "name": "Kris Delmhorst & Jeffrey Foucault", "description": "Love and marriage and songwriting, with new music from Kris"}, {"date": "2017-12-01T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/228071984350090/", "name": "Don White at Green Wood Coffee House", "description": "Back by popular demand! Don White combines heartfelt, serious lyrics with side-splitting laughs to provide an evening not to be forgotten. This Massachusetts comedian/singer/songwriter/author is best-known in these parts for his radio gems, \"Rascal,\" \"Psycho Mom and Dad\" and \"I Know What Love Is.\"  A Don White show promises to delight new audiences and devoted \"repeat offender\" fans, alike.\nwww.donwhite.net"}, {"date": "2017-12-05T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1874864086169155/", "name": "This Wonderful Life", "description": "A one-man play starring Jeremy Kendall, based on the 1946 Jimmy Stewart film. Student tickets $10 at Michigan Union Ticket Office and Ark box office in person only."}, {"date": "2017-12-07T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1705154979788647/", "name": "Two Friends at Necto", "description": "React Presents...\n\n:: Two Friends ::\n\nSupport TBD\n\nNecto Nightclub\n516 E. Liberty St.\nAnn Arbor, MI 48104\n18+\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet"}, {"date": "2017-12-09T12:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/440123889658934/", "name": "2017 Abominable Snowman Ride", "description": "Join us at the 2017 Abominable Snowman Ride at HIGH NOON on Saturday, December 9th at the Glenbrook Yurt in Pinckney Recreation Area. Ride as much or as little of the Poto trail as you would like. There are many options! Woody will have chili ready for the riders and he’ll have the fire going. The griddle will be ready as well for any hot dogs you’d like to bring. Cold temps and snow have been ordered for the weekend. Please bring wood to help keep the fire burning into the evening.\n\nThis event is being brought to you by the Potawatomi Mountain Biking Association."}, {"date": "2017-12-10T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1840537026263975/", "name": "An Evening with George Winston", "description": "A solo piano legend. Photo by Steve Lankford"}, {"date": "2017-12-16T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/342193202881483/", "name": "Blackthorn", "description": "A musical ramble across Ireland—in Michigan"}, {"date": "2017-12-28T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/519917991672623/", "name": "Seth Glier", "description": "New music!"}, {"date": "2018-01-12T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/456043271413426/", "name": "Urban Bush Women: Hair & Other Stories", "description": "\"The Urban Bush Women are committed, triple-threat performers who dance, sing, and act with a sometimes searing sense of truthfulness.\" (New York Times)\n\nFounded by Jawole Zollar, the company burst onto the dance scene in 1984 and has made an indelible mark on the field with bold, innovative, and demanding works that challenge long-held assumptions about women, people of color, body types, styles of movement, society, history, and appropriate content for the stage. Hair & Other Stories is a multidisciplinary evening-length work that addresses matters of race, gender identity, and economic inequality through the lens of hair, primarily that of African-American women.\n\nMore info: http://ums.org/performance/urban-bush-women/"}, {"date": "2018-01-14T14:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/215010219000619/", "name": "St. Lawrence String Quartet: Haydn Mega-Concert", "description": "Geoff Nuttall, first violinist with the St. Lawrence String Quartet, is as well known for the insightful commentary he provides about the works the Quartet performs as he is for his violin playing.\nHaydn has been a passion for the Quartet since their founding in 1989, and they think of the composer less as the source of “pleasant opening music” than as a “radical, passionate innovator.” \n\nIn this special, immersive concert, the SLSQ performs all six of Haydn’s Op. 20 string quartets, with two intermissions (including a meal break). “No other North American quartet plays the music of Haydn with more intelligence, expressivity, and force,” says the New Yorker.\n\nMore info: http://ums.org/performance/st-lawrence-string-quartet/"}, {"date": "2018-01-28T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1071623319604830/", "name": "Maxim Vengerov, violin and Roustem Saïtkoulov, piano", "description": "Universally hailed as one of the world’s finest musicians, Maxim Vengerov made his public debut at age 5 and performed the Mendelssohn Concerto at age 7.\n\nVengerov is inspired by many different styles of music and brings his tireless search for new means of creative expression to his first UMS recital appearance in nearly 20 years.\n\nMore info: http://ums.org/performance/maxim-vengerov-violin-roustem-saitkoulov-piano/"}, {"date": "2018-01-31T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1409405905765276/", "name": "Janai Brugger, soprano and Martin Katz, piano", "description": "Winner of Placido Domingo’s prestigious Operalia competition in 2012 and a true standout in the What’s in a Song event that launched the UMS Song Biennial two years ago, soprano Janai Brugger has quickly become one of the Metropolitan Opera’s go-to singers, with four roles this past season.\n\nThe U-M alumna, who studied with the late Shirley Verrett, also won the Kennedy Center’s 2016 Marian Anderson Vocal Award and was identified by Opera News as one of their top 25 “brilliant young artists” in 2015. At the Metropolitan Opera competition in 2012, the New York Times wrote, “Only one singer inspired me to look forward to a full performance. Janai Brugger sang with poise and style, quiet intensity, and superb phrasing…The emotion was in her sound, which projected, with silvery ease, relaxed but focused bliss and then haunting melancholy.” Brugger, joined by pianist Martin Katz, makes her UMS recital debut with this performance.\n\nMore info: http://ums.org/performance/janai-brugger-soprano-martin-katz-piano/"}, {"date": "2018-02-02T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/456875417998907/", "name": "Gabriel Kahane’s Book of Travelers", "description": "The morning after the 2016 presidential election, singer-songwriter Gabriel Kahane packed a suitcase and set out, with no cell phone or internet connection, on a 9,000-mile railway journey around the US, in an attempt to better understand his country.\n\nOver the course of two weeks spent talking to strangers in Amtrak dining cars, he encountered an array of fellow citizens — cowboys, postmasters, religious luddites, national park conservationists, drifters, and seasteading software engineers — who, taken together, amount to nothing less than an American mosaic. At a distance from his daily routine, Kahane meditated on the intimacy and immediacy of train culture, and the ways in which it offers a stark contrast to — and relief from — the fragmentation, polarization, and obsession with efficiency that have come to embody contemporary American society. The highly anticipated follow-up to his acclaimed stage piece, The Ambassador, Gabriel Kahane’s Book of Travelers offers an expansive exploration of American history, regionalism, and the history of travel itself, all couched in a collection of songs as personal as any Kahane has written.\n\nMore info: http://ums.org/performance/gabriel-kahanes-book-of-travelers/"}, {"date": "2018-02-03T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1591991634186745/", "name": "Estonian National Symphony Orchestra", "description": "Former Detroit Symphony Orchestra music director Neeme Järvi returns to Southeast Michigan with the Estonian National Symphony Orchestra.\n\nJärvi leads the ensemble in its UMS debut with a program steeped in the music of Estonian composers, including the beautiful fifth symphony of Eduard Tubin, who fled to Stockholm in 1944 when the Soviet Union occupied Estonia. Garrick Ohlsson, a musician of magisterial interpretive and technical prowess, joins the orchestra for Brahms’s first piano concerto.\n\nMore info: http://ums.org/performance/estonian-national-symphony-orchestra/"}, {"date": "2018-02-04T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/817007715141905/", "name": "Ian Bostridge, tenor and Julius Drake, piano", "description": "Schubert’s Winterreise\nIan Bostridge, tenor\nJulius Drake, piano\n\n“Even as a child, I was unnaturally obsessed with love and death,” says celebrated English tenor Ian Bostridge. “So in that sense, I really was born to sing lieder.”\n\nBostridge’s fascination with Schubert’s Winterreise extends beyond the hundreds of performances he has given of the 24 song cycle; the former historian has also written a book, Schubert’s Winter Journey: Anatomy of an Obsession. The book is an engrossing read, but the live performance of a winter journey across a landscape of lost love is not to be missed. Of recent performances in England, the Financial Times observed that “Bostridge gets inside the very soul of Schubert’s tortured winter traveler.” The Telegraph raved, “This was without doubt the most extraordinary, riveting, uncanny performance of Schubert’s great song-cycle I have ever witnessed.”\n\nMore info: http://ums.org/performance/schuberts-winterreise/"}, {"date": "2018-02-08T19:00:00-06:00", "source": "Facebook", "url": "https://www.facebook.com/events/426467187725959/", "name": "American Ballet Theatre: Romeo and Juliet", "description": "Kenneth MacMillan’s masterful interpretation of Shakespeare’s enduring romantic tragedy has become one of ABT’s signature productions.\n\nThe story of Verona’s tragic star-crossed lovers is woven throughout a dance tapestry rich in character nuance and sensuality, with Renaissance Italy providing a sumptuous and period-perfect background. Sergei Prokofiev’s instantly recognizable music underscores the lyric beauty and passion of this beloved ballet. UMS and Michigan Opera Theatre co-present American Ballet Theatre as part of an extended partnership to bring dance to southeastern Michigan. Casting to be announced.\n\nMore info: http://ums.org/performance/american-ballet-theatre/"}, {"date": "2018-02-10T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/283934428684734/", "name": "Joshua Bell, violin and Sam Haywood, piano", "description": "Joshua Bell enchants audiences with his breathtaking virtuosity and charismatic stage presence.\n\nHis restless curiosity, passion, and multi-faceted musical interests have developed and deepened since he was first spotted plucking tunes with rubber bands stretched around the handles of his dresser drawers at age four. Though unrecognized during a morning rush-hour performance in the DC Metro documented by the Washington Post, his concerts regularly draw rock-concert enthusiasm from audiences, despite — or perhaps because of — his down-to-earth personality.\n\nMore info: http://ums.org/performance/joshua-bell-violin-sam-haywood-piano/"}, {"date": "2018-02-14T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1892469594343329/", "name": "Emmanuel Pahud, flute and Alessio Bax, piano", "description": "A star flutist only comes around once or twice in a generation — and it’s fair to say that this generation’s strongest candidate is the Swiss-born Emmanuel Pahud.\n\nOne of today’s most adventurous musicians, Pahud joined the Berlin Philharmonic as principal flute under Claudio Abbado at age 22, a position he still holds today. For this debut recital, he performs arrangements of sonatas written for other instruments, allowing audiences to experience the works from a completely different soundscape.\n\nMore info: http://ums.org/performance/emmanuel-pahud-flute/"}, {"date": "2018-02-17T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1657971264511574/", "name": "Opera in Concert: The Gershwins’ Porgy and Bess", "description": "UMS and the U-M School of Music, Theatre & Dance (SMTD) present  U-M Gershwin Initiative’s research discoveries into this landmark score.\n\nPorgy and Bess is without rival as the most famous 20th-century American opera. Since its 1935 debut, this story of a disabled beggar transformed by the unexpected love of Bess has been performed worldwide and features such well-known songs as “I Got Plenty o’ Nuttin’,” “My Man’s Gone Now,” “Summertime,” and “It Ain’t Necessarily So.” In addition to the concert, UMS and SMTD will host related symposia and other educational activities as part of an ongoing scholarly examination of the art of George and Ira Gershwin.\n\nMore info: http://ums.org/performance/george-gershwins-porgy-and-bess/"}, {"date": "2018-03-09T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/798070050351249/", "name": "Company Wang Ramirez: Borderline", "description": "A couple both onstage and in real life, Sébastien Ramirez, a Frenchman with Spanish parents, and Honji Wang, a German woman with a Korean mother, make their UMS debut with Borderline.\n\nTheir dance backgrounds could hardly be more different — Ramirez was a B-boy while Wang was classically trained — but they share a love of other dance styles and an interest in experimentation. In Borderline, the six dancers toy with the forces of gravity through a subtle and sophisticated use of rigging, creating a powerful evening of breathtaking movement, physical energy, and spiritual serenity. “The contemporary dance revolution is taking place. And dancers like Sébastien Ramirez and Honji Wang are on the frontlines.” (L’Indépendant)\n\nMore info: http://ums.org/performance/company-wang-ramirez/"}, {"date": "2018-03-11T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1710470309252752/", "name": "Elias Quartet", "description": "After a three-year project exploring all of Beethoven’s string quartets, the Elias Quartet decided to consider how composers after Beethoven lived up to his monumental legacy.\n\nSome of them approached their string quartets by expanding his musical language; others took a more poetic and imaginative turn of phrase. This particular program focuses on the freshness and fluidity of the music of Schubert and Dvořák, both of whom had a particular gift for writing melodies that seemed to spring from an endless well of inspiration.\n\nMore info: http://ums.org/performance/elias-quartet/"}, {"date": "2018-03-13T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1796401707355462/", "name": "Tenebrae: Path of Miracles", "description": "Joby Talbot’s Path of Miracles was the first major work commissioned by the professional vocal ensemble Tenebrae, a group that was founded by former King’s Singers member Nigel Short in 2000 and includes members drawn from the choirs of Westminster Abbey, King’s College Cambridge, and Britain’s two major opera houses.\n\nThe work was supposed to premiere in London on July 7, 2005, but was delayed because of the London bombings that day, which killed over 50 people and injured more than 700. Ten days later, Path of Miracles received its premiere as part of the City of London Festival. Talbot’s composition is based on the most enduring route of Catholic pilgrimage, the great Pilgramage to Santiago, and the four movement titles are the four main posts along the route (Roncevalles, Burgos, León, and Santiago). Path of Miracles incorporates medieval texts and Roman Catholic liturgy and is sung in Greek, Latin, Spanish, Basque, French, English, and German. Candlelight and an imaginative use of the St. Francis of Assisi space guarantee a dramatic evening.\n\nMore info: http://ums.org/performance/tenebrae-path-of-miracles/"}, {"date": "2018-03-14T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1923056544607027/", "name": "Piedmont Blues: A Search for Salvation", "description": "Ragtime rhythms, a unique finger-picking guitar style, and understated vocals are the hallmarks of the folk music style found in the Piedmont region, the area between the Atlantic Coastal Plain and the Appalachian Mountains covering central Georgia to central Virginia.\n\nJazz pianist and composer Gerald Clayton (who also holds down the piano chair in the Charles Lloyd Quartet) has captured the essence of this celebrated land, home to a unique culture and rapidly vanishing folkloric history, and preserved it in a multimedia project. This music-theater experience features a nine-piece band led by Clayton and combines music with projected film, new and archival photography, and the stories of those few musical elders who are still keeping the tradition alive. It makes a testimony of the struggle endured by African Americans in the Southeast during Jim Crow and chronicles the efficacy of the Piedmont Blues as a salve for suffering.\n\nMore info: http://ums.org/performance/piedmont-blues-a-search-for-salvation/"}, {"date": "2018-03-17T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/138402956702506/", "name": "Steve Lehman & Sélébéyone", "description": "Though hip-hop and jazz are clearly no strangers to one another, Sélébéyone takes the conversation between jazz and hip-hop to “feverish new heights” (The WIRE), drawing from Senegalese rap, modern jazz, live electronics, and underground hip-hop to create a unique form of urban experimentalism.\n\nComposer and saxophonist Steve Lehman, a “quietly dazzling saxophonist” (New York Times), has built a career creating innovative new music that packs a visceral wallop. He leads this international ensemble, which includes rappers HPrizm, a legend of New York’s underground hip-hop scene, and Gaston Bandimic, one of Senegal’s most distinctive young rap stars, in a unique hybrid that juxtaposes English and Wolof against changing meters and asymmetrical rhythms, giving rise to the development of a whole new musical universe. In Wolof, “sélébéyone” refers to an intersection, where two fixed entities meet and transform themselves into something previously unknown. “The international jazz-rap project Sélébéyone is a rare case of two genres mixing at their most far-out, abstract corners.” (Pitchfork)\n\nMore info: http://ums.org/performance/steve-lehman-selebeyone/"}, {"date": "2018-03-22T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1164904813638590/", "name": "Bubble Schmeisis", "description": "Welcome to the steam baths! The word bubbemeises is a Yiddish term meaning “a grandmother’s story” or “an old wives’ tale.”\n\nWriter and street performer Nick Cassenbaum, along with his klezmer musicians, invite you into the warmth of the Schvitz in Detroit, one of the country’s few remaining traditional bath houses, which has been in operation for over 85 years. Among the steam and the ritual, Nick will take you on a journey of discovery to find the place where he belongs. Bubble Schmeisis is full of intimate and personal true stories about identity, home, and getting schmeised (washed) by old men. “It is by far the funniest thing I have seen in Edinburgh so far… Bubble Schmeisis is also beautiful in its depiction of male friendship and shared routines.” (Exeunt)\n\nPlease note: Due to the historical nature of the venue, the Schvitz is not fully-accessible; audiences must descend stairs to get into the space, and there is no elevator. UMS makes every effort to hold its events in accessible spaces, but the unique nature of this work, which must be presented in a real bath house, limited the options available.\n\nMore info: http://ums.org/performance/bubble-schmeisis/"}, {"date": "2018-03-23T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1882767398637595/", "name": "Nederlands Dans Theater", "description": "Widely considered the Berlin Philharmonic of the dance world, Nederlands Dans Theater has forged a path between classical ballet and American modern dance, creating a modern ballet style that is widely admired across the world.\n\nMany NDT members have gone on to found companies around the world, including Nacho Duato, Ohad Naharin, and Crystal Pite. Pite’s 2016 work, “The Statement,” features two men and two women dealing with a conflict in a boardroom setting, with Jonathan Young (from the 2016-17 season’s Betroffenheit) providing the script/score. “Shoot the Moon” is a heartbreaking view of three different love stories deteriorating behind closed doors in a revolving set of three rooms, set to music by Philip Glass. “Think ballet line and virtuosity fused with modern dance weight and power. Think a commitment to the deepest European art-making traditions with no pandering to pop culture. Above all, think a super-ensemble: dancers who can form a superb corps one moment and perform just as superbly as principals the next.” (Los Angeles Times)\n\nMore info: http://ums.org/performance/nederlands-dans-theater/"}, {"date": "2018-03-31T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/276664639461191/", "name": "Jazz at Lincoln Center Orchestra with Chick Corea", "description": "The Music of Chick Corea\n\nSurprise! This perennial favorite is back, but this time with jazz pianist Chick Corea at the helm. Corea’s staggering career, spanning more than 50 years, is a torrent of creative and professional highlights.\n\nHis last UMS appearance, with Herbie Hancock, was a sellout, and demonstrated why the New York Times called him “a luminary, ebullient and eternally youthful.” Corea’s fearless creative spirit has earned him a slew of accolades along the way, including the country’s highest honor for a jazz artist when he was named an NEA Jazz Master in 2006. “The Jazz at Lincoln Center Orchestra is ridiculously tight, executing tricky maneuvers like a fighter jet.” (DownBeat)\n\nMore info: http://ums.org/performance/jazz-at-lincoln-center-orchestra-with-chick-corea/"}, {"date": "2018-04-08T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1437444286325815/", "name": "Artemis Quartet", "description": "Named after the Greek goddess of hunt and wilderness, the Artemis Quartet was founded in 1989 but took a full 10 years before it performed its first concerts for a live audience.\n\nThis dedication to excellence has not wavered, and their playing is known for its “apparently effortless grace and effervescent athleticism.” (BBC) Based in Berlin, it programs its own series at the Berlin Philharmonie and the Vienna Konzerthaus, as well as in Munich and Amsterdam.\n\nMore info: http://ums.org/performance/artemis-quartet/"}, {"date": "2018-04-13T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/137157083493985/", "name": "The Jazz Epistles featuring Abdullah Ibrahim and Hugh Masekela", "description": "The two iconic South African jazz legends Abdullah Ibrahim and Hugh Masekela reunite and perform as part of a tour that puts them on the same stage for the first time in 56 years.\n\nThey come together for a historic concert to tell the story of The Jazz Epistles, the first all-black jazz group in South Africa and arguably the most important jazz (bebop) recording in the country’s history. This music was almost lost forever — only 500 copies were pressed in 1959, buried, and rediscovered decades later after the tyranny of apartheid. These giants of South African jazz perform music from the seminal Jazz Epistles recording alongside music from both of their illustrious careers. “[Ibrahim] glowed with a sound reminiscent of that of [his] most famous patron, Duke Ellington.” (Guardian) “Hugh Masekela creates an instant party, leading from vocals and flugelhorn like a South African Louis Armstrong.” (Guardian)\n\nMore info: http://ums.org/performance/the-jazz-epistles-featuring-abdullah-ibrahim-and-hugh-masekela/"}, {"date": "2018-04-14T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/136496643560270/", "name": "Colin Stetson", "description": "Sorrow: A Reimagining of Górecki’s Third Symphony\n\nHenryk Górecki’s iconic third symphony, often called “Symphony of Sorrowful Songs,” made a huge impact on listeners in the early 1990s and was a musical touchstone for virtuoso saxophonist Colin Stetson.\n\nThe original work’s three movements centered around three laments, each focused in some way about a child being taken away from a mother. Celebrated for the way he “demolishes clichés to unleash fresh, unexpected energies,” (Pitchfork) Stetson takes on the mammoth task of reimagining Górecki’s symphony for an expansive and contemporary sonic palate. Sorrow, his imaginative new interpretation of the heartbreaking work, is “timeless and of the moment,” (PopMatters) drawing on a uniquely constructed 12-member ensemble that employs electric guitars, synthesizers, drums, strings, woodwinds, and soprano to create transformative extensions of the emotional core of the piece.\n\nMore info: http://ums.org/performance/colin-stetson-sorrow/"}, {"date": "2018-04-15T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/319354431816493/", "name": "Opera in Concert: Monteverdi’s L’Orfeo", "description": "Apollo’s Fire / The Cleveland Baroque Orchestra\n\n“It’s hard to say who wrote the very first opera, but there’s little doubt about the first, truly great one — it’s Monteverdi’s 1607 masterpiece, L’Orfeo.” (National Public Radio)\n\nAs one of the earliest examples of the form, and certainly the earliest that still has a place in the present repertoire 400 years later, L’Orfeo sets to music the famous myth of Orpheus and Eurydice, whose long-awaited wedding night ends in tragedy when Eurydice is bitten by a poisonous snake and Orfeo storms the gates of hell to rescue her. Jeannette Sorrell leads a company of 40 performers in this semi-staged production with period dancers. Performed in Italian with English supertitles.\n\nMore info: http://ums.org/performance/monteverdis-lorfeo-apollos-fire-baroque-orchestra-and-chorus/"}, {"date": "2018-04-19T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/988108387991369/", "name": "Charleroi Danses: Cold Blood", "description": "After the resounding success of Kiss & Cry (2014-15 season), the magnificent creative team of Charleroi Danses in Belgium brings Cold Blood, a poetic journey that is filmed before your very eyes.\n\nThe performance explores the miniscule, surveying the worlds where life is viewed through a kaleidoscope, with fingers cavorting in a delightful miniature setting. In a hypnotic story laced with offbeat humor, Cold Blood explores the uncertain, yet inevitable, last moments we experience before we die. Cold Blood is neither a sequel nor an epilogue to Kiss & Cry but utilizes the same storytelling techniques, combining film, dancing fingers, music, and theater in brilliant and surprising ways. “If the team came back to Quebec ten times, we would rush to see them ten times. And would encourage you to do the same. Because their work is absolutely masterful.” (Le Devoir, Montreal)\n\nMore info: http://ums.org/performance/cold-blood/"}, {"date": "2018-04-22T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1997818657105976/", "name": "Murray Perahia, piano", "description": "Murray Perahia’s place in the pantheon of great musicians is indisputable.\n\nWith 12 UMS appearances since his debut over 40 years ago, he is one of the most treasured artists to appear on our series and consistently delivers performances that audiences remember years, or even decades, later. With his particular kind of magic, each and every performance is a revelation.\n\nMore info: http://ums.org/performance/murray-perahia-piano/"}]