[{"date": "2017-03-04T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1839182856327434/", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "name": "Women's History Month and Planned Parenthood"}, {"date": "2017-03-04T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/929444727192886/", "description": "On March 4th we will read \"A Warm Winter Tail\" by Carrie Pearson and meet a mouse as we learn about what it's like to be a mammal. \n\nNature Tales happens on select Thursday and Saturday mornings and focuses on outdoor and nature-based activities that inspire you and your preschoolers and their grown-ups to explore and appreciate the out of doors at LSNC—Ann  Arbor’s very own backyard. Each session will be centered around a specific theme and include a variety of hands-on activities, like live animal encounters, guided hikes, group games, and enticing stories. \n\nPrograms will take place outdoors rain or shine—please dress for the weather. This program’s theme is Furry Friends. \nAges: 5 years and younger\n$4 per child ($3 per member), adults are free", "name": "Nature Tales: Furry Friends"}, {"date": "2017-03-04T10:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/411636892503853/", "description": "Create your own forged bracelet out of copper wire! You’ll learn metalsmithing techniques like forming, forging, and finishing while gaining experience with Anvils, Hammers and Torches. \n\nThis 2 hour Make & Take Workshop is perfect for students as young as 8 with an adult (16+), or anyone over 13 on their own.  Fun for kid+adult to do together! Register each person in your group, so we know how many will be coming. No prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.\n\nCall Maker Works at 734-222-4911 or visit  http://www.supersaas.com/schedule/makerworks/CheckOut?view=day&month=3&day=4 to register!", "name": "Forge Your Own Copper Bracelet (good for families!)"}, {"date": "2017-03-04T13:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/172303896603725/", "description": "Longtime A2CT member and MFA-educated actor/director Glenn Bugala is teaching a 6-week Practical Acting Workshop this March and April!\n\nThe class runs 6 Saturdays, from 1-3 PM, March 4 - April 8, 2017 at the A2CT studio. This course will focus on practical techniques that all actors can use for musicals, straight plays, group or solo performance. Rather than an acting intensive, this class is a light-touch look at the craft of acting, designed for those with all levels of experience. If you're looking to get started acting, or you'd like to brush up your skills, this class is for you. \n\nParticipants must be 16 years or older. The cost of the class is $150 (sorry, no refunds for missed sessions). You may register by emailing manager@a2ct.org or calling the office at 734-971-0605 (M-F, 9AM-4PM). \n\nHurry! Space is limited!", "name": "Practical Acting Workshop"}, {"date": "2017-03-04T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1204202942946225/", "description": "“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas)\n\nSince 1988, Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, it’s all sheer jazz perfection — and no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/jazz-at-lincoln-center-with-wynton-marsalis/", "name": "Jazz at Lincoln Center with Wynton Marsalis"}, {"date": "2017-03-04T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/195810100885174/", "description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XV"}, {"date": "2017-03-04T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/362897307429638/", "description": "Join us at Club Above in Ann Arbor to experience the muscial stylings of Nuaudio, Pajamas, and Cetan Clawson! If you enjoy alt rock, blues, fusion, and jam music then this is a show you do not want to miss! $5 for 21+, $7 for under.", "name": "Nuaudio, Pajamas, Cetan Clawson at Club Above"}, {"date": "2017-03-04T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1375141332547113/", "description": "Donation based admission. All proceeds go to planned parenthood.\n\nDrugs in the Carpet (Kalamazoo)\ndrugsinthecarpet.bandcamp.com\nm.facebook.com/drugsinthecarpet\n\nRotokiller (Ypsilanti)\nrotokiller.bandcamp.com\n\nDecisions  (Ypsilanti)\ndecisionsband.bandcamp.com\nm.facebook.com/decisionsband\n\nPLEASE FOLLOW house RULES and be RESPECTFUL towards EACH OTHER/THE BANDS/THE HOUSE/THE NEIGHBORS!", "name": "Planned Parenthood Benefit"}, {"date": "2017-03-05T11:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1724899501156129/", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration"}, {"date": "2017-03-05T15:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1737031363276684/", "description": "Join us for a long-awaited small-batch beer release! This one is from our Brewmaster himself, Oliver Roberts. There is a very limited amount of Creamy Good available, so clear your Sunday afternoon! Plus: We're featuring brisket tacos with mole sauce to pair with this chocolatey treat. Read on for a description! \n\nFrom Oliver: \"Tantalizing aromas of maple syrup and sweet dipping chocolate preface a silky, smooth, creamy first sip with hints of dark chocolate followed by campfire toasted marshmallows. Creamy Good has been aging quietly in the corner of the brewery cellar for over a year. It was Brewmaster Oliver Roberts' first 10 gallon brew in years, alas when it was done fermenting he pushed it aside to age and forgot about it. He walked past it hundreds of times somehow knowing it wasn't ready. Then the bartenders of Wolverine State could wait no more and got it ready to serve. Should beer ever be aged or forgotten for a year? Not typically but in this case it is so Creamy Good.\"\n\n6.7% ABV/34 IBUs", "name": "Small-Batch Beer Release: Creamy Good!"}]