[{"description": "This class covers the operation of pedestal grinders, angle grinders and belt/disc sander. You will learn basic operation with an emphasis on safety. With the successful completion of this class you will be certified to use these tools on your own at Maker Works.\n\nRegister by calling 734-222-4911 or visiting http://www.supersaas.com/schedule/makerworks/CheckOut?day=29&month=10&year=2016&view=day\n\nNo prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.", "url": "https://www.facebook.com/events/169455303513447/", "date": "2016-10-29T11:00:00-04:00", "name": "Metal Abrasives - $25 - 1 Hr", "source": "Facebook"}, {"description": "Come watch as Vault of Midnight gets invaded by masked heroes, spooky ghosts, and at least one Harley Quinn. Starting at Noon, Vault Staff will be on hand to take photos of you in your amazing costume. All photos will be entered in our costume contest and the winners will be announced in the coming days. \n\nThis year we will be judging both an adult and kids category (we got pretty tired of all the adults crying about how great the kids' costumes were). Prizes will be given out for the top three costumes in each group and are as follows:\n\nAdults (Ages 16+)\n1st Place: $100 Vault of Midnight Gift Card\n2nd Place: $50 Vault of Midnight Gift Card\n3rd Place: $25 Vault of Midnight Gift Card\n\nKids:\n1st-3rd Place: $10 Vault of Midnight Gift Card and a Halloween-themed Graphic Novel\n\nCheck out Vaultofmidnight.com for our full list of Halloween activities.", "url": "https://www.facebook.com/events/1822022961367861/", "date": "2016-10-29T12:00:00-04:00", "name": "Vault of Make-Believe Costume Contest", "source": "Facebook"}, {"description": "Happy Halloween! Join us on October 29th during the Saturday market for trick or treating, games, activities, and more! Bring the whole family and don't forget your costumes!", "url": "https://www.facebook.com/events/197763613969181/", "date": "2016-10-29T12:00:00-04:00", "name": "Halloween at the Market!", "source": "Facebook"}, {"description": "The PSSWC is an unsupported group ride around the Potawatomi Trail. This is not a race.", "url": "https://www.facebook.com/events/1068615186579290/", "date": "2016-10-29T12:00:00-04:00", "name": "Poto Singlespeed World Championship", "source": "Facebook"}, {"description": "This class will introduce you to the Tormach CNC mill and Bridgeport mill. You will learn basic operation with an emphasis on safety. With the successful completion of this class you will be certified to use the Tormach CNC mill and Bridgeport mill on your own.\n\nRegister by calling 734-222-4911 or visiting http://www.supersaas.com/schedule/makerworks/CheckOut?day=29&month=10&year=2016&view=day\n\nNo prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.", "url": "https://www.facebook.com/events/1810440489192881/", "date": "2016-10-29T12:00:00-04:00", "name": "Learn to machine metal (manual and CNC mills) - $95 - 3.5 Hrs", "source": "Facebook"}, {"description": "Join us at 12 PM on Saturday, October 29th for this 20th anniversary celebration parade! \n\nEdgefest 2016 musicians, led by one of our Edgefest artists, and members of the community at large, including students from Clague & Scarlett Middle Schools, will participate in the now-traditional Edgefest parade. Instruments of all kinds create a highly creative, fun and quirky musical presence in the Kerrytown area, surprising the unsuspecting shoppers at the Saturday morning Ann Arbor Farmers' Market and surrounding areas. The public is invited to tag along with any kind of instrument they have at hand, including bells and whistles! \n\nMeet us at Kerrytown Concert House at 11:30 am.", "url": "https://www.facebook.com/events/239138856489150/", "date": "2016-10-29T12:00:00-04:00", "name": "Edgefest Parade | Fringe at the Edge", "source": "Facebook"}, {"description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Will McEvoy's Third Coast Quartet, Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation: A Tribute to Connie Crothers, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, MoTreetown Collective, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest website: \nwww.edgefestannarbor.com", "url": "https://www.facebook.com/events/1606056323056977/", "date": "2016-10-29T17:00:00-04:00", "name": "Edgefest 20: 20 Years At The Edge!", "source": "Facebook"}, {"description": "All Sanctuary relishes the element of surprise. It is an unexpected and improvisatory trio that fuses sounds from across the instrumental spectrum featuring Mark Kirschenmann (playing trumpet without a mouthpiece), John Churchville (on tabla) and harpist Jennifer R. Ellis. \n\nAll Sanctuary will present a special dinner concert at The Lunch Room (to see The Lunch Room menu, visit thelunchrooma2.com).\n\nThis performance is a part of the Fringe at the Edge series, celebrating the spirit of Edgefest through free public performances throughout downtown Ann Arbor.", "url": "https://www.facebook.com/events/305604223155974/", "date": "2016-10-29T17:30:00-04:00", "name": "All Sanctuary at The Lunch Room | Fringe at the Edge", "source": "Facebook"}, {"description": "LSNC’s beloved autumnal celebration returns! Celebrate Halloween with LSNC's non-scary Animal Haunts. Take a guided hike through Black Pond Woods, where costumed interpreters bring plants and animals to life by sharing natural history facts and stories. We'll have festive fun with harvest crafts,a hay jump, and more. Don't forget to come in costume! \n\nRegistration is required by October 26th. Register online at http://bit.ly/2ctiV5w or call (734) 997-1553", "url": "https://www.facebook.com/events/1145687525505590/", "date": "2016-10-29T18:00:00-04:00", "name": "Animal Haunts", "source": "Facebook"}, {"description": "Want the biggest & best Halloween party in Michigan? You've found it. \n\n• DRINK SPECIALS. Happy Hour is from 9pm - 11pm with\n50% off all drinks, shots & bottled beers & $2 Long Islands. \n\n• MUSIC. DJ Hardy spins the best Top 40, Dance & House with host MC Yoda.\n\n• PLEASE NOTE. No metal or hard plastic, toys, or faux weapons are permitted. \n\n• FREE PICTURES with your friends by a professional photographer.\n\n• COVER. $5 for 21+ & $10 for 18 to 20.\n\nGet here early to avoid the line & to hit up the 1/2 off happy hour!", "url": "https://www.facebook.com/events/194207361000676/", "date": "2016-10-29T21:00:00-04:00", "name": "Halloween Saturday 2016", "source": "Facebook"}]