[{"url": "https://www.facebook.com/events/1871445973082972/", "description": "Coming Friday, August 5\n\nPOP-IN: Intermitten Edition [intermitten.org]\nWorks that showcase the intersection of Art and Tech\n\nFREE ADMISSION\n6:00PM – 9:00PM \n\nJoin us for POP-IN: one night only pop-up expressions of creativity by local artists that will immerse you in unusual, accessible experiences.\n\nCurated by and in partnership with the Intermitten conference, where influential leaders reveal how harnessing creativity transforms industries\n\nMusic Performances by:\n\nShigeto\nCharles Trees\nwith virtual reality experience provided by ICON Interactive\nFeaturing:\nCreative learning environment with a “hacked piano” by Sam Pierce Lolla\nSound installation booth by Anna Nuxoll\nThe artwork of Jeremy Wheeler\nLive screen dance by Sean Hoskins\nDrop-in origami making and origami exhibition by Beth Johnson\n\nand more!", "source": "Facebook", "date": "2016-08-05T18:00:00-04:00", "name": "Pop in Intermitten Edition"}, {"url": "https://www.facebook.com/events/1312355338789742/", "description": "For the second year running, Literati is pleased to help celebrate MGoBlog's Hail To The Victors--an indepedent, definitive, in-depth guide to the upcoming Michigan Football Season--with an event in its honor. The evening will again feature a presentation from the issue's contents, and additional copies will be available for sale. This year's event will take place at Circus Bar & Billiards. Purchase a drink from their full bar, grab a bowl of free popcorn, revel in the football previewing. Free and open to the public. 7pm.\n\nFeatured in Hail To The Victors 2016: \n\nMGoBlog's Brian Cook writes a team preview covering about a third of the book, offers an opinion on the overall state of the offense, defense, and special teams, and then plunks down a prediction that will no longer be roundly mocked because Michigan's coaching staff is no good. Probably.\nAce Anbender surveys the opposition with savage intent. Buckeye Grove's Ross Fulton rounds out the Ohio State preview; Ross's in-depth knowledge of the Buckeyes and surprising sanity are an excellent combination.\nAdam Schnepp sits down with tight end Jake Butt and discusses Harbaugh, the NFL, his decision to avoid it, and many other topics. Michael Elkon on expectations in year two of Harbaugh.\nSBNation's Ian Boyd on John O'Korn and how he fits into Harbaugh's passing game. Steve Sharik on Don Brown's dudes and what he plans to accomplish with them.\nSeth Fisher and Mel Newman on when Texas A&M tried to buy Bo... and failed. John Kryk on The Guarantee, 30 years later. Steve Sapardanis on the Six Penny Defense, or when Bo invented the dime package. Craig Ross on how Michigan more or less invented all of football, from the forward pass to platoons.", "source": "Facebook", "date": "2016-08-05T19:00:00-04:00", "name": "MGoBlog's Hail to the Victors 2016 at Circus Bar"}, {"url": "https://www.facebook.com/events/503218819864337/", "description": "Join us on Friday, Saturday & Sunday, August 5-7 for OUTFest 2016!  OUTFest is free and open to the public. \n\n~~ Friday, August 5, 2016 ~~\n\nMovie Night: Rent in Braun Court: 8:00 PM\nNecto Pride Night at Necto: 9:00 PM - 2:00 AM\n\n~~ Saturday, August 6, 2016 ~~\n\nFestival Booths & Exhibits at Kerrytown N. 4th Ave.: 10:00 AM-8:00 PM\n\nJim Toy Community Center Open House: 10:00 AM-5:00 PM\n\nDJ Selina Style at N. 4th Ave. Stage: 10:00 AM-Noon\n\nRedi and the Midnight Hour Perform at N. 4th Ave. Stage: Noon-2:00 PM\n\nKid Zone in Braun Court at Braun Court Parking Lot: Noon-6:00 PM\n\nElemental Meaning Performs at N. 4th Ave. Stage: 2:00-3:00 PM\n\nDrag Revue at Kerrytown N. 4th Ave. Stage: 3:00-4:30 PM\n\nBeer & Wine Garden at Braun Court Parking Lot: 4:00 PM-Midnight\n\nSilent Auction at Beer & Wine Garden: 4:00-7:00 PM\n\nCivil Rights & Equal Protection Talk at The Bar at 327 Braun Ct: 4:00-5:00 PM\n\nAlise King Performs at Kerrytown N. 4th Ave. Stage: 4:30-5:30 PM\n\nPoetry Slam w/ Jason B. Crawford at The Bar at 327 Braun Ct: 5:00-6:00 PM\n\nOut Loud Chorus Performs at N. 4th Ave. Stage: 5:30-6:30 PM\n\nBoard Game Night at Brillig Dry Bar/Mighty Good (N. Main): 6:00-10:00 PM\n\nBurlesque Show with Queens of Cups at Kerrytown N. 4th Ave. Stage: 6:00-7:00 PM\n\nSam Tolson Performs at Kerrytown N. 4th Ave. Stage: 7:00-8:00 PM\n\nOUTFest Drag Revue w/ Jadein Black & Sabin at N. 4th Ave. Stage: 8:00-9:00 PM\n\nNecto Pride Dance Party with DJ Jace at N. 4th Ave. Stage: 9:00 PM-Midnight\n\nOUTFest After Party at Circus Bar: Midnight-2:00 AM\n\n~~ Sunday, August 7, 2016 ~~\n\nWashtenaw County Pride Picnic at Wheeler Park: Noon-4:00 PM\n\n\nFor a complete and evolving schedule of events, visit www.a2outfest.com\n\nPresenting Sponsors:\nComcast Michigan\nBetween The Lines Newspaper\nWolverine State Brewing Co.\nBarefoot Wine & Bubbly\nNecto Pride\n\nSponsors:\nMANI Osteria & Bar & Isalita\nDomino's Pizza\nComerica Bank\nCare One, Inc.\nVisit Ann Arbor! & Ypsi Real\nOut Post\nBill's Beer Garden\nTrillium Real Estate\nBlue Cross Blue Shield of Michigan\nbank of ann arbor\nPNC\nDuo Security\nAut Bar & Common Language Bookstore\nUNIFIED - HIV Health and Beyond\nAmerican Red Cross, Southeastern Michigan Region\nUniversity of Michigan Spectrum Center\nCorner Health Center\nWoodland Mews\n327 Braun Court\nThe Wurst Bar\nMighty Good Coffee\nBrillig Dry Bar\nWilson P. Tanner III, PLC\nCircus Bar and Billiards Ann Arbor\nColor Pet Productions\n\nFriend of Jim Toy:\n Zingerman’s, Queer Young Professionals, Plum Market\n\nHonorary Chairs:\nJim Toy, Sheriff Jerry Clayton, State Representative Adam Zemke, State Representative Kristy Pagan, Commissioner Felicia Brabec,  Commissioner Andy LaBarre, Commissioner Yousef Rabhi, City Council member Anne Brown, Leigh Greden, Jason Frenzel, Cynthia Dunitz, Jim Simpson, Jeremy Merklinger, Heather Wold-Gallagher, Jennie Hale, Mary Larkin, Christine Kitora, Meg Wyzlic, Renee & John Greden\n\nOur Mission: We envision an inclusive community where people of diverse sexual orientation and gender identity are visible and live together in equality, respect and happiness.", "source": "Facebook", "date": "2016-08-05T20:00:00-04:00", "name": "OUTFest & Pride Picnic 2016"}, {"url": "https://www.facebook.com/events/1597811077198277/", "description": "At the Kerrytown Concert House this summer: Oscar Wilde’s The Importance of Being Earnest, directed by James Ingagiola.  Unbeknownst to his friends and acquaintances, John Worthing leads a double life:  He is Jack, a respectable landowner, in the country and Ernest in the city.  But when the love of his life, the elegant Gwendolyn Fairfax, insists that her dream is to marry a man named Ernest, John must abandon his dual identity–which may prove harder than it seems…especially when his friend Algernon visits John’s country estate pretending to be Ernest!  This “Trivial Comedy for Serious People” is truly one of the wittiest, funniest plays in the English language.  \n\nThe show will run August 4-6, with 8 p.m. start times on Thursday, Friday and Saturday, PLUS a 2 p.m. matinee on Saturday (there is no show on Sunday).\n\nThe cast will feature Amanda Barnett, Ethan Gibney, Elizaveta McFall, Amanda Photenhauer, Jan Romans, Annaliese Romans, Elizabeth Wagner, and Catherine Zudak.\n\nTickets are $15 for adults/$5 for students.  Visit http://www.kerrytownconcerthouse.com/index.php/events/event/BTE_earnest_thu/, call 734-769-2999 or email reservations@kerrytown.com for tickets.", "source": "Facebook", "date": "2016-08-05T20:00:00-04:00", "name": "The Importance of Being Earnest"}, {"url": "https://www.facebook.com/events/1029166527138447/", "description": "It's movie night at Pointless! \"Silver Screenings Playbook\" is a curated collection of comedic video shorts from Detroit area filmmakers and actors. Our League of Pointless Improvisers will open the show with some hilarious improv, then the films start rolling, giving you a wide variety of some of the best homegrown comedy around. One weekend only!\n\nFriday, August 5 @ 8 pm\nSaturday, August 6 @ 8 pm", "source": "Facebook", "date": "2016-08-05T20:00:00-04:00", "name": "Silver Screenings Playbook"}, {"url": "https://www.facebook.com/events/301838690156473/", "description": "join us as we communicate with the other side, special guest THE FRIEND will be our medium for the evening. Matilda will be providing the visual circle of hands\n\nThe Friend\nhttps://soundcloud.com/thefriend\n\nother participants include\n\nsuitor\nhttps://soundcloud.com/suitor-1\n\njimmy k\nhttps://soundcloud.com/jimmykdetroit\n\nPAT in the HAT\nhttps://soundcloud.com/patinthehatdoe\n\njeff garcia\nhttps://mixcloud.com/garconsrustiques/\n\nsanford\n\nVISUALS\n\nUnofficial: Matilda", "source": "Facebook", "date": "2016-08-05T20:00:00-04:00", "name": "Summer Seance wsg The Friend (how to kill) at Club Above"}, {"url": "https://www.facebook.com/events/1743322025932290/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \" Nuverre & Aaron\" \n\nGroup 2: \"Horses\"\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Arthur Brannon III, Corene Ford, Jason Valentini, and Moni Jones", "source": "Facebook", "date": "2016-08-05T22:00:00-04:00", "name": "Pointless Improv with Nuverre & Aaron and Horses"}, {"url": "https://www.facebook.com/events/247419802290299/", "description": "What was once a construction yard for M-14 is now a natural grassland. Exotic invasive plants are invading this open habitat, and volunteer help is needed to remove them. Please meet at the park entrance on Beechwood Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "source": "Facebook", "date": "2016-08-06T09:00:00-04:00", "name": "Kuebler Langford Park Stewardship Workday"}, {"url": "https://www.facebook.com/events/1254446424585433/", "description": "Happy Birthday Ann Arbor Farmers Market! This year we're celebrating 97 years of bringing the community together over fresh, local, delicious food and more! Join us as we thank our vendors and community for their loyal support.  We're one year closer to the big 100! \n\nIn addition to the regular market hours 7am-3pm, we are so excited to have games and activities for market-goers of all ages 10am-2pm on Detroit Street. Come decorate a birthday card for a market vendor and pick up some tasty treats from some of our favorite local food trucks.\n\nFood Gatherers will be onsite 7am-3pm, accepting donations of fresh fruits and vegetables. This is fantastic opportunity to give back right at the market! The market's birthday kicks off this fantastic partnership, which will be ongoing throughout the month of August.\n\nLiterati Bookstore will be showcasing local food, cooking and gardening books with great examples for ingredients that you can buy right at the market!\n\nA #TasteofMusic performance by the Ann Arbor Symphony Orchestra starting at 12:30 with an instrument petting zoo for kids of all ages from 10am-2pm.\n\nDon't forget to tag us in your pictures with #a2marketbday\nWe're on Twitter and instagram too!", "source": "Facebook", "date": "2016-08-06T10:00:00-04:00", "name": "97th Birthday Celebration!"}, {"url": "https://www.facebook.com/events/1673599989630250/", "description": "Calling all IPA lovers!! Today we come together to share our love of Humulus lupulus!\nWe will feature 5 ABC IPA's on tap kicking off at 11:00am.\n\n- Precious Metal IPA\n6.8% ABV 43 IBU\nSingle-Hopped IPA with El Dorado\n\n- Shark Jumper DIPA\n8.9% ABV 90 IBU\nResinous and dank with hints of apricot and meyer lemon.\n\n- Sacred Cow Cask IPA\n6.9% ABV 80 IBU\nTangy, citrusy hops with distinct ruby-red grapefruit\n\n- Buzzsaw American IPA\n7.5% ABV 51 IBU\nBold hop-forward west coast style with notes of pine, grapefruit, and apricot\n\n - Largebeat Wheat IPA\n8% ABV 90 IBU\nImperial wheat IPA with loads of hops", "source": "Facebook", "date": "2016-08-06T11:00:00-04:00", "name": "IPA Day!"}]