[{"source": "Facebook", "date": "2017-01-09T19:00:00-05:00", "name": "Ambassador Omar Saif Ghobash", "description": "Literati Bookstore is pleased to bring Ambassador Omar Saif Ghobash to Ann Arbor in support of his book, Letters to a Young Muslim, and delighted to announce that he'll be joined in conversation the Arab American National Museum's David Serio. This event will take place in the Rackham Amphitheater and is free and open to the public. Join us!\n\nIn a series of personal letters to his sons, Omar Saif Ghobash offers a short and highly readable manifesto that tackles our current global crisis with the training of an experienced diplomat and the personal responsibility of a father. Today's young Muslims will be tomorrow's leaders, and yet too many are vulnerable to extremist propaganda that seems omnipresent in our technological age. The burning question, Ghobash argues, is how moderate Muslims can unite to find a voice that is true to Islam while actively and productively engaging in the modern world. What does it mean to be a good Muslim?\n\nWhat is the concept of a good life? And is it acceptable to stand up and openly condemn those who take the Islamic faith and twist it to suit their own misguided political agendas? In taking a hard look at these seemingly simple questions, Ghobash encourages his sons to face issues others insist are not relevant, not applicable, or may even be Islamophobic. These letters serve as a clear-eyed inspiration for the next generation of Muslims to understand how to be faithful to their religion and still navigate through the complexities of today's world. They also reveal an intimate glimpse into a world many are unfamiliar with and offer to provide an understanding of the everyday struggles Muslims face around the globe.\n\nOmar Saif Ghobash is the Ambassador of the United Arab Emirates to Russia. In addition to his post in Moscow, Ambassador Ghobash sponsors the Saif Ghobash-Banipal Prize for Arabic Literary Translation and founded the International Prize for Arabic Fiction in collaboration with the Booker Prize in London. Ambassador Ghobash studied law at Oxford and mathematics at the University of London.\n\nDavid Serio is an Education and Public Programming Specialist at the Arab American National Museum (AANM).  He holds a M.A. in Near Eastern Studies and Arabic from Wayne State University.  Mr. Serio joined the AANM in January of 2011, initially as an AmeriCorps, later being hired as a full-time Educator and Public Programmer.  As an Educator and Public Programmer, Mr. Serio has conducted educational presentations and workshops throughout the Mid-West.  Mr. Serio also helps in the planning and implementation of youth programs and cultural events.  Mr. Serio is also the Curator of the Arab Film Festival and manages all of the AANM’s film programming, both at the AANM and at offsite locations around the world.  Mr. Serio is also the Volunteer Coordinator and responsible with growing and managing the volunteer program.  Mr. Serio continues to implement educational and cultural programming to audiences far and wide. \n\nEvent date: \nMonday, January 9, 2017 - 7:00pm\nEvent address: \nRackham Amphitheater\n915 E. Washington St.\nAnn Arbor, MI 48109\nLetters to a Young Muslim Cover Image", "url": "https://www.facebook.com/events/142238682928604/"}, {"source": "Facebook", "date": "2017-01-10T11:00:00-05:00", "name": "Sensory-Friendly Storytime", "description": "Come one, come all! This storytime is designed for children of diverse abilities and considers the sensory needs of ALL kids. Stories will be interactive and encourage children to participate with their voices and body movements. Weighted blankets, lap pads, and small fidget toys will be available. This is a safe and comfortable space for all kids to enjoy an activity in their community, socialize, and learn in whatever way works best for them! We plan to host storytime in the children’s area upstairs, next to the café, but will immediately move it to our main level if any attendee is unable to traverse the stairs. All ages are welcome! If you have questions about this event or would like to suggest additional materials, please email Rachel Schilling at rlblinguist@gmail.com.", "url": "https://www.facebook.com/events/1674424716188420/"}, {"source": "Facebook", "date": "2017-01-10T18:00:00-05:00", "name": "Sava's Uncorked: Sparkling Wines", "description": "A full sensory experience with 8 wines, cheese, and charcuterie! Enjoy tasting 8 wines served with hors d'oeuvres in a mix & mingle setting, with a briefing on each wine!\n\nWe are featuring Organic French Wines for this tasting!", "url": "https://www.facebook.com/events/1908321386062355/"}, {"source": "Facebook", "date": "2017-01-10T19:00:00-05:00", "name": "Bill Ayers", "description": "Literati welcomes Bill Ayers to Ann Arbor as part of a national tour to celebrate the release of his latest book, Demand the Impossible!: A Radical Manifesto.\n\nDemand the Impossible! is a manifesto for movement-makers. In an era defined by mass incarceration, endless war, economic crisis, catastrophic environmental destruction, and a political system offering more of the same, radical social transformation has never been more urgent. Demand the Impossible! urges us to imagine a world beyond what this rotten system would have us believe is possible. In critiquing the world around us, insurgent educator and activist Bill Ayers uncovers cracks in the system, raising our sights for radical change, and envisioning strategies for building a movement to create a more humane, balanced, and peaceful world.\n\n\"For Bill Ayers, it is the freedom of our collective imagination that links the contemporary world—ensconced as it is in pervasive militarism, racist violence, and environmental devastation—to the flourishing of our planet. This is a manifesto that should be read by everyone who wants to believe that “another world is possible.”—Angela Y. Davis, author of Abolition Democracy and Freedom is a Constant Struggle\n\n\"With huge numbers of us recognizing the need for transformative change, this ambitious and exuberant book perfectly matches its historical moment. Ayers fearlessly confronts the intersecting crises of our age—endless war, surging inequality, unchecked white supremacy and perilous planetary warming—while mapping emancipatory new possibilities. From the first page, his courage is contagious.\"—Naomi Klein, author of This Changes Everything and The Shock Doctrine\n\n\"Demand the Impossible is more than a book, more than a manifesto. It is a torch. Bill Ayers’ vision for a humane future is incendiary—fire that incinerates old logics and illuminates new paths. If we do not end the violence of militarism, materialism, caging, dispossession, debt, want, ignorance, and global warming, our very survival is impossible. Read aloud.\"—Robin D. G. Kelley, author of Freedom Dreams\n\nBill Ayers is a social justice activist, teacher, Distinguished Professor of Education (retired) at the University of Illinois at Chicago, and author of two memoirs, Fugitive Days and Public Enemy.\n\nEvent date: \nTuesday, January 10, 2017 - 7:00pm\nEvent address: \n124 E. Washington\nAnn Arbor, MI 48104\nDemand the Impossible!: A Radical Manifesto Cover Image", "url": "https://www.facebook.com/events/196835577445229/"}, {"source": "Facebook", "date": "2017-01-10T19:00:00-05:00", "name": "Go-Tech Meeting (second Tuesday of each month)", "description": "Join us for this self-proclaimed \"geek show-and-tell.\" Makers present their creations! \n\nWe have people interested in a wide scope of topics and endeavors. Programming, robots, machining, welding, artistic creations, metal casting, anything being built or created. Pretty much anything someone is \"Making\" is welcome at a Go-Tech meeting. \n\nAlso, if you have a problem with your project ask for help and the brain trust of Go-Tech will amaze you with solutions to difficulties you haven't even explored yet.. This is an open group all are welcome and especially young makers are encouraged to bring in a project to show off.\n\nSecond Tuesday of each month at 7pm.", "url": "https://www.facebook.com/events/1139039842853453/"}, {"source": "Facebook", "date": "2017-01-11T00:00:00-05:00", "name": "Babo Juice Cleanses", "description": "COLD-PRESSED JUICE CLEANSES ARE BACK!\n\n... and just in time for the New Year! For the month of January only– get 10% off your juice cleanse and a free yoga class with Bikram Yoga West!\n\nBook your Cleanse now with promo code JUICECLEANSEJANUARY at Store.BaboAnnArbor.com!", "url": "https://www.facebook.com/events/388503011499248/"}, {"source": "Facebook", "date": "2017-01-11T11:45:00-05:00", "name": "Marketing Your Company's Culture with Brad Hedeman, Zingerman's", "description": "Brad Hedeman, Marketing & Product Selection for Zingerman's Mail Order will discuss how important it is to consider your company's culture in your marketing and branding efforts.", "url": "https://www.facebook.com/events/1833391283539477/"}, {"source": "Facebook", "date": "2017-01-12T10:30:00-05:00", "name": "Pizza House Fundraiser for the Jim Toy Community Center", "description": "Help the Jim Toy Community Center raise funds for OUTFest 2017 and enjoy a delicious meal, too! Just mention the Jim Toy Center while placing your order anytime on Thursday, January 12 and Pizza House will donate a portion of what you spend back to the Jim Toy Community Center. \n\nThis will work for delivery and online orders as well.", "url": "https://www.facebook.com/events/1806612242931934/"}, {"source": "Facebook", "date": "2017-01-12T11:00:00-05:00", "name": "West Liberty Street Improvements Project Meeting", "description": "The City of Ann Arbor is preparing plans for the reconstruction of W. Liberty Street between First Street and Main Street. To help residents and businesses learn about the improvements to be made as part of project, staff will be hosting a public meeting on Thursday, Jan. 12, 2017 from 11 a.m. to 1:00 p.m. in the multi-purpose room of the Ann Arbor District Library’s downtown branch located at 343 S. Fifth Ave in Ann Arbor.\n\nIf you are unable to attend or have questions, please contact Jennifer Nelson, Project Manager, jnelson@a2gov.org or 734.794.6410 x43672\n\nAll persons are encouraged to participate in public meetings. Accommodations, including sign language interpreters, may be arranged by contacting the city clerk’s office at 734.794.6140; via email to cityclerk@a2gov.org; or by written request addressed and mailed or delivered to:\n\nCity Clerk’s Office\n301 E. Huron St. \nAnn Arbor, MI 48104\n\nRequests made with less than two business days’ notice may not be able to be accommodated.\n\nPlease visit the project website for updates:  www.a2gov.org/Liberty", "url": "https://www.facebook.com/events/612360835631247/"}, {"source": "Facebook", "date": "2017-01-12T17:30:00-05:00", "name": "Zell Visiting Writers Series: Mary Szybist, Janey Lack Poetry", "description": "Mary Szybist is most recently the author of Incarnadine, winner of the 2013 National Book Award for Poetry. She is the recipient of fellowships from the Guggenheim Foundation, the National Endowment for the Arts, the Rona Jaffe Foundation, and the Witter Bynner Foundation in conjunction with the Library of Congress. Her work has been awarded two Pushcart Prizes and has been supported by residencies at the MacDowell Colony and the Rockefeller Foundation's Bellagio Center in Bellagio, Italy. Her first book Granted won the 2004 GLCA New Writers Award and was a finalist for the National Book Critics Circle Award. A native of Williamsport, Pennsylvania, she now lives in Portland, Oregon where she teaches at Lewis & Clark College.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon '13).", "url": "https://www.facebook.com/events/756730994483756/"}]