[{"description": "We are gearing up for another week of culinary bliss during Ann Arbor's summer Restaurant Week! \n\nWe are featuring these special menus available in addition to our regular menu all week long.  \n-------------------------------------------------------------------------------\nSummer Restaurant Week 2016\n-------------------------------------------------------------------------------\nTwo for $15 lunch\nTax and gratuity not included\n•\tChoose one entrée for each person\no\tBBQ Tofu Sandwich\no\tWhitefish Po-boy\no\tChicken BLT\no\tCaesar Salad\no\tCherry Almond Salad\n-------------------------------------------------------------------------------\nTwo for $28 dinner per person\nTax and gratuity not included\n\nAppetizer\nTo share, please choose one\n•\tFried Pickle Spears \n•\tTruffle Sprouts\n•\tHummus and Pita \n\nEntree\nEach guest chooses one entree\n•\tMac and Cheese\n•\tFish and Chips\n•\tUrban Cowboy Bean Burger\n•\tAr-burger\n\nDessert or Beer\nTo share, please choose one\n•\tStout Chocolate pudding cake\n•\tStrawberries and Cream Belgian waffle\n•\tMaple Bourbon Bread Pudding\n\nNot interested in dessert? Swap it out for your choice of two 16oz drafts", "date": "2016-06-22T11:00:00-04:00", "name": "Restaurant Week", "source": "Facebook", "url": "https://www.facebook.com/events/1008482025896787/"}, {"description": "Our June Artists' Meet & Greet topic is Tips on Applying for Grants: Specifically MCACA Minigrants. Join us for this free event, connect with other artists and the Art Center staff.\n\nSpeaker: Allison Buck\n\nYou will learn about:\n\n- Tips for submitting a compelling application.\n- What types of opportunities are fundable?\n- How to create an accurate budget.\n- Things to pay extra attention to in order to avoid application mistakes.\n- Other resources for grant opportunities:\n- Grant Station \n- The Arts Alliance Newsletter\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "date": "2016-06-22T18:00:00-04:00", "name": "Tips on Applying for Grants", "source": "Facebook", "url": "https://www.facebook.com/events/527954430710284/"}, {"description": "Thursdays through Sundays through June 26. Check out Tickets Available link for arb member advance ticket info plus note Summer 2016 construction impacting arboretum area parking & traffic. Arrive early for tickets and time to walk to location of the first scene.", "date": "2016-06-22T18:30:00-04:00", "name": "Shakespeare in the Arb 2016 Love's Labour's Lost Week 2", "source": "Facebook", "url": "https://www.facebook.com/events/799178996885556/"}, {"description": "Journalist Amy Haimerl and her husband had been priced out of their Brooklyn neighborhood. Seeing this as a great opportunity to start over again, they decide to cash in their savings and buy an abandoned house for $35,000 in Detroit, the largest city in the United States to declare bankruptcy.\n\nAs she and her husband restore the 1914 Georgian Revival, a stately brick house with no plumbing, no heat, and no electricity, Amy finds a community of Detroiters who, like herself, aren t afraid of a little hard work or things that are a little rough around the edges. Filled with amusing and touching anecdotes about navigating a real-estate market that is rife with scams, finding a contractor who is a lover of C.S. Lewis and willing to quote him liberally, and neighbors who either get teary-eyed at the sight of newcomers or urge Amy and her husband to get out while they can, Amy writes evocatively about the charms and challenges of finding her footing in a city whose future is in question. Detroit Hustle is a memoir that is both a meditation on what it takes to make a house a home, and a love letter to a much-derided city.", "date": "2016-06-22T19:00:00-04:00", "name": "Amy Haimerl: Detroit Hustle", "source": "Facebook", "url": "https://www.facebook.com/events/1732247170397839/"}, {"description": "Yo! Its been a great  run and we'd like to give a big shout out to Greg Powell and the rest of the staff at Club Above, and especially to all you who have been comin out to support over the last year!!! \n\n\nLookin to end our residency with a bang and show some love to the people, so this will be a FREE show!! \n\nStay tuned, Northern Threat has plenty up its sleeves for the near future  :) Its just time for us to start partying on the weekends like the rest of the working world haha\n\nTALENT FOR THE NIGHT-\n\n9:00 -Neekapz\nhttps://m.soundcloud.com/neecaps\n10:00 // FKA [WADE]\n11:00 Trillo b2b Little-bird\n12:00 Tristarz\n1:00   OnDemand", "date": "2016-06-22T21:00:00-04:00", "name": "WildOutWednsdays: The Last Hurrah!", "source": "Facebook", "url": "https://www.facebook.com/events/532773230239321/"}, {"description": "This week is National Pollinator Week which is celebrated all across the country to raise awareness for pollinators and their importance to the ecosystem. NAP is participating in National Pollinator Week by hosting a workday in the Native Garden at Furstenberg Nature Area. Join us on Saturday, June 25th from 9:00am-Noon at Furstenberg Nature Area to help the local pollinators by removing invasive plants from within the Native Garden. For more information on the workday with NAP please visit www.a2gov.org/napevents and for more information on National Pollinator Week visit www.pollinator.org/pollinatorweek .", "date": "2016-06-23T09:00:00-04:00", "name": "National Pollinator Week", "source": "Facebook", "url": "https://www.facebook.com/events/1771333209777255/"}, {"description": "JR JR w/s/g Joe Hawley of Tally Hall\nWith an ear for Brian Wilson-esque harmony, JR JR swirl indie pop, folk, and electronic elements into one breezy package. Originally named Dale Earnhardt Jr. Jr. with typical irreverence, the duo of Joshua Epstein (also of the Silent Years) and Daniel Zott came together in Detroit in 2009. Working out of a basement studio, the pair worked to create a sound that was danceable without sacrificing anything in the songwriting department, merging intricate and airy melodies with solid programmed beats and synth atmospherics.\nTheir hard work bore fruit in 2010 when they released their debut EP, Horse Power, on Quite Scientific, quickly followed by the EP My Love Is Easy: Remixes Pt. 1. That same year, the pair was also tapped to do a remix of Moby's \"Wait for Me.\" The resulting buzz from their early releases led to a record deal with Warner Bros., who released their Record Store Day-exclusive EP titled We Almost Lost Detroit in spring 2011. The duo's full-length debut, It's a Corporate World, followed that summer. In 2013, they returned with an EP, Patterns, before releasing their sophomore full-length, The Speed of Things, later that year. \nIn 2015, even though they had the blessing of Dale Earnhardt, Jr. himself, to avoid ongoing confusion by fans and seekers of the race car driver, Epstein and Zott decided to change the band's name to simply JR JR. Their first LP under the shortened handle and their third with Warner Bros., the endearing JR JR was released that September\nwww.jrjrmusic.com \n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "date": "2016-06-23T11:30:00-04:00", "name": "JR JR w/s/g Joe Hawley of Tally Hall / June 23rd / Bank of Ann Arbor's Sonic Lunch / 11:30AM FREE", "source": "Facebook", "url": "https://www.facebook.com/events/1717896315157605/"}, {"description": "NEW SPRING MENUS!\n\nNew season, new Menu. Introducing new menu items that are seasonally fresh, bright, and delicious!\n\nBringing all things spring to the table, with new colorful and locally sourced food and beverage options. \n\nCheck out our new menus at http://aventuraannarbor.com \n\nMAKE A RESERVATION\nClick link listed in \"Tickets Available\"", "date": "2016-06-23T12:00:00-04:00", "name": "New Spring Cocktail & Dinner Menus", "source": "Facebook", "url": "https://www.facebook.com/events/478741615584046/"}, {"description": "Join us every Thursday in June to help support our community partner, Growing Hope! From 6-9 pm, $1 of each beer sold will be donated towards Growing Hope's efforts to educate, inspire, and empower the community through gardening and access to healthy food.", "date": "2016-06-23T18:00:00-04:00", "name": "Hops for Hope", "source": "Facebook", "url": "https://www.facebook.com/events/1880068362221268/"}, {"description": "The results are in, and the readers have spoken! Join us to celebrate the eclectic mix of businesses, individuals, arts and entertainment that make Washtenaw County an awesome place to live.\n\nParty with Washtenaw County's finest on Thursday, June 23rd at Club Above (215 N. Main St. Above The Heidelberg). \n\nAgent 99 will be spinning 45's from the Motown era:\nhttps://www.mixcloud.com/alexis-ford/\n\nFood and swag will be provided along with a cash bar. \n\nThe event is FREE and open to the public! \n\nSee all of the 2016 Best of Washtenaw results online at: www.ecurrent.com/Best-of-Washtenaw-2016/", "date": "2016-06-23T18:00:00-04:00", "name": "2016 Best of Washtenaw Party", "source": "Facebook", "url": "https://www.facebook.com/events/108996502858146/"}]