[{"url": "https://www.facebook.com/events/208434849627331/", "source": "Facebook", "date": "2017-01-15T10:00:00-05:00", "description": "Join us for Ann Arbor\nRestaurant Week\nJanuary 15th – 20th, 2017\nLunch & Dinner\n\nhttp://www.annarborrestaurantweek.com/\n\nReservations Recommended\n(888) 456-3463 (DINE)", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/1716505231999811/", "source": "Facebook", "date": "2017-01-15T10:00:00-05:00", "description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "name": "Intro to Stagecraft Workshops"}, {"url": "https://www.facebook.com/events/1844201079197076/", "source": "Facebook", "date": "2017-01-15T10:00:00-05:00", "description": "Ann Arbor Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price.\n\nVinology Wine Bar and Restaurant is proud to be part of this great event, offered from January 15 - 20.  Enjoy a three course dinner for only $28!", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/1894155567471093/", "source": "Facebook", "date": "2017-01-15T11:00:00-05:00", "description": "We'd love for you to join us for Ann Arbor Restaurant Week, January 15th-20th. Click the link to view our lunch and dinner options for two. We have vegetarian, vegan, and gluten free options.\n\nAlso, $.50 from each Restaurant Week meal purchased at the brewpub will be donated to Food Gatherers!\n\nhttp://www.annarborrestaurantweek.com/…/arborbrewingcompany/", "name": "Ann Arbor Restaurant Week at Arbor Brewing Company"}, {"url": "https://www.facebook.com/events/357869054582083/", "source": "Facebook", "date": "2017-01-15T11:00:00-05:00", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $15 for lunch and $28 for a three course dinner with many restaurants offering 2 for 1 pricing!\n\nCheck out www.annarborrestaurantweek.com for participating restaurants and menu offerings!", "name": "Ann Arbor Restaurant Week"}, {"url": "https://www.facebook.com/events/389172271424476/", "source": "Facebook", "date": "2017-01-15T14:00:00-05:00", "description": "Pictorialism was the first truly international photography movement, and its practitioners, among them Alfred Stieglitz, Edward Steichen and Gertrude Käsebier, sought to position photography as a legitimate aesthetic art form. They favored soft-focus images that drew upon the conventions of important artists and movements of the previous century. Their poetic compositions drawn from contemporary life, combined with the use of expensive and labor-intensive printing materials established these photographs as complex and nuanced works of high artistic quality. Join a tour with an UMMA docent and explore this rich moment in the history of photography.", "name": "The Aesthetic Movement in America: Artists of the Photo-Secessio"}, {"url": "https://www.facebook.com/events/1860632414149850/", "source": "Facebook", "date": "2017-01-15T14:00:00-05:00", "description": "Arborea Trio:\nExpressions of Drama & Rhetoric in the Classical Era\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nAlison Luthmers Teyssier, violin\nShin Hwang, fortepiano\nEva Lymenstull, cello\n\nThe Arborea Trio is an ensemble founded in the Netherlands that performed in significant concert series such as the Kasteelconcerten in Gelderland (NL), the Stadsgehoorzaal in Leiden (NL), the Academy of Early Music (USA), and the Utrecht Early Music Festival (NL). The trio is dedicated to performance on period instruments.\nThis performance is made possible in part by an award from the Michigan Council for Arts & Cultural Affairs and the National Endowment for the Arts. Art Works.\n\nProgram\nViolin Sonata in C major, KV. 303\tW.A. Mozart (1756-1791)\nAdagio - Molto Allegro\nTempo di Menuetto\t \nPiano Trio in C major, Hob. XV:27\tJoseph Haydn (1732-1809)\nAllegro\nAndante\nFinale. Presto\t \n\nINTERMISSION\n\nPiano Trio in C minor, Op. 1, No. 3\tLudwig van Beethoven (1770-1827)\nAllegro con brio\nAndante cantabile con variazioni\nMenuetto, quasi allegro\nFinale: Prestissimo\t \n\nAlison Luthmers Teyssier\n\nCanadian-American violinist Alison Luthmers Teyssier performs on both Baroque and modern violin, appearing throughout Europe with groups such as Concerto Copenhagen (Denmark), The Orchestra of the Age of Enlightenment (UK), Barokksolistene (Norway), Arte dei Suonatori (Poland), Camerata Øresund (Denmark) and the Malmö Symphony Orchestra (Sweden). She has performed in festivals such as Trigonale (Austria), Midsommer Barok (Denmark), Utrecht Fringe Festival (Netherlands), Spitalfields Music (UK), and the Oregon Bach Festival (USA). In addition, she has participated in Aspen Music Festival, Music Academy of the West, Urbino Musica Antica and Vancouver Early Music. She holds a Bachelors degree from the Colburn School in Los Angeles and currently resides in Sweden. Additional mentors include Peter Spissky and Arek Golinski in Copenhagen. In 2014 she received a grant from the Canada Council for the Arts for her study of early music and folk music in Scandinavia.\n\nShin Hwang\n\nShin Hwang, a prize-winner of the 1st International Westfield Fortepiano Competition, is a versatile keyboardist who has won recognition in both modern and historical performance. After completing his Masters degree at the University of Michigan with Penelope Crawford and Arthur Greene, he received the prestigious Fulbright Grant to study in the Netherlands at the Royal Conservatory of the Hague. In 2011, he was invited to perform at the United States Library of Congress for the American Musicological Society Lecture Series: \"What the Autograph Can Tell Us: Beethoven's Sonata in E major, Opus 109\". Other significant performance engagements include solo and chamber performances in the Kleine Zaal of the Concertgebouw, Vredenburg Leeuwenbergh in Utrecht, Het Bethanienklooste in Amsterdam, and the UNESCO World Heritage Site in Schokland. As a recipient of the DAAD Grant, he completed additional studies with Robert Hill at the Hochschule für Musik Freiburg and is currently completing a Doctorate in Musical Arts in Performance Practice at Cornell University under the guidance of Malcolm Bilson. \n\nEva Lymenstull\n\nEva Lymenstull completed a Master’s degree in baroque cello at the Royal Conservatory of The Hague in 2014, where she was a student of Jaap ter Linden. As a baroque cellist and violist da gamba, Ms. Lymenstull has performed with the Orchestra of the Age of Enlightenment, Lyra Baroque, Holland Baroque Society, Symphonie Atlantique, Orpheon Consort, and with various ensembles at the 2013 and 2014 Utrecht Early Music Fringe Festivals, and was a member of ensembles selected to be semi-finalists in the International Biber Competition 2013 and the Van Wassenaer Competition 2014. Recent performance highlights include a BBC Proms concert with the Orchestra of the Age of Enlightenment, a production of Händel’s Giulio Cesare with Symphonie Atlantique in the Amsterdam Concertgebouw, and Haydn’s virtuosic symphonies Le Matin, Le Midi, and Le Soir with Lyra Baroque. Ms. Lymenstull has presented research findings on historical chordal continuo realization practices on the cello, and has received several grants, including the Theodore Presser and Wagoner Foundation awards, to pursue studies in historical performance. Ms. Lymenstull also holds a Master’s degree in modern cello from Rice University, where she studied with Desmond Hoebig, and a Bachelor of Music from the University of Michigan, with Richard Aaron, where she graduated with highest honors.", "name": "Arborea Trio"}, {"url": "https://www.facebook.com/events/346585499061009/", "source": "Facebook", "date": "2017-01-15T15:00:00-05:00", "description": "From the eighteenth through the early twentieth century, Europe underwent a series of changes and upheavals, including industrialization and two World Wars. Artists responded to these enormous changes, some working within established artistic traditions, others rejecting artistic conventions to find new forms. Lehti Keelmann, UMMA’s Assistant Curator of Western Art and curator of the exhibition Europe on Paper: The Ernst Pulgram and Frances McSparran Collection (on view through January 29, 2017), will delve into these varied interpretations of Europe’s people and places, and particularly the expressive capacities of line to both depict and comment upon human experience", "name": "People and Places: Exploring the Collections"}, {"url": "https://www.facebook.com/events/1789801867942915/", "source": "Facebook", "date": "2017-01-15T15:00:00-05:00", "description": "Edward Morin is from Chicago, where he earned degrees in English at University of Chicago and Loyola University. His poems have appeared in Hudson Review, Ploughshares, and Prairie Schooner.  Collections of his poems include Labor Day at Walden Pond (1997) and The Dust of Our City (1978). A chapbook titled Housing for Wrens is forthcoming from Cervena Barva Press in September 2016.  His co-translations of modern Greek and Chinese poems have appeared in Iowa Review, Michigan Quarterly Review, and Poetry Miscellany. He edited and co-translated an anthology, The Red Azalea: Chinese Poetry since the Cultural Revolution (U. of Hawaii Press, 1990) and a book of poems by Cai Qijiao.  Recent co-translations of Arabic poems have been published in Banipal: Magazine of Modern Arab Literature, The Dirty Goat, and Asymptote. He is editor of the Poetry Society of Michigan’s journal, Peninsula Poets, and co-hosts the Crazy Wisdom Poetry Series in Ann Arbor. \n\nBob Brill is a retired computer programmer and digital artist. He is now devoting his energies to writing fiction and poetry. His novellas, short stories and 150 poems have appeared in over 45 online magazines, print journals, and anthologies. His most recent publications are 2 poems in Water Music: The Great Lakes State Poetry Anthology, and his first book of poems, Hello Goodbye, Selected Poems by Bob Brill.", "name": "Sunday Afternoon Poetry - Edward Morin & Bob Brill"}, {"url": "https://www.facebook.com/events/222647398148619/", "source": "Facebook", "date": "2017-01-15T16:00:00-05:00", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games"}]