[{"source": "Facebook", "url": "https://www.facebook.com/events/1107421282648487/", "description": "Bank of Ann Arbor is excited to announce that Michigan born rocker, Mitch Ryder will close out the 9th consecutive year for Sonic Lunch. Ryder, a music legend with hits like Sock It To Me Baby and Devil with a Blue Dress On will take the stage at noon on August 25th in Liberty Plaza.\nDue to unforseen circumstances, Serena Ryder is not able to perform, as previously announced.\n“Mitch Ryder is the legendary link between classic Motown R&B and hard rocking Detroit-area bands like the MC5 and the Stooges. The Hamtramck native has recorded over two dozen albums in a career that stretches back to the mid-60s, and he still captivates audiences with his fiery vocals and commanding stage presence. He was in fine form the last time he performed at Sonic Lunch, so expect another great set of timeless hits when Mitch Ryder closes out the 9th season of Sonic Lunch on Thursday, August 25th” Martin Bandyke, ann arbor's 107one\n“Good fortune smiled upon Ann Arbor this week when we learned that Mitch was going to play Sonic Lunch for us again. His pervious Sonic Lunch performance left us dancing in the streets and singing his classic songs throughout his entire show,” said Tim Marshall, President and CEO of Bank of Ann Arbor. “When we learned that his schedule opened up, we jumped on it.”\n\n2016 Lineup \n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Mitch Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Mitch Ryder & The Detroit Wheels / August 25th Sonic Lunch / Noon Free", "date": "2016-08-25T12:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1802554976685448/", "description": "Come join the high-flying fun with David Dimitri at this hands-on workshop! Have a blast learning the basics of several circus tricks! Sit back and see now-familiar skills put into action with a breathtaking demonstration by the multi-talented circus sensation himself. Get an exclusive, up-close look behind the scenes before the evening’s jaw-dropping performance.\n\nThursday, August 25 @ 3-4 pm\nBurns Park\nFREE\n\nAges 12+. Enrollment for this free session will be capped at 30 participants. Sign up now to reserve your spot!", "name": "Free Circus Workshop with David Dimitri", "date": "2016-08-25T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/217304028639529/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by The New York Times, this world famous high-wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high-wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with a grand flourish, be awestruck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets should be purchased in advance, if any tickets remain, they will be sold at the tent 30 minutes prior the show. The tent is wheelchair accessible with advance notice and tent capacity is limited. For everyone's comfort and safety, please note that the tent has a cooling feature that is used if it is a particularly hot day. Performance parking is available at the Burns Park Elementary lot for a $5 donation to the PTO.\n\n$20 Kids & $30 Adult - General Admission\nParking at the Burns Park Elementary School\n\nSponsored by: Toyota USA\nPresented in part with support from: National Endowment for the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nAugust 24 @ 6:30 pm, Burns Park \nAugust 25 @ 6:30 pm, Burns Park\nAugust 26 @ 6:30 pm, Burns Park \nAugust 27 @ 6:30 pm, Burns Park \nAugust 28 @ 6:30 pm, Burns Park\n\nWatch the videos:\nThe Show: https://youtu.be/TB0Oyl1gSNk\n\nHighwire Stunts: https://www.youtube.com/watch?v=rqCzjvM3_Sc\n\nOn a Treadmill: https://www.youtube.com/watch?v=oxrqksjrMf0", "name": "One-Man Circus (L’homme Cirque)", "date": "2016-08-25T18:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1712617762323586/", "description": "Test Batch features the newest crop of improv groups in our community. Come and watch these troupes test their chops on the Pointless stage. When they are all inevitably famous, you can say \"I saw them way back when….\"\n\nFeaturing:\n\"Twelve-Second Countdown\" with Ashley Davis, Ramon Martinez, Sam Shattuck, Jenny Blair, Matt, Townsend, Blake Charlebois, Cyrus Naheedy, and Judy Irvine\n\n\"Gladstoned\" with Mike Dobmeier, Cynthia D'Amour, Tony DeRosa, and Frank Ankomah-Boateng\n\n\"Raptor Attack\" with Allyson Miko and Katie Parzych\n\n\"$13 Special\" with Jessica Cooper, Evan Ellis, Bonnie Girson, Chris Grimm, Sarah Shaya, Kathryn Schumacher, Jonathan Weidert, and Ryan Westbrook\n\n\"Unfiltered\" with Sara Hoffman, Monica Hiris, John Klenk and one to three others to be named!", "name": "Test Batch", "date": "2016-08-25T19:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1779661278919663/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe", "date": "2016-08-26T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1705218533059185/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by The New York Times, this world famous high-wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high-wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with a grand flourish, be awestruck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets should be purchased in advance, if any tickets remain, they will be sold at the tent 30 minutes prior the show. The tent is wheelchair accessible with advance notice and tent capacity is limited. For everyone's comfort and safety, please note that the tent has a cooling feature that is used if it is a particularly hot day. Performance parking is available at the Burns Park Elementary lot for a $5 donation to the PTO.\n\n$20 Kids & $30 Adult - General Admission\nParking at the Burns Park Elementary School\n\nSponsored by: Toyota USA\nPresented in part with support from: National Endowment for the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nAugust 24 @ 6:30 pm, Burns Park \nAugust 25 @ 6:30 pm, Burns Park\nAugust 26 @ 6:30 pm, Burns Park \nAugust 27 @ 6:30 pm, Burns Park \nAugust 28 @ 6:30 pm, Burns Park\n\nWatch the videos:\nThe Show: https://youtu.be/TB0Oyl1gSNk\n\nHighwire Stunts: https://www.youtube.com/watch?v=rqCzjvM3_Sc\n\nOn a Treadmill: https://www.youtube.com/watch?v=oxrqksjrMf0", "name": "One-Man Circus (L’homme Cirque)", "date": "2016-08-26T18:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1070642983018466/", "description": "Literati is pleased to welcome renowned speaker Shaka Senghor, author of Writing My Wrongs: Life, Death, and Redemption in an American Prison. Literati will donate all proceeds from sales of Writing My Wrongs to the Children's Literacy Network in support of their Staying in Closer Touch programming.\n\nAbout Writing My Wrongs\n\nIn life, it’s not how you start that matters. It’s how you finish. \n\nShaka Senghor was raised in a middle-class neighborhood on Detroit’s east side during the peak of the 1980s crack epidemic. Under difficult circumstances at home, Shaka ran away at age 14, turned to drug dealing, and ended up in prison for murder at age 19. Writing My Wrongs is his story of what came next.\n\nAfter pleading guilty to second-degree murder, Shaka was sentenced to 40 years in prison, entering the system at age 19, bitter, angry, and hurt. He blamed everybody, from his parents to the system, and he channeled that anger into violence. He ran a black market store, he loan sharked, and, halfway through his sentence, he was sent to solitary confinement for 4½ years for assaulting an officer to the point of near-death.\n\nA turning point in prison for Shaka occurred when his 10-year-old son wrote a letter to him recognizing the crucial reality for what he was in prison for—murder. With the cold hard truth hitting Shaka for the first time, his toughness and prison shrewdness wore off, as right there in that moment he realized he failed his son and the other black males in his neighborhood.\n\nClinging on to hope from the letter his son wrote to him years earlier, Shaka continued to pour his time into literature, reading about Malcolm X and Nat Turner, Socrates and Donald Goines novels. He also discovered religion, meditation, and self-examination tools that he used to help him begin atoning for the wrongs he had committed. Shaka was more determined than ever to get a parole hearing. In 2008, he was granted a hearing but quickly denied, and then again in 2009, before he was able to enroll into the Assaultive Offender Program (AOP), a ten-month-long group therapy class required by all inmates with an assaultive case.\n\nShaka eventually completed the AOP class and was up for parole yet a third time. “If I am released from prison, I plan to work and volunteer at local high schools and community centers,” he announced to a parole board member. He continued, “My ultimate goal is to pursue a career in writing.”\n\nOn June 22, 2010, one day after his 38th birthday, Shaka was released from prison and was finally a free man. He stood by his words he shared with the parole board member, his family, and friends and became an activist and mentor to young men and women facing circumstances like his. His work in the community and the courage to share his story led him to fellowships at the MIT Media Lab and the Kellogg Foundation and invitations to speak at events like TED and the Aspen Ideas Festival. Writing My Wrongs is an extraordinary tale of forgiveness, hope and second chances, one that reminds us that our worst deeds don’t define who we are.\n\nAbout the Author\n\nShaka Senghor is a writer, mentor, and motivational speaker whose story of redemption has inspired thousands. He is the author of six books, a former Director's Fellow at the MIT Media Lab, a Community Leadership Fellow with the Kellogg Foundation, and the founder of The Atonement Project, which helps victims and violent offenders heal through the power of the arts. He currently serves as the co-founder of #BeyondPrisons, a #cut50 initiative to share the devastating and far-reaching human impacts of the incarceration industry. In addition to serving as a lecturer at the University of Michigan, Shaka speaks regularly at conferences, high schools, prisons, churches, and universities around the country.", "name": "Shaka Senghor", "date": "2016-08-26T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1771434546465737/", "description": "Come join friends & neighbors alike for a fun, slow, community bike ride through Ann Arbor.\n\nAll the fun starts at the Ann Arbor Farmers Market and will continue at a leisurely pace around town, where we will \"bike-in\" to the Ann Arbor Distilling Co. on Felch St. (https://goo.gl/maps/JEEQrMjjFuQ2). Their new deck space should be just the spot for enjoying a late summer's drink or to just take in the good vibes & stellar company.\n\nIf you haven't been yet, Ann Arbor Distilling Co. is a boutique distillery sourcing ingredients from the local community. They're making quite the coffee liqueur (from Mighty Good Coffee, at that). More than anything, we hope you can join us!\n\nMeet up time is 7:00 PM (departing 7:15 PM). Plan on a nice & easy route, 10 miles or less, within city limits and a mid-ride stop to boot. Check back soon for route & other details to come. Until then, ride safe, be friendly, and have fun!\n\n\nWhat's Bike-in?\nSee the community page:\nhttps://www.facebook.com/bikeinannarbor/info?tab=page_info\n\nOR read below\n\nBike-in is: Slow bike rides throughout Ann Arbor for everyone. Post-ride fun with friends, neighbors, and visitors around the community.\n\nEach ride we will begin at the listed location & time, ride casually, then finish the ride by \"biking-in\" to a post-ride time together at a local establishment, green space, or other friendly host setting (i.e. Bike-in :: Movie (outdoor), Creamery (ice cream), Picnic (potluck), Garden (beer garden), etc.).\n\nRides will be open and friendly to all. For gathering information, times, locations, riding routes, weather updates, etc. like/follow the page or visit for updates.\n\nPlease practice safe riding and abide by all legal riding rules at all times, especially while riding with a Bike-in community. Be sure to provide your own helmet, riding lights, and other appropriate accessories.", "name": "Bike-in :: Ann Arbor Distilling Co.", "date": "2016-08-26T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/298304527191023/", "description": "Shakespeare is back at Pointless Brewery & Theatre this August!  \n\nAfter May's sellout performance of MUCH ADRINK ABOUT NOTHING, Ann Arbor's original Shakespeare performance/drinking game is back this time with four performances, over two weekends, with entirely new shows.  Not above taking on low-hanging fruit, we're presenting two of the Bard's most popular and most overdone plays with A MIDSUMMER NIGHT'S DRINK and THE LAMENTABLE DRINK OF ROMEO & JULIET.  \n\nShakespeare at Pointless looks to revive a bit of vibrant raucous nature of Shakespeare's early modern theater. Honoring the in-house brewery, the actors will and audience can partake in a drinking game over the course of the plays with specific rules for each play.\n\nAll shows are at 8 pm.\n\nFriday, August 26th: A Midsummer Night's DRINK\nSaturday, August 27th: The Lamentable DRINK of Romeo & Juliet", "name": "Shakespeare & Beer: A Midsummer Nights DRINK", "date": "2016-08-26T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/175839469493045/", "description": "House | EDM | Trap | Twerk | Electro\nmusic by KEVIN MICHAEL\n\nKevin Michael, aka Kevin Kerber aka The Dangling Participle has been started from the bottom and now he’s here. From rocking stages to rocking chairs, Kevin Michael has always been a bastion of excellence in music, arts, culture, and oxford commas. His frenetic, open-format style of mixing has been described as, “pop-meets-electro-meets-slow-cooker.” This Ann Arbor based DJ is in it to win it. On his off time, Kevin Michael can be found lifting weights, eating mammies, not reading directions, and sardonically pontificating on miscellaneous etcetera. If you’re looking for the same old DJ, swipe left. http://bit.ly/LiveA2b", "name": "Festival Friday 8/26", "date": "2016-08-26T21:00:00-04:00"}]