[{"source": "Facebook", "url": "https://www.facebook.com/events/360112051012337/", "description": "Shop with us on January 31st, and we'll donate 10% of everything you buy to Ann Arbor YMCA! They're committed to expanding wellness in Ann Arbor, so start making your grocery list and mark this day on your calendar!", "name": "Impact Day benefiting Ann Arbor YMCA", "date": "2017-01-31T08:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1848102932125078/", "description": "For the past 25 years, Image has been changing the comic book industry. Image put comics in the hands of the creators, therefore unleashing a whole world of stories just waiting to be told. The very foundation of their business was and still is to empower creators by giving them the liberty to tell the stories they find relevant. For the last 25 years, Image has been a beacon for the weird, the strange, the fantastical, the subversive, and the wonderous. Join us in celebrating these 25 years and all that it has meant for the industry. Here's to many more!", "name": "Image Comics' 25th Anniversary", "date": "2017-02-01T10:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/230775294023258/", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "name": "Exhibit: Avant Garden-Fashion & Plants Together!", "date": "2017-02-01T10:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/685587268315320/", "description": "Join us at Ashley's for a beer dinner featuring two WSBC bottled beers and two WSBC drafts paired with Ashley's killer food! Pairings TBA. Call Ashley's at 7349969191 for ticket info and details.", "name": "Ashley's Beer Dinner", "date": "2017-02-01T18:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/212979832440029/", "description": "For folks who want to get started with CNC as well as veterans to share information. Focus of the group is anything CNC-related: projects, additive machines like the Makerbot or subtractive mills, CAD, CAM, and the holy war of issues like Servos vs. Steppers, NURBS vs. Meshes, and EMC2 vs. Mach3.\n\nMeetings are normally on the first Wednesday of the month (except when they land on a holiday and Maker Works is closed), free and open to everyone and you don't have to be a member of Maker Works to attend.\n\nWith the approach of winter, if the weather is too inclement for safe travel, the meeting may be cancelled if conditions warrant it.\n\nAny CNC-related topic is game and if you have something to show off, please bring it.\n\nFor more info, visit: https://groups.yahoo.com/neo/groups/semicnc/info", "name": "SE Michigan CNC Enthusiast Group (first Wednesday of the month)", "date": "2017-02-01T19:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1576186542414108/", "description": "Tom Sleigh was born in Mount Pleasant, Texas. He attended the California Institute of the Arts and Evergreen State College, and earned an MA from Johns Hopkins University. Sleigh is the author of several books of poetry; his most recent collections include Army Cats (Graywolf Press, 2011), winner of the John Updike Award from the American Academy of Arts and Letters, and Space Walk (Houghton Mifflin, 2007), winner of the Kingsley Tufts Award. His latest book, Station Zed, was published by Graywolf Press in 2015. He has also published a translation of Euripides’s Herakles and a book of essays, Interview With a Ghost (Graywolf Press, 2006). Sleigh has received the Shelley Prize from the Poetry Society of America, an Academy Award from the American Academy of Arts and Letters, an Individual Writer’s Award from the Lila Wallace/Reader’s Digest Fund, and fellowships from the American Academy in Berlin, the Guggenheim Foundation, and the National Endowment for the Arts, among many others. He is a Distinguished Professor in the MFA program at Hunter College and lives in Brooklyn.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon '13).", "name": "Zell Visiting Writers Series: Tom Sleigh", "date": "2017-02-02T17:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/615446661974202/", "description": "Join us on Thursday, February 2nd for a beer dinner at Portland's Wagon Wheel, benefiting Sparrow Hospital! This German-themed beer dinner features four courses of plus a dessert course, all paired with Wolverine State brews. Ticket info and pricing forthcoming.", "name": "Wagon Wheel Beer Dinner", "date": "2017-02-02T18:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1825557424364548/", "description": "The Ann Arbor District Library will be showing the 54th AAFF Tour on Thursday, February 2nd! They will be hosting the event at their downtown location (343 South Fifth Avenue, Ann Arbor, MI 48104), and it is FREE and open to the public. The event will take place from 7:00 pm to 8:30 pm in the Multi-Purpose Room. We look forward to seeing you all there for this chance to enjoy some amazing films with your local community!", "name": "54th AAFF Tour at the Ann Arbor District Library", "date": "2017-02-02T19:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/523093904564649/", "description": "This unique concert features an Austrian orchestra performing works by composers who wrote about the experience of Africans and African-Americans.\n\nThe program features Phillip Glass’s recent collaboration with the Beninese singer Angélique Kidjo, one of the great international artists performing today, based on three poems of Ifé, where the Yoruba people believe the world was created. \n\n“The power of Kidjo’s unflappable voice, the range of her emotional expression, the stellar, genre-bending musicians who back her, and the infectious, activist energy that course through her songs all transcend any native tongue.” (NPR Music)\n\nThe program also includes Alexander Zemlinsky’s Africa Sings, which was written in 1929 and features poetry by Langston Hughes and other prominent writers from the Harlem Renaissance.\n\nMore info: http://ums.org/performance/bruckner-orchester-linz/", "name": "Bruckner Orchester Linz", "date": "2017-02-02T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/195810100885174/", "description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XV", "date": "2017-02-02T20:00:00-05:00"}]