[{"date": "2016-06-24T07:00:00-04:00", "description": "Yes, Virginia, it's real- all wine is 25% off on Friday the 24th!", "url": "https://www.facebook.com/events/1355323777814283/", "source": "Facebook", "name": "25% Off All Wine- One Day Only"}, {"date": "2016-06-24T15:00:00-04:00", "description": "Our Fingers on Fire: American Strings campers will be presenting their newfound skills in fiddling and improve in the historic barn at Rentschler Farms THIS Friday, June24th!  The Moxie Strings and Sarah Lenhart as their mentors during this week long camp will also be performing!", "url": "https://www.facebook.com/events/1748987448719458/", "source": "Facebook", "name": "Fingers on Fire Jam Session with The Moxie Strings at Rentschler Farm"}, {"date": "2016-06-24T18:00:00-04:00", "description": "Join us on FRIDAY, JUNE 24 (6 - 9PM) for 'A DIGITAL TAKE OVER OF THE ANN ARBOR ART CENTER'\n\nFree and open to the public.\n\nOur first POP•IN of the year highlights processes and products of electric and electronic arts, featuring:\n\nMUSIC PERFORMANCES:\n- The.Black.Opera. a multimedia rap performance group with creative roots from Nigeria, Uganda, Madagascar, France and the United States.  They have toured extensively in Europe and the USA.\n\n- Efflux a project intended as a structure for interdisciplinary improvisation.  It encompasses algorithms that react to sounds of percussion and electronic instruments.  This is a project of Simon Alexander-Adam (digital visual artist/musician) and Jon Taylor (percussionist.)\n\n- Live DJ music from Scout, LIVE Nightclub's Saturday night resident.\n\nAN INTERACTIVE PLAY STATION:\nFeaturing tech tools from the Ann Arbor District Library such as the gesture-operated Theremini, glowing Bliptronic, synthesizers, beat machines, and effects pedals.\n\nDIGITAL ART MAKING STATIONS:\nFeaturing the tools of the Art Center's ARTLab, which combines traditional art and digital technologies. Pop-up workstations will allow visitors to try animation, claymation, and digital drawing.\n\nIMMERSIVE THEATER PERFORMANCE:\n-Featuring Kickshaw Theatre's production, Technology, In the Flesh.\nDevised by Angela Dawe, Aral Gribble, and Lynn Lammers, \nlaugh out loud in this playful 15-minute immersive performance. Tickets will be $8 at the event for the performance, that follows the journey of a scientist experimenting with digital and analog stimuli of human humor.\n----------\nPOP•IN- Injecting the Art Center with a spirit of pop-up culture and by collaborating with diverse artists, we aim to attract intrepid young adults looking to explore and be excited by a city. \n\nCommunity members who attend POP•IN will be immersed in unusual, accessible experiences, whether they planned to attend the event or wandered in off the street.\n\nWhile POP•IN is free, we will allow visitors to buy tickets to reserve seating for performances, and make things they can take home.\n\nPOP·OFF: POP·IN's official after party.\n\nALL ATTENDEES receive coupons for discounts and freebies at several participating bars/restaurants within a block of the Art Center.\n\nOfficial page: http://www.annarborartcenter.org/events/popin/\n-------------------\nSponsored by \nMichigan Council for Arts and Cultural Affairs & PNC\n\n#POPIN", "url": "https://www.facebook.com/events/1189411824410155/", "source": "Facebook", "name": "Pop•In"}, {"date": "2016-06-24T19:00:00-04:00", "description": "Come join friends & neighbors alike for a fun, slow, community bike ride through Ann Arbor.\n\nThe fun starts at the Ann Arbor Farmers Market and will continue at a leisurly pace around town, where we will \"bike-in\" to Top of the Park (https://goo.gl/maps/zSwW1vsk9X32) for some post-ride music, dancing, food, drink, & fun.\n\nThat night on the Rackham Stage PanaMO and Orquesta RITMO are playing. There will also be salsa lessons. For more information about the festival go to http://a2sf.org/\n\nMeet up time is 7:00 PM (departing 7:15 PM). Plan on a nice & easy route, 10 miles or less, within city limits. Check back later this week for route & other details to come. Until then, ride safe, be friendly, and have fun!\n\n\nWhat's Bike-in?\nSee the community page:\nhttps://www.facebook.com/bikeinannarbor/info?tab=page_info\n\nOR read below\n\nBike-in is: Slow bike rides throughout Ann Arbor for everyone. Post-ride fun with friends, neighbors, and visitors around the community.\n\nEach ride we will begin at the listed location & time, ride casually, then finish the ride by \"biking-in\" to a post-ride time together at a local establishment, green space, or other friendly host setting (i.e. Bike-in :: Movie (outdoor), Creamery (ice cream), Picnic (potluck), Garden (beer garden), etc.).\n\nRides will be open and friendly to all. For gathering information, times, locations, riding routes, weather updates, etc. like/follow the page or visit for updates.\n\nPlease practice safe riding and abide by all legal riding rules at all times, especially while riding with a Bike-in community. Be sure to provide your own helmet, riding lights, and other appropriate accessories.", "url": "https://www.facebook.com/events/1751217745099856/", "source": "Facebook", "name": "Bike-in :: Top of the Park"}, {"date": "2016-06-24T19:00:00-04:00", "description": "Astrobrite (featuring Scott Cortez of lovesliescrushing) make a special stop in Ann Arbor to hype up the astral vibes \n\nJoined by the lovely and always surprising IO Megaji\n\nOfficial preparty for 8-Bit Above w/ Nikola Whallon Watabou Catears Vest And Tyler later that night\n\nDoors at 7pm | music will begin at 8pm sharp\n\nclub above\n215 N Main Street\nDowntown Ann Arbor", "url": "https://www.facebook.com/events/1710024772590309/", "source": "Facebook", "name": "Astrobrite \\\\ iO Megaji | early show + chiptune preparty at Club Above"}, {"date": "2016-06-24T21:00:00-04:00", "description": "8-Bit Above is back!!!\n\nNikola Whallon \n\nNikola takes a break from coding for the greater good of Particle Physics and LIVING in FRANCE, to visit friends and play his hometown of Ann Arbor! Chiptune and live instrumentation \n\nhttp://soundcloud.com/nikola-whallon\n\nWatabou \n\nChipbreak/Nintendocore/breakcore/GABBER artist takes a short break from his hiatis to play with friends. Travis will not be working or doing homework for at least a few hours, this is special!\n\nhttp://soundcloud.com/watabou\n\nVest And Tyler\nThe newest addition to Chiptune in this area! Ann arbor chiptune dance music to the max!\n\nhttp://soundcloud.com/vestandtyler\n\nCatears \n\nGameoy and Sega Genesis dance tracks! :3\n\nhttp://battleofthebits.org/barracks/Profile/Catears/\n\nSnesei as the DJ of the night!\n\nVisuals by Walk in Circles!", "url": "https://www.facebook.com/events/1728528820720097/", "source": "Facebook", "name": "8-Bit Above w/ Nikola Whallon Watabou Catears Vest And Tyler"}, {"date": "2016-06-24T22:00:00-04:00", "description": "House | EDM | Trap | Twerk | Electro\nmusic by KEVIN MICHAEL\n\nKevin Michael, aka Kevin Kerber aka The Dangling Participle has been started from the bottom and now he’s here. From rocking stages to rocking chairs, Kevin Michael has always been a bastion of excellence in music, arts, culture, and oxford commas. His frenetic, open-format style of mixing has been described as, “pop-meets-electro-meets-slow-cooker.” This Ann Arbor based DJ is in it to win it. On his off time, Kevin Michael can be found lifting weights, eating mammies, not reading directions, and sardonically pontificating on miscellaneous etcetera. If you’re looking for the same old DJ, swipe left.", "url": "https://www.facebook.com/events/251118478588572/", "source": "Facebook", "name": "Festival Friday"}, {"date": "2016-06-25T09:00:00-04:00", "description": "This park along the river has lots of great ecological diversity, including restored prairie and oak savanna. Help is needed to protect it from invasive weeds that crowd out natives and  maintaining the Native Garden at this park. The Garden is a living demonstration of the beauty of native wildflowers, both a help for identification and an example of how they can be used in landscaping. Please meet in the parking lot off of Fuller Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/637977313016320/", "source": "Facebook", "name": "Furstenberg Park Stewardship Workday"}, {"date": "2016-06-25T21:00:00-04:00", "description": "A little magic in the air. Lots of hope, a little despair. Join us...\n\nDeath Posture\nhttps://deathpostureband.bandcamp.com/\n\nFallow Land\nhttps://fallowland.bandcamp.com/\n\niO Megaji\nhttps://iomegaji.bandcamp.com/\n\nShortly\nhttps://shortly.bandcamp.com/\n\nHarison Zamperla\nhttps://www.youtube.com/watch?v=m7qKsN5qIHA\n\n$5 | 18 and up welcome\n\nclub above \n215 N Main Street\nDowntown Ann Arbor\n[above the Heidelberg]", "url": "https://www.facebook.com/events/267060887018329/", "source": "Facebook", "name": "Death Posture \\\\ Fallow Land \\\\ Harison Zamperla \\\\ iO Megaji \\\\ Shortly"}, {"date": "2016-06-25T21:30:00-04:00", "description": "Sat. June 25 | 9:30pm | 18+ | $10 Cover\n\nSuper Happy Funtime Burlesque is a 12 member touring monstrosity. A live band, a burlesque troupe, a circus act, that is all together too contemporary, too modern, too bawdy, and too controversial to be defined just as “burlesque”. So, calling itself ‘burlesque’ for lack of a better term, SHFB is heading out for their 7th national tour this fall with its newest musical production. Designed to find your line and cross it, some kind of strange mix of GWAR and Benny Goodman with touches of SNL and the Price is Right, SHFB sprays you with glitter and love while playfully degrading taboo subjects like religion, politics, and sex. “For every 100 people dancing, there are usually ten or so walking out the door,” says host and bandleader Mr. Happypants, “You either get it or you don’t; the right people get it.” SHFB sets itself apart from other burlesque shows, and touring acts in general, for one major reason: its live band playing original music. Somewhere in a middle ground between Frank Zappa and Tom Waits, this show that gets curiosity seekers out with the promise of tits keeps them in the seats with a set of original tunes that get stuck in your head for weeks after the performance. “People are surprised by the songwriting! What they don’t know is that we’re all professional artists who’s day jobs are in the musical theater world, we bring that aesthetic and blend it with an underground edginess that leaves peoples jaws on the floor.” SHFB is presenting a new and contemporary musical theater at its finest. Come see it now before it gets so big that you can’t afford the ticket!!", "url": "https://www.facebook.com/events/251628825201774/", "source": "Facebook", "name": "Super Happy Funtime Burlesque 6/25/16 at Blind Pig - Ann Arbor"}]