[{"url": "https://www.facebook.com/events/230775294023258/", "source": "Facebook", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "date": "2016-12-09T10:00:00-05:00", "name": "Exhibit: Avant Garden-Fashion & Plants Together!"}, {"url": "https://www.facebook.com/events/1426647894031119/", "source": "Facebook", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "date": "2016-12-09T15:00:00-05:00", "name": "Drink & Draw / Imbibe & Inscribe"}, {"url": "https://www.facebook.com/events/1916510508570504/", "source": "Facebook", "description": "Beginning November 4th, GameStart will be hosting a six-week series of Open House workshops called GameLab. Each week will feature a FREE to participate class, rotating* between two of GameStarts most popular courses: Game Creation with Unity and Minecraft Python Programming. Students are invited to try out and retake each class as often as they'd like during the six-week term.\n\nGameLab Course Schedule:\nDecember 9th, 4:00pm - 5:00pm: Minecraft Python Programming\nDecember 16th, 4:00pm - 5:00pm: Game Creation with Unity", "date": "2016-12-09T16:00:00-05:00", "name": "GameLab: Minecraft Modding in Python (5/6)"}, {"url": "https://www.facebook.com/events/179637829166406/", "source": "Facebook", "description": "Stop in to UMMA on select Friday evenings to enjoy special exhibitions and engaging activities at Fridays After 5! With all of UMMA's galleries remaining open until 8:00 p.m., this exciting series provides an interactive atmosphere for all audiences. While you're here, browse the UMMA Store for a wide variety of speciality items. Park in the Maynard Structure (between Liberty and William) and receive free, validated parking. The Museum is always free.\nUMMA Fridays After 5 are generously supported by Comerica Bank and the State Street District. The media sponsor for Fridays After 5 is Michigan Radio.", "date": "2016-12-09T17:00:00-05:00", "name": "Fridays After 5"}, {"url": "https://www.facebook.com/events/1807900772828520/", "source": "Facebook", "description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "date": "2016-12-09T18:00:00-05:00", "name": "Art Off The Wall Holiday Exhibition & Shopping Event"}, {"url": "https://www.facebook.com/events/1702724873388586/", "source": "Facebook", "description": "Free and open to the public. Seating is first-come, first-serve.\n\nOne MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.\n\nThis week's reading features Bryce Hayes Pope (Introduced by Sam Jensen) & Sierra Brown (Introduced by Robert Heald).\nBryce Hayes Pope is a writer from New York. This past summer, she was a Donor Relations intern at PEN America and a volunteer at MoMA. She once showed Donna Tartt where the bathroom was. She enjoys reading (duh), yoga, Seinfeld, and not cooking.\nSierra Brown is a person hailing from Florida who walks quickly and drinks too much coffee. When not writing poetry, Sierra plays with Madam the cat and hopes for a world without capitalism. You will find Sierra's poems in Blue Mesa Review and Salamander.", "date": "2016-12-09T19:00:00-05:00", "name": "Mark Webster Reading Series"}, {"url": "https://www.facebook.com/events/1352811658064320/", "source": "Facebook", "description": "Literati is pleased to welcome Geneviève Zubrzycki in support of her latest work, Beheading the Saint: Nationalism, Religion, and Secularism in Quebec.\n\nThe province of Quebec used to be called the priest-ridden province by its Protestant neighbors in Canada. During the 1960s, Quebec became radically secular, directly leading to its evolution as a welfare state with lay social services. What happened to cause this abrupt change? Genevieve Zubrzycki gives us an elegant and penetrating history, showing that a key incident sets up the transformation. Saint John the Baptist is the patron saint of French Canadians, and, until 1969, was subject of annual celebrations with a parade in Montreal. That year, the statue of St. John was toppled by protestors, breaking off the head from the body. Here, then is the proximate cause: the beheading of a saint, a symbolic death to be sure, which caused the parades to disappear and other modes of national celebration to take their place. The beheading of the saint was part and parcel of the so-called Quiet Revolution, a period of far-reaching social, economic, political, and cultural transformations. Quebec society and the identity of its French-speaking members drastically reinvented themselves with the rejection of Catholicism. Zubrzycki is already acknowledged as a leading authority on nationalism and religion; this book will significantly enlarge her stature by showing the extent to which a core feature of the Quiet Revolution was an aesthetic revolt. A new generation rejected the symbols of French Canada, redefining national identity in the process (and as a process) and providing momentum for institutional reforms. We learn that symbols have causal force, generating chains of significations which can transform a Catholic-dominated conservative society into a leftist, forward-looking, secular society.\n\nGeneviève Zubrzycki is Associate Professor of University of Michigan Sociology and Director of the Weiser Center for Europe and Eurasia at the University of Michigan. Born and raised in Quebec City, she was educated at McGill University and the Université de Montréal before obtaining her Ph.D. from the University of Chicago. Her work examines politics and religion, nationalism, as well as national mythology and the politics of commemorations. Her publications include the award-winning The Crosses of Auschwitz: Nationalism and Religion in Post-Communist Poland (University of Chicago Press, 2006); Beheading the Saint: Nationalism, Religion and Secularism in Quebec (University of Chicago Press, 2016); and National Matters: Nationalism, Culture and Materiality (forthcoming, Stanford University Press.). She is now completing a third monograph on the current revival of Jewish communities in Poland and non-Jewish Poles’ interest in all things Jewish. She has published articles on the topic in Comparative Studies in History and Society and the Journal for the Scientific Study of Religion. Her scholarship was awarded prizes from the Association for Slavic, East European and Eurasian Studies, the Polish Studies Association, and from the American Sociological Association’s sections on Sociology of Culture, Political Sociology, Sociology of Religion, and Collective Behavior and Social Movements.\n\nEvent date: \nFriday, December 9, 2016 - 7:00pm\nEvent address: \n124 E. Washington St.\nAnn Arbor, MI 48104", "date": "2016-12-09T19:00:00-05:00", "name": "Genevieve Zubrzycki"}, {"url": "https://www.facebook.com/events/1234846563247351/", "source": "Facebook", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nThe League will invite volunteers from the audience to share stories about their holidays – funny, awkward, sad, or wacky – and then they will perform scenes inspired by these tales.\n\nGroup 1: Caps Lock \nGroup 2: Generation Gap\nGroup 3: The League of Pointless Improvisers", "date": "2016-12-09T20:00:00-05:00", "name": "Holiday Improv Show with Caps Lock and Generation Gap"}, {"url": "https://www.facebook.com/events/277240782615400/", "source": "Facebook", "description": "Chuck Mitchell started singing in Detroit folk clubs in the 1960s. In Toronto, on his first out of town gig, he met Canadian songwriter Joni Anderson. They married, and as a duo Chuck and Joni Mitchell played the coffeehouse circuit, and gin rummy, until they divorced in 1968. Mitchell's credits include A Prairie Home Companion and repertory theatre in Texas and in England. He has played Harold Hill in The Music Man and Woody Guthrie in Woody Guthrie's American Song. Most recently, he wrote and produced Mr. Foster & Mr. Twain, in which Stephen Foster joins Mark Twain for an evening of story and song. A Chuck Mitchell's show combines his seasoned skills as an actor, singer and guitarist with a selection of delightful material. He sings cabaret songs by Brecht and Weil -- \"Mack the Knife\" and \"The Bilbao Song\" -- and whimsical songs by Flanders & Swann -- \"The Gnu\" and \"Have Some Madeira, M'dear\". He roves the room singing \"Freeborn Man\" by Ewan McColl, or \"Necessity\" from Finian's Rainbow. He weaves poetry by Robert Frost and T.S. Eliot into his shows. He has been called a renaissance man, and thinks he is old enough to be one.\nwww.mitchellsong.com", "date": "2016-12-09T20:00:00-05:00", "name": "Chuck Mitchell at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/599365436933063/", "source": "Facebook", "description": "Nu Lo and What The Sound present their first ever collaboration, bringing you a tight-knit sweater of a lineup from close to home: \n\nJacob Sigman: http://jacobsigman.bandcamp.com/\n\nwsg\n\nThe Stellars: https://the-stellars.bandcamp.com/releases\n\nFluffer: http://fluffer.us/\n\nMy Girlfriend Beru: https://soundcloud.com/mygirlfriendberu\n\n$7 for 21+\n$10 for 18-21", "date": "2016-12-09T21:00:00-05:00", "name": "Jacob Sigman, The Stellars, Fluffer, & My Girlfriend Beru"}]