[{"description": "PARTY LIKE IT'S 1995\nSave the Date for our 21st Birthday Bash Street Party on July 15th!!\n\nFlash back to 1995: gas was $1.09, ER was the #1 show, the Frappuccino was released, match.com revolutionized dating, and we were all living in Coolio’s Gangsters Paradise.  But best of all, ABC opened their doors, just in time for the 36th annual Art Fair. Fast Forward to 2016 and we are taking the training wheels off and officially turning 21!\n\nIt has been a memorable 21 years to say the least.  As is our way, we are taking the party to the streets to celebrate the past 21 years with an birthday party.  We will be getting’ down on East Washington at Main Street in downtown from 5pm-12am.  As always, there is no cover and we are family friendly as long as minors are with their parents.\n \nThe festival will feature two bars pouring pub classics and fan favorites brews along with a  special release Party Like it's 1995, Prince wheat wine and a signature 21st birthday cocktail.  There will also be some games, great street food and live music from Halcyon Sound and Dragon Wagon.\n\nTo follow the latest happenings follow ABC on twitter and Facebook and use #ABC21birthday for up-to-date info.\n\nFor more information and questions, email ecaintoth@arborbrewing.com.  Can’t wait to see you all there!", "name": "ABC's 21st Birthday!", "source": "Facebook", "date": "2016-07-15T17:00:00-04:00", "url": "https://www.facebook.com/events/538564959681011/"}, {"description": "The Mighty Oak just qualified for the Midwest Region playoffs and have two friendly matches before their first playoff tilt on Friday, July 22nd. \n\nJoin AFC Ann Arbor as they play host to the Columbus Crew College Program.", "name": "AFC Ann Arbor vs. Columbus Crew CP", "source": "Facebook", "date": "2016-07-15T19:00:00-04:00", "url": "https://www.facebook.com/events/150891341998883/"}, {"description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu", "source": "Facebook", "date": "2016-07-15T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/"}, {"description": "Literati is thrilled to welcome Chad Dundas in support of his debut novel, Champion of the World. Chad will be joined in conversation by Chris McCormick, author of Desert Boys.\n\nIn this stunning historical fiction debut set in the world of wrestling in the 1920s, a husband and wife are set adrift in a place where everyone has something to hide and not even the fights can be taken at face value. \n\nLate summer, 1921: Disgraced former lightweight champion Pepper Van Dean has spent the past two years on the carnival circuit performing the dangerous “hangman’s drop” and taking on all comers in nightly challenge bouts. But when he and his cardsharp wife, Moira, are marooned in the wilds of Oregon, Pepper accepts an offer to return to the world of wrestling as a trainer for Garfield Taft, a down-and-out African American heavyweight contender in search of a comeback and a shot at the world title. At the training camp in rural Montana, Pepper and Moira soon realize that nothing is what it seems: not Taft, the upcoming match, or the training facility itself. With nowhere to go and no options left, Pepper and Moira must carefully navigate the world of gangsters, bootlegging, and fixed competitions, in the hope that they can carve out a viable future.\n\nA story of second chances and a sport at the cusp of major change, Champion of the World is a wonderful historical debut from a new talent in fiction.\n\nChad Dundas earned his MFA from the University of Montana, and his short fiction has appeared in the Beloit Fiction Journal, Sycamore Review, Sou’Wester and Thuglit. Since 2001, he’s worked as a sportswriter for national outlets like ESPN, NBC Sports, The Sporting News, Bleacher Report and the Associated Press, as well as local and regional newspapers. A fourth generation Montanan, he lives with his wife, daughter and son in Missoula.\n\nEvent date: \nFriday, July 15, 2016 - 7:00pm", "name": "Fiction at Literati: Chad Dundas, w/ Chris McCormick", "source": "Facebook", "date": "2016-07-15T19:00:00-04:00", "url": "https://www.facebook.com/events/1711105222486725/"}, {"description": "Calling all Pokémon Trainers! Sweetwaters Ypsi will be having a meet up at 7 pm for all teams to unite together to play Pokémon Go. Come and enjoy 10% off drinks before heading out with your team!\n\n#GottaCatchEmAll", "name": "Pokémon Go Meet Up @SWYpsi", "source": "Facebook", "date": "2016-07-15T19:00:00-04:00", "url": "https://www.facebook.com/events/1817241211840526/"}, {"description": "Fri. July 15 | 9:30pm | 18+ | Free Before 10pm / $5 After\n\nCelebrate / Impersonate the Canadian Phenomenon that is Drake with help from Mic Phelps, DJ Cataclysmic,  DJ Graffiti, Dante LaSalle & DJ Jonah\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/750", "name": "Drake Night 7/15/16 at Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-07-15T21:30:00-04:00", "url": "https://www.facebook.com/events/290068474680384/"}, {"description": "BASS WHLF is collaborating with Grand Rapids natives to bring you a bass packed night to celebrate the peak of summer in beautiful downtown Ann Arbor. \n\nDoors at 9pm\n\nLINEUP:\nDJ Dean Martian\nDïRTYBLÜR\nDissonance\nDawning Music b2b CHöFF music\nFrybread Power\nΜütrix\n \n$5 before 11pm, $10 after \n\nOfficial time slots TBA \n\nLighting provided by: ProLux Entertainment\nAdditional sound provided by CHOFF Entertainment", "name": "Summer Horizon at Club Above", "source": "Facebook", "date": "2016-07-15T21:30:00-04:00", "url": "https://www.facebook.com/events/802938726473702/"}, {"description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2", "source": "Facebook", "date": "2016-07-16T16:00:00-04:00", "url": "https://www.facebook.com/events/527350447450698/"}, {"description": "The City Beautification Bureau is proud to present The Floating Concert at A2 Float Fest 2016!!  \n\nDon't forget to bring your swim suit and a tube for front row seating. \n\nThis is an all ages, family friendly event. We will have some outdoor games set up for adults and kids and we will be awarding trophies and prizes to our raft race competitors starting at 4:15pm (Raft Race starts @ 2:30 https://www.facebook.com/events/1115468568491647/).\n\n**Please make sure trash and recyclables are disposed of in their proper places, be discreet if you roll with adult beverages and have fun!**\n\n._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.\n\nWire in the Wood :-: A Bluegrass band based in Ann Arbor MI which includes an upright bass.\n- https://www.reverbnation.com/wireinthewood\n\nBrian Tucker :-: A solo acoustic-rock act featuring our very own Brian Tucker who is very familar with our floating stage\n\nThe Holy Bungs :-: Two band members from Liars & Theives to perform beautiful classical-like peices on the river\n-https://soundcloud.com/theholybungs/charleston\n\n._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.\n\nThe music starts @ 4:30! Be on time for maximum amounts of fun!", "name": "Wire in the Wood}:{Brian Tucker}:{The Holy Bungs at A2 Float Fest 2016", "source": "Facebook", "date": "2016-07-16T16:30:00-04:00", "url": "https://www.facebook.com/events/1072541709503863/"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Tony Hawk\"\n\nGroup 2: \"Listen, Stupid\" \n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Chris Moody, Mitch Socia, Moni Jones, and Jason Valentini", "name": "Pointless Improv with Tony Hawk and Listen, Stupid", "source": "Facebook", "date": "2016-07-16T20:00:00-04:00", "url": "https://www.facebook.com/events/874042816057199/"}]