[{"description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nBUY JUNE 11 TICKETS: http://bpt.me/2538000\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule", "date": "2016-05-24T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/192972824428594/", "name": "Ann Arbor Derby Dimes 2016 season"}, {"description": "Put on your finest pair of cutoffs because Short's Brewing Company is taking over all 12 handles to celebrate the release of our pub-exclusive session IPA, Jorts in the Garden! \n\nFor each pint of Nicie or any other Short's beer, Bill will donate $1 to the Jim Toy Community Center, so get here early and stay late!", "date": "2016-05-24T18:15:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/917469021685075/", "name": "Jorts in the Garden Release Party!"}, {"description": "Are you #ThirstyForEquality? Join us for a drink!\n\nBill's Beer Garden is - once again - generously donating $1 to the Jim Toy Community Center for every beer sold, so come out, bring some friends and have a drink for a good cause!", "date": "2016-05-24T18:15:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1697485673859446/", "name": "Equality On Tap"}, {"description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n- May 24 Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\n\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience. Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile. Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond.\n\nNever a cover\nAlways a good time", "date": "2016-05-24T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1532863607016540/", "name": "Acoustic Tuesdays: Heather Schwartz"}, {"description": "Our very own Kristin Jonna is going head to head with a mystery guest sommelier for a Somm Slam. Kristin and our guest sommelier will each pair a wine with a food course and attendees will vote for which wine and food pairing they prefer. Attendees will enjoy three food dishes, each paired with two different wines. Who'll win the Somm Slam?!?! \n\nSomm Slam costs $75 and includes tax and gratuity.", "date": "2016-05-24T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1725259194424597/", "name": "Somm Slam"}, {"description": "Dr. Monica Starkman is a psychiatrist who is a faculty member of the University of Michigan Medical School Department of Psychiatry in Ann Arbor, Michigan. She is a clinician and a scientific researcher. Many of her publications in the scientific literature highlight concerns and conditions of women, such as the first study of women’s reactions to the use of fetal monitoring during labor. She has served on the editorial board of the Journal of Psychosomatic Obstetrics and Gynecology. She is a recognized expert on the effects of stress hormones on mood and on brain structure. Dr. Starkman has also published in The New Republic and Vogue magazine.\n\nWhen a seemingly miraculous pregnancy following years battling infertility ends in a late miscarriage, Margo is devastated.  For a time, the unshakable yet false belief that she is pregnant again provides relief from all-consuming grief. When her fantasy inevitably clashes with reality, Margo falls into a deep depression requiring admission to a psychiatric unit. Uncertain if the sometimes-chaotic environment there is helping or making her worse, Margo seizes an opportunity to flee. Alone on the city streets, new fantasies propel her to commit a crime with dangerous consequences for herself and others.\n      \nThis stirring portrait by a prominent psychiatrist  of one woman’s psychological unraveling takes readers on a journey across the blurred boundaries between sanity and depression, madness and healing.", "date": "2016-05-24T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/118135448589722/", "name": "Join Us - Book Launch Party for Ann Arbor Author Monica Starkman for Her New Novel 'the end of miracles'"}, {"description": "Our May Artists' Meet & Greet topic is \nHow to Submit Your Artwork to a Show or Gallery. Join us for this free event, connect with other artists and the Art Center staff.\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "date": "2016-05-25T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1176167649079840/", "name": "How to Submit Your Artwork to a Show or Gallery"}, {"description": "Literati is pleased to welcome Elizabeth Hinton in support of her book From the War on Poverty to the War on Crime: The Making of Mass Incarceration in America. Elizabeth will be joined in conversation by Heather Ann Thompson, a professor of History and Afroamerican and African Studies at the University of Michigan; Reuben J. Miller, an assistant professor at UM's School of Social Work; and Ronald Simpson-Bey, Alumni Associate for Just Leadership USA.\n\nElizabeth Hinton is Assistant Professor of History and African and African American Studies at Harvard University. Hinton’s research focuses on the persistence of poverty and racial inequality in the 20th century United States. In her new book, From the War on Poverty to the War on Crime: The Making of Mass Incarceration in America (Harvard University Press), Hinton examines the implementation of federal law enforcement programs beginning in the mid-1960s that laid the groundwork for the mass incarceration of American citizens. In revealing the links between the rise of the American carceral state and earlier anti-poverty programs, Hinton presents Ronald Reagan’s War on Drugs not as a sharp policy departure but rather as the full realization of a shift towards surveillance and confinement that began during the Johnson administration. Before joining the Harvard faculty, Hinton spent two years as a Postdoctoral Scholar in the Michigan Society of Fellows and Assistant Professor in the Department of Afroamerican and African Studies at the University of Michigan. A Ford Foundation Fellow, Hinton completed her Ph.D. in United States History from Columbia University in 2012.\n\nEvent date: \nWednesday, May 25, 2016 - 7:00pm", "date": "2016-05-25T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1758695851043356/", "name": "Elizabeth Hinton"}, {"description": "-$2 wells and $1 shooters before 11pm\n--$2 Bud Light bottles\n--$3 Shock Top pints\n--$3 Malibu Black shots and mixed drinks\n--$5 Soft Parade pints\n\n\n\n\nWildoutWednsdays is here for one thing- to help you get thru that midweek slump! Come out and jump on the hump with ya boys from NTE!!! We're at club above on the 2nd and 4th wednsdays of every month, providing-\n\n---Quality Entertainment\n-Bass Music on the 2nd wedndsay\n-Hip-hop Showcase & DJ/s on the 4th\n--$2 Domestics\n--$3 Drafts\n--$3 Malibu & Rum\n-- A relaxed, supportive environment for artists and fans to network and party amongst each other---we're all in this together!!\n\nonly $3 before 11, and $5 after!!!!", "date": "2016-05-25T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/228993060811676/", "name": "WildOutWednsdays Wsg DJ Cataclysmic King Milo \\Duke Newcomb \\Tru Klassick \\J Classic \\Lucy V \\ROB"}, {"description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: Strawberries & Cream - Cream soda meets fresh-picked strawberry in this juicy rendition of the infamous Strawberry Blonde. Smooth scents of vanilla flood the nose and taste buds at first sip, followed by the bite of strawberry and a satisfying finish.. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "date": "2016-05-26T11:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/158066451258466/", "name": "American Craft Beer Week"}]