[{"description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nHeather Schwartz \nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1210761835633153/", "source": "Facebook", "name": "Acoustic Tuesdays: Heather Schwartz", "date": "2016-08-16T19:00:00-04:00"}, {"description": "So, this is pretty great- Short's Brewing Company will be packaging and delivering their Pyscedelic Cat Grass Without Delay IPA in just 24 hours, making for about the freshest beer you can get. We have a limited supply, so be sure to make it in early to get yours!", "url": "https://www.facebook.com/events/1730492930501364/", "source": "Facebook", "name": "Without Delay IPA Release", "date": "2016-08-17T14:00:00-04:00"}, {"description": "Learn the fundamentals of improvisation, basic games, scene work and skills. Get used to being on stage and working with others in safe, supportive environment. For ages 18 and up. Every Wednesday for 8 weeks.\n\nThe class is now full. To get on the wait list, please email info@pointlessbrew.com", "url": "https://www.facebook.com/events/301784066833678/", "source": "Facebook", "name": "Intro 1: Welcome to Improv", "date": "2016-08-17T19:00:00-04:00"}, {"description": "Joe Hertler & The Rainbow Seekers will make a sprightly young groove doctor out of anyone. With spectacular energy pulsating from every member of the band, its no wonder why they are headlining festivals and one of Michigan’s top rising stars.  Lead singer and Amish excommunicate Joe Hertler splashes through lyrical puddles of golden rain, leaving his audience wearing flowery headdresses and bubbling smiles. A ride on the Rainbow will take you across the mountains of Motown, through the fjords of folk, over the archipelagos of Americana, and—at last—into a funky firth, where only the fiercest of friendships can be found.   Their new album “Terra Incognita “ goes beyond their comfort limits into new styles, new instruments, and new vocals. Everything works out in favor of Joe Hertler & The Rainbow Seekers. It might be early to say, but Terra Incognita could be just what they need to push them over the threshold. Fans that love Joe Hertler & The Rainbow Seekers for their folk melodies will not be disappointed. Though they’ve gone in new directions, the new album still features songs similar to those on On Being. With slow, precise fingerpicking Joe gently sings poetry similar to their old stuff in “Betelgeuse” and “Red Wings.”\nhttp://www.joehertler.com \n\n2016 Lineup \n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "url": "https://www.facebook.com/events/1751795881730523/", "source": "Facebook", "name": "Joe Hertler & The Rainbow Seekers / August 18th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE", "date": "2016-08-18T12:00:00-04:00"}, {"url": "https://www.facebook.com/events/118987195210446/", "source": "Facebook", "name": "Fairy Tea", "date": "2016-08-18T13:00:00-04:00"}, {"description": "Children and their families are welcome for tea and cookies served by real fairies!\nCelebrate with our enchanting fairies as they serve tea, treats, and magic.\nThere will be story time with books available from Crazy Wisdom Bookstore.\nFairy attire is encouraged.\nBe creative!\n$11 per person.\n(Adults accompanying children must purchase tickets also!)\nBabies 18 months and younger are free.\nTickets must be purchased online prior to the event.\nLet us know of any food allergies while checking out.\nemail fairytea@crazywisdom.net", "url": "https://www.facebook.com/events/1108169869274034/", "source": "Facebook", "name": "Fairy Tea", "date": "2016-08-18T16:00:00-04:00"}, {"description": "This month, we have a diverse trio of great topics headed your way at NNA2 edition #37! \n\nAric Schultz returns to the NNA2 stage to give us the scientific skinny on genetically modified organisms. Beloved heckler Kevin Davis is back to talk data storage and perhaps ruin any illusions you may have regarding the cloud. And fellow NNA2 alum Carl Engelke (of the amazing homemade trumpet!) brings us home with his talk on the most epic magical saga of all time - Wagner’s Ring Cycle. Going to be a great night, so grab some friends and a couple of cold ones to join us at Nerd Nite!\n\nWhen: Thursday, August 18, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: Free , thanks AADL!\n\nAric J Schultz: \"OMG, GMOs.\"\nWe often hear the term \"genetically modified organisms\" (GMOs) without much context as to what they are and what they are not. I’ll explain how they are made, plus their application and impact.\n\nAbout Aric: \nI am a graduate student in the microbiology department at the University of Michigan Medical School. I study a microscopic parasite, Toxoplasma gondii, in order to learn more about how it causes disease in humans and identify aspects of this infection that could be exploited and used in the treatment of the disease. Outside of the lab I enjoy practicing brazilian jiu jitsu, gardening, and of course science communication. Follow him on Twitter at @aricj10.\n\nCarl Engelke: \"The use of leitmotif in Wagner’s Ring Cycle: A boring musicology talk\"\nThe original “never-ending story,” (okay, so it’s actually 15 hours) Wagner’s epic opera cycle Der Ring des Niebelungen is widely regarded as the best way to thoroughly convince people that they hate opera. But it need not be so! As we cruise through a “brief” synopsis of the plot, we will explore how Wagner’s use of musical motifs neatly ties the storyline together, and how this compositional style has influenced the development of film scores.\n\nAbout Carl: \nCarl had many, varied interests throughout the years, and he still sometimes wonders what he wants to do when (if) he grows up. He studied trumpet performance in college at Indiana University and the Royal Academy of Music in London, and performed with the Civic Orchestra of Chicago upon graduation. Currently, as a completely logical next step, he is an MD/PhD student at the University of Michigan Medical School, where he studies how chromatin dynamics influence the development and progression of prostate cancer.\n\nKevin Davis: \"Flipping Bits: The History of Data Storage\"\nA review of the advancement of data storage and archival technologies, from the Mainframe to the Pokedex.\n\nAbout Kevin: \nA SAN Engineer for a Fortune 10 company, Kevin determines the best IT storage solutions, for needs ranging from PowerPoint to Oracle. A 17-year IT veteran, he spends his days hard drive drag racing, writing manuals and procedure guides, reviewing new builds, and overseeing storage operations.", "url": "https://www.facebook.com/events/1212502818781000/", "source": "Facebook", "name": "NNA2 #37: Go Big! The Dramatic and Daring Worlds of Genetic Engineering, Memory and Epic Drama", "date": "2016-08-18T18:30:00-04:00"}, {"description": "Detroit News features reporter Stephanie Steinberg, editor of In the Name of Editorial Freedom: 125 Years at the Michigan Daily, will give a book talk at Literati Bookstore in Ann Arbor Aug. 18.\n\nCome hear how the University of Michigan's student-run newspaper, The Michigan Daily, got started in 1890 and how it has kickstarted the careers of journalists working at top media outlets from The New York Times to ESPN. Stephanie will share a few stories from the collection of essays by Daily alumni. A Q&A and book signing will follow. \n\nBooks will be available for purchase for $28.95. For more information on the book, visit: https://www.press.umich.edu/7864923/in_the_name_of_editorial_freedom\n\nFor more event details visit http://www.literatibookstore.com/event/stephanie-steinberg-name-editorial-freedom", "url": "https://www.facebook.com/events/1032923290126826/", "source": "Facebook", "name": "Book Talk at Literati", "date": "2016-08-18T19:00:00-04:00"}, {"description": "Three years ago, a cranky Chinese-American concluded a quest to find his ancestors that led him across four continents and four thousand years. Now, in the midst of a new identity crisis, the champion of negative thought is going back to China.\nWhether he's beating the streets of Beijing in pursuit of a stolen backpack or confronting Communism in an Emperor's tomb, engaging in a battle of wits with overzealous tour guides or performing a pig sacrifice in his ancestral village, internationally touring storyteller phillip low returns with more mystery, more musings, and of course more angst, in his first travelogue since the 2007 hit Descendant of Dragons (Minnesota Fringe Festival Encore winner).\n\n\"It's a mystery story that satisfies because it is about more than the nuts and bolts of solving a puzzle. It's a family story that doesn't shy away from the difficult moments, but also doesn't dissolve into sentimentality. It's a window into another culture, without being a dry sociology lesson. It's a globe-trotting journey that doesn't fall into \"look at these slides of my vacation\" territory. Amazingly, it's just one guy, standing on a stage, telling a compelling story, with very little in the way of theater tricks to back him up. Because he doesn't need them.\"\n-Matthew Everett, playwright (five star review)\n \nGuest artist Maximum Verbosity brings this one-person show to the Pointless stage for one night only.", "url": "https://www.facebook.com/events/287837741565552/", "source": "Facebook", "name": "Pissing on the Great Wall", "date": "2016-08-18T19:30:00-04:00"}, {"description": "Midwest Fest at the Blind Pig for the first time ever!\nDoors 8pm | 18+ | Tix $10 / $20 for all three days (limited availability)  Visit www.blindpigmusic.com for tickets\n\nTHURS 8/18\nThe Go Rounds - https://thegorounds.bandcamp.com/\nMinihorse - https://www.facebook.com/minihorseband/\nThe Antivillians - www.theantivillains.com\nSteven Leaf & the Ex Pats - https://www.facebook.com/steveleafandtheexpats/\nMichigander - https://www.facebook.com/michiganderband\n\nFRI 8/19\nThe Soil & the Sun - www.thesoilandthesun.com/\nMike Adams At His Honest Weight - www.mikeadams.info/\nBig Sherb - https://www.facebook.com/bigsherb/\nBoudoir Noir - https://boudoirnoir.bandcamp.com/\nAncient Language - https://www.facebook.com/AncientLanguageMusic\n \nSAT 8/20\nGuilty Simpson - http://rapraprapraprap.com/\nMister - http://rapraprapraprap.com/\nRed Pill - https://www.facebook.com/redpillrap\nLast Gasp - https://www.facebook.com/LastGaspCollective/?fref=ts\nAlexander Lynch - https://soundcloud.com/alexanderlynch", "url": "https://www.facebook.com/events/564009510445180/", "source": "Facebook", "name": "Midwest Fest IX August 18-20 at Blind Pig - Ann Arbor", "date": "2016-08-18T20:00:00-04:00"}]