[
  {
    "url": "https://www.facebook.com/events/1186938597987536/",
    "description": "After 18 years working at the City of Ann Arbor’s Natural Area Preservation, Dea Armstrong will be leaving us at the end of the season. You’re cordially invited to celebrate her career at a farewell party to be held on November 10th, 2015 at the Leslie Science and Nature Center in Ann Arbor.",
    "source": "Facebook",
    "date": "2015-11-10T17:00:00-05:00",
    "name": "Farewell Celebration for Dea"
  },
  {
    "url": "https://www.facebook.com/events/463631817155986/",
    "description": "Literati is pleased to welcome Lisa Goich for the launch of her memoir 14 Days: A Mother, A Daughter, A Two-Week Goodbye.\n\nWhen Lisa traveled home to visit her parents in December 2011, she never expected an ordinary three-day weekend to turn into an extraordinary 14-day observance of her mother’s life and, ultimately, death. 14 Days is a story of parental loss, and how to lovingly, bravely and gracefully let go of a hand you’ve been holding your entire life.  From a child’s first breath, to a mother’s last, this memoir shows how closing that circle can be a celebration of this unbreakable bond.\n\nLisa Goich-Andreadis is an award-winning copywriter, major market talk radio host, blogger, journalist and former stand-up comedian. Graduating from Central Michigan University in 1984 with a Bachelor Of Applied Arts Degree in Journalism, she has spent her life dedicated to the written word, the spoken word and the arts. Lisa has worked for some of the biggest names and corporations in the literary and entertainment business: Mitch Albom, Carole King, Robert Redford, ABC, The WB, CAA and Playboy. She has written ads for clients including: The American Red Cross, KFC, 7-Eleven, Thorn Apple Valley, and numerous TV and radio stations. As a talk radio host and producer, Lisa has worked for major market terrestrial radio stations including: KFI AM 640 in Los Angeles (America’s #1 Talk Radio Station), The iconic WJR AM 760 in Detroit, KLSX / Los Angeles and KTLK / Los Angeles. Lisa currently serves as a senior project manager for the Jazz and Comedy genres of the prestigious GRAMMY Awards.\n\nLisa’s first book, The Breakup Diary, was published in 2002. She currently lives in Los Angeles with her husband, musician Teddy Andreadis (Guns ‘n’ Roses, Carole King, Alice Cooper, Billy Bob Thornton), and their four rescue dogs. She and her Maltese mix, Angie, work with hospice patients and their families, helping to make their transitions to the other side a loving, bonding and peaceful experience.",
    "source": "Facebook",
    "date": "2015-11-10T19:00:00-05:00",
    "name": "Lisa Goich"
  },
  {
    "url": "https://www.facebook.com/events/516006171906944/",
    "description": "Monthly meeting of the Go-Tech \"geek show and tell\".",
    "source": "Facebook",
    "date": "2015-11-10T19:00:00-05:00",
    "name": "GO-Tech"
  },
  {
    "url": "https://www.facebook.com/events/945758482163704/",
    "description": "Give the Gift of Fine Dining\nEnjoy FREE MSV Promo Gift Cards* with your purchase.\n\nPurchase $250 or more in Gift Cards and get a free $25 Promotional Gift Card for every $250 spent.     \n\nPurchase $1,000 or more in Gift Cards, and get $50 free in Promotional Gift Cards for every $250 spent. \n\nMSV Holiday Combo Package \nFor only $75 get $50 in Gift Cards and TWO Distinctive Recipes Cookbooks. \n\nMSV Distinctive Recipes Cookbook\nOur MSV Distinctive Recipes cookbook lets you share in the experience of preparing uniquely styled entrées and award-winning recipes. It’s a great gift for those who love to cook! Offered now for only $19.95* (reg. $35).\n\n*Offered for a limited time only 11/1/2015– 12/31/2015, while supplies last.",
    "source": "Facebook",
    "date": "2015-11-10T23:00:00-05:00",
    "name": "Give the Gift of Fine Dining!"
  },
  {
    "url": "https://www.facebook.com/events/187323768272792/",
    "description": "Join us for an evening of art as artists from one of our biggest exhibitions of the year talk about their experience and process. \n\nWe received 550 submissions from around 200 artists from the Great Lakes region.\n\n\"The number of thoughtful and inspired entries for this exhibition overwhelmed me!  From conceptual work, to realistic portraiture, to abstract landscapes, there was enough exciting artwork to easily fill three galleries.  My only regret is that I had to leave out many great pieces that should have also been included.  I thoroughly enjoyed the jurying process, and want to thank everyone for his/her submissions this year.\" - Cristen Velliky, Juror",
    "source": "Facebook",
    "date": "2015-11-11T18:30:00-05:00",
    "name": "Artist Talk - 93rd Annual All Media Exhibition"
  },
  {
    "url": "https://www.facebook.com/events/1722746661287743/",
    "description": "Wed. November 11 | 7pm | 18+ | $12 Adv./ $15 Day of\n\n Theo Katzman\nwith: The Stellars & Anna Ash\n\n(((My name is Theo Katzman))) http://www.ticketweb.com/t3/sale/SaleEventDetail?dispatch=loadSelectionData&eventId=6302345&pl=majesti\n\n(((((I write healing Meta Pop Anthems to soothe your post-Y2K Pop Culture Hangover))))\n\n((((((I think Billy Joel is a punk-rock artist)))))))\n\n((((((((((((((((((((Thank you)))))))))))))))))))))))))\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/556",
    "source": "Facebook",
    "date": "2015-11-11T19:00:00-05:00",
    "name": "Theo Katzman with The Stellars & Anna Ash 11/11/15 @ Blind Pig - Ann Arbor"
  },
  {
    "url": "https://www.facebook.com/events/425039804354650/",
    "description": "Literati is pleased to welcome R.J. Fox for the launch of Love & Vodka: My Surreal Adventures in the Ukraine, the debut title from local publisher Fish Out of Water Books (www.fowbooks.com)!\n\nBobby is over the moon after sharing a bike on the E.T. ride at Universal Studios with Katya. Join our “intrepid crusader” as he takes a leap of faith—traveling from comfortable “have-a-nice day … and have-a-warm-shower” suburban Detroit to the former center of Cold War Soviet missile production. And unbeknownst to anyone but himself, he’s bringing an engagement ring! Experience life in a city that, until the mid-1980s, was closed to foreign visitors. R.J. Fox’s humorous, poignant, and memorable expedition is punctuated by a colorful cast of characters, adventures, and cultural mishaps and misunderstandings—from irate babushka women to hard-drinking uncles. Lesser mortals might have “phoned home” to be rescued. Armchair travelers and romantics—you will find yourself both schooled in hard knocks and heartened to have shared in the unforgettable experience of Love & Vodka! “Za vashe zdorovie!”\n\n\"Love & Vodka is an honest, funny, and deeply heartfelt story about a young man who drops everything to pursue an epic romance. If you’ve ever done something crazy in the name of love, R.J. Fox’s adventures in Ukraine will strike a chord. This book is a delight!” — Davy Rothbart, author of My Heart Is an Idiot and founder of FOUND Magazine\n\n“From the violent rugby scrum at the airport baggage carousel to inoperable midnight plumbing and a potential grandmother-in-law who doubles as the queen of serial vodka shots, R.J. Fox stumbles through one misadventure after another, all in the name of love. The reader is along for the ride and will walk away shaky-legged, enlightened, and undoubtedly able to correctly pronounce Dnipropetrovsk!” — Jeff Kass, author of Knuckleheads, Independent Publishers Gold-Medal Winning Best Short Fiction Collection\n\nR.J. FOX is the award-winning writer of several short stories, plays, poems, and fifteen feature-length screenplays. He is also the writer and director of several award-winning short films. In addition his writing and filmmaking exploits—not to mention his talents as a saxophonist—Fox teaches English and Video Production in the Ann Arbor Public Schools where he uses his own dream of making movies to inspire his students to follow their own dreams. Fox has also worked in public relations at Ford Motor Company and as a newspaper reporter. He resides in Ann Arbor, MI.",
    "source": "Facebook",
    "date": "2015-11-11T19:00:00-05:00",
    "name": "R.J. Fox"
  },
  {
    "url": "https://www.facebook.com/events/425639190972710/",
    "description": "WHAT:\nThe Michigan Department of Transportation (MDOT) will host an open house regarding construction on US-23 between Ann Arbor and Brighton starting as early as 2016. The meeting will be a way for the public to get updates on the project schedule and provide input on the preliminary aesthetics and landscape themes for the corridor between M-14 and I-96. There will be no formal presentation made. The public is invited to attend any time during the meeting hours.                                                                     \n                                                                                    \nWHO: \nMDOT officials\nLocal officials\nInterested residents and commuters\n                                    \nWHEN:\nThursday, Nov. 12, 2015\n4 - 7 p.m.         \n                                                            \nWHERE:\nNorthfield Township Hall, 2nd Floor Commission Room\n8350 N. Main St. \nWhitmore Lake\n \nSpecial accommodations: 810-227-4681\n                                                            \nBACKGROUND:\nAt the open house, the public will be asked to provide input on specific themes and aesthetic elements as part of a context sensitive solution for the US-23 corridor in Washtenaw and Livingston counties. \n \nThe public will also receive updates on the upcoming project that includes replacing and upgrading pavement, median shoulders, bridges, and entrance and exit ramps. In addition, MDOT will install an active traffic management system along the corridor between M-14 and M-36 to help manage peak-hour congestion and increase safety. \n\nhttp://content.govdelivery.com/accounts/MIDOT/bulletins/122d47f",
    "source": "Facebook",
    "date": "2015-11-12T16:00:00-05:00",
    "name": "MDOT to host public meeting to discuss US-23 corridor improvements"
  },
  {
    "url": "https://www.facebook.com/events/752219808216705/",
    "description": "This is the mack daddy of all of our beer tasting events! We pull together 25 to 30 of the best Belgian and belgian-style ales across the category spectrum. From malty rich trappists to traditional sour lambics and flemish browns to aged and high gravity ales to crazy concoctions made with fruits and spice.  \n\nTickets include beer samples and 24 beers to choose from, an appetizer buffet, a complete event program with tasting notes, and door prizes. \n\nTickets are $30 in advance and $35 if purchased on tasting day. Advance tickets recommended as this tasting often sells out. Call 734-213-1393 to order tickets over the phone.",
    "source": "Facebook",
    "date": "2015-11-12T19:00:00-05:00",
    "name": "A Taste of Belgium"
  },
  {
    "url": "https://www.facebook.com/events/1671834359750223/",
    "description": "Ann Arbor’s God Knows Who is back to perform material from their early days. Three decades of astounding leaps and bounds in Audio Technology has done little to change their lo-fi approach.\n\n$10 at the door\nFree to Yellow Card holders.\n\nBand website: http://www.benmiller.info/bmi_GKW.html",
    "source": "Facebook",
    "date": "2015-11-12T20:00:00-05:00",
    "name": "God Knows Who"
  },
  {
    "url": "https://www.facebook.com/events/929976707046058/",
    "description": "Thursday, November 12 | 9pm | $10 adv./ $12 day of | 18+\nThe Bright Light Social Hour with: SWIMM & Buffalo Coven Party \n\nQuestions bring art to life. Songs can still ponder socio-political issues, the fragility and isolation of the human condition, and what lies ahead for earth. Moreover, music possesses the potential and gravitas to incite change, while reflecting the world’s faults and follies. The Bright Light Social Hour contemplate a “Future South” on their second full-length album, Space Is Still the Place [Frenchkiss Records]. The Austin artists—Curtis Roush [guitar, vocals, synths], Jack O’Brien [bass, vocals, synths], Joseph Mirasole [drums, synths]—offer a different interpretation of the space around them throughout ten thematically connected songs. They tackle a myriad of issues head on during tracks such as “Ghost Dance” and “Ouroboros,” while “Infinite Cities” contemplates loneliness and “Escape Velocity” subtly hints at a orgiastic ending. The album will pose a few questions, but you may leave with an answer or two as well.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/449\n\nSurcharge free tix at The 8 Ball Saloon",
    "source": "Facebook",
    "date": "2015-11-12T21:00:00-05:00",
    "name": "The Bright Light Social Hour with SWIMM 11/12/15 @ Blind Pig - Ann Arbor"
  },
  {
    "url": "https://www.facebook.com/events/1481043418869369/",
    "description": "We are excited to announce our 2015 Holiday Season transformation! \n\nThe holiday shopping season at the 117 Gallery in the Ann Arbor Art Center starts on November 13th! Featuring unique handmade works of art by local artists that you won't find anywhere else! \n\nPaintings, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more! \n\nJoin this Facebook Event page and receive updates about our unique merchandise, photos, descriptions, and prices.\n\nWe have an exclusive MEMBERS ONLY Shopping Preview Event on NOVEMBER 12, from 5 to 9 pm, in which members of the Ann Arbor Art Center will have the opportunity to be the first to shop for the holidays and receive exclusive discounts (up to 20%)*\n\n*Discount excludes Motawi merchandise\n\nWant to become a member? Support the Art Center and enjoy all the benefits that come with being a part of our community: http://goo.gl/x0iIxC",
    "source": "Facebook",
    "date": "2015-11-13T10:00:00-05:00",
    "name": "117 Gallery Shop - Holiday Shopping Season!"
  },
  {
    "url": "https://www.facebook.com/events/581090628711468/",
    "description": "first break --- Helmut Stern Auditorium\n\nOne MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.",
    "source": "Facebook",
    "date": "2015-11-13T19:00:00-05:00",
    "name": "Mark Webster Reading Series"
  }
]
