[{"url": "https://www.facebook.com/events/1700416470279803/", "source": "Facebook", "description": "It's happening again! On Friday, September 30th, we're marking Cucuribita Smiles release day by pouring it out of pumpkins with special fruit and spice additions! We'll release more details as we get closer to the event.", "date": "2016-09-30T16:00:00-04:00", "name": "Cucurbita Smiles Pumpkin Pour"}, {"url": "https://www.facebook.com/events/1558232137817484/", "source": "Facebook", "description": "Bird Walk \nFriday, September 30 \nArgo Nature Area \n5:30 to 7:30 p.m.\nJoin City Ornithologist Juliet Berger for a walk through Argo Nature Area and the Argo Cascades in search of southward migrating songbirds and waterfowl! We’ll also observe many birds that stay the winter in the Argo area, and we’ll see the beginnings of autumn color in the trees and shrubs. Meet in the parking area closest to the dam. Bring binoculars if you have them, but they are not necessary. Be prepared for uneven terrain, mosquitoes and rainy or muddy conditions. Free.", "date": "2016-09-30T17:30:00-04:00", "name": "Bird Walk- Argo Nature Area"}, {"url": "https://www.facebook.com/events/289096731461751/", "source": "Facebook", "description": "You asked for it- Trivia Night is now a regular thing! Every other Friday, our Trivia Master Kevin will be hosting this super fun event, and the winner will receive a $25 gift card. Our taps will be flowing with great beer as always, just $2 a pint. Come see if you really are a know it all!", "date": "2016-09-30T18:00:00-04:00", "name": "Trivia Night"}, {"url": "https://www.facebook.com/events/298731297167159/", "source": "Facebook", "description": "Literati is pleased to welcome poets Raymond McDaniel, Christina Quintana, Sarah Sala, and Keith Taylor for the latest installment of our Poetry at Literati reading series. \n\nRaymond McDaniel is the author of Murder, Saltwater Empire, Special Powers & Abilities, and in 2017 The Cataracts, all from Coffee House Press.\n\nChristina Quintana is a New York-based writer of plays, poetry, and fiction with Cuban and Louisiana roots. Her work has been published or is forthcoming in Raspa Magazine, Saw Palm, and Nimrod International Journal, and her chapbook of poems, The Heart Wants, has been released by Finishing Line Press.\n\nSarah Sala is the former editor-in-chief of the University of Michigan’s literary magazine, Oleander Review. Her poem \"Hydrogen\" was recently featured in the \"Elements\" episode of NPR's hit show Radio Lab in collaboration with Emotive Fruition. The Ghost Assembly Line, a chapbook of her selected poetry, has been published by Finishing Line Press. Her poems appear in Poetry Ireland Review, Atlas Review, and the Stockholm Review of Literature. \n\nKeith Taylor's most recent books are Fidelities and The Ancient Murrelet (published by Alice Greene & Co.), Marginalia for a Natural History (published by Black Lawrence Press), and Ghost Writers: Us Haunting Them, co-edited with Laura Kasischke (published by Wayne State University Press).", "date": "2016-09-30T19:00:00-04:00", "name": "Raymond McDaniel, Sarah Sala, Christina Quintana, Keith Taylor"}, {"url": "https://www.facebook.com/events/199447367142600/", "source": "Facebook", "description": "Ann Arbor Civic Theatre presents the Second Stage comedy, Sylvia, directed by Cassie Mann, September 30-October 2, 2016, at the A2CT Studio Theater, 322 West Ann St, Ann Arbor, MI, 48104. Performances are Friday and Saturday at 8 p.m. and Sunday at 2 p.m. All tickets are $12, with a $2 discount at the Sunday performance for those bringing a photo—printed or on a cell phone—of them with their dog, or a non-perishable pet supply donation. In collaboration with the Humane Society of Huron Valley, donations of pet supplies and food, as well as monetary donations, will be accepted at every performance. Tickets are available by calling the office at 734-971-2228, or at the door.  Additional information is available by visiting www.a2ct.org.  \nSylvia finds Greg and Kate, recent empty-nesters, at a cross roads in their relationship. Kate is a middle school English teacher who fills the void with a renewed commitment to her career. Greg, on the other hand, flounders in a job he has grown to dislike and a surplus of free time. Enter Sylvia, a disarming dog of unknown origins whom Greg finds unattended in Central Park. Greg brings Sylvia home, much to Kate’s displeasure. As the bond between Greg and Sylvia grows, a chasm opens in Greg and Kate’s marriage into which friends, a well-meaning fellow dog owner, and a misguided therapist fall. With sharp wit and biting satire, A.R. Gurney explores the age-old connection between man and his best friend.\n“I saw a scene from Sylvia in an acting showcase a few years ago and fell in love with the play,” says director Cassie Mann. “Having a young woman play a dog—not in a dog suit but as a fully-conversant human with dog tendencies--is a brilliant device. The audience gets to experience the inner life of a dog as well as the relationships between Sylvia and those around her. The comedy builds as the relationship between Sylvia and Greg grows, but there’s also a poignant message about how a longtime couple navigates their post-child-rearing years.”\n\nThe cast of Sylvia features Stacy Buck as Sylvia, Larry Rusinsky as Greg, and Denyse Clayton as Kate. The cast also includes Lonnie Curri, Dave Giles, and Celeste Green. \n\nSylvia contains adult themes and languages and is intended for mature audiences. ***", "date": "2016-09-30T20:00:00-04:00", "name": "Sylvia"}, {"url": "https://www.facebook.com/events/508962365964547/", "source": "Facebook", "description": "Ann Arbor singer, songwriter and recording artist Khalid Hanifi brings his fine band, featuring drummer Chuck Mauk, guitarist Alex Anest, bassist Don Beyer and keyboardist Grace Mauk to Kerrytown Concert House for an evening of vibrant, lyrically incisive and irrepressibly tuneful original songs.", "date": "2016-09-30T20:00:00-04:00", "name": "Khalid Hanifi at Kerrytown Concert House"}, {"url": "https://www.facebook.com/events/517141991807074/", "source": "Facebook", "description": "Jeremy Horn grew up in Memphis -- \"Home of the Blues\" and \"Birthplace of Rock and Roll\" -- but his music sounds more like the Beatles than B.B. King or Elvis.  He writes songs for the church and songs for the radio, yet his songs are more complex than either has traditionally allowed.  He lives in a city that is known as much for its racial unrest and inner-city violence as it is for being the place Elvis called home, yet he leads worship at one of the largest multicultural churches in the South, where half the congregation is African-American. When you meet Jeremy, he looks and sounds just like the \"guy next door\" -- if the guy next door has a traditional southern drawl.  Making music has preoccupied  Jeremy Horn ever since he received his first guitar at age fifteen. Growing up on the sounds of James Taylor and the Beatles, Jeremy spent most of his early years emulating the sounds and songwriting styles of the popular culture. \"I used to write songs about social injustices in the world,\" says Horn. After a few years and conversations with a wise, older friend, Jeremy realized he could also write songs that aspired to give people hope, and not just write what everybody else was writing. Says Horn, \"That progressed into writing songs for Jesus, and that was the process that unexpectedly led me to become a worship leader.\" That progression started Jeremy Horn on the path of continued discovery --listening to artists both Christian and not -- to figure out how to express feelings and concepts that came from within, rather than from the evening news.  Jeremy's music is a fixture on Michigan's 17 Smile-FM Contemporary Christian music stations; his \"I Will See Angels 'Round Your Throne\" and \"First Love\" are two of his popular hits. Jeremy's new CD is No Other Love. This is a rare opportunity to see Jeremy Horn in a small venue setting. Bring a friend!\nwww.jeremyhornmusic.com", "date": "2016-09-30T20:00:00-04:00", "name": "Jeremy Horn at Green Wood Coffee House"}, {"url": "https://www.facebook.com/events/1807171166184117/", "source": "Facebook", "description": "Fri. September 30 | 9pm | 18+ | $10 adv./ $12 day of\n\nFuzz Fest Showcase feat: Goblin Cock, Super Thing & The Highborn\n\n\"SO STUPID!!!\" bemoans Lord Phallus as he gazes pensively from the curtain wall of his modest stronghold.\n\n\"They don't know what they have, nor understand what they can do for one another or how short a time they have to do it in.\"\n\nHead in hands, the lead singer, guitar-player, and sole songwriter of histories most beloved Comic-Book Metal band knows what must be done.\n\n\"I must make a gesture\", he says.\n\n\"A frivolous gesture, perhaps, but a dear one nonetheless\"\n\nUpon snapping his bony fingers, an immense stone murphy bed plummets from a nearby rock wall, immiting all manner of bats, cobwebs, and forgotten paraphernalia until, coughing and wheezing, the auxiliary members of Goblin Cock appear one by one, shaken and disturbed, yet hungry for battle.\n\n\"It's the Humans again!\" Phallus intones, \"they've made it so increasing hard to for themselves to breathe their own air, eat their own food, love the ones they truly love, or generally have a full life without destroying the lives of innocents!\"\n\n\"But why, oh Lord?\" speak his bandmates in chilling unison, \"Why must they all live in such obvious denial?\"\n\n\"Beats me!\", Phallus ponders hesitantly, \"but instead of risking you all falling back to sleep through boorish philosophizing, lets put out a new record and get back on the road where we belong before they finish turning this lovely blue sphere into a burned out garbage planet!\"\n\n\"Hooray for that!\" cheer his hyper-enthusiastic bandmates.\n\nSo, Phallus went to work on his most concise album to date, invoking the spirit of Pure Fun while appeasing his love of Doomed Art.\n\nIt is a crushingly brutal Dear John letter to society.\n\nIt is a rock falling from space that knocks you unconscious that you, in turn, shove in your pajama pocket for safe keeping upon awakening.\n\nThese are songs about True Love.\n\nThese are songs about Revolution.\n\nThese are songs about 70's Children's Television.\n\nGoblin Cock have delivered an auditory tome of such importance that it needs to be experienced before the Secret Bastards find a way to marginalize it out of existence forever.\n\nNECRONOMIDONKEYKONGIMICON.\n\nIt is their gift to us.\n\nDon't squander it.", "date": "2016-09-30T21:00:00-04:00", "name": "Goblin Cock w/ Super Thing & The Highborn 9/30/16 at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/1493588277395378/", "source": "Facebook", "description": "We'll be serving up our beloved made in-house wings outside this weekend, 6 for $5, as well as $2 pints of craft beer. Come be our wing man, woman, or child?", "date": "2016-10-01T09:00:00-04:00", "name": "Popup Kitchen- Wings!"}, {"url": "https://www.facebook.com/events/192593237818652/", "source": "Facebook", "description": "Park in our lot and get one of one of our made in-house brats*, just $25! We'll be tailgating all day, too- $2 pints, made in-house wings, and good times. Go Blue!\n\n*Please note that it is just one delicious brat per car for $25.", "date": "2016-10-01T09:00:00-04:00", "name": "Spots and Brats!"}]