[{"source": "Facebook", "date": "2017-02-15T20:00:00-05:00", "description": "Busty and the Bass\nW/ Michael Blume &  O N E F R E Q\n\nFebruary 15 at Blind Pig - Ann Arbor, MI\n\nTix / info >> https://goo.gl/NOU4BW", "url": "https://www.facebook.com/events/1031725066955473/", "name": "Busty and the Bass // Ann Arbor, MI"}, {"source": "Facebook", "date": "2017-02-16T17:00:00-05:00", "description": "Joins us for our special Valentine's Day creations all weekend long all they way through Valentine's Day. \n\nWe'll be featuring some great Food & Beverage Specials. To make your reservations visit SavasRestaurant.com/reservations or call us at 734-623-2233\n\nDRINK SPECIALS\n__________________\n\nA FRENCH ROSE\ncreme yvette, cocchi americano rosa, parigot rosé\n\nQUEEN OF HEARTS\nhendrick's gin, st. germain, lavender syrup, lemon juice, cranberry juice, apple-cranberry cider\n\nKING OF HEARTS\njohnnie walker red, averna, carpano antica, chocolate bitters\n\nDINNER SPECIALS\n__________________\n\nFILET & PRAWNS\nchoice grade 6 oz. filet with 2 jumbo prawns and beurre maître d’hotel. With pommes fondant and veal glazed carrots\n\nMOULES  CHAMPAGNE \nbay harbor mussels steamed in an herbed champagne cream broth, served with baguette\n\nOYSTERS\noysters, black pepper-balsamic sorbet, minced shallot, micro radish, cucumber brunoise\n\nHALF-ROAST CHICKEN\nbrined half-chicken, roasted fingerling potatoes, warm spinach salad with apple, sarvecchio and creamy bacon vinaigrette\n\nRISOTTO STUFFED SQUASH\nbutternut squash risotto, wild mushroom blend, braised leeks, roast acorn squash, curried romesco, roasted asparagus", "url": "https://www.facebook.com/events/1197760063612471/", "name": "Sava's Valentine's Day Featured Food & Beverage Specials"}, {"source": "Facebook", "date": "2017-02-16T17:30:00-05:00", "description": "Terrance Hayes is the author of Lighthead (Penguin 2010), winner of the 2010 National Book Award and finalist for the National Book Critics Circle Award. His other books are Wind In a Box (Penguin 2006), Hip Logic (Penguin 2002), and Muscular Music (Tia Chucha Press, 1999). His honors include a Whiting Writers Award, a National Endowment for the Arts Fellowship, a United States Artists Zell Fellowship, a Guggenheim Fellowship, and a MacArthur Fellowship. How To Be Drawn (Penguin 2015), his most recent collection of poems, was a finalist for the 2015 National Book Award, the 2016 National Book Critics Circle Award, and received the 2016 NAACP Image Award for Poetry.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon '13).", "url": "https://www.facebook.com/events/236843713440906/", "name": "Zell Visiting Writers Series: a conversation with Terrance Hayes"}, {"source": "Facebook", "date": "2017-02-16T17:30:00-05:00", "description": "CMSa2 welcomes instrumentalists of all ages to come join our Classical and Jazz ensembles during a week of open house rehearsals! Experience the joy of playing in an orchestra, jazz combo or chamber ensemble, meet our conductors and teachers, learn more about our programs, make new friends and play music from Beethoven to Chick Corea to John Williams!\n\nThe schedule for the rehearsals is listed below:\n\nMONDAY:\nConcert Orchestra - 5:30PM-7:15PM @ Scarlett Middle School\nSymphony Orchestra - 6:30PM-8:30PM @ Scarlett Middle School\nWind Ensemble - 6:30PM-8:30PM @ CMSa2\nBrass Ensemble - 6:30PM-8:30PM @ CMSa2\n\nTUESDAY\nYouth Jazz Combo - 6:00PM-7:30PM @ CMSa2\nAdult Jazz Combo - 8:00PM-9:30PM @ CMSa2\n\nWEDNESDAY\nNew Horizons Senior String Orchestra - 1:00PM-3:00PM @ CMSa2\nAdult Jazz Combo - 8:00PM-9:30PM @ CMSa2\n\nTHURSDAY\nPercussion Ensemble - 6:30PM-8:30PM @ Clague Middle School\n\nWe look forward to seeing everyone there!", "url": "https://www.facebook.com/events/397979943874993/", "name": "CMSa2 OPEN HOUSE"}, {"source": "Facebook", "date": "2017-02-16T17:30:00-05:00", "description": "Terrance Hayes is the author of Lighthead (Penguin 2010), winner of the 2010 National Book Award and finalist for the National Book Critics Circle Award. His other books are Wind In a Box (Penguin 2006), Hip Logic (Penguin 2002), and Muscular Music (Tia Chucha Press, 1999). His honors include a Whiting Writers Award, a National Endowment for the Arts Fellowship, a United States Artists Zell Fellowship, a Guggenheim Fellowship, and a MacArthur Fellowship.  How To Be Drawn (Penguin 2015), his most recent  collection of poems, was a finalist for the 2015 National Book Award, the 2016 National Book Critics Circle Award, and received the 2016 NAACP Image Award for Poetry.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon '13)", "url": "https://www.facebook.com/events/238840629903686/", "name": "Zell Visiting Writers Seres: a conversation with Terrance Hayes"}, {"source": "Facebook", "date": "2017-02-16T18:30:00-05:00", "description": "It’s Nerd Nite time again, Ann Arbor friends! \n\nWe have an exceptional lineup of Valentine’s Day-adjacent topics presented by a lovely assortment of local nerds that we are delighted to be bringing to the LIVE stage on Thursday, 2/16. \n\nRomance novelist Celia Mulder will lead a ridiculous romp through the world of romance novel subgenres - from time-traveling Vikings to firefighting cowboys to shapeshifting were-creatures - and so much more. \n\nRich Retyi and Brian Peters, the beer-drinking, local history-loving duo behind the Ann Arbor Stories podcast, will bring the story of Ann Arbor’s seedy underbelly to (red) light. \n\nPhysicist Brian Worthmann says pink is bulls&%# and he’ll give a whole spectrum of reasons why in this colorful talk.\n\nSo bring someone you love, like, or love to hate, and join us for Red Light Romance: A Very Nerdy Valentine at LIVE on First St, Thursday, 2/16, doors at 6:30 pm.", "url": "https://www.facebook.com/events/405980399753718/", "name": "Red Light Romance: A Very Nerdy Valentine"}, {"source": "Facebook", "date": "2017-02-16T18:30:00-05:00", "description": "The City of Ann Arbor invites the community to attend the Allen Creek Greenway Project public meeting that takes place Thursday, Feb. 16, 2017, from 6:30 to 8:30 p.m. at Larcom City Hall, second floor Council chambers, located at 301 E. Huron St. The first hour will consist of an in-depth presentation of the progress on the Greenway to date. During the second hour, attendants will be able to interact with staff and more closely view trail types as well as potential route alignments. \n            \nAnn Arbor Community Television Network (CTN) will record the presentation for later broadcast. Background information about this project is available at a2gov.org/allencreekgreenway. Any questions on the Allen Creek Greenway Project can be directed to project manager Connie Pulcipher at cpulcipher@a2gov.org or 734.794.6430 ext. 43731.\n\nAll persons are encouraged to participate in public meetings. Accommodations, including sign language interpreters, may be arranged by contacting the city clerk's office at 734.794.6140; via email to cityclerk@a2gov.org; or by written request addressed and mailed or delivered to:\n\nCity Clerk's Office\n301 E. Huron St.\nAnn Arbor, MI 48104\n\nRequests made with less than two business days' notice may not be able to be accommodated.", "url": "https://www.facebook.com/events/1245128565578436/", "name": "Allen Creek Greenway Community Meeting"}, {"source": "Facebook", "date": "2017-02-16T19:00:00-05:00", "description": "Join UMMA’s Student Engagement Council and friends for “Spectra: Voicing Our Experience,” a night of student-produced song and spoken word. Free and open to the public, be sure to stop by to enjoy the range of performances, free refreshments (including a hot cocoa bar!), and art!\n\n$cottie Pimpin'\nAlexandra Edwards\nGirlNoise\nFranny Choi\nAlyssa Holt\nSarah Baruch\nVictoria Paternoster\nJonathan Holland\nElliot Brannon\nVijita Ajit Kamath\nOlivia Johnson\nMargaret Hasspacher\nClarisse Baleja Saidi\nEmma Aboukasm", "url": "https://www.facebook.com/events/1621899271448531/", "name": "ArtsX UMMA presents: Spectra: Voicing Our Experience"}, {"source": "Facebook", "date": "2017-02-16T19:00:00-05:00", "description": "Literati is delighted to partner with our friends at the Children's Literacy Network to bring Julie Danielson to Ann Arbor for a discussion of her fantastic blog, Seven Impossible Things Before Breakfast; her favorite picture books; her own book, Wild Things!; and more!\n\nJulie Danielson holds an MS in Information Sciences and blogs about picture books at Seven Impossible Things Before Breakfast. The co-author of Wild Things! Acts of Mischief in Children’s Literature, she also writes a weekly column and conducts Q&As for Kirkus Reviews. She reviews picture books for BookPage and has written for the Horn Book and the Association for Library Services to Children. She has been a judge for the Bologna Ragazzi Awards in Italy, as well as the Society of Illustrators’ Original Art Award, and she teaches a graduate course on picture books for the University of Tennessee's Information Sciences program.  \n\nEvent date: \nThursday, February 16, 2017 - 7:00pm", "url": "https://www.facebook.com/events/355604361481372/", "name": "Julie Danielson: A Picture Book Discussion"}, {"source": "Facebook", "date": "2017-02-16T20:00:00-05:00", "description": "Dave Douglas, trumpet\nFabian Almazan, piano\nJon Irabagon, saxophone\nLinda Oh, bass\nRudy Royston, drums\n\nTrumpeter and composer Dave Douglas, one of the most prolific and influential jazz musicians of our time, has created “a body of work [that] reflects an inveterate engagement with the world, taking inspiration from literature, politics, dance and film, as well as jazz and new-music traditions,” writes Nate Chinen of The New York Times. Douglas' Quintet arrived a a creative peak with their newest album, Brazen Heart, released in 2015. The quintet has deepened their pursuit of a more polyphonic and through-composed sound, with new music by Douglas that crackles with precision and improvisational depth.\n\n$35 Assigned Rows 1-2\n$25 Assigned Rows 3-5\n$20 General Admission\n$10 Student", "url": "https://www.facebook.com/events/1858162200876300/", "name": "Dave Douglas Quintet"}]