[{"source": "Facebook", "date": "2016-07-20T18:00:00-04:00", "url": "https://www.facebook.com/events/255268508163922/", "description": "The Ann Arbor Art Center and The Guild of Artists & Artisans are hosting a very special edition of our Artists Meet & Greet Series: Art Fair Edition. \n\nPlease join us at the 117 Gallery on Wednesday, July 20 (6:00 to 9:00 pm) and enjoy an evening of networking, connecting with the Art Fair artist community while enjoying a refreshing drink and delicious appetizers.\n\nYou will also get to see our exhibition Real American, an exhibit that explores the generational, ethnographic, cultural, and anthropological ideals of what the word American means.  \n\nThis is a free event.", "name": "Art Fair Edition"}, {"source": "Facebook", "date": "2016-07-20T19:00:00-04:00", "url": "https://www.facebook.com/events/241018282944889/", "description": "This is a free event on July 20th at Arbor Brewing Company in downtown Ann Arbor. Come out to meet and greet Stephen Johnson, author of \"Detroit Beer - A History of Brewing in the Motor City.\" and special guest David Bardallis who is the author of the Ann Arbor Beer Book. This event will be a talk and Q&A on Detroit beer history. Purchase signed copies of the book while enjoying a fine malted beverage in the process. Arbor Brewing Company. This is in conjunction with the bookstore next door - Literati Bookstore", "name": "Detroit Beer Book - Author Signing - Arbor Brewing Company"}, {"source": "Facebook", "date": "2016-07-20T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-07-20T19:00:00-04:00", "url": "https://www.facebook.com/events/578381809033122/", "description": "Literati is excited to join author and owner of Motor City Brew Tours, Stephen C. Johnson, and author of Ann Arbor Beer, David Bardallis, for a discussion of Detroit Beer: A History of Brewing in the Motor City. This event will take place next door in the tap room at Arbor Brewing Company, with the bar open for business! Both books will be available for purchase.\n\nWhile in recent years Detroit’s craft beer scene has exploded with activity and innovation, brewing has a long history in the Motor City. Small brewers popped up during the mid-1800s to support nearby saloons. Many breweries survived the dry years by producing “near beer,” or non-alcoholic beer, which was quickly abandoned after Prohibition. Consolidation marked the following decades until only Stroh Brewery Company remained. Local brewing returned triumphantly with dozens of breweries opening their doors since the 1990s, including Motor City Brewing Works, Atwater Brewery and Kuhnhenn Brewing Company. \n\nStephen Johnson is the owner and founder of Motor City Brew Tours, a tour company that provides guided tours to Michigan breweries. He is also an adjunct professor of marketing at Macomb Community College and has worked in both sales and marketing for over twenty years. Stephen earned a bachelor’s in business from Western Michigan University and a master’s of business administration from Walsh College of Business. A Michigan native, Stephen loves to share his knowledge and history of Detroit the beer scene.\n\nDavid Bardallis is the author of Ann Arbor Beer: A Hoppy History of Tree Town Brewing, and a former beer columnist for the Ann Arbor News an MLive. He has written for Great Lakes Brewing News, Michigan Beer Guide, the Metro Times, and Mitten Brew, among other websites.", "name": "Stephen C. Johnson & David Bardallis"}, {"source": "Facebook", "date": "2016-07-20T19:00:00-04:00", "url": "https://www.facebook.com/events/1070299019731690/", "description": "Chigozie Obioma was born in 1986 in Akure, Nigeria. His short stories have appeared in the \"Virginia Quarterly Review \"and \"New Madrid\". He was a fall 2012 Omi Fellow at Ledig House in New York. Obioma has lived in Nigeria, Cyprus, and Turkey and currently resides in the United States, where he has completed an MFA in creative writing at the University of Michigan. \"The Fishermen \"is his first novel.\n\nTold by nine-year-old Benjamin, the youngest of four brothers, THE FISHERMEN is the Cain and Abel-esque story of a childhood in Nigeria, in the small town of Akure. When their father has to travel to a distant city for work, the brothers take advantage of his absence to skip school and go fishing. At the forbidden nearby river, they meet a madman who persuades the oldest of the boys that he is destined to be killed by one of his siblings. What happens next is an almost mythic event whose impact-both tragic and redemptive-will transcend the lives and imaginations of the book's characters and readers.", "name": "Chigozie Obioma - Author & U of M MFA Grad"}, {"source": "Facebook", "date": "2016-07-21T10:00:00-04:00", "url": "https://www.facebook.com/events/994376950635153/", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "name": "The 2016 Ann Arbor Art Fair"}, {"source": "Facebook", "date": "2016-07-21T10:00:00-04:00", "url": "https://www.facebook.com/events/487403974717996/", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "name": "State Street Art Fair"}, {"source": "Facebook", "date": "2016-07-21T18:30:00-04:00", "url": "https://www.facebook.com/events/163933877351276/", "description": "Summer's here and the time is right for nerding out with friends! The 36th edition of NNA2 will be next Thursday, July 21! Up this month: a fantastic trio of full-spectrum talks by some of Ann Arbor's greatest. Katie Prater will take us beyond The Game of Life to introduce us to the wide world of European board games. Lorraine Suzuki will explain what's going on in your brain when you're learning to ride a bike (and why that's different than memorizing state capitals!). And Danny Mayer will show us how evolution shapes our lives by impacting culture as well as our genes. So grab a drink and a couple of pals to come beat the heat with your fellow nerds!\n\nWhen: Thursday, July 21, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: Free because Ann Arbor District Library has got you covered!\n\n\nKatie Prater — The Death of The Die: The Rise of \"Euro\" board games in America\nDid you \"Pass Go and Collect $200\" on your way in to work today? If you grew up playing classic American board games as a child, you're likely familiar with never-ending games of Monopoly or squabbling over some uninhabitable territory of Australia in Risk. But board games aren't just for kids anymore! Adult nerds all over America are gaming, and loving it! We'll discuss the characteristics of classic American games, the differences between those and Eurogames, and why everyone who tries them agrees that Eurogames are much more fun! If you're interested in spending your nights and weekends breeding sheep, building temples, recycling garbage, and taking control of your own destiny, this talk will get you started!\n\nAbout Katie: When not in the neuroscience lab at UofM, Katie can often be found teaching new board games to friends, with her nose in a book, playing computer games with her husband, or enjoying the outdoors. She also loves attending GenCon, where she can check out the newest board games and show off her Kaylee Frye costume. She recently completed her PhD, during which she also co-founded a science communication organization called RELATE (www.learntoRELATE.org). Follow her on Twitter at @katieeprater.\n\n\nLorraine Suzuki — Motor learning and memory systems\nAs we learn motor skills we use two memory systems. These systems are separate and can compete with each other. My talk will go over some evidence of this interaction within the brain.\n\nAbout Lorraine:  Lorraine is a PhD candidate in the School of Kinesiology at the University of Michigan. She obtained a Bachelor's degree in Biology and a Master's degree in Genetics from the University of Western Brittany (Universit de Bretagne Occidentale. She now works on understanding how learning new motor skills affects brain networks.\n\n\n\nDanny Mayer —  Genes, Memes, and Human Beings: Why Evolution Isn't Just a “Life” Thing\n\nEvolution is a part of our everyday lives. We might talk about how someone’s beliefs have evolved. We might explain the success of an app or business as “survival of the fittest.” But rarely do we consider that evolution—in the real, scientific sense—might be able to explain things other than life. Maybe life isn’t as special as we think—after all, viruses aren’t considered by science to be alive, and yet they evolve in more or less the same way that living cells do. Enter memetics: the study of how units of cultural information (memes) evolve. Using memetics, genetics, and philosophical theories of mind and consciousness, we’ll explore how evolution has shaped the world of information that we live in, how our identities are made up of both genes and memes, and how evolution plays an enduring role in the future of our species.\n\nAbout Danny:  Danny Mayer is a web designer and entrepreneur who’s proud to have called Ann Arbor home for the past 6 years. After getting a degree in English from U of M, he shifted his focus to web design and programming, and now works at Magnetic, an ad tech company. His passion for design and development has given birth to several websites and even an app (coming soon), and late last year he co-founded Hyzer Shop, a Disc Golf retail shop, designing and developing the company’s cutting-edge online store. Alongside all this, Danny loves keeping up with his academic interests, which include literature, philosophy, and evolutionary biology. He’d like to thank his family, friends, and amazing girlfriend, all of whom inspire him to be better, and to keep learning, creating, and laughing every day. Follow him on Twitter at @damayer92.", "name": "Play It Think It Share It: Board Games Memory & Memes"}, {"source": "Facebook", "date": "2016-07-21T19:00:00-04:00", "url": "https://www.facebook.com/events/1801544236740589/", "description": "Montana author Marc Beaudin is traveling 100 highways to share his poetic travel memoir, Vagabond Song: Neo-Haibun from the Peregrine Journals.  \n\nCalled a “jazzy, freewheeling, rollicking road trip into the beating heart of the Eternal Now” by Montana Quarterly, Vagabond Song recounts 15 years of hitchhiking and road trip adventures, in prose and poetry, starting out from a small cabin in northern Michigan and ending in an even smaller cabin outside of Livingston, Montana. Inspired by Bashō’s haibun classics such as Narrow Road to the Deep North and Records of a Weather-Exposed Skeleton, the book takes the reader to the mountains of Colorado, the jungles of Central America, the woods and pubs of Britain and the stunning bleakness of the badlands and prairies of the West.\n\nWilliam Hjortsberg, author of Jubilee Hitchhiker: The Life and Times of Richard Brautigan, calls the book “a poet's song to the rewards of wandering and the joy of the highway”; Walter Kirn, author of Up in the Air, dubs it “free-range literature” and Rick Bass, author of Winter: Notes from Montana writes, “This is the kind of book parents will hide from their graduating children, but which will be found nonetheless.”\n\nOriginally from Michigan, Beaudin now lives in Livingston, Montana. He is a frequent performer of his poetry and spoken word, often collaborating with jazz and rock musicians. In its review of Vagabond Song, Arts Saginaw writes, “simply put, Beaudin is a superb writer and storyteller.”\n\nSigning to follow.", "name": "Author Event: Vagabond Song with Marc Beaudin"}, {"source": "Facebook", "date": "2016-07-21T19:30:00-04:00", "url": "https://www.facebook.com/events/1112070205500778/", "description": "Test Batch features the newest crop of improv groups in our community. Come and watch these troupes test their chops on the Pointless stage. When they are all inevitably famous, you can say \"I saw them way back when….\"\n\nThe Test Batch Line Up\n\"Gladstoned\" starring Mike Dobmeier, Cynthia D'Amour, Tony DeRosa, Ali Maredia, Hank Greenspan, Mark Dieve, and Tom Kusch\n\n\"Gateway Butters\" starring Alex Boyd, Thom Bales, Sara Cholyway, Shannon Coon, and John Kane\n\n\"All-Purpose Gesture\" starring Ashley Davis, Ramon Martinez, Sam Shattuck, Jenny Blair, and Cyrus Naheedy", "name": "Test Batch"}]