[{"description": "This class will introduce you to the Amaya Bravo 16-Thread CNC Embroidery Machine and the Design Shop software that lets you create digitalized embroidery files from an image file. This machine is great for monogramming shirts or towels, decorating bags and accessories and making patches! Use the Design Shop software and design your own. There is also a baseball cap attachment! You will learn the basic operation with an emphasis on safety. With the successful completion of this class you will be certified to use the Amaya CNC Embroidery Machine on your own.", "url": "https://www.facebook.com/events/849961008439513/", "source": "Facebook", "name": "Learn to use the Amaya CNC Embroidery Machine", "date": "2016-11-14T15:00:00-05:00"}, {"description": "Literati is pleased to welcome Chris Dombrowski in support of his memoir Body of Water: A Sage, a Seeker, and the World's Most Alluring Fish.\n\nChris Dombrowski was playing a numbers game: two passions—poetry and fly-fishing; two children, one of them in utero; and an income hovering perilously close to zero. Enter, at this particularly challenging moment, a miraculous email: can’t go, it’s all paid for, just book a flight to Miami. Thus began a journey that would lead to the Bahamas and to David Pinder, a legendary bonefishing guide. Bonefish are prized for their elusiveness and their tenacity. And no one was better at hunting them than Pinder, a Bahamian whose accuracy and patience were virtuosic. He knows what the fish think, said one fisherman, before they think it. By the time Dombrowski meets Pinder, however, he has been abandoned by the industry he helped build. With cataracts from a lifetime of staring at the water and a tiny severance package after forty years of service, he watches as the world of his beloved bonefish is degraded by tourists he himself did so much to attract. But as Pinder’s stories unfold, Dombrowski discovers a profound integrity and wisdom in the guide’s life.\n\n\"A brilliant book. Destined to be a classic.\"—Jim Harrison\n\nBorn in Michigan, Chris Dombrowski earned his MFA from the University of Montana. His publications include two collections of poems, By Cold Water (2009) and Earth Again (2013). His poetry and nonfiction have been widely published in leading journals and magazines. Also a well-established fly-fishing guide, Dombrowski lives in Missoula, Montana.", "url": "https://www.facebook.com/events/547838865414445/", "source": "Facebook", "name": "Chris Dombroski", "date": "2016-11-14T19:00:00-05:00"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/324709987912141/", "source": "Facebook", "name": "10% For Good for Community Action Network", "date": "2016-11-15T08:00:00-05:00"}, {"description": "Literati is pleased to once again partner with the University of Michigan's Sweetland Center for Writing in support of their Word2: Writer to Writer programming. Professor Philip J. Deloria is this installment's featured guest.\n\nSweetland's Word Squared: Writer to Writer series lets you hear directly from University of Michigan professors about their challenges, processes, and expectations as writers and also as readers of student writing. Each semester,Word² pairs one esteemed University professor with a Sweetland faculty member for a conversation about writing.\n\nWord² sessions are broadcast live on WCBN radio. These conversations offer students a rare glimpse into the writing that professors do outside the classroom. You can hear instructors from various disciplines describe how they handle the same challenges student writers face, from finding a thesis to managing deadlines. Professors will also discuss what they want from student writers in their courses, and will take questions put forth by students and by other members of the University community. If there's anything you've ever wanted to ask a professor about writing, Word² gives you the chance.\n\nProfessor Deloria is the Carroll Smith-Rosenberg Collegiate Professor of American Culture and History, former LSA Associate Dean of Undergraduate Education, and past Director of the Program in American Culture and the AC Native American Studies program. He has served as president of the American Studies Association, a council member of the Organization of American Historians, and a Trustee of the Smithsonian National Museum of the American Indian. He holds a joint appointment in the Department of American Culture and the Department of History.\n\nEvent date: \nTuesday, November 15, 2016 - 6:00pm", "url": "https://www.facebook.com/events/1482747538408633/", "source": "Facebook", "name": "Sweetland Writer to Writer: Philip J Deloria", "date": "2016-11-15T18:00:00-05:00"}, {"description": "We know. It's been a rough week. Come together with us on Tuesday at Sweetwaters Coffee & Tea for some much-needed poetry, community, and warm drinks. Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Readers\n\nThis month's feature: MATT HART!\n\nMatt Hart is the author of eight books of poems, including Radiant Action (H_NGM_N Books, 2016), Radiant Companion (Monster House Press, 2016), and Blue Jay Slayer, an art and poetry collaboration with artist Ken Henson (Aurore Press, 2015). Hart’s poems, reviews, and essays have appeared or are forthcoming in numerous print and online journals, including The Academy of American Poets online, Big Bell, Cincinnati Review, Coldfront, Columbia Poetry Review, H_NGM_N, Harvard Review, Jam Tarts Magazine, jubilat, Kenyon Review online, Lungfull!, and POETRY, among others. His awards include a Pushcart Prize, a 2013 individual artist grant from The Shifting Foundation, and fellowships from both the Bread Loaf Writers' Conference and the Warren Wilson College MFA Program for Writers. A co-founder and the editor-in-chief of Forklift, Ohio: A Journal of Poetry, Cooking & Light Industrial Safety, he lives in Cincinnati where he is Associate Professor in Creative Writing and the Chair of Liberal Arts at the Art Academy of Cincinnati. He plays guitar and shouts in the bands TRAVEL and THE LOUDEST SOUNDER.\n\n\nNext month: CASEY ROCHETEAU!", "url": "https://www.facebook.com/events/214882622272514/", "source": "Facebook", "name": "Skazat! Poetry Series featuring Matt Hart", "date": "2016-11-15T19:00:00-05:00"}, {"description": "All week, all Garden of Life products are 35% off! That includes plant-based protein supplements, vitamins, and even special products just for kids. Stop in to chat with our friendly and knowledgable Natural Living team, and stock up on wellness!", "url": "https://www.facebook.com/events/144098819397112/", "source": "Facebook", "name": "35% Off Garden of Life", "date": "2016-11-16T08:00:00-05:00"}, {"description": "Another thrilling edition of the Vault of Midnight Game Nights is imminent!\n\nOn Wednesday, November 16th, gamers young and old, green and consummate will gather in the basement of Ann Arbor's local Shinola, conveniently located just across the street from Vault of Midnight Ann Arbor. \n\nFor a mere $10, you may secure your spot and join in the raucous game-playing and general merriment. Tickets are available at Vault of Midnight Ann Arbor and will not only grant you entry to this event, but will also serve as a voucher for one Shinola Coffee beverage. AND THAT'S SOMEHOW NOT ALL: your ticket ALSO acts as a 10% off one game coupon! What a busy little ticket!\n\nTickets may be purchased in person, or over the phone. Space is limited, so don't delay! Make sure one of the 30 highly-exclusive and much coveted spots are yours. \n\nOur Game Clerics will be attending to help out with everything, from teaching some of our favorite games, to settling entrenched score disputes. Whether you're new to gaming or are a seasoned cardboard-connoisseur, join us, join us.", "url": "https://www.facebook.com/events/154492655019344/", "source": "Facebook", "name": "Ann Arbor Game Night", "date": "2016-11-16T18:00:00-05:00"}, {"description": "Free and open to the public. Seating is first come, first served.\nColm Tóibín is an Irish novelist, short story writer, essayist, playwright, journalist, critic, and poet. His seventh novel, Brooklyn, was recently adapted into a major motion picture, and his most recent novel, Nora Webster, received the Hawthornden Prize in 2015. Tóibín has been shortlisted for the Booker Prize on three different occasions, and been awarded the Los Angeles Times Novel of the Year, the Lamda Literary Award, the Costa Novel Award, and the Irish PEN Award, among many others. A celebrated essayist as well, Tóibín’s latest nonfiction book, On Elizabeth Bishop, offers a deeply personal introduction to the work and life of the American poet, who was one of his most important literary influences.", "url": "https://www.facebook.com/events/952333384898221/", "source": "Facebook", "name": "Zell Visiting Writers Series: Colm Tóibín", "date": "2016-11-17T17:30:00-05:00"}, {"description": "Yoga in the Gulo Room is back! Earn your beer with Robin Schultz-Purves, owner of Yoga Rising. $20 gets you one hour of all-levels vinyasa yoga followed by a pint of your choice at the end of class. Bring your friends and a mat -- register here! https://www.universe.com/wsbcpintsandposes", "url": "https://www.facebook.com/events/718292594988796/", "source": "Facebook", "name": "Pints and Poses", "date": "2016-11-17T18:00:00-05:00"}, {"description": "Gobble gobble! Feast your eyes on the lineup for NNA2 #40, featuring a hearty helping of some of the best folks from Ann Arbor's food scene. Joel Panozzo of The Lunch Room guides us through his approach to veganism, including his take on tofu. Ann Arbor Distilling Company's Phil Attee gives us a glimpse into how booze is born, and walks us through a day in the life of a distiller. Last, but certainly not least, Mike White from Zingerman's slices us off a hunk of some pungent, delectable cheese knowledge. So put on your elastic-waist pants and turkey-trot your way over to Live — and raise a glass with your fellow nerds!\n\nWhen: Thursday, Npvember 17, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER, thanks to your friendly neighborhood AADL!", "url": "https://www.facebook.com/events/1794382900803666/", "source": "Facebook", "name": "Nerd Nite Treats: A Cornucopia of Cheese, Cocktails, and Vegan E", "date": "2016-11-17T18:30:00-05:00"}]