[{"description": "Featuring the newly released Zingerman’s Guide to Good Leading, Part 4; A Lapsed Anarchist’s Approach to the Power of Beliefs in Business (a copy of the book is included in the price of each seat.)\n\nAlthough most of us don’t realize it, our beliefs have a major impact on how things go in our lives. What we believe may or may not be true, but unknowingly most of us will behave in ways that reinforce our beliefs anyways. At this breakfast, Ari Weinzweig, Co-Founder and CEO of Zingerman’s Community of Businesses, will take a look at how the impact of those beliefs likely play out in our day to day experiences in the workplace, and how we and our workplaces are impacted by those beliefs. Whether we accept it or not, what we believe about ourselves, about our organization, our co-workers, our boss, the work that we do and our ability to do it will significantly alter the outcomes we are seeking to achieve. And how, by becoming more mindful of our beliefs, we can effectively backtrack—by altering our beliefs, we change the way we see our work and the world and then, in turn, significantly alter the outcomes we get from our efforts.\n\nIt is our belief you will leave breakfast with a full stomach and a full mind - with new insights, tips and techniques into how you can become more mindful of your own beliefs and how you can positively affect your surroundings by changing your beliefs.\n\nBreakfast is served!\n- Fresh Fruit Platter\n- Zingerman’s Bakehouse Coffee Cakes\n- Corned Beef Hash\n- Applewood Smoked Bacon\n- Zingerman’s Coffee Co. Roadhouse Joe and Detroit St. Decaf", "url": "https://www.facebook.com/events/1778863865683283/", "source": "Facebook", "date": "2016-08-12T08:00:00-04:00", "name": "Beliefs, Business and Breakfast"}, {"description": "August 9–October 30, 2016\nCorridor Gallery\n\nArtist and poet Ann Holmes first encountered Japanese folk ceramics while living in Tokyo in the late 1960s. Fascinated by the simple aesthetic, the craftsmanship, and the makers’ unassuming personalities and ways of life, Holmes visited many kiln towns to photograph and interview the artists and collect ceramic wares of various shapes and techniques. She donated a significant portion of her collection to UMMA in 2013.\n\nRichly introduced in this presentation are works by ceramic artists emerging in the late 1960s and the early 1970s in the town of Mashiko, two hours north of Tokyo by train. Mashiko became an international mecca of folk ceramics after Hamada Shōji (1894–1978), a major figure of Japan’s Folk Craft (Mingei) Movement, set up his studio there in 1930. Hamada’s idea of ceramic making for a new age, which combined the aesthetic of folk ceramics and the modern concept of the studio artist, attracted many younger artists of unconventional backgrounds, including women.", "url": "https://www.facebook.com/events/170729440003602/", "source": "Facebook", "date": "2016-08-12T11:00:00-04:00", "name": "In Focus: Modern Japanese Folk Ceramics"}, {"description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/626712344171582/", "source": "Facebook", "date": "2016-08-12T15:00:00-04:00", "name": "Drink & Draw / Imbibe & Inscribe"}, {"description": "Come join us for a reunion jazz benefit concert sponsored by The Morning Owl Cafe in Milan, MI.  Nick Sandhu (drums), Matt Epperson (bass), Noah Luntzlara (piano), Paul Finkbeiner (trumpet) and firends!  $10 suggested donation.  Check out the Cafe's jazzed up menu here: http://www.themorningowl.com/", "url": "https://www.facebook.com/events/1628254700820045/", "source": "Facebook", "date": "2016-08-12T18:00:00-04:00", "name": "Jazz at the Morning Owl Cafe"}, {"description": "A little post-pop... a bit of post-core... what more could anyone ask for?\n\nEARLY show to rev up the eve. Female fronted Naked Naps on tour from North Carolina join Welman for some fire and ice\n\n7:30PM | 18 and up welcome | $4 suggested donation\n\nClub Above\n215 N Main Street\nDowntown Ann Arbor\n[above the Heidelberg Restaurant]", "url": "https://www.facebook.com/events/1783512835200717/", "source": "Facebook", "date": "2016-08-12T19:30:00-04:00", "name": "Welman \\\\ Naked Naps (on tour from Raleigh, NC) EARLY SHOW"}, {"description": "“Art is made in the freedom of the imagination with no rules”\n\n\"bobrauschenbergamerica\" is a fast paced non-traditional slice of life story revolving around relationships, explored through wacky images, poetry, jokes, dance, and more, providing a wild look at American culture. \n\nWritten by Charles L. Mee. Featuring: Danielle Clevenger, Elizabeth Dieterich, Rick Eva, Alanna Elling, Mark Isler, Kelsea Kerkes, Josie Lapczynski, Sara Long, Jeffery Stringer, and James Walrod. \n\nFriday, August 12 @ 8 pm \nSaturday, August 13 @ 8 pm\nSunday, August 14 @ 7 pm", "url": "https://www.facebook.com/events/494075117454653/", "source": "Facebook", "date": "2016-08-12T20:00:00-04:00", "name": "Bobrauschenbergamerica"}, {"description": "IRL Music & Hebinomichi Present: \nURL2IRL - VIBE\nFriday, August 12th @ Club Above \n\nClub Above \n215 N Main St, Ann Arbor, MI 48104\n2nd Floor\n\nJonah Baseball\nhttps://soundcloud.com/jonah-baseball\n\nThe A2-based producer Jonah Baseball exudes an aura of confidence in his music, wrapping together a combination of future bass, experimental electronic, jazz, and sample-based funk. Opening for electronic pioneers like Lido, Wave Racer, SNBRN, and Alison Wonderland, Jonah is a perfect example of a musician well-developed in his craft and a diamond in the rough for those in the music industry who discover his music. Grand slam, baby. \n\nAhh-ooh (Hebinomichi)\nhttps://soundcloud.com/ahh-ooh\n\nBased out of Detroit, Aah-Ooh continues to wow his listeners with a fusion of future bass and jamtronica. His live set is impressive as well, bringing together live elements into the equation in addition to hot synths and vibing basslines. He is also one of the co-founders of global music collective, Hebinomichi. \n\nBirocratic (Chillhop Records) [MI DEBUT] \nhttps://soundcloud.com/birocratic\n\nFor the beat-chef honcho and chill-hop producer from New Jersey, Birocratic excels at presenting his collection of elegantly-made beats that string together elements of hip-hop, jazz, funk, glitch-hop and sample-based R&B. Similar to the likes of Flamingosis and Tom Misch, his live set demonstrates a special component: building beats and expanding on their composition in the moment. His work has been featured by Buzzfeed as well as Dancing Astronaut and The Music Ninja. He also works at Chillhop Music and co-owns a screen-printing company. \n\nSteelix\nhttps://soundcloud.com/s7eelix\n\nSPECIAL GUEST: \nAceMyth\nhttps://soundcloud.com/acemyth\n\nTICKET LINK: http://bit.ly/url2irlvibe\n$7 ADV, $10 DOOR\n18+ ADMISSION // 21+ TO DRINK \nDrink Specials Galore\n\nIRL Music promotes and provides a platform for URL artists to showcase their artistry to a broader audience. We are curators of music influenced by Internet culture and tastemakers of digital aesthetic.\n\nConnect with IRL Music:\nwww.irlmusic.org\nSoundcloud: https://soundcloud.com/in-real-life-music\nTwitter: @irl_music\nInstagram: IRL Music\n\nHebinomichi is a forward-thinking worldwide collective of musicians and artists co-founded by StéLouse and Ahh-ooh.\n\nConnect with Hebinomichi: \nwww.hebinomichi.com/\nSoundcloud: soundcloud.com/hebinomichi\nTwitter: twitter.com/Hebinomichi", "url": "https://www.facebook.com/events/1004769426302977/", "source": "Facebook", "date": "2016-08-12T21:00:00-04:00", "name": "IRL Music x Hebinomichi Present: Jonah Baseball, Ahh Ooh, Birocratic + Special Guests"}, {"description": "Please help us finish the fantastic addition and re-route that has been added to Torn Shirt. We will have two back-to-back trail days on Saturday and Sunday, from 9am-1pm both days.  You'll be helping us add the finishing touches to this new section. Tools will be provided.\n\nWe will meet at the trail head at Bishop Lake  at 9:00 and then split up into groups.", "url": "https://www.facebook.com/events/636392859875157/", "source": "Facebook", "date": "2016-08-13T09:00:00-04:00", "name": "Bright Rec/Torn Shirt Trail Days"}, {"description": "This park has come a long way from its past as a gravel quarry. Now bicyclists, dog owners, soccer players and hikers all use it. Volunteers are needed to hand-pull invasive weeds where they are invading open meadows. There are several uncommon species of butterflies in this park that use these open spaces. Please meet at the entrance on Dhu Varren Road, just east of Pontiac Trail. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/280716698937457/", "source": "Facebook", "date": "2016-08-13T09:00:00-04:00", "name": "Olson Park Stewardship Workday"}, {"description": "Join the Humane Society of Huron Valley and SW  in raising funds for our furry friends.\n\nGet a drink & and we’ll provide a treat for your pup! 30% of drink proceeds go to HSHV.\n\nAlso, meet great dogs looking for their forever homes.", "url": "https://www.facebook.com/events/1729212003999250/", "source": "Facebook", "date": "2016-08-13T11:00:00-04:00", "name": "Paws for a Cause with the Huron Valley Humane Society"}]