[{"source": "Facebook", "date": "2017-02-21T11:00:00-05:00", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration", "url": "https://www.facebook.com/events/1724899501156129/"}, {"source": "Facebook", "date": "2017-02-21T17:00:00-05:00", "description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "name": "Sunseed Farm CSA Pickup", "url": "https://www.facebook.com/events/731926473638010/"}, {"source": "Facebook", "date": "2017-02-21T19:00:00-05:00", "description": "Presented by James Patterson's new children's imprint, this gleefully illustrated space adventure is a laugh on every page. That's a lot of laughs Kelvin Klosmo isn't just the new kid at school - he's the new kid in the galaxy Welcome to Sci-Fi Junior High: an inter-galactic space station with students of all shapes, sizes, smells, and... slime content. As the son of Earth's two most famous geniuses, Kelvin isn't just the smartest kid in the world....he's the smartest kid in the UNIVERSE. At least, that's what everybody at Sci-Fi Junior High thinks. \n\nSo, maybe Kelvin lied a little about being a genius to fit in. And maybe a mad scientist is about to take over the universe unless Kelvin can stop him. Maybe everyone is doomed. Well, at least Kelvin won't have to worry about math homework anymore.\n \nSci-Fi Junior High is an out-of-this-world story about friendship, accepting our differences, and the fight against evil... bunnies. Yes, evil bunnies - don't ask.", "name": "Author Scott Seegert & Illustrator John Martin", "url": "https://www.facebook.com/events/1361165493904597/"}, {"source": "Facebook", "date": "2017-02-22T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network", "url": "https://www.facebook.com/events/280243392370950/"}, {"source": "Facebook", "date": "2017-02-22T19:00:00-05:00", "description": "Literati is pleased to welcome Shira Erlichman and Angel Nafis for the latest installment of Poetry at Literati.\n\nBorn in Israel, living in Brooklyn, SHIRA is a songwriter, producer, writer & visual artist. She has shared stages with CocoRosie, Mirah, TuNe-YaRdS & Andrea Gibson. A three time Pushcart Prize nominee, her work has been published in PBS Poetry, Buzzfeed Reader, The Huffington Post, BUST Magazine, Winter Tangerine, The Massachusetts Review, as well as alongside Patricia Smith in Bull-Gouging the Matador, in the anthology Courage: Daring Poems for Gutsy Girls and the Lambda award winning LGBTQ anthology Glitter and Grit. She received her BA from Hampshire College, a Millay Colony Fellowship & a James Merrill Fellowship from the Vermont Studio Center.\n\nAngel Nafis is the author of BlackGirl Mansion (Red Beard Press/ New School Poetics, 2012). She earned her BA at Hunter College and is an MFA candidate in poetry at Warren Wilson College. Her work has appeared in The Rattling Wall, The BreakBeat Poets Anthology, MUZZLE Magazine, The Rumpus, Poetry magazine, and elsewhere. Nafis is a Cave Canem fellow, the recipient of a Millay Colony residency, an Urban Word NYC mentor, and the founder and curator of the Greenlight Bookstore Poetry Salon. In 2011 she represented the LouderArts poetry project at both the Women of the World Poetry Slam and the National Poetry Slam. With poet Morgan Parker, she runs The Other Black Girl Collective, an internationally touring Black Feminist poetry duo. Facilitating writing workshops and reading poems globally, she lives in Brooklyn with artist, writer, and musician Shira Erlichman. In 2016, Nafis was a recipient of the Ruth Lilly and Dorothy Sargent Rosenberg Poetry Fellowship from the Poetry Foundation.\n\nEvent date: \nWednesday, February 22, 2017 - 7:00pm", "name": "Poetry at Literati: Angel Nafis & Shira Erlichman", "url": "https://www.facebook.com/events/1844129809188766/"}, {"source": "Facebook", "date": "2017-02-22T19:00:00-05:00", "description": "Drummunity Circle with Lori Fithian • Feb. 22, Mar. 21, Apr. 20; 7 p.m. in the Crazy Wisdom Community Room • Get your hands on a drum and add your sound and spirit to the community groove. All are welcome to join the circle. No experience necessary. Drums available. Free. Call 426-7818; lorifithian@mac.com or drummunity.com.", "name": "Drummunity Circle with Lori Fithian", "url": "https://www.facebook.com/events/1738168726444077/"}, {"source": "Facebook", "date": "2017-02-23T12:00:00-05:00", "description": "Become a part of NAP’s Volunteer Burn Crew! This is the required training session for anyone interested in assisting with NAP’s controlled burns. Meet at Leslie Science and Nature Center’s Nature House. Burns typically take place Monday through Friday between noon and 7 p.m. Registration is required by February 21, as enrollment is limited. Call 734.794.6627 or email NAP@a2gov.org to register or for more information", "name": "Volunteer Burn Crew Training", "url": "https://www.facebook.com/events/383615658683165/"}, {"source": "Facebook", "date": "2017-02-23T19:00:00-05:00", "description": "Literati is pleased to welcome Eleni Sikelianos in support of her most recent work, Make Yourself Happy.\n\nUsing text and images, moving spikily across the page and across ideas in ever-expanding loops, Make Yourself Happy is devoted to one of the oldest and most important human questions: how to live. Humanity, happiness, and the survival of the biosphere spin each section forward, species are wiped out, yet the poem endures. \n\n“In Make Yourself Happy, Eleni Sikelianos evinces a neuro-psychological state counter to the miswrought biology that has haunted the Occident since the dawn of Roman times. These poems open the neurology to its whole participation in the psycho-physical field and are not unlike the seminal amplification of indigenous culture, where the language of the body simultaneously circulates with living metastates. These poems organically form as environmental respiration that only the poet can approach in the latter days of this techno-hypercritical epoch.” —Will Alexander\n\n“This poem is addressed to you. You want to be happy, don’t you? In deceptively simple sentences, it tells you how to ‘make yourself happy.’ You might aspirate on honey, for instance. Play connect the dots and the extinct animals pop out. Did you kill them all to make yourself happy? Here you will bask in the syllabic glow of the ‘shirred / aggregates / mineral iridium / irresidue.’ This book is your invitation to the post-human pool party of the future.” —Rae Armantrout\n\n“With her native Greek wisdom and her American exuberance, Eleni takes us into the different layers which make our daily lives, perceptions, thoughts . . . as they take form, and thanks to her become an initiatique, even archeological, journey. Besides the pleasure we feel, we see here a moral endeavor, an invitation to make ourselves happy. Her journey finds its energy in her perfect ear for language and immense generosity of heart. Her openness lets in the sinuosities and cracks of what we may well end up calling ‘being,’ in her great project of telling us, in these worst moments of actual history, to be (urgently) happy because we are . . . happy. And let me share at least one epiphany: ‘to graze in / winter in snow- / free meadows.’” —Etel Adnan\n\nEleni Sikelianos is the author of six books of poetry, most recently The Loving Detail of the Living and the Dead and The California Poem, which was a Barnes & Noble Best of the Year, as well as hybrid memoirs, The Book of Jon and You Animal Machine (The Golden Greek). Sikelianos teaches in the Creative Writing Program at the University of Denver. A California native, longtime New Yorker, and world traveler, she now lives in Boulder with her husband, the novelist Laird Hunt, and their daughter, Eva Grace.\n\nEvent date: \nThursday, February 23, 2017 - 7:00pm", "name": "Poetry at Literati: Eleni Sikelianos", "url": "https://www.facebook.com/events/1997490890478309/"}, {"source": "Facebook", "date": "2017-02-23T19:30:00-05:00", "description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "name": "Sing Happy!", "url": "https://www.facebook.com/events/254338798323472/"}, {"source": "Facebook", "date": "2017-02-23T19:30:00-05:00", "description": "Test Batch features the newest crop of improv groups in our community. Come and watch these troupes test their chops on the Pointless stage. When they are all inevitably famous, you can say \"I saw them way back when....\"\n​\nThis month's line up:\n- &mpersand\n- The Shadow League\n- Mountain Dude\n- Low Estrogen\n- The Travel Band", "name": "Test Batch - February", "url": "https://www.facebook.com/events/1637034633267865/"}]