[{"description": "The City of Ann Arbor invites the public to attend and participate in the next round of public meetings in the Ann Arbor Station Environmental Review project to discuss and comment on the Alternatives Analysis Phase II report. \n\nPublic Meeting \nMonday, September 26 \n4:00 p.m.-5:30 p.m., 6:30 p.m.-8:30 p.m. (presentations at 4:30 p.m. and 7:00 p.m.)\nLower level multipurpose room, Downtown Ann Arbor District Library, 343 S. 5th Ave., \nAnn Arbor\n\nThis Alternatives Analysis is the result of technical and environmental analysis compliant with the National Environmental Policy Act (NEPA) and public input received since February 2014. The Ann Arbor Station planning effort is led by the City of Ann Arbor with the Michigan Department of Transportation (MDOT) and the Federal Railroad Administration (FRA). The Phase II report, along with additional project information and documents, is available online at www.a2gov.org/annarborstation.", "date": "2016-09-26T16:00:00-04:00", "name": "Ann Arbor Station Phase II Public Meeting", "source": "Facebook", "url": "https://www.facebook.com/events/1288029951210111/"}, {"description": "The City of Ann Arbor invites the public to attend and participate in the next round of public meetings in the Ann Arbor Station Environmental Review project to discuss and comment on the Alternatives Analysis Phase II report. \n\nPublic Meeting \nMonday, September 26 \n4:00 p.m.-5:30 p.m., 6:30 p.m.-8:30 p.m. (presentations at 4:30 p.m. and 7:00 p.m.)\nLower level multipurpose room, Downtown Ann Arbor District Library, 343 S. 5th Ave., \nAnn Arbor\n\nThis Alternatives Analysis is the result of technical and environmental analysis compliant with the National Environmental Policy Act (NEPA) and public input received since February 2014. The Ann Arbor Station planning effort is led by the City of Ann Arbor with the Michigan Department of Transportation (MDOT) and the Federal Railroad Administration (FRA). The Phase II report, along with additional project information and documents, is available online at www.a2gov.org/annarborstation.", "date": "2016-09-26T18:30:00-04:00", "name": "Ann Arbor Station Phase II Public Meeting", "source": "Facebook", "url": "https://www.facebook.com/events/1066706776749534/"}, {"description": "Literati is delighted to welcome Margaret Lazarus Dean and Christopher Hebert back to Ann Arbor, in celebration of their recent (staff-favorite!) works. \n\nChristopher Hebert's Angels of Detroit draws us into the lives and voices of multiple characters struggling to define their futures in this desolate landscape: a scrappy group of activists trying to save the city with placards and protests; a curious child who knows the blighted city as her own personal playground; an elderly great-grandmother eking out a community garden in an oil-soaked patch of dirt; a carpenter with an explosive idea of how to give the city a new start; a confused idealist who has stumbled into debt to a human trafficker; a weary corporate executive who believes she is doing right by the city she remembers at its prime—each of these characters’ desires are as distinct as their voices, and their visions for a better city are on a collision course. In this propulsive, masterfully plotted epic, an urban wasteland whose history is plagued with riots and unrest is reimagined as an ambiguous new frontier—a site of tenacity, possibility, even hope. Driven by struggle and suspense, and shot through with a startling empathy, Christopher Hebert’s magnificent second novel unspools an American story for our time.\n\n“A humbler, more endearing bunch of rainbow-hued misfits never fumbled their broken-hearted way towards revolution than those we meet in Christopher Hebert’s Angels of Detroit–truly a novel of our moment, both in the way it stares unsentimentally at the real trouble we are in–a world of poisoned children and cities in ruins–and in the deep and detailed empathy it shows for characters of every class and provenance. Hebert gets Detroit right, in this beautifully made book: his careful drawing of its physical catastrophe locates the city at the exact boundary between gritty-real and surreal, between last hope and post-apocalyptic nightmare.”—Jaimy Gordon, author of the National Book Award-winning Lord of Misrule\n\nChristopher Hebert is the author of the novels Angels of Detroit and The Boiling Season, winner of the 2013 Friends of American Writers award. He is also co-editor of Stories of Nation: Fictions, Politics, and the American Experience (forthcoming from UT Press). His short fiction and nonfiction have appeared in such publications as FiveChapters, Cimarron Review, Narrative, Interview, and the Millions. He is a graduate of the University of Michigan and is editor-at-large for the University of Michigan Press. Currently he lives in Knoxville, TN, where he is Assistant Professor of English at the University of Tennessee.\n\n*\n\nMargaret Lazarus Dean's Leaving Orbit: Notes from the Last Days of American Spaceflight won the Graywolf Press Nonfiction Prize. In the 1960s, humans took their first steps away from the earth, and for a time our possibilities in space seemed endless. But in a period of austerity and in the wake of high-profile disasters like Challenger, that dream has ended. In early 2011, Margaret Lazarus Dean traveled to Cape Canaveral for NASA’s last three space shuttle launches in order to bear witness to the end of an era. With Dean as our guide to Florida’s Space Coast and to the history of NASA, Leaving Orbit takes the measure of what American spaceflight has achieved while reckoning with its earlier witnesses like Norman Mailer, Tom Wolfe, and Oriana Fallaci. Along the way Dean meets NASA workers, astronauts, and space fans, gathering possible answers to the question: what does it mean that a spacefaring nation won’t be going to space anymore?\n\n“Margaret Lazarus Dean is that rarest of hybrids, the dearest of hyphenates. She brings to science such exquisite sentence making, to futurism the sound anchorage of the past, to space travel the tidings of personal journey. Journalist, essayist, memoirist and storyteller—her prized text shows Americans, each and every, how we came to be the ones we are. And where we’re going. This is rocket science, reliable witness, replete with poetry.”—Thomas Lynch, author of The Undertaking\n\nMargaret Lazarus Dean received a BA in anthropology from Wellesley College and an MFA from the University of Michigan. She is the author of the novel The Time It Takes to Fall and the recipient of fellowships from the NEA and the Tennessee Arts Commission. She is an associate professor of English at the University of Tennessee.", "date": "2016-09-26T19:00:00-04:00", "name": "Margaret Lazarus Dean & Christopher Hebert", "source": "Facebook", "url": "https://www.facebook.com/events/1566449190330413/"}, {"description": "Join us and watch Hillary Clinton take on and Republican Donald Trump (Drumpf) in the first Presidential debate of 2016! \n\nDebate is scheduled to run from 9-10:30 p.m. \nEvent is free of charge and open to the public. Suggested donations always accepted. \n\nAppetizers being served include: chips & salsa, hummus, stuffed mushrooms, vegan spring rolls, chicken wings kalbi with siracha aoli, meatballs, pretzel spears, and thai chicken satays!\n\nSponsors: Arbor Brewing Company, Washtenaw County Democratic Party, Ann Arbor Democratic Party.", "date": "2016-09-26T20:00:00-04:00", "name": "Presidential Debate Watch Party!", "source": "Facebook", "url": "https://www.facebook.com/events/928079850670349/"}, {"description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nTike Anderson Music\nTike Anderson’s songs are genuine testaments to life on the road, life at home, life in the center of the fire and life in the Motor City. He is an accomplished guitar player with a voice that sounds trained but feels honest. Tike’s songwriting blends road worn soul with the roots rock grit of the motor city and a hint of the easy intellectual earth tones of Ann Arbor.\n\nNever a cover\nAlways a good time", "date": "2016-09-27T19:00:00-04:00", "name": "Acoustic Tuesdays: Tike Anderson", "source": "Facebook", "url": "https://www.facebook.com/events/325821474423026/"}, {"description": "Tue. September 27 | 8pm | 18+ | $15 adv./ $17 day of\n\nann arbor's 107one presents: Anderson East\n\nAnderson East learned to sing and play guitar at 11 years old. He is the grandson of a southern Baptist preacher, while his mother played piano in the church. After spending much of his time touring and engineering records, he was discovered by Dave Cobb at Nashville's Bluebird Café.\n\nHis debut album on Low Country Sound / Elektra, entitled 'Delilah,' was released on July 10th, 2015. Before the release East started touring nationally in January 2015 as direct support for Sturgill Simpson. In addition to his own sold-out headline shows, he has toured with Brandi Carlile, The Lone Bellow, Jason Isbell, and John Butler Trio. \"Satisfy Me\" was the first single released off the record. It instantly went top 10 viral on Spotify and received regular radio airplay. NPR music called 'Delilah' an \"eclectic, fully formed debut album.\" Daytrotter wrote, \"It's one of those 10-song records that's damned near perfect, traveling through the old, smoky bars of older days and down the twisted back roads of love.\" On July 15th, 2015 East made his television debut on \"Late Night with Seth Meyers,\" and also appeared on \"CBS This Morning Saturday\" in support of his album.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/724", "date": "2016-09-27T20:00:00-04:00", "name": "Anderson East - Devil in Me Tour 9/27/16 at Blind Pig - Ann Arbor", "source": "Facebook", "url": "https://www.facebook.com/events/1190479254318296/"}, {"description": "Hailed by the Boston Globe as “elegant and exacting,” Hub New Music is a mixed quartet crafting new experiences in 21st century sound. With a unique instrumentation of two winds and two strings, Hub explores a richly diverse palate of newly commissioned and rarely performed works for its non-standard combination. \n\nMichael Avitable, flute\nDavid Dziardziel, clarinet\nOrin Laursen, violin\nAllison Drenkow, cello\n\nProgram:\nJudd Greenstein, \"at the end of a really great day\"\nNico Muhly, \"I know where everything is\"\nKirsten Volness, New Work for Hub New Music\nDaniel Wohl, \"Microfluctuations in Plainchant\"\nMason Bates, \"The Life of Birds\"\n\nThis performance is presented in partnership with ÆPEX Contemporary Performance. Visit aepexcontemporary.org, or follow ÆPEX on Twitter @aepexcp, to learn more about ÆPEX Contemporary Performance's debut season and plans for the future.\n\nTickets:\n$25 Assigned Seats in Rows 1-2\n$15 Assigned Seats in Rows 3-5\n$10 General Admission\n$5 Student General Admission", "date": "2016-09-27T20:00:00-04:00", "name": "Hub New Music: Pushing Boundaries", "source": "Facebook", "url": "https://www.facebook.com/events/183136952114468/"}, {"description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "date": "2016-09-28T12:00:00-04:00", "name": "POP-X", "source": "Facebook", "url": "https://www.facebook.com/events/585713071616738/"}, {"description": "Literati is pleased to welcome Chuck Collins in support of Born on Third Base: A One Percenter Makes the Case for Tackling Inequality, Bringing Wealth Home, and Committing to the Common Good.\n\nAs inequality grabs headlines, steals the show in presidential debates, and drives deep divides between the haves and have nots in America, class war brews. On one side, the wealthy wield power and advantage, wittingly or not, to keep the system operating in their favor—all while retreating into enclaves that separate them further and further from the poor and working class. On the other side, those who find it increasingly difficult to keep up or get ahead lash out—waging a rhetorical war against the rich and letting anger and resentment, however justifiable, keep us from seeing new potential solutions.\n\nBut can we suspend both class wars long enough to consider a new way forward? Is it really good for anyone that most of society’s wealth is pooling at the very top of the wealth ladder? Does anyone, including the one percent, really want to live in a society plagued by economic apartheid? It is time to think differently, says longtime inequality expert and activist Chuck Collins. Born into the one percent, Collins gave away his inheritance at 26 and spent the next three decades mobilizing against inequality. He uses his perspective from both sides of the divide to deliver a new narrative. Collins calls for a ceasefire and invites the wealthy to come back home, investing themselves and their wealth in struggling communities.  And he asks the non-wealthy to build alliances with the one percent and others at the top of the wealth ladder.\n\nStories told along the way explore the roots of advantage, show how taxpayers subsidize the wealthy, and reveal how charity, used incorrectly, can actually reinforce extreme inequality. Readers meet pioneers who are crossing the divide to work together in new ways, including residents in the author’s own Boston-area neighborhood who have launched some of the most interesting community transition efforts in the nation. In the end, Collins’s national and local solutions not only challenge inequality but also respond to climate change and offer an unexpected, fresh take on one of our most intransigent problems.\n\n“I have never read a story remotely like the one Chuck Collins has to tell. Born to the one percent, in circumstances few of us can imagine, he grew an outsized conscience and gave up his inherited wealth for a life of fighting the vicious inequality that is destroying our country. Somewhere along the way, he came to understand that the rich can be part of the solution instead of the problem and started organizing them to join in the struggle for a fair economy. The result is an electrifying challenge to the affluent as well as the one percent. ‘Come out of your gated communities and gated hearts,’ he writes, because outside lies the warmth of human solidarity.”--Barbara Ehrenreich, author of Nickel and Dimed\n\nChuck Collins is a researcher, campaigner, storyteller, and writer based at the Institute for Policy Studies where he co-edits Inequality.org. He has written extensively on wealth inequality in previous books like 99 to 1, Wealth and Our Commonwealth (with Bill Gates Sr.), and Economic Apartheid in America as well as in The Nation, The American Prospect, and numerous other magazines and news outlets. Collins grew up in the 1 percent as the great grandson of meatpacker Oscar Mayer, but at age 26 he gave away his inheritance. He has been working to reduce inequality and strengthen communities since 1982 and in the process has cofounded numerous initiatives, including Wealth for the Common Good (now merged with the Patriotic Millionaires), United for a Fair Economy, and Divest-Invest. He is also a leader in the transition movement, and a co-founder of the Jamaica Plain New Economy Transition and the Jamaica Plain Forum, both in the Boston-area community in which he lives.", "date": "2016-09-28T19:00:00-04:00", "name": "Chuck Collins", "source": "Facebook", "url": "https://www.facebook.com/events/179229159178583/"}, {"description": "We're bringing the Painting With Dreams tour to Necto Nightclub in Ann Arbor!\n\nNew album, a brand new stage production, and most important, all of our Tritonians of Michigan under one roof!!!!\n\nMore info and tickets - http://paintingwithdreams.com/\n\nSee you this fall!", "date": "2016-09-28T21:00:00-04:00", "name": "Tritonal: Painting With Dreams - Ann Arbor", "source": "Facebook", "url": "https://www.facebook.com/events/1731098520471774/"}]