[{"description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "date": "2016-05-28T10:30:00-04:00", "name": "Little Peeps PlayGround - \"Five Senses\"", "source": "Facebook", "url": "https://www.facebook.com/events/1719473614960941/"}, {"description": "We're grilling out! Our footlong Made In-House brats or sausage with baked in house buns and side of our coleslaw, just $5 a plate- now that's a sausage party!", "date": "2016-05-28T11:00:00-04:00", "name": "$5 Footlong", "source": "Facebook", "url": "https://www.facebook.com/events/1708191829422279/"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Dianasty\" \n\nGroup 2: \"Frank & Dale\" \n\nGroup 3: \"The League of Pointless Improvisers\" starring Arthur Brannon III, Chris Moody, Julia Schroeder, Moni Jones, and James Quesada", "date": "2016-05-28T20:00:00-04:00", "name": "Pointless Improv with Dianasty and Frank & Dale", "source": "Facebook", "url": "https://www.facebook.com/events/1710692055846356/"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Frank & Dale\" \n\nGroup 2: \"Dianasty\" \n\nGroup 3: \"The League of Pointless Improvisers\" starring Arthur Brannon III, Chris Moody, Julia Schroeder, Moni Jones, and James Quesada", "date": "2016-05-28T22:00:00-04:00", "name": "Pointless Improv with Frank & Dale and Dianasty", "source": "Facebook", "url": "https://www.facebook.com/events/173186349747059/"}, {"description": "Experience the flavors of the season and try our new Spring menu. Featuring new food and beverages you are sure to love! \nBut, don't worry we have kept some of the classics on our menu too.\nYou can make your reservation with OpenTable link above.", "date": "2016-05-29T12:00:00-04:00", "name": "Spring Menu Launch", "source": "Facebook", "url": "https://www.facebook.com/events/1745052782438333/"}, {"description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "date": "2016-05-29T16:00:00-04:00", "name": "Beer and Board Games", "source": "Facebook", "url": "https://www.facebook.com/events/586099571550962/"}, {"description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nBUY JUNE 11 TICKETS: http://bpt.me/2538000\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule", "date": "2016-05-29T17:00:00-04:00", "name": "Ann Arbor Derby Dimes 2016 season", "source": "Facebook", "url": "https://www.facebook.com/events/192972824428594/"}, {"description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "date": "2016-05-29T19:00:00-04:00", "name": "The Arcade - A Pointless Improv Jam", "source": "Facebook", "url": "https://www.facebook.com/events/1611968685690572/"}, {"description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: Strawberries & Cream - Cream soda meets fresh-picked strawberry in this juicy rendition of the infamous Strawberry Blonde. Smooth scents of vanilla flood the nose and taste buds at first sip, followed by the bite of strawberry and a satisfying finish.. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "date": "2016-05-31T11:30:00-04:00", "name": "American Craft Beer Week", "source": "Facebook", "url": "https://www.facebook.com/events/158066451258466/"}, {"description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n- May 31 Nick Fügedi\nhttps://www.reverbnation.com/nickfugedimusic\n\nSinger / Songwriter Nick Fügedi has called many places home. Fügedi's love for music began with his parents record player, where he frequently listened to LP's of popular 1960's Folk singers; Jim Croce, James Taylor, John Denver, Simon and Garfunkel, and Bob Dylan. It was with this inspiration that he decided to start playing and writing music of his own. Fügedi's songs use traditional Folk and Americana styling's to portray modern themes and ideas.\n\nNever a cover\nAlways a good time", "date": "2016-05-31T19:00:00-04:00", "name": "Acoustic Tuesdays: Nick Fügedi", "source": "Facebook", "url": "https://www.facebook.com/events/1687484028205922/"}]