[{"source": "Facebook", "url": "https://www.facebook.com/events/601566876699752/", "description": "Free to attend; for students 3rd through 8th grade.\n\nStudents learn to experiment with the basics in Computer Aided Design (CAD) by creating miniature Minecraft character keepsakes.\n\nNote: sessions must have at least 4 students registered to attend in order to be held. Registration deadline is 48 hours before scheduled time.", "date": "2017-03-03T17:00:00-05:00", "name": "3D Printing & Design (Week 1 of 6)"}, {"source": "Facebook", "url": "https://www.facebook.com/events/340989426297521/", "description": "Alley Bar is once again partnering with A2CT for their Give Back Thursdays program!  Here's how it works: Alley Bar donates 10% of their sales each Thursday in March to A2CT.  So come on out., hang out with friends, support a great local bar AND your favorite theatre! Hope to see you there.", "date": "2017-03-03T19:00:00-05:00", "name": "Give Back Thursdays"}, {"source": "Facebook", "url": "https://www.facebook.com/events/631477160373613/", "description": "Bookbound is pleased to welcome back local author Shelley Schanfield for the launch of the second book in her fantasy trilogy. By inclination a voracious reader and by profession a librarian, Shelley looked for a good novel about the Buddha . When she didn’t find one that satisfied her, she had the notion to write her own based on the spiritual struggles of women in the Buddha’s time, set in the fascinating world that gave birth to yoga and Buddhism. Steeped in India’s myths and legends, this novel is fresh territory for Western readers of fantasy and historical epics. Through its strong female characters, it will appeal to readers of historical fiction with a woman’s perspective. Light refreshments. Signing to follow.\n\nMore about the book:\nA beautiful warrior princess. A tormented prince. A terrible choice between love, duty, and spiritual freedom.\n\nRebellious Dhara runs away from her Himalayan clan to study with the powerful yogi Mala, a mysterious woman with a violent past. Flung by war onto an adventure-filled journey, Dhara meets and captures the heart of Siddhartha, whose skill in the martial arts and extraordinary mental powers equal her own.\n \nWorldly power and pleasure seduce Dhara, creating a chasm between her and her husband, who longs to follow a sage’s solitary path. She takes on the warrior’s role Siddhartha does not want, and when she returns wounded from battle court intrigue drives them further apart. As Siddhartha’s discontent with royal life intensifies, Dhara’s guru Mala, who has returned to her life as a ruthless outlaw queen, seeks her former pupil for her own evil purposes. \n \nDhara’s and Siddhartha’s love keeps evil at bay, but their son’s birth brings on a spiritual crisis for the prince.  If he leaves his kingdom to seek enlightenment, he turns his back on love and duty and risks destroying his people. Only Dhara can convince him to stay.", "date": "2017-03-03T19:00:00-05:00", "name": "Book Launch: The Mountain Goddess with Shelley Schanfield"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1093572227425292/", "description": "In a career that spans 23 albums and includes three Grammy awards, Tom Chapin has covered a lot of creative ground. In addition to his work as a recording artist and concert performer, Chapin has acted on Broadway and worked in films, television and radio. Tom grew up in a family that encouraged artistic pursuits. He began performing professionally as a teenager in the early 1960s, playing in Greenwich Village folk clubs alongside his siblings, Harry and Steve, as one of The Chapin Brothers. In 1971, he began a five-year run as the host of the ABC-TV children's series, \"Make A Wish.\" Chapin and his songs were also featured in the 1970 documentary film, \"Blue Water, White Death,\" for which he spent six months sailing the Indian Ocean searching for great white sharks.\n\nAs a music-maker, Chapin has maintained two parallel careers, as a highly respected contemporary folk artist and as a pioneer in the field of children's music. In the former role, Chapin has established a reputation for insightful, heartfelt songcraft and charismatic live performances. In the latter, he continues to engage the hearts, minds and imaginations of young listeners with witty, life-affirming original songs delivered in a sophisticated array of musical styles. Chapin's infectious songs, sterling musicianship and personal warmth shine, whether he's performing on record or in a concert hall, an outdoor festival, a school, in front of a symphony orchestra, or in an intimate coffeehouse.  www.tomchapin.com", "date": "2017-03-03T20:00:00-05:00", "name": "Tom Chapin at Green Wood Coffee House"}, {"source": "Facebook", "url": "https://www.facebook.com/events/657765481078555/", "description": "SUBSONNIK INVITES YOU !!!\nCelebrate our Record Release Party with Us bringing you the best entertainment to kick off your weekend! \nHosted at Club Above, Ann Arbor, expect to hear a dynamic range of genres, Open kitchen and Drink Specials served all night long.\n\n--- L i n e U p ---\nVest And Tyler\nhttps://soundcloud.com/vestandtyler\nhttps://itunes.apple.com/us/album/glitch/\nhttps://www.facebook.com/vestandtyler/\n\nCurtis Wolfe (L.O) Operator of Statik Records   \n[b2b] Mushkilla\nhttps://www.facebook.com/LODeepHouseMusic/\nhttp://popmuzik.se/2016/02/dj-l-o-not-without-my-coffee/\nhttps://www.beatport.com/artist/l-o/465288\nhttps://soundcloud.com/mushkilla\nhttps://www.facebook.com/DJMushkilla/\n\nTek - Mazter\nhttps://soundcloud.com/tek-mazter\nhttps://www.facebook.com/tek.mazter/\n\nQUENAUDON [b2b] Dan Ryan\nhttps://soundcloud.com/itsquenaudon\nhttps://soundcloud.com/quenaudon-remixs\nhttps://www.facebook.com/Quenaudon/\nhttps://www.facebook.com/TheRealDanRyan/\nhttps://soundcloud.com/apollo-671613041\n\nCody Popov (CHERRYZ)\nfacebook.com/cody.popov.5\nsoundcloud.com/cherryzofficial\n\nGrab your tickets at the door!!!\n$5 (21+)\n$7 (18+)\n\nSponsored By: SUBSONNIK and Statik Records\nwww.wearesubsonnik.com\nhttp://statikrecords.com/", "date": "2017-03-03T21:00:00-05:00", "name": "Subsonnik Takeover"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1839182856327434/", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "date": "2017-03-04T10:00:00-05:00", "name": "Women's History Month and Planned Parenthood"}, {"source": "Facebook", "url": "https://www.facebook.com/events/929444727192886/", "description": "On March 4th we will read \"A Warm Winter Tail\" by Carrie Pearson and meet a mouse as we learn about what it's like to be a mammal. \n\nNature Tales happens on select Thursday and Saturday mornings and focuses on outdoor and nature-based activities that inspire you and your preschoolers and their grown-ups to explore and appreciate the out of doors at LSNC—Ann  Arbor’s very own backyard. Each session will be centered around a specific theme and include a variety of hands-on activities, like live animal encounters, guided hikes, group games, and enticing stories. \n\nPrograms will take place outdoors rain or shine—please dress for the weather. This program’s theme is Furry Friends. \nAges: 5 years and younger\n$4 per child ($3 per member), adults are free", "date": "2017-03-04T10:00:00-05:00", "name": "Nature Tales: Furry Friends"}, {"source": "Facebook", "url": "https://www.facebook.com/events/411636892503853/", "description": "Create your own forged bracelet out of copper wire! You’ll learn metalsmithing techniques like forming, forging, and finishing while gaining experience with Anvils, Hammers and Torches. \n\nThis 2 hour Make & Take Workshop is perfect for students as young as 8 with an adult (16+), or anyone over 13 on their own.  Fun for kid+adult to do together! Register each person in your group, so we know how many will be coming. No prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.\n\nCall Maker Works at 734-222-4911 or visit  http://www.supersaas.com/schedule/makerworks/CheckOut?view=day&month=3&day=4 to register!", "date": "2017-03-04T10:30:00-05:00", "name": "Forge Your Own Copper Bracelet (good for families!)"}, {"source": "Facebook", "url": "https://www.facebook.com/events/172303896603725/", "description": "Longtime A2CT member and MFA-educated actor/director Glenn Bugala is teaching a 6-week Practical Acting Workshop this March and April!\n\nThe class runs 6 Saturdays, from 1-3 PM, March 4 - April 8, 2017 at the A2CT studio. This course will focus on practical techniques that all actors can use for musicals, straight plays, group or solo performance. Rather than an acting intensive, this class is a light-touch look at the craft of acting, designed for those with all levels of experience. If you're looking to get started acting, or you'd like to brush up your skills, this class is for you. \n\nParticipants must be 16 years or older. The cost of the class is $150 (sorry, no refunds for missed sessions). You may register by emailing manager@a2ct.org or calling the office at 734-971-0605 (M-F, 9AM-4PM). \n\nHurry! Space is limited!", "date": "2017-03-04T13:00:00-05:00", "name": "Practical Acting Workshop"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1204202942946225/", "description": "“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas)\n\nSince 1988, Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, it’s all sheer jazz perfection — and no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/jazz-at-lincoln-center-with-wynton-marsalis/", "date": "2017-03-04T20:00:00-05:00", "name": "Jazz at Lincoln Center with Wynton Marsalis"}]