[{"url": "https://www.facebook.com/events/1833391283539477/", "source": "Facebook", "description": "Brad Hedeman, Marketing & Product Selection for Zingerman's Mail Order will discuss how important it is to consider your company's culture in your marketing and branding efforts.", "date": "2017-01-11T11:45:00-05:00", "name": "Marketing Your Company's Culture with Brad Hedeman, Zingerman's"}, {"url": "https://www.facebook.com/events/1806612242931934/", "source": "Facebook", "description": "Help the Jim Toy Community Center raise funds for OUTFest 2017 and enjoy a delicious meal, too! Just mention the Jim Toy Center while placing your order anytime on Thursday, January 12 and Pizza House will donate a portion of what you spend back to the Jim Toy Community Center. \n\nThis will work for delivery and online orders as well.", "date": "2017-01-12T10:30:00-05:00", "name": "Pizza House Fundraiser for the Jim Toy Community Center"}, {"url": "https://www.facebook.com/events/612360835631247/", "source": "Facebook", "description": "The City of Ann Arbor is preparing plans for the reconstruction of W. Liberty Street between First Street and Main Street. To help residents and businesses learn about the improvements to be made as part of project, staff will be hosting a public meeting on Thursday, Jan. 12, 2017 from 11 a.m. to 1:00 p.m. in the multi-purpose room of the Ann Arbor District Library’s downtown branch located at 343 S. Fifth Ave in Ann Arbor.\n\nIf you are unable to attend or have questions, please contact Jennifer Nelson, Project Manager, jnelson@a2gov.org or 734.794.6410 x43672\n\nAll persons are encouraged to participate in public meetings. Accommodations, including sign language interpreters, may be arranged by contacting the city clerk’s office at 734.794.6140; via email to cityclerk@a2gov.org; or by written request addressed and mailed or delivered to:\n\nCity Clerk’s Office\n301 E. Huron St. \nAnn Arbor, MI 48104\n\nRequests made with less than two business days’ notice may not be able to be accommodated.\n\nPlease visit the project website for updates:  www.a2gov.org/Liberty", "date": "2017-01-12T11:00:00-05:00", "name": "West Liberty Street Improvements Project Meeting"}, {"url": "https://www.facebook.com/events/252774095153979/", "source": "Facebook", "description": "Need help getting started with cleansing program? Join our Apothecary department manager, Delphine to learn more and get some motivation.\n\nWe will go over how cleansing improves overall health, how to pick the right cleanse, and the supplements needed to accompany a cleanse.\n\nThere are many benefits associated with cleansing, potentially including:\nIncreased energy\nAppetite reset\nBlood sugar balance\nImmune system boost\nCandida managment\nLongevity and more!\n\nOne lucky participant will take home Renew Life Organic Essential Detox on us- maybe it will be you?", "date": "2017-01-12T11:30:00-05:00", "name": "Cleansing 101 with Delphine"}, {"url": "https://www.facebook.com/events/1076768855785005/", "source": "Facebook", "description": "Need help getting started with cleansing program? Join our Apothecary department manager, Delphine to learn more and get some motivation.\n\nWe will go over how cleansing improves overall health, how to pick the right cleanse, and the supplements needed to accompany a cleanse.\n\nThere are many benefits associated with cleansing, potentially including:\nIncreased energy\nAppetite reset\nBlood sugar balance\nImmune system boost\nCandida managment\nLongevity and more!\n\nOne lucky participant will take home Garden of Life Wild Rose Harbal D-Tox on us- maybe it will be you?", "date": "2017-01-12T17:00:00-05:00", "name": "Cleansing 101 with Delphine"}, {"url": "https://www.facebook.com/events/1733263916986993/", "source": "Facebook", "description": "Nancy's long career in watercolor painting is filled with rural naturalism and abstract design. The beautiful hills, trees and farmsteads of Southern Michigan with its small farming heritage appear prominently in Nancy's artwork. No two farms are alike in their arrangement of buildings, encouraging endless design possibilities. She works with the light, shadow, and shapes of these pastoral scenes, familiar homes for people and their animals. Having worked and lived on farms most of her life, she uses energetic line, color and texture to evoke a rich experience within this changing rural culture. Her work appears in many local and national exhibits where she has won numerous awards and has achieved signature status in the Pennsylvania Watercolor Society.", "date": "2017-01-12T17:00:00-05:00", "name": "Nancy Feldkamp Exhibit Opening"}, {"url": "https://www.facebook.com/events/756730994483756/", "source": "Facebook", "description": "Mary Szybist is most recently the author of Incarnadine, winner of the 2013 National Book Award for Poetry. She is the recipient of fellowships from the Guggenheim Foundation, the National Endowment for the Arts, the Rona Jaffe Foundation, and the Witter Bynner Foundation in conjunction with the Library of Congress. Her work has been awarded two Pushcart Prizes and has been supported by residencies at the MacDowell Colony and the Rockefeller Foundation's Bellagio Center in Bellagio, Italy. Her first book Granted won the 2004 GLCA New Writers Award and was a finalist for the National Book Critics Circle Award. A native of Williamsport, Pennsylvania, she now lives in Portland, Oregon where she teaches at Lewis & Clark College.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon '13).", "date": "2017-01-12T17:30:00-05:00", "name": "Zell Visiting Writers Series: Mary Szybist, Janey Lack Poetry"}, {"url": "https://www.facebook.com/events/1807900772828520/", "source": "Facebook", "description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "date": "2017-01-12T18:00:00-05:00", "name": "Art Off The Wall Holiday Exhibition & Shopping Event"}, {"url": "https://www.facebook.com/events/1299649313440032/", "source": "Facebook", "description": "Alpha Sig, Big Ticket, Delta Chi, Sig Ep & Necto present...\n\nTWO FRIENDS (Armada)\n\nwith opening sets TBA\n\nAbout Two Friends:  Matt Halper and Eli Sones, the young masterminds behind Two Friends, have quickly revamped from high school bedroom producers to one of the most promising dance music duos of 2016. Known for their viral remixes of “Trap Queen”, “I Miss You” and “Cool”, the two have, in unprecedented time, mastered a wide range of genres from deep, melodic house to harder progressive cuts. With their Spotify and SoundCloud views now exceeding 35 million and with nineteen #1’s on Hype Machine, the boys are well on their way to becoming the next big dance act to come out of America. \n\nKicking off their musical journey in senior year of high school, the boys honed their skills through remixing, taking on the likes of The Chainsmokers, Blink 182, Tori Kelly and Alesso to name but a few. Perfecting their distinct “Soul House” style, Two Friends were quick to prove their versatile production techniques, drawing upon a wide variety of live instrumentation to create a truly multi-faceted sound with every release. After receiving the “Award of Independent Excellence” from Hollywood Music in Media Awards, Two Friends swiftly exceeded their influence beyond the online sphere, attracting the spotlight on stage and radio. While Don Diablo was dropping Two Friends remixes on Hexagon Radio, their remix of Lana Del Rey’s hit “Born To Die” scored airplay on Sirius XM, securing the boys a top ten spot in the BPM Hits Chart in 2014.\n\nFollowing multiple performances at San Francisco’s Ruby Skye, as well as shows at New York’s illustrious Webster Hall and the Fonda Theatre in Los Angeles, the boys soon branched out to venues in Denmark, Mexico and Canada, showing off their potential in the international arena.\n\nWith support now coming from the likes of Tiesto, The Chainsmokers, Krewella and many more, and with a whole host of original releases locked in for 2016, Matt and Eli undoubtedly look set to dominate this year and beyond.\n\nWatch: https://www.youtube.com/user/TwoFriendsMusic\nListen: https://soundcloud.com/two-friends\nTalk: https://twitter.com/twofriendsmusic\nMeet: https://www.facebook.com/twofriendsmusic\nPeek: https://www.instagram.com/twofriendsmusic/\n\nDoors open at 9pm • 18 & over welcome with proper ID • VIP services are available. contact: VIP@necto.com", "date": "2017-01-12T21:00:00-05:00", "name": "Two Friends at Necto"}, {"url": "https://www.facebook.com/events/230775294023258/", "source": "Facebook", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "date": "2017-01-13T10:00:00-05:00", "name": "Exhibit: Avant Garden-Fashion & Plants Together!"}]