[{"name": "2017 Local Food Summit", "description": "Register at localfoodsummit.org!\n\nOnline registration ends at 8 pm Sunday March 19th. \nDay of the event registration will begin at 7:30 am at the EMU Student Center.\n\nThe Local Food Summit brings together individuals and organizations that share a common vision for the localized food system of Washtenaw County. The 2017 event utilizes a summit style format, featuring facilitated group discussions that include learning, dialogue, and collective visioning. The summit hopes to engage new audiences as well as long-time participants, including purchasers, chefs, producers, distributors, consumers, educators, business owners, politicians, and local food activists. Attendees will participate in one of six tracks, allowing them to think deeply about a particular aspect of our local food system, and to consider the impacts of racism and policy in Washtenaw County. \n\nTRACKS\n•\tRacism and Access to Land and Capital \n•\tFarm to Institution\n•\tMarket Development\n•\tFarm Worker and Labor Justice\n•\tCurrent Environmental Issues\n•\tFood Justice\n\nCost of Attendance (includes breakfast and lunch)\nEarly registration (before 3/13) - $40\nRegistration at the door - $50\nScholarships are available upon request.", "date": "2017-03-20T09:00:00-04:00", "url": "https://www.facebook.com/events/303111296758253/", "source": "Facebook"}, {"name": "Stamps presents: Tracy Snelling, \"Multiple Realities\"", "description": "Through the use of sculpture, photography, video, and large-scale installation, Tracey Snelling gives her impression of a place, its people and their experience. Often, the cinematic image stands in for real life as it plays out behind windows in the buildings, sometimes creating a sense of mystery, other times stressing the mundane. Snelling’s work derives from voyeurism, film noir, and geographical and architectural location. Within this idea of location, themes develop that transport observation into the realm of storytelling, with reality and sociological study being the focus. Snelling had exhibited in international galleries, museums and institutions, including the The Royal Museum of Fine Arts, Belgium; Palazzo Reale, Milan; Museum of Arts and Design, New York; Kunstmuseen Krefeld Germany; El Museo de Arte de Banco de la Republica, Bogota; the Stenersen Museet, Oslo, and the Sundance Film Festival. Her short films have screened at the San Francisco International Film Festival, the Thessaloniki International Film Festival, Circuito Off in Venice, Italy, and the Arquiteturas Film Festival Lisboa in Portugal. She also received a 2015 Joan Mitchell Painters and Sculptors Grant. Snelling lives and works in Oakland, California and Berlin, Germany.\n\nA Penny Stamps Speaker Series presentation in partnership with the Institute for the Humanities and co-sponsored by the University of Michigan Museum of Art.", "date": "2017-03-20T17:10:00-04:00", "url": "https://www.facebook.com/events/1637065343255870/", "source": "Facebook"}, {"name": "Sunseed Farm CSA Pickup", "description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "date": "2017-03-20T18:00:00-04:00", "url": "https://www.facebook.com/events/731926473638010/", "source": "Facebook"}, {"name": "Deepak Unnikrishnan", "description": "Literati is delighted to welcome Deepak Unnikrishnan in support of his debut novel, Temporary People, winner of the Restless Books Prize for New Immigrant Writing.\n\nIn the United Arab Emirates, foreign nationals constitute over 80 percent of the population. Brought in to construct the towering monuments to wealth that punctuate the skylines of Abu Dhabi and Dubai, this labor force works without the rights of citizenship, endures miserable living conditions, and is ultimately forced to leave the country. Until now, the humanitarian crisis of the so-called “guest workers” of the Gulf has barely been addressed in fiction. With his stunning, mind-altering debut novel Temporary People, Deepak Unnikrishnan delves into their histories, myths, struggles, and triumphs. \n\nCombining the irrepressible linguistic invention of Salman Rushdie and the satirical vision of George Saunders, Unnikrishnan presents twenty-eight linked stories that careen from construction workers who shapeshift into luggage and escape a labor camp, to a woman who stitches back together the bodies of those who’ve fallen from buildings in progress, to a man who grows ideal workers designed to live twelve years and then perish—until they don’t, and found a rebel community in the desert. With this polyphony, Unnikrishnan brilliantly maps a new, unruly global English. Giving substance and identity to the anonymous workers of the Gulf, he highlights the disturbing ways in which “progress” on a global scale is bound up with dehumanization. \n\nDeepak Unnikrishnan is a writer from Abu Dhabi, and an editor at The State. His fiction and essays have appeared in Guernica, Drunken Boat, Himal Southasian, Bound Off, The State Vol IV: Dubai and in the anthology The Apex Book of World SF 4, among others.\n\n \n\nEvent date: \nMonday, March 20, 2017 - 7:00pm\n\nEvent address: \nLiterati Bookstore\n124 E. Washington St.\nAnn Arbor, MI 48104", "date": "2017-03-20T19:00:00-04:00", "url": "https://www.facebook.com/events/256937014711898/", "source": "Facebook"}, {"name": "Ernestine Ruben at Willow Run: Mobilizing Memory", "description": "March 11–August 20, 2017\nPhotography Gallery\n\nIn 2013, artist Ernestine Ruben (BSDEs ’53) photographed the once-famed industrial complex Willow Run in Washtenaw County, Michigan. Designed by her grandfather, Detroit architect Albert Kahn, for the Ford Motor Company, Willow Run was an exemplar of American defense manufacturing because of its efficient mass-production of B-24 Liberators during World War II.\nFor this exhibition, Ruben overlaid interior views of the now-dormant factory with imagined glimpses into her body’s interior landscape. The resulting compositions seem to breathe energy and light into the stagnant and cavernous spaces of Willow Run and suggest a longing for a productive existence undeterred by mortality for both Willow Run and the artist. Her grandfather’s role in the history of the site underscores Ruben’s personal connection.\nThe exhibition presents Ruben’s photographs of Willow Run in UMMA’s Photography Gallery and an original film—co-created by Ruben and video artist Seth Bernstein and featuring an original score by award-winning composer Stephen Hartke—in the Museum’s Forum.\n\nLead support for Ernestine Ruben at Willow Run: Mobilizing Memory is provided by the University of Michigan Office of the Provost and the Herbert W. and Susan L. Johe Endowment.", "date": "2017-03-21T12:00:00-04:00", "url": "https://www.facebook.com/events/1008319905968712/", "source": "Facebook"}, {"name": "The 55th Ann Arbor Film Festival", "description": "The Ann Arbor Film Festival has been around for over 50 years, fascinating, challenging, enchanting, even appalling and often surprising tens of thousands of viewers - some who have been attending for decades. The AAFF is a highlight of Michigan's cultural year. The majority of screenings will take place at the Michigan Theater (603 E Liberty St, Ann Arbor, MI 48104) with additional events and exhibitions at other venues around downtown Ann Arbor. Tickets and passes are available for purchase on our website.\n\nFind out more info on our website:\nhttp://aafilmfest.org", "date": "2017-03-21T14:00:00-04:00", "url": "https://www.facebook.com/events/1821291198093435/", "source": "Facebook"}, {"name": "Pints and Poses - Equinox Edition", "description": "On Tuesday, March 21st, celebrate the return of the sun with an hour of all-levels vinyasa in the Gulo Room! This is an \"Equinox Edition\" of our very popular Pints and Poses event, which last took place in November. The event sold out quickly, so don't miss out! Local yoga instructor Robin Schultz-Purves will lead the class through a series of flows dedicated to welcoming spring. Class is, of course, followed by a pint of your choice. Bring a yoga mat and a water bottle and wear comfortable clothes. We'll gather beginning at 6 pm and class will start at 6:30. Limited tickets available -", "date": "2017-03-21T18:00:00-04:00", "url": "https://www.facebook.com/events/396460264046116/", "source": "Facebook"}, {"name": "55th AAFF Opening Night", "description": "OPENING NIGHT RECEPTION\n3/21/2017 6:30-8:00pm\nMichigan Theater Grand Foyer\nKick off the Festival with cocktails and food from some of the best local vendors. Open bar, a great assortment of hors d'oeuvres and desserts, and music spun by DJ Jeremy Wheeler make the Opening Night Reception an event to remember! Entrance includes seats to the first screening of the festival, the Opening Night Films in Competition 1. Tickets start at $40.00 and you can purchase them here: http://bit.ly/2mkq9ZA\n\nOPENING NIGHT SCREENING - Films in Competition 1\n3/21/2017 8:15pm\nMichigan Theater Main Auditorium\nJoin us for an exciting first program of nine short films including recent experimental, documentary, and animated works. Features a 35mm found-footage hand-manipulated collage, a love tale between a human cannonball circus man and a young secretary from Liverpool, a kinetic romp investigating the images imprinted onto wine corks, a visit to a place without ever going there, mind-bending animation, the most narrative narrative never narrated, and more.\nhttp://bit.ly/2ngEZVK", "date": "2017-03-21T18:30:00-04:00", "url": "https://www.facebook.com/events/1726757667635462/", "source": "Facebook"}, {"name": "Acoustic Tuesday - Carly Bins", "description": "On this Acoustic Tuesday, we welcome Carly Bins to the brewpub.", "date": "2017-03-21T19:00:00-04:00", "url": "https://www.facebook.com/events/1569594503068582/", "source": "Facebook"}, {"name": "Drummunity Circle with Lori Fithian", "description": "Drummunity Circle with Lori Fithian • Feb. 22, Mar. 21, Apr. 20; 7 p.m. in the Crazy Wisdom Community Room • Get your hands on a drum and add your sound and spirit to the community groove. All are welcome to join the circle. No experience necessary. Drums available. Free. Call 426-7818; lorifithian@mac.com or drummunity.com.", "date": "2017-03-21T19:00:00-04:00", "url": "https://www.facebook.com/events/392020407817982/", "source": "Facebook"}]