[{"source": "Facebook", "url": "https://www.facebook.com/events/994376950635153/", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "name": "The 2016 Ann Arbor Art Fair", "date": "2016-07-27T10:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/487403974717996/", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "name": "State Street Art Fair", "date": "2016-07-27T10:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1803129396573702/", "description": "Literati is delighted to welcome Blair Braverman in support of her memoir, Welcome to the Goddamn Ice Cube: Chasing Fear and Finding Home in the Great White North. Blair will be joined in conversation by UM MFA alum Mindy Misener.\n\nBlair Braverman fell in love with the North at an early age: By the time she was nineteen, she had left her home in California, moved to Norway to learn how to drive sled dogs, and worked as a tour guide on a glacier in Alaska. By turns funny and sobering, bold and tender, Welcome to the Goddamn Ice Cube charts Blair’s endeavor to become a “tough girl”—someone who courts danger in an attempt to become fearless. As she ventures into a ruthless arctic landscape, Blair faces down physical exhaustion—being buried alive in an ice cave, and driving a dogsled across the tundra through a whiteout blizzard in order to avoid corrupt police—and grapples with both love and violence as she negotiates the complex demands of being a young woman in a man’s land.\n\nBrilliantly original and bracingly honest, Welcome to the Goddamn Ice Cube captures the triumphs and the perils of the journey to self-discovery and independence in a landscape that is as beautiful as it is unforgiving.\n\nBlair Braverman graduated from the University of Iowa’s Nonfiction Writing Program, where she was also an Arts Fellow. She has been a resident fellow at Blue Mountain Center and the MacDowell Colony and her work has appeared in Buzzfeed, The Atavist, The Best Women’s Travel Writing, Orion, AGNI, High Country News, Waging Nonviolence, and on This American Life. She lives in Mountain, Wisconsin.", "name": "Blair Braverman", "date": "2016-07-27T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1155777777799289/", "description": "Meet freelance writer Larry Olmstead and Radio Personality Micheal Patrick Shiels with an Olive Oil Tasting from Zingerman's.\n\nLarry Olmsted, a prolific freelance writer who has published thousands of articles in national publications, including Outside, Playboy, USA Today, and Inc., is a contributing editor to numerous publications, and was a longtime columnist for Investor's Business Daily. He lives in Vermont.\n\nYou ve seen the headlines: Parmesan cheese made from sawdust. Lobster rolls containing no lobster at all. Extra-virgin olive oil that isn t. Fake foods are in our supermarkets, our restaurants, and our kitchen cabinets. Award-winning food journalist and travel writer Larry Olmsted exposes this pervasive and dangerous fraud perpetrated on unsuspecting Americans. \"Real Food/Fake Food\" brings readers into the unregulated food industry, revealing that this shocking deception extends from high-end foods like olive oil, wine, and Kobe beef to everyday staples such as coffee, honey, juice, and cheese. It's a massive bait and switch where counterfeiting is rampant and where the consumer ultimately pays the price. But Olmsted does more than show us what foods to avoid. A bona fide gourmand, he travels to the sources of the real stuff, to help us recognize what to look for, eat, and savor: genuine Parmigiano-Reggiano from Italy, fresh-caught grouper from Florida, authentic port from Portugal. Real foods that are grown, raised, produced, and prepared with care by masters of their craft. Part cautionary tale, part culinary crusade, \"Real Food/Fake Food\" is addictively readable, mouth-wateringly enjoyable, and utterly relevant. Larry Olmsted convinces us why real food matters.", "name": "Larry Olmstead & Olive Oil Tasting by Zingerman's", "date": "2016-07-27T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1616853798644437/", "description": "Ann Arbor Festival of Song presents the Twenty-Third Annual\nWeek After Art Fair Song Fest\n\nWednesday though Friday, July 27-29, 2016\nKerrytown Concert House\nwww.kerrytownconcerthouse.com    (734-769-2999)  \n415 N. Fourth Ave., Ann Arbor, MI 48104\n\nWednesday July 27, 8:00PM (FREE ADMISSION)\nSONGS WE LOVE TO SING:   Various Composers, Eras, Styles\n\nThursday July 28, 8:00PM (FREE ADMISSION)\nLES CHEMINS DE L’AMOUR:  The Lyrical Legacy of Francis Poulenc\n\nFriday July 29, 8:00PM (Call 734-769-2999 for tickets and reservations)\nSPEAK LOW:  Songs of Weill and Sondheim\n\nFeaturing Kevin Bylsma at the piano, with your favorite singers! \nSOPRANOS\nEmily Benner  \t\nChelsea Cloeter  \t\nJenny Cresswell  \t\nMadeline Harts  \t\nTeri Herron   \t\nRebekah Kroesing   \t\nHillary LaBonte  \t\nJane Schoonmaker Rodgers  \t\n\nMEZZOS\nChristine Amon  \t\nLaura Reaper  \t\nDeanna Relyea  \t\nEllen Strba Scholl \t\nMonica Swartout-Bebow  \t\n\nTENORS\nGregory Ashe\nJohn Hopkins  \t\nChristopher Scholl  \t\n\nBARITONES\nChy Billings \t\nJohn Glann \t\nJohn Mink  \t\nRobert Peavler \t\nDale Schriemer", "name": "2016 Week After Art Fair Song Fest", "date": "2016-07-27T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/814563692008977/", "description": "Brett Dennen - Youthful West Coast singer/songwriter Brett Dennen, with a fragile, high-pitched voice that makes him sound at times like a cross between Tracy Chapman, Paul Simon and Neil Young, first drew attention in 2004 with the single \"Desert Sunrise.\" The tune, with its easy groove and soulful phrasing, garnered enough spins on KCRW to warrant the release of his self-titled debut the following year. In 2006, Dennen signed with Dualtone and released So Much More. Hope for the Hopeless followed on the same imprint in 2008. Dennen's fourth studio effort, Loverboy, which featured subtle African rhythms and more of a pop veneer, arrived in April of 2011, followed in 2013 by the sparser acoustic-based Smoke and Mirrors and 2014 \nrelease of Out of My Head.  Brett’s latest release Por Favor is getting released on May 20th, 2016.   http://brettdennen.net\n\n\nMulti-instrumentalists Katie Larson and Savannah Buist are creating quite a name for themselves among music lovers of all genres. Described as, “A duo giving an edge to folk with unique instrumentation,\" Z93 FM DJ, Matt Mansfield writes: “Combine musicality, originality and melodic beauty with a welcome and unexpected bite to clever lyrics and you've got Accidentals music. Songwriters, look no farther to find a new pairing to be jealous of, especially with such a bright future ahead of them.”\nThey met in 2011 at their public high school. Katie (15) was a freshman cello player, “playing up” in the Philharmonic Orchestra and Savannah (16) was Concert Master, violinist. They volunteered for a class assignment that threw them together for their first rehearsal and The Accidentals were born. \nGrowing up in musical families with professional pianists for fathers and vocalist for mothers, their influences bounced between classical, jazz, bluegrass, country, alt-rock, and the obscure. Their collective playlist you won’t find on mainstream radio\nIn 2015, the band won Traverse Magazine’s “Red Hot Best” of Northern Michigan Music for their third year in a row, The Emerging Artists Series at Summerfest hey were named one of the top seven breakout artists at SXSW 2015 by Billboard Magazine. Their album, Bittersweet, won \"Album of the Year\" and the band landed, \"Best New Artist\" 2015 WYCE Jammie awards. Their song, The Silence, won St. Cecilia, Art Prize People's Choice. \nhttp://www.moreaccidentals.com \n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Brett Dennen w/s/g The Accidentals / July 28th / Bank of Ann Arbor's Sonic Lunch / FREE 12PM", "date": "2016-07-28T11:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1616853798644437/", "description": "Ann Arbor Festival of Song presents the Twenty-Third Annual\nWeek After Art Fair Song Fest\n\nWednesday though Friday, July 27-29, 2016\nKerrytown Concert House\nwww.kerrytownconcerthouse.com    (734-769-2999)  \n415 N. Fourth Ave., Ann Arbor, MI 48104\n\nWednesday July 27, 8:00PM (FREE ADMISSION)\nSONGS WE LOVE TO SING:   Various Composers, Eras, Styles\n\nThursday July 28, 8:00PM (FREE ADMISSION)\nLES CHEMINS DE L’AMOUR:  The Lyrical Legacy of Francis Poulenc\n\nFriday July 29, 8:00PM (Call 734-769-2999 for tickets and reservations)\nSPEAK LOW:  Songs of Weill and Sondheim\n\nFeaturing Kevin Bylsma at the piano, with your favorite singers! \nSOPRANOS\nEmily Benner  \t\nChelsea Cloeter  \t\nJenny Cresswell  \t\nMadeline Harts  \t\nTeri Herron   \t\nRebekah Kroesing   \t\nHillary LaBonte  \t\nJane Schoonmaker Rodgers  \t\n\nMEZZOS\nChristine Amon  \t\nLaura Reaper  \t\nDeanna Relyea  \t\nEllen Strba Scholl \t\nMonica Swartout-Bebow  \t\n\nTENORS\nGregory Ashe\nJohn Hopkins  \t\nChristopher Scholl  \t\n\nBARITONES\nChy Billings \t\nJohn Glann \t\nJohn Mink  \t\nRobert Peavler \t\nDale Schriemer", "name": "2016 Week After Art Fair Song Fest", "date": "2016-07-28T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1723035611280967/", "description": "Come check out Final Chapter Entertainment's new artist Syd's Cottage at the relelase party for his brand new EP \"Devant\"\n\nAdditional Performances By \n\nGalaxy X\nDownright Kris\nDavinci Caso\nTriscuitonthetrack\nToasty Tenzin", "name": "Syd's Cottage Release Party", "date": "2016-07-28T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1816550935245704/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe", "date": "2016-07-29T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu", "date": "2016-07-29T19:00:00-04:00"}]