[{"date": "2017-02-19T11:00:00-05:00", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration", "url": "https://www.facebook.com/events/1724899501156129/", "source": "Facebook"}, {"date": "2017-02-19T11:00:00-05:00", "description": "Children ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. The story on February 18 will focus on Protecting Wisdom: Tibetan Book Covers from the MacLean Collection and stories of the Buddha. Meet in front of the UMMA Store.\n\nStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.\n\nLead support for Protecting Wisdom: Tibetan Book Covers from the MacLean Collection is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, and the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund and the Department of Asian Languages and Cultures.", "name": "Storytime at the Museum", "url": "https://www.facebook.com/events/245767159212723/", "source": "Facebook"}, {"date": "2017-02-19T12:00:00-05:00", "description": "Back by popular demand, it's Vault of Midnight's franken-toy extravaganza! Spend an afternoon with our hobby gurus breathing life into your very own, 100% original creation. All the craft supplies your little heart could desire and the expertise to boot will be provided, all for a meager $20 entry fee.\n\nTICKETS ARE ON SALE NOW! \n\n\nThe event will be run and guided by Vault of Midnight Owner and Proprietor Curtis J Sullivan, as well as our resident hobby guru Brandon M. Sapp. This highly qualified duo will guide you gently and expertly through the following techniques:\n\nPlanning out your custom toy! The Key To Success is Planning!\nLearn how to use super glue the \"Curtis way!\"\nHow to properly use a hobby knife and avoid serious injury to yourself or others.\nPainting Your Creation 101\nBest Practices for taking a selfie with your new creation.\nBring the kids, bring your friends, and spend a day building with your hands and MIND. Don't miss it.\n\nSpaces limited to 32 people, so act fast!", "name": "Ultimate Build-A-Toy", "url": "https://www.facebook.com/events/239074313202320/", "source": "Facebook"}, {"date": "2017-02-19T13:00:00-05:00", "description": "AOT will be holding their auditions for the 2017-18 season, including productions of Puccini's Suor Angelica and Tosca.  To find out all the information and how to apply for a live audition or submit recordings for consideration, follow the link below.\n\nhttp://www.arboropera.com/index.php/blog/auditions", "name": "Auditions for 2017-18 season", "url": "https://www.facebook.com/events/1574304402584366/", "source": "Facebook"}, {"date": "2017-02-19T14:00:00-05:00", "description": "Pictorialism was the first truly international photography movement, and its practitioners, among them Alfred Stieglitz, Edward Steichen and Gertrude Käsebier, sought to position photography as a legitimate aesthetic art form. They favored soft-focus images that drew upon the conventions of important artists and movements of the previous century. Their poetic compositions drawn from contemporary life, combined with the use of expensive and labor-intensive printing materials established these photographs as complex and nuanced works of high artistic quality. Join a tour with an UMMA docent and explore this rich moment in the history of photography.", "name": "Guided Tour: The Aesthetic Movement in America", "url": "https://www.facebook.com/events/1308697722501672/", "source": "Facebook"}, {"date": "2017-02-19T15:00:00-05:00", "description": "The Jan and David Brandon Family Bridge\nThis program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.\n\nTwo brothers. Two million dollars. Two Buildings. Two gendered spaces. Constructing Gender: the Origins of Michigan’s Union and League (January 28 – May 7, 2017), looks not only at how brothers (and U-M alumni) Irving K. and Allen Pond meticulously conceived and constructed the two clubs—one for men, one for women—but how they built ideas about gender and society into the very fabric of the Union and League themselves. Join exhibition curator Nancy Barlett of the Bentley Historical Library, for an exploration of the origins of these iconic buildings through an architectural lens, and showing how their design reflected the era’s ideas about gender, morals, and coeducation.\n\nLead support for Constructing Gender: Origins of Michigan's Union and League is provided by the Herbert W. and Susan L. Johe Endowment.", "name": "In Conversation: Constructing Gender", "url": "https://www.facebook.com/events/762560107246663/", "source": "Facebook"}, {"date": "2017-02-19T16:00:00-05:00", "description": "Timeless classics are elevated by modern masters when gifted jazz pianist and arranger Aaron Diehl and 26-year-old vocalist extraordinaire Cécile McLorin Salvant join forces to revisit and revitalize the works of George Gershwin and Jelly Roll Morton.\n\nMore info: http://ums.org/performance/jelly-and-george-aaron-diehl-and-cecile-mclorin-salvant/", "name": "Jelly and George - Aaron Diehl and Cécile McLorin Salvant", "url": "https://www.facebook.com/events/1062809883742057/", "source": "Facebook"}, {"date": "2017-02-19T16:00:00-05:00", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games", "url": "https://www.facebook.com/events/1841183032822164/", "source": "Facebook"}, {"date": "2017-02-19T17:30:00-05:00", "description": "CMSa2 welcomes instrumentalists of all ages to come join our Classical and Jazz ensembles during a week of open house rehearsals! Experience the joy of playing in an orchestra, jazz combo or chamber ensemble, meet our conductors and teachers, learn more about our programs, make new friends and play music from Beethoven to Chick Corea to John Williams!\n\nThe schedule for the rehearsals is listed below:\n\nMONDAY:\nConcert Orchestra - 5:30PM-7:15PM @ Scarlett Middle School\nSymphony Orchestra - 6:30PM-8:30PM @ Scarlett Middle School\nWind Ensemble - 6:30PM-8:30PM @ CMSa2\nBrass Ensemble - 6:30PM-8:30PM @ CMSa2\n\nTUESDAY\nYouth Jazz Combo - 6:00PM-7:30PM @ CMSa2\nAdult Jazz Combo - 8:00PM-9:30PM @ CMSa2\n\nWEDNESDAY\nNew Horizons Senior String Orchestra - 1:00PM-3:00PM @ CMSa2\nAdult Jazz Combo - 8:00PM-9:30PM @ CMSa2\n\nTHURSDAY\nPercussion Ensemble - 6:30PM-8:30PM @ Clague Middle School\n\nWe look forward to seeing everyone there!", "name": "CMSa2 OPEN HOUSE", "url": "https://www.facebook.com/events/397979943874993/", "source": "Facebook"}, {"date": "2017-02-19T19:00:00-05:00", "description": "Sixteen poets.  Four teams.  Three cities.  One epic poetry slam!\n\nFreshwater Wordsmiths (Detroit), Windsor Poetry Slam, The Drunken Retort (Grand Rapids), and Artists Inn Detroit will be competing in an NPS-style bout: four rounds of four poems each, scored by randomly selected audience judges.  The top two teams will automatically qualify for the 2017 National Poetry Slam in Denver.\n\nDon't miss your chance to see sixteen of the hottest performance poets from this corner of the Midwest.", "name": "National Poetry Slam: Regional Qualifier aka 2 Wins & You're In", "url": "https://www.facebook.com/events/245503075876926/", "source": "Facebook"}]