[{"description": "Join moderator Pauline Jones (Director of the U-M Digital Islamic Studies Curriculum and professor of political science) and panelists in a town hall style meeting that explores the regional and global impact of Islamic cultures, and examines ways to counteract Islamophobia in our community.\n\nPanelists include Beyond Sacred cast members Kadin Herring and Amir Khafagy, and U-M associate professor of history Butch Ware.\n\nPing Chong + Company’s Beyond Sacred: Voices of Muslim Identity is at Power Center on Saturday, February 18.\n\nIn collaboration with the U-M Digital Islamic Studies Curriculum and the U-M International Institute.", "date": "2017-02-17T14:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1817888895165516/", "name": "Investigating Islam: A Community Forum"}, {"description": "Bring your well-worn items that could use a tune up, and we'll take a look at them! \n\nOr, make someone else's day by volunteering at Fix-It Friday and repairing their items.\n\nFix-It Friday:\nThink of this as the last chance before you get rid of something; Free, but no Guarantee.\n\nWe will:\n- try to diagnose what is wrong\n- tell you if we think we may be able to fix it today\n- tell you if you'll need a part, and where you might be able to get it\n- try to fix it to the best of our ability, but in the limited time we have\n\nHowever, we may not be able to fix it. Many products are not designed to be fixed, and just opening them up may damage them. Furthermore, we may not have someone on hand with the expertise to do a proper repair. Also, it may require a special part, tools, information, or materials to repair, or it may just require more time than we have.\n\nWe may end up damaging your item even more. Please let the repairer know how comfortable you are at each stage of diagnosis and repair.\n\nItems that are often easier to repair: lamps, types of toys, broken wires, things that need epoxy/wood glue\n\nItems that are often very difficult to repair: consumer electronics such as CD/Cassette boom boxes, TVs, radios, CD players, VCRs, and DVD players", "date": "2017-02-17T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/396224057386783/", "name": "Fix-It Friday (third Friday of every month)"}, {"description": "Let’s celebrate Valentine’s Day All Week Long!\nSaturday, February 11 – Tuesday, February 14, 2017\nDinner Available Each Day 4pm – Close\n\n3- COURSE DINNER MENU FOR TWO\n\nFIRST COURSE\nPlease select one of the following:\nSoup, Bleu Cheese Cole Slaw, House Salad or Caesar Salad\n\nSECOND COURSE\nLobster Stuffed Filet Mignon\nTopped with hollandaise sauce then served with grilled asparagus and Duchess potatoes\n\nTHIRD COURSE\nDessert to share\nChocolate Molten Cake\nwith a warm creamy center and a scoop of vanilla ice cream\n\nReservations Recommended\n(888) 456-3463 (DINE)\nCall to reserve your spot!\n$69.95 for two, tax/gratuity not included.\nLimited time offer. \nhttp://carsonsamericanbistro.com/valentines-dinner-for-two/\n___________________________________\n\nDRINK SPECIALS \n(Not included in price of the Dinner for Two)\n\n“Amore Martini” \nMalibu, Peach Schnapps, Citrus Vodka, Cranberry Juice $10.95\n\n“Kir Royale”\nLaMarca Prosecco, Crème de Cassis $11.95\n\n____________________________________", "date": "2017-02-17T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1832607166998206/", "name": "Valentine’s Dinner for Two, 2/11 – 2/14"}, {"description": "Stop in to UMMA on select Friday evenings to enjoy special exhibitions and engaging activities at Fridays After 5! With all of UMMA's galleries remaining open until 8:00 p.m., this exciting series provides an interactive atmosphere for all audiences. Park in the Maynard Structure (between Liberty and William) and receive free, validated parking. The Museum is always free.\n\nAlso, be sure to save the date for our upcoming Fridays After 5:\nApril 7, 2017 May 12, 2017 June 9, 2017 July 21, 2017", "date": "2017-02-17T17:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1224413797643769/", "name": "Fridays After 5"}, {"description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "date": "2017-02-17T18:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1807900772828520/", "name": "Art Off The Wall Holiday Exhibition & Shopping Event"}, {"description": "Free and open to the public. Seating is first-come, first-served.\n\nOne MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.\n\nThis week's reading features Tara E. Jay (Introduced by Molly Dickinson) & Danez Smith (Introduced by Courtney Faye Taylor).\nTara E. Jay is a poet from Indiana. She grew up in trailer parks, on food stamps and gas station take-out. She lives alone with a rescued miniature Schnauzer named Phoebe.\n\nDanez Smith is the author of [insert] boy (YesYes Books, 2014), winner of the Kate Tufts Discovery Award and the Lambda Literary Award, and Don’t Call Us Dead (Graywolf Press, 2017).", "date": "2017-02-17T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/245667192541703/", "name": "Mark Webster Reading Series"}, {"description": "Literati is pleased to welcome Emily Fridlund in support of her debut novel, History of Wolves, a staff favorite and a Literati Cultura selection.\n\nOne of the most daring literary debuts of the season, History of Wolves is a profound and propulsive novel from an urgent, new voice in American fiction. Teenage Linda lives with her parents in the austere woods of northern Minnesota, where their nearly abandoned commune stands as a last vestige of a lost counter-culture world. Isolated at home and an outsider at school, Linda is drawn to the enigmatic, attractive Lily and new history teacher Mr. Grierson. When Mr. Grierson is faced with child pornography charges, his arrest deeply affects Linda as she wrestles with her own fledgling desires and craving to belong.\n\nAnd then the young Gardner family moves in across the lake and Linda finds herself welcomed into their home as a babysitter for their little boy, Paul. But with this new sense of belonging come expectations and secrets she doesn’t understand. Over the course of a summer, Linda makes a set of choices that reverberate throughout her life. As she struggles to find a way out of the sequestered world into which she was born, Linda confronts the life-and-death consequences of the things people do—and fail to do—for the people they love.\n\nWinner of the McGinnis-Ritchie award for its first chapter, and A BEA Buzz Book and An ABA Indies Introduce Selection, Emily Fridlund’s agonizing and gorgeously written History of Wolves introduces a new writer of enormous range and talent.\n\n“‘Winter collapsed on us that year. It knelt down, exhausted, and stayed.’ So much is accomplished here, not least a kind of trust that this writer will make everything count, including the kind of data that is usually left for dead in a story. What is literary authority, after all, but the ability to regularly, without apparent effort, make the most of every sentence, build feeling in every line and do it in such a way that is tough, tight, funny, and often brilliantly disruptive?”—Ben Marcus\n\n“So delicately calibrated and precisely beautiful that one might not immediately sense the sledgehammer of pain building inside this book. And I mean that in the best way. What powerful tension and depth this provides! I’m so excited for readers to encounter the talent and roiling intelligence of Emily Fridlund.”—Aimee Bender\n\n\"As exquisite a first novel as I’ve ever encountered. Poetic, complex, and utterly, heartbreakingly beautiful.\" —T. C. Boyle\n\nEmily Fridlund grew up in Minnesota and currently resides in the Finger Lakes region of New York. Her fiction has appeared in a wide variety of journals. She holds a PhD in Literature and Creative Writing from the University of Southern California and currently teaches at Cornell University. Fridlund's collection of stories, Catapult, was a finalist for the Noemi Book Award for Fiction and the Tartts First Fiction Award. It won the Mary McCarthy Prize and will be published by Sarabande in 2017. The opening chapter of History of Wolves was published in Southwest Review and won the 2013 McGinnis-Ritchie Award for Fiction.", "date": "2017-02-17T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/472588303129144/", "name": "Emily Fridlund"}, {"description": "Aaaaaand we're back! After countless semesters of contests and concerts, the organizers at MUSIC Matters have decided to take their talents to the world of sports. This semester, we will be hosting the first annual MUSIC Madness: a battle of the bands tournament.The winner will have the opportunity to perform at our spring festival!! \n\nTHREE EVENTS, ONE CHAMPION\n\nPRELIMS: \nFebruary 17th: Michigan League Basement\n\t\nMarch 8th: Kerrytown Concert House\n\nFINALS: \nMarch 30th @ Club Above  \n\nThis 3 night, 3 venue knockout-style tournament was created to answer the question we've all been asking...who really is the best musician at Michigan? Two preliminary rounds will take place Friday, February 17th and Wednesday, March 8th. From there we will take the final four of each round to make up our elite 8! These top acts will then put everything on the line as they juke it out for the 'ship March 30th at Club Above. Winner will have the opportunity to perform at our music and art festival, SpringFest!\n\nIf you think you got what it takes to go the distance, submit your application through the link below. We will be accepting participants till February 10th, 11:59pm.\n\n\nhttps://docs.google.com/a/umich.edu/forms/d/e/1FAIpQLSfjzNz8zVAdVYYhx51Ut6Y0jW_vRTLDLPZzqluMfR4S_jgkqg/viewform\n\nSurvive and Advance.", "date": "2017-02-17T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1238031392951145/", "name": "MUSIC Madness: A Battle of the Bands Tournament"}, {"description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "date": "2017-02-17T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/254338798323472/", "name": "Sing Happy!"}, {"description": "Adoring & Adored: The Good Girls of Art Song\n\nAriana Strahl, soprano\nKathleen Kelly, piano\n\nGerman-born and Ann Arbor-based soprano Ariana Strahl (\"a real star presence\", Opera Today) joins beloved opera coach and pianist Kathleen Kelly for a program of art song written by and about women. The program will include works by Clara Schumann, Fanny Mendelssohn, and more!\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 1-2\n$15 General Admission\n$5 Student", "date": "2017-02-17T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1823728667894729/", "name": "Adoring & Adored: The Good Girls of Art Song"}]