[{"date": "2016-07-08T07:00:00-04:00", "source": "Facebook", "description": "This is one of our biggest- and favorite- One Day Sales! All self-serve bulk items are 30% off for one day only, so make some room in your pantry, grab some containers, and come see us this Friday :)\n\nThis sale applies to bulk items in our self-serve bins, and not on our packaged bulk items.", "url": "https://www.facebook.com/events/295464824122080/", "name": "30% Off Bulk- One Day Sale"}, {"date": "2016-07-08T11:00:00-04:00", "source": "Facebook", "description": "Aura Cacia Aromatherapy essential oils are 50% off through Thursday! Used for everything from making you smell good to massages, from soothing ailments to creating a soothing environment, essential oils have benefits big and small.", "url": "https://www.facebook.com/events/635642046590268/", "name": "Aura Cacia Essential Oils 50% Off"}, {"date": "2016-07-08T14:00:00-04:00", "source": "Facebook", "description": "Bill Crispin Chevrolet and the Main Street Area Association present the 22nd Annual “Rolling Sculpture Car Show” on July 8 from 2-10 pm.\n\nThe event itself is free and open to the public. Spectators enjoy the energy of more than 300 exotic, antique, classic, and one of a kind cars on Main, Liberty, and Washington Streets in downtown Ann Arbor.\n\nOur Hot Rod DJ, Surfer Joe, will be “spinning” all of your favorite, and soon to be favorite, hot rod songs throughout the show. Surfer Joe Productions has 25 hours of all hot rod tunes, and Joe will play his most popular 8 hours at the show. Stop by and make a request at the corner of Main and Liberty.\n\nThe Ann Arbor District Library will have family activities at their booth on Liberty Street between Fourth and Fifth Ave.\n\nAwards judged by Bill Crispin Chevrolet and other show sponsors will be presented at 7pm at the corner of Main and Liberty.", "url": "https://www.facebook.com/events/1717075365223531/", "name": "2016 Rolling Sculpture Car Show"}, {"date": "2016-07-08T14:00:00-04:00", "source": "Facebook", "description": "Bill Crispin Chevrolet and the Main Street Area Association present the 22nd Annual “Rolling Sculpture Car Show” on July 8 from 2-10 pm.\n\nTaking place in the heart of downtown Ann Arbor, the Rolling Sculpture Car Show is a one of kind experience for the car enthusiast. All cars are welcome to exhibit at the Show. Exhibitors pre register vehicles, $20. Show cars enter on Washington Street at Fifth.\n\nThe event itself is free and open to the public. Spectators enjoy the energy of more than 300 exotic, antique, classic, and one of a kind cars on Main, Liberty, and Washington Streets in downtown Ann Arbor. Plenty of public parking is available in all structures and surface lots. Visit www.a2dda.org for parking options.\n\nHot Rod DJ, Surfer Joe, will be “spinning” all of your favorite, and soon to be favorite, hot rod songs throughout the show. Surfer Joe Productions has 25 hours of all hot rod tunes, Joe will play his most popular 8 hours at the show. Stop by and make a request at the corner of Main and Liberty.\n\nThe Ann Arbor District Library will have family activities at their booth on Liberty Street between Fourth and Fifth. Stop by Ann Arbor’s 107one booth on Main Street and sign up for some great giveaways.\n\nThe special display area on E. Liberty between Fourth and Fifth will feature Studebakers. The Studebaker family, with a tradition of blacksmithing, began building wagons in South Bend, Indiana in 1852, and eventually became the world’s largest manufacturer of horse-drawn vehicles. Early in the 20th century they added electric, and then gasoline powered, vehicles (initially produced in Detroit). Studebaker was the only wagon and carriage manufacturer to successfully transition to motor vehicles into the modern era, ending production of automobiles in 1966. Though always outpaced by the Big Three financially, Studebaker often exhibited daring and ground breaking design, especially after World War II. One model, the Avanti, was so well regarded that it continued in production by various independent successor companies into 2006. This display will showcase vehicles dating back to 1880 all the way up to 2002.\n\nAwards judged by Bill Crispin Chevrolet and other Show sponsors presented at 7 pm at the corner of Main and Liberty.", "url": "https://www.facebook.com/events/1629489244034490/", "name": "Rolling Sculpture Car Show"}, {"date": "2016-07-08T19:00:00-04:00", "source": "Facebook", "description": "Literati is thrilled to launch the latest issue of the Michigan Review of Prisoner Creative Writing, produced by the Prison Creative Arts Project. You can learn more about PCAP and their work here.\n\n\"PCAP’s Michigan Review of Prisoner Creative Writing seeks to showcase the talent and diversity of Michigan's incarcerated writers.  The review features writing from both beginning and experienced writers - writing that comes from the heart, and that is unique, well-crafted, and lively.\"\n\nSelections from the issue will be read and copies will be available for sale.", "url": "https://www.facebook.com/events/1026985497386536/", "name": "Michigan Review of Prisoner Creative Writing"}, {"date": "2016-07-08T19:00:00-04:00", "source": "Facebook", "description": "Are you a big know it all? Come see if you've got what it takes to win a $25 gift card in our very first Trivia Night!", "url": "https://www.facebook.com/events/1730057410569128/", "name": "Trivia Night!"}, {"date": "2016-07-09T11:00:00-04:00", "source": "Facebook", "description": "Before joining the faculty of the Southern California Institute of Architecture in Los Angeles, Mira Henry spent several years as a project architect, immersed in the everyday, banal details of how buildings get built: construction drawings, material specs, and building codes. She became an expert in seeing the world the way an architect sees it. But as a progressive architectural thinker, Henry’s inspiration has been to deconstruct that vision, to “unsee” the very forms and representations that constitute an architect’s basic language.\n\nThrough speculative experiments and conceptual drawings Henry discovers in static architectural details an unsettling range of figurative expression, including, for example, the way the profiles of roof eaves resemble human heads. Wallpaper, with its ability to mask, transform, or animate a space, is also a prominent element in her work. Her projects explore how these features animate our subjective experience—what she calls our “shifting fantasies”—of architectural space.\n\nLead support for this exhibition is provided by the Herbert W. and Susan L. Johe Endowment.", "url": "https://www.facebook.com/events/402661156571041/", "name": "Mira Henry: The View Inside"}, {"date": "2016-07-09T14:00:00-04:00", "source": "Facebook", "description": "Multipurpose Room\n\nFree. Registration is required: email umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11 a.m. session or the 2 p.m. session and how many adults and children are in your group.\n\nUMMA's exhibition of Catherine Opie: 700 Nimes Road presents photographs of Hollywood legend Elizabeth Taylor's residence in Bel Air, California. Catherine Opie, a renowned contemporary photographer, captures the essence of Taylor's larger-than-life persona through her personal objects and mementos. July's Family Art Studio takes its inspiration from these captivating and often intimate images. Local artist and long-time UMMA docent Susan Clinthorne will lead families on an exploration of the gallery followed by a hands-on workshop. Designed for families with children ages six and up to experience and create art together. Parents must accompany children.", "url": "https://www.facebook.com/events/294501814230595/", "name": "Family Art Studio: Personal Treasures"}, {"date": "2016-07-09T17:00:00-04:00", "source": "Facebook", "description": "Join Ann Arbor Roller Derby at Buhr Park on July 9 for a Derby Double Header! Two great roller derby mash ups for one low price!\n\n6:00- Arbor Bruising Co. vs. Border City Brawlers All Stars \n\n7:30- Ypsilanti Vigilantes vs. Border City Brawlers Canadian Clubbers\n\nBouts include kid-friendly activities, half-time entertainment, sponsored concessions, and giveaways! \n\nDoors open at 5:00, first whistle at 6:00.\n\nEnjoy a cold Pabst Blue Ribbon, Founder's Pale Ale, or Angry Orchard Cider while you watch the games!\n\nAfter party location: * Aubree's Pizzeria and Grill* 39 E. Cross Street, Ypsilanti, MI 48198 * http://aubrees.com/", "url": "https://www.facebook.com/events/859375300833524/", "name": "Ann Arbor Roller Derby Double Header"}, {"date": "2016-07-09T21:00:00-04:00", "source": "Facebook", "description": "Join DJ Hardy & MC Yoda as we heat up the summer & celebrate with a beach party!\n\n• WEAR BEACH ATTIRE & PAY NO COVER! \n\n• HAPPY HOUR! From 9-11pm, 50% off all drinks, shots & bottled beers.\n\n• Beach decorations inside, and summer evening on our patio outside. We promise we'll play Summertime by Will Smith only once.\n\nFree before 10pm. Ladies free before 11pm. Otherwise, cover is $5 for 21+ and $8 for 18-20.", "url": "https://www.facebook.com/events/587229844772065/", "name": "Beach Party: Frequency Saturday"}]