[{"source": "Facebook", "name": "Oats & Woes Oatmeal Pop-up!", "description": "Oats & Woes & Babo, Oh My!\n\nBabo presents Oats & Woes Ann Arbor a local oatmeal pop-up! Launching The \"babo Study Buddy\" & \"The Nutty Professor\" for the first time EVER (See ingredients below)! \n\nEach bowl is packed with oats and topped with sweet and healthy breakfast options so you can fuel up for the day.\n\nWe will be selling each bowl individually and giving away our exclusive recipe so you can create your own oatmeal bowl at home!\n\nNo tickets are required for this event. \n\nbabo Study Buddy\n-Bob's Red Mill Oats\n-Strawberry compote\n-Fresh Strawberries\n-Fresh Avocados\n-Michigan Honey \n-babo Seedtrus Granola\n\nThe Nutty Professor \n-Bob's Red Mill Oats\n-Banana Compote\n-Justin's Peanut Butter\n-Coconut Oil\n-Bananas \n-Justin's Peanut Butter cup's\n-babo roasted peanuts", "url": "https://www.facebook.com/events/1725654407681535/", "date": "2016-04-19T09:00:00-04:00"}, {"source": "Facebook", "name": "Commute by Bus in Ypsi? Read this!", "description": "This event is geared toward Ypsilanti employees. \n\nDrop in to this casual informational workshop to find out how these bus service improvements could impact your bus commute. \n\nAlso welcome are any employees who may be interested in taking to bus but are unsure what to do.\n\nFree snacks and giveaways provided!\nRSVP: https://www.messageblocks.com/commute-by-bus-ypsi", "url": "https://www.facebook.com/events/617117388436683/", "date": "2016-04-19T13:10:00-04:00"}, {"source": "Facebook", "name": "Acoustic Tuesdays: Eric Moore", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-          April 19 - Eric Moore\nEric Moore is a familiar face on the Ann Arbor/Ypsi scene. A Pittsburgh native, Moore has been a human jukebox in dive bars, a songsmith on festival stages, and a hootenanny revivalist. Eric’s stellar fingerstyle work bumps down the jagged, thorny backroads of the Mississippi delta and skips over the seas to the British Isles. \n\nWhile he was working as a river guide in Grand Teton Nat’l Park, he frequented the  legendary Hootenanny at Dornans in Jackson Hole, WY. The Hoot’s mandate on traditional music was a scourge to many a songwriter, but not so for Moore. He began a spirited inquiry into acoustic guitar styles and the pre-war songbook. Taking cues from players like Bert Jansch, John Martyn, Archie Fisher and the Delta Blues great Tommy Johnson, Moore brings fresh arrangements and decades of performing experience to his spirited originals and traditional music from both sides of the Atlantic.\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/1699294757015373/", "date": "2016-04-19T19:00:00-04:00"}, {"source": "Facebook", "name": "Skazat! Poetry Series featuring Susan Hutton", "description": "Can you feel it? Spring? It's there hiding behind the snow -- come celebrate it with us! Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Reader\n\nThis month's feature: SUSAN HUTTON!\n\nSusan Hutton graduated from Kalamazoo College, and got an MFA from the University of Michigan. She held a Wallace Stegner fellowship in poetry at Stanford University. Her poems have appeared in magazines such as Poetry, Ploughshares, and FIELD. Her book, On the Vanishing of Large Creatures (Carnegie Mellon, 2007), won the John C. Zacharis First Book Award. She works at University of Michigan and is chair of the City of Ann Arbor Environmental Commission and a member of the Ann Arbor Climate Partnership.\n\n\nNext month's feature: STEVIE EDWARDS!", "url": "https://www.facebook.com/events/1536622576641711/", "date": "2016-04-19T19:00:00-04:00"}, {"source": "Facebook", "name": "SITA 2016 Auditions", "description": "Audtions WED & THU APRIL 20-21 4-7 PM\nCallbacks SAT APRIL 23 4-7 PM, East Quad Rom 1405\n \nNo monologue needed; Be prepared to work with scenes from the play.  Many roles are double cast.  Performances in June.", "url": "https://www.facebook.com/events/557979811041512/", "date": "2016-04-20T16:00:00-04:00"}, {"source": "Facebook", "name": "Meet Author & U of M Grad Monica Tesler for a Discussion & Signing of Her Debut YA Novel 'Bounders'", "description": "Monica Swanson Tesler is a graduate of the University of Michigan Law School, and is an attorney in Boston, where she lives with her family.\n\nIn the tradition of Michael Vey and The Unwanteds, twelve-year-old Jasper and his friends are forced to go up against an alien society in this first book in a brand-new adventure series \nThirteen years ago, Earth Force a space-military agency discovered a connection between brain structure and space travel. Now they ve brought together the first team of cadets, called Bounders, to be trained as high-level astronauts. \n\nTwelve-year-old Jasper is part of this team being sent out into space. After being bullied back on Earth, Jasper is thrilled to have something new and different to do with other kids who are more like him. While learning all about the new technologies and taking classes in mobility otherwise known as flying with jetpacks Jasper befriends the four other students in his pod and finally feels like he has found his place in the world. \n\nBut then Jasper and his new friends learn that they haven t been told everything about Earth Force. They weren t brought to space for astronaut training, but to learn a new, highly classified brain-sync technology that allows them to manipulate matter and quantum bound, or teleport. And it isn t long before they find out this new technology was actually stolen from an alien society.\nWhen Jasper and his friends discover the truth about why Earth Force needs them, they are faced with a choice: rebel against the academy that brought them together, or fulfill their duty and protect the planet at all costs.", "url": "https://www.facebook.com/events/1019071558166423/", "date": "2016-04-20T19:00:00-04:00"}, {"source": "Facebook", "name": "Fresh + Fit!", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "url": "https://www.facebook.com/events/1573275812982685/", "date": "2016-04-21T12:00:00-04:00"}, {"source": "Facebook", "name": "SITA 2016 Auditions", "description": "Audtions WED & THU APRIL 20-21 4-7 PM\nCallbacks SAT APRIL 23 4-7 PM, East Quad Rom 1405\n \nNo monologue needed; Be prepared to work with scenes from the play.  Many roles are double cast.  Performances in June.", "url": "https://www.facebook.com/events/557979811041512/", "date": "2016-04-21T16:00:00-04:00"}, {"source": "Facebook", "name": "Bacteria vs Viruses, Backyard Brains, & Beer Science", "description": "When bacteria, brains, and beer converge in one amazing place, you know it’s gotta be another edition of Nerd Nite Ann Arbor. Come by to hear Ada Hagan tell of the zombie apocalypse that occurs when a certain virus attacks bacteria. Dylan Miller will explain how to take over someone’s free will with DIY neuroscience, and Ryan Engemann will explainscientific development through beer while you order another pint. Come nerd out with us at LIVE, or miss your chance to learn about the zombie virus and cockroach control while drinking an enlightening brew!\n \nWhen: Thursday, April 21, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER! cuz Ann Arbor District Library said so\n\nAda Hagan - Predator vs. Prey: A Micro Tail\nBacteria are feared by humans for their ability to cause diseases that can't always be treated with antibiotics. But do bacteria have a predator of their own? Come learn about the virus that uses its \"tail\" to prey on bacteria, turning them into zombies. Predator versus prey may be a familiar story, but hear it with some new \"micro\" characters.  \n\nAbout Ada: Ada Hagan is a doctoral student at the University of Michigan in the department of Microbiology and Immunology. She does recon on the sneaky ways bacteria find nutrients (like iron!) when they are invading our bodies. Ada is a co-founder of the graduate student science communication blog MiSciWriters. Originally hailing from the mountains of East Tennessee, Ada spends her spare time writing, walking her dogs, cooking, and comparing strollers. Follow her on Twitter @adahagan.\n\nDylan Miller - The Body’s Electricity: From Cockroaches to You!\nHave you ever had the desire to lose your free will? Or, alternatively, have you ever had the desire to take someone's free will? This talk will discuss how Backyard Brains uses DIY-style neuroscience to bring to you direct control, via your muscle electricity, over cockroaches, machines, and even other humans!\n\nAbout Dylan: Dylan Miller came to Backyard Brains as an undergraduate in neuroscience.  He has since graduated from Michigan State University, and now works at BYB as a research scientist and on marketing.  He initially joined in order to apply the RoboRoach setup to controlling scorpions, and moved on to manage several other undergraduate DIY-neuroscience projects. He also studies the behavior of scorpions in a separate research lab at MSU. Follow him on Twitter @BraconidaeBaron.\n\nRyan Engemann - The Science of Beer\nBeer has been there from the beginning of the scientific revolution.  From providing sanitary nourishment to the development of modern medicine and pasteurization, beer has been an integral influence on the development of science.  Join Certified Cicerone® Ryan Engemann and explore this fascinating topic--over a pint, of course.  \n\nAbout Ryan: A nerd by nature, Ryan started working in the craft beer industry in Northern Michigan in 2011.  He became the first Certified Cicerone in Northern Michigan and now can be found selling beers and talking science at Brewery Vivant in Grand Rapids. Check out what he’s doing at the brewery via www.breweryvivant.com, or on Facebook, Instagram or Twitter @breweryvivant.", "url": "https://www.facebook.com/events/825233070915001/", "date": "2016-04-21T19:00:00-04:00"}, {"source": "Facebook", "name": "Poetry at Literati: Michael Delp, Zilka Joseph, & M.L. Liebler", "description": "Literati is pleased to welcome three authors from Wayne State University Press's Made in Michigan series: Michael Delp, Zilka Joseph, and M.L. Liebler.\n\nMichael Delp recently retired from the Interlochen Arts Academy, where he was the director of creative writing for many years. He is the author of numerous collections of prose and poetry, with his most recent collection of short stories being As If We Were Prey. He is also the mentor and advisor to the Front Street Writers Program in Traverse City, which operates under the auspices of the National Writers Series. He lives in Interlochen with his wife, Claudia, and splits his time between there and Reeling Waters, his cabin on the Boardman River.\n\nZilka Joseph teaches creative writing and is an independent editor and manuscript coach. Her chapbooks, Lands I Live In and What Dread, were nominated for a PEN America and a Pushcart award, respectively. She was awarded a Zell Fellowship, a Hopwood Prize, and the Elsie Choy Lee Scholarship (Center for the Education of Women) from the University of Michigan.\n\nM. L. Liebler is an award-winning poet, literary arts activist, and professor. He is the author of several books of poetry, including Wide Awake in Someone Else’s Dream, and an editor of the anthology Working Words: Punching the Clock and Kicking Out the Jams. He is also co-editor of Bob Seger's House and Other Stories. He has taught at Wayne State University since 1980.\n\nEvent date: \nThursday, April 21, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1780441212177400/", "date": "2016-04-21T19:00:00-04:00"}]