[{"url": "https://www.facebook.com/events/252286721802099/", "description": "We're celebrating dads with a free 12oz cup of coffee all day on Saturday! We'll have some fun coloring pages for all ages, too, so you can relax with a cup of joe and do some soothing coloring, to boot.", "source": "Facebook", "date": "2016-06-18T07:00:00-04:00", "name": "Coffee and Coloring for Dad"}, {"url": "https://www.facebook.com/events/1730586637224726/", "description": "Bring family and friends out to remove invasive weeds, opening space for tree seedlings and native wildflowers. The oak-hickory woods here overlook Argo Pond, and owls and hawks nest in the trees. Meet in the parking lot north of the Argo Canoe Livery, off Longshore Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "source": "Facebook", "date": "2016-06-18T09:00:00-04:00", "name": "Argo Park Stewardship Workday"}, {"url": "https://www.facebook.com/events/258245371187585/", "description": "Join the ARTBus on Saturday June 18 and don't miss the exclusive opportunity to feel firsthand the creative energy sweeping Detroit!\n\nWe will be heading to the Eastern Market neighborhood, which is rich with innovative and diverse art spaces. Our itinerary has been designed to showcase Detroit artists from emerging to established as well as strengthen the comradery amongst Art Center community members.\n\nLimited seating - Reserve your spot soon.\n\n**Members of the Ann Arbor Art Center receive a discounted price. To learn about our membership program please visit: https://goo.gl/oCflqB\n-----------------------------------------------------------\n ARTBus Art in the Market generously sponsored by: Sarah Whitsett Real Estate", "source": "Facebook", "date": "2016-06-18T09:00:00-04:00", "name": "ARTBus: Art in the Market"}, {"url": "https://www.facebook.com/events/1008482025896787/", "description": "We are gearing up for another week of culinary bliss during Ann Arbor's summer Restaurant Week! \n\nWe are featuring these special menus available in addition to our regular menu all week long.  \n-------------------------------------------------------------------------------\nSummer Restaurant Week 2016\n-------------------------------------------------------------------------------\nTwo for $15 lunch\nTax and gratuity not included\n•\tChoose one entrée for each person\no\tBBQ Tofu Sandwich\no\tWhitefish Po-boy\no\tChicken BLT\no\tCaesar Salad\no\tCherry Almond Salad\n-------------------------------------------------------------------------------\nTwo for $28 dinner per person\nTax and gratuity not included\n\nAppetizer\nTo share, please choose one\n•\tFried Pickle Spears \n•\tTruffle Sprouts\n•\tHummus and Pita \n\nEntree\nEach guest chooses one entree\n•\tMac and Cheese\n•\tFish and Chips\n•\tUrban Cowboy Bean Burger\n•\tAr-burger\n\nDessert or Beer\nTo share, please choose one\n•\tStout Chocolate pudding cake\n•\tStrawberries and Cream Belgian waffle\n•\tMaple Bourbon Bread Pudding\n\nNot interested in dessert? Swap it out for your choice of two 16oz drafts", "source": "Facebook", "date": "2016-06-18T11:00:00-04:00", "name": "Restaurant Week"}, {"url": "https://www.facebook.com/events/633284243500619/", "description": "The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink celebrates gifts to the Museum from two accomplished scholars with eclectic interests, a keen appreciation of form, and a love of learning from objects. Nesta Spink, curator at UMMA from 1967 to 1979, is regarded as the preeminent authority on the lithographs of James McNeill Whistler. U-M professor emeritus Walter Spink is a world-renowned specialist on early Buddhist art and architecture in India. This selection of their gifts, exhibited together for the first time, provides insight into the minds of two connoisseurs with tastes that range far beyond their areas of specialization; highlights include exquisite Whistler prints that are rarely on display and a rich representation of South Asian folk art. The Connoisseurs’ Legacy also honors the Spinks’ long relationship with the Museum, their roles as teachers of future scholars and curators, and their commitment to public education.\nLead support for this exhibition is provided by the University of Michigan Office of the Provost. Additional generous support is provided by the University of Michigan Center for South Asian Studies.", "source": "Facebook", "date": "2016-06-18T11:00:00-04:00", "name": "The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink"}, {"url": "https://www.facebook.com/events/1744465362502042/", "description": "Feel the Frequencies Workshop with - Patricia Yiu in the Crazy Wisdom Community Room - Reconnective Healing is a new form of health care that works by accessing the higher frequencies of the energy field that surrounds us.\n$ 10 FEE - REDEEMED AT YOUR FIRST SESSION\n\nContact: myinnersun2@gmail.com, (248) 662-7236\n\nhttp://www.myinnersun.com", "source": "Facebook", "date": "2016-06-18T11:00:00-04:00", "name": "Feel the Frequencies Workshop with Patricia Yiu"}, {"url": "https://www.facebook.com/events/478741615584046/", "description": "NEW SPRING MENUS!\n\nNew season, new Menu. Introducing new menu items that are seasonally fresh, bright, and delicious!\n\nBringing all things spring to the table, with new colorful and locally sourced food and beverage options. \n\nCheck out our new menus at http://aventuraannarbor.com \n\nMAKE A RESERVATION\nClick link listed in \"Tickets Available\"", "source": "Facebook", "date": "2016-06-18T12:00:00-04:00", "name": "New Spring Cocktail & Dinner Menus"}, {"url": "https://www.facebook.com/events/1693291780924029/", "description": "Jonathan Rudinger, RN LMT has been instrumental in developing the field of canine massage for people at home and PetMassageTM at the professional level since the mid-1990’s. PetMassage workshops draw students from all over the worlds.  Jonathan has authored several books and DVD’s and taught over 300 professional level canine massage workshops. \n\nJonathan will bring a dog with him to do hands-on demonstration of massage techniques.", "source": "Facebook", "date": "2016-06-18T13:00:00-04:00", "name": "Learn the Art & Essence of Canine Massage w/Jonathan Rudinger RN LMT"}, {"url": "https://www.facebook.com/events/173615043041761/", "description": "Literati is pleased to welcome Benjamin Landry as part of the Ann Arbor Book Festival's book crawl! Ben will read from his most recent collection, Burn Lyrics.\n\nBenjamin Landry is a poet currently residing in Ohio with his wife, the fiction writer Sara Schaff. A graduate of the University of Michigan (MFA, 2013), Middlebury College’s Bread Loaf School of English (MA, 2006) and Brown University (BA with teaching certification, 2000), he has taught English and creative writing for over a decade, at secondary and college levels, in the United States, Colombia and China. He is the author of An Ocean Away, Particle and Wave, and Burn Lyrics.", "source": "Facebook", "date": "2016-06-18T19:00:00-04:00", "name": "Benjamin Landry"}, {"url": "https://www.facebook.com/events/1553291858297260/", "description": "Magical Mitten Productions Presents: YOOKiE ft DOGFINGAZ, Tek - Mazter and Krippleninja\n\n>>>What is a Bassover Takeover?<<<\nThe Bassover Takeover is night filled with great music, beautiful artwork and friends new and old. We bring together some of the best names in modern bass music and pair that with local artists and vendors to create a truly immersive experience that satisfies all of your senses.  \n\n$10 limited early bird (online)\n$12 Presale and before 12am\n$15 at the Door after 12am\n\nTickets can be bought online at:\nhttp://www.brownpapertickets.com/event/2539753\n\n--------------Doors at 8pm---------------\n\n8:30-9:30\n++Secrt Asian Mn++\nhttps://soundcloud.com/secrt-asian-mn\nSAM, the Secrt Asian Mn, is currently very unheard of. He’d like to keep it that way too. His dream is to effectively turn around the EDM Scene from the shadows. SAM also surrounds himself in the college party scenario, playing for those who aren’t comprehensive and those who are lost within themselves… Those who like the unique music, not the Top 40. Those who like hard hitting trap and deep house. \nSAM will stay anonymous. SAM will always live anonymous.\n\n9:30-10:30\n++Krippleninja++ \nhttps://soundcloud.com/krippleninja\nI DJ , Make beats, Record, but mostly I make music I like \n\n10:30-11:30\n++Tek - Mazter++\nhttps://soundcloud.com/tek-mazter\nTek-Mazter is in the game for the love of the music and the process of creating it for other people's ears to enjoy. He never sticks to performing or creating just one genre, his mixes and tracks consist of anything from the heaviest Riddim Dubstep to Chill Trap. In his short career he has performed alongside DJ Starscream (Slipknot's DJ), has been local support for Truth, Eptic and AB The Thief, opened for Timeflies & Walk Off The Earth, DJ'd for D12's Bizarre and has played some legendary venues such as The Detroit Masonic Temple, St. Andrews Hall, Elektricity Nightclub and The Works Nightclub.\n\n11:30-12:30\n++DOGFINGAZ++\nhttps://soundcloud.com/dogfingaz\nBorn and raised in the suburbs of Shelby Township, Michigan. DOGFINGAZ is a producer/DJ of many\ndifferent genres. His music carries an array of bass, melody and unique vocal manipulation. Unrestrained by\n'genre', DOGFINGAZ transforms traditional styles and creates his own. He has a natural and original ear for\nall things music. DOGFINGAZ has propelled himself into the music scene using social media to self-promote.\nAmbitious and driven, he has made his mark and is here to stay.\n\n12:30-2\n++YOOKiE++\nhttps://soundcloud.com/sex-sex-and-more-sex\nThe art within the artificial: instrumentation computed in utter harmony with the brains of those willing to lend themselves, their ears, and their youth to the ends of ecstasy. Bass presence hums through a melody that leaves a gathering bouncing to its pulse; a perfect synergy of careless consequence and pure energy. It all centers around a single name: \"YOOKiE.\"\n\n\n-------------Local Vendors-------------\nODRD Collective\n\n\n-------- Live Art ------------------\nTBA\n\nIf you are intereted in vending or doing live art email MagicalMittenProd@gmail.com or Message Chris Stewart on FB thank you\n-One Love", "source": "Facebook", "date": "2016-06-18T20:30:00-04:00", "name": "Bassover Takeover: YOOKiE ft. Dogfingaz, Tek-Mazter & More"}]