[{"date": "2016-12-04T10:00:00-05:00", "description": "More than 30 local artisans and craftspeople offer their work for sale at our second annual Holiday Artisan Market.\n\nHigh-quality items available in a variety of media, including jewelry, fashion accessories, original illustrations, paintings, photography, note cards, fabrics, and more. A great opportunity to find original artisanal holiday gifts.\n\nParticipating artists: Adrienne Elliot, Creative Photo Effects LLC; Angeline Rebottaro, Mason and Birch; Angie Hauch, Straight From The Lake; Anke Eichstaedt-Trampler, Elophina; Cynthia Silveri, Passionate Colorist Adult Coloring Books; Ed Warzynie; Elizabeth Dreitzler, Twisted Lizard Ceramics; Emma Rand, Woodbury Rand; Gail Ristow, Bead Here Now; Gail Piepenburg; Jess Kohnert, Matthaei-Nichols staff; Jessica Nielsen, Jessica Nielsen Designs; Joan Mandell, Green Toe Gardens; John Megahan Megafauna Art; Julie Cohen; Julie Corey, Julie's Ceramics; Karrie Posio, Posio Studios; Kirsten Elling; Lacy Mrock, MRockStar Designs; Mark O'Brien; Mary F. Whiteside; Nancy Tychewicz; Nancy Bulkley; Paula Neys, Paula Neys Art; Penrith Goff, Goff Botanic Art; Quinn Burrell; Rachel Spall; Rena Hopkins, Bits and Oddments; Robin Goldsmith, Goldsmith Bead Designs; Stephanie King; Todd Marsee;  BioArtography - University of Michigan; Will Brinkerhoff, Will Brinkerhoff Photography;", "url": "https://www.facebook.com/events/1418553884838699/", "source": "Facebook", "name": "Holiday Artisan Market at Matthaei Botanical Gardens"}, {"date": "2016-12-04T10:00:00-05:00", "description": "This is your chance to take care of all your holiday shopping with handcrafted ceramic ware and art. Doors open at 10 AM both Saturday and Sunday. Work by more than 25 artisans under a large heated tent!", "url": "https://www.facebook.com/events/210498232693198/", "source": "Facebook", "name": "Winter Sale on Now: Dec, 3&4 10am-5pm"}, {"date": "2016-12-04T14:00:00-05:00", "description": "Ann Arbor Civic Theatre announces auditions for its main stage production of John Cariani’s Almost Maine, directed by Kat Walsh. Auditions take place Sunday, December 4th at 2pm and Monday, December 5th at 6:30 pm at 6155 Jackson Rd., Ann Arbor, MI 48103. (PLEASE NOTE: the general audition sessions are offsite). Callbacks are Tuesday, December 6th at 6:30 pm at the Ann Arbor Civic Theatre Studio. Those auditioning should attend one of the two regular audition dates, and should be available for callbacks. No pre-registration is required. All actors cast must attend a mandatory workshop on Saturday, January 7, 2017, from 1-6 pm. Rehearsals begin January 16. Production dates are March 9-12, 2017 at the Arthur Miller Theatre on UM’s North Campus.\n\nOne cold, clear Friday night in the middle of winter, while the northern lights hover in the sky above, Almost’s residents find themselves falling in and out of love in the strangest ways. Knees are bruised. Hearts are broken. Love is lost, found, and confounded. And life for the people of Almost, Maine will never be the same. \n\nThe show has 19 characters, but the director may double cast roles based on talent at auditions. Those auditioning do not need to prepare anything. Please wear movement clothes. \n\nPLOT AND CHARACTER BREAKDOWN:\n\n\nAlmost, Maine by John Cariani comprises nine short plays that explore love and loss in a remote, mythical almost-town called Almost, Maine. Almost, Maine is a town that’s so far north, it’s almost not in the United States—it’s almost in Canada. And it almost doesn’t exist. Because its residents never got around to getting organized. So it’s just…Almost. One cold, clear Friday night in the middle of winter, while the northern lights hover in the sky above, Almost’s residents find themselves falling in and out of love in the strangest ways. Knees are bruised. Hearts are broken. Love is lost, found, and confounded. And life for the people of Almost, Maine will never be the same. A note about this play from the playwright: \n\n\nThe people of Almost, Maine are not quaint, quirky eccentrics. They don't wear funny clothes and funny hats.  They don't have Maine accents.  They are not \"Down Easters.\"  They are not fishermen or lobstermen.  They don't wear galoshes and rain hats. They don't say, \"Ayuh.\" \n\nThe people of Almost, Maine are ordinary people. They work hard for a living.  They are extremely dignified. They are honest and true.  They are not cynical. They are not sarcastic. They are not glib. But this does not mean that they are dumb.  They're very smart. They just take time to wonder about things.  They speak simply, honestly, truly, and from the heart. They are never precious about what they say or do.", "url": "https://www.facebook.com/events/1051418098337234/", "source": "Facebook", "name": "Auditions for Almost, Maine"}, {"date": "2016-12-04T15:00:00-05:00", "description": "Join us for an afternoon with four local debut Young Adult authors for a discussion and signing. \n\nAuthors participating: Kirstin Bartley Lenz, Heather Smith Meloche, Darcy Woods and Erica M. Chapman \n\nKristin Bartley Lenz:\n\nKristin Bartley Lenz is a Michigan writer and social worker who fell in love with the mountains when she moved to Georgia and California. Now she’s back in Detroit where she plots wilderness escapes and manages the Michigan Chapter blog for the Society of Children’s Book Writers and Illustrators (SCBWI-MI). THE ART OF HOLDING ON AND LETTING GO is her debut young adult novel.\n\n‘The Art of Holding on and Letting Go’ \n\nCompetitive climber Cara Jenkins feels most at home high off the ground, clinging to a rock wall by her fingertips. She's enjoyed a roaming life with her mountaineering parents, making the natural world her jungle gym, the writings of Annie Dillard and Henry David Thoreau her textbooks. But when tragedy strikes on an Ecuadoran mountaintop, Cara's nomadic lifestyle comes to an abrupt halt. \nStarting over at her grandparents home in suburban Detroit, Cara embarks on a year of discovery, uncovering unknown strengths, friendships, and first love. Cara's journey illustrates the transformative power of nature, love and loss, and discovering that home can be far from where you started.\n\n********\nHeather Smith Meloche\n\nHeather Smith Meloche’s work has appeared in SPIDER, YOUNG ADULT REVIEW NETWORK (YARN), and ONCE UPON A TIME, and she has placed twice in the children’s/YA category of the WRITER’S DIGEST Annual Competition. Her short story, “Him,” won the HUNGER MOUNTAIN Katherine Paterson Prize for Young Adult and Children’s Writing in 2011, and Heather’s novel, RIPPLE, released September 20, 2016, is based on that short work. She lives in Rochester Hills.\n\nWith her impossible-to-please grandmother on her back about college and her disapproving step-dad watching her every move, Tessa would do anything to escape the pressure-cooker she calls home. So shefinds a shot of much-needed power and confidenceby hooking up with boys, even though itmeans cheating on her boyfriend.But when she's finally caught red-handed, she ll do anything she can to cover up what she's done. \n\nJack is a prankster who bucks the system every chance he gets each transgression getting riskier and riskier. He loves the thrill, and each adventure allows a little release because his smug smile and suave demeanor in the face of authority doesn t make life at home with his mom any less tough. He tries to take care of her, but the truth is he's powerless in the face of her fragile mental health. So he copes in his own way, by defacing public property and pulling elaborate pranks, though he knows in the end this ll only screw up his life even more. \n\nAs they both try not to let their self-destructive patterns get the best of them, Tessa and Jack gravitate toward one another, discovering the best parts of themselves in the process. An honest portrayal of the urges that drive us and finding the strength to overcome them, Ripple is a stunning debut from a powerful new voice.\n\n********\nDarcy Woods\n\nDarcy Woods had three big loves in grade school: Reading, writing, and pizza day. Some things never change. She now lives in Michigan with her madly supportive husband, and two tuxedo cats who overdress for everything. Once upon a time, she was in a US Army aviation unit and threw live grenades. Now she throws words. SUMMER OF SUPERNOVAS, a YA contemporary romance, is Darcy’s first novel and is published by Random House/Crown BFYR.\n\n‘Summer of Supernovas’\n\nFans of Jennifer E. Smith and Jenny Han will fall in love with this heartfelt and humor-laced debut following one zodiac-obsessed teen as she struggles to find the guy of her cosmic dreams. \nAs the daughter of an expert astrologer, Wilamena Carlisle knows that truth lies within the stars. So when she discovers a planetary alignment that won t repeat for a decade, she's forced to tackle her greatest astrological fear: The Fifth House relationships and love. But Wil must decide whether to trust her heart or her chart when she falls for a sensitive guitar player whose zodiac sign points to cosmic disaster. \n\nIf Wil's fate is truly written in the stars, then this summer is about to go supernova. . . . \n\n********\nErica M. Chapman\n\nErica M. Chapman is a young adult author who writes dark, emotional novels with a burst of humor, and lighter contemporaries with smart-ass protagonists. Her first novel, TEACH ME TO FORGET will be published by Merit Press on 12/02/16. Her writing is represented by the lovely Christa Heschke of McIntosh & Otis. She's a member of SCBWI and a lifetime Lions and Michigan football fan who loves alternative music. She blogs, tweets, and watches various CW & Freeform shows while typing her next story on her MacBook in a Detroit Lions Snuggie.\n\n‘Teach Me to Forget’\n\nEllery wants to die. Nothing is going right. Her younger sister is dead, and her family is in a shambles. But on the day that she tries to end it all, even the gun won't work. When she tries to return it, she's intercepted by a security guard who also happens to be a boy in one of her classes, Colter Sawyer. Colter recognizes Ellery's desperation and begins working hard to earn her trust. Why does this cute boy care about my worthless life?, Ellery wonders. But as the story unfolds, it becomes clear that Colter has very good reasons for his vigilance, deep, personal reasons. And whether Ellery likes it or not, he won't let go.", "url": "https://www.facebook.com/events/214594198975054/", "source": "Facebook", "name": "Sunday Afternoon with Local YA Debut Authors"}, {"date": "2016-12-04T16:00:00-05:00", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "url": "https://www.facebook.com/events/140763576393408/", "source": "Facebook", "name": "Beer and Board Games"}, {"date": "2016-12-04T19:00:00-05:00", "description": "We had to make our last feature reading of 2016 an epic double feature with two incredible poets!\n\nSiaara Freeman is a friendly neighborhood hope dealer. She does it through poems whether on stage or on page with no apologies. She hope she gets caught doing it over & over again. She has been Slam Champion in Colombus, OH as well as her hometown of Cleveland. She's an internationally touring artist and has been a featured performer at dozens and dozens of venues, including the Green Mill, Nuyorican Poets Cafe, Writing Wrongs, and Writer's Block. It's how she eats. She likes to eat. Her work appears in Tinderbox Journal, Crab Fat Magazine, Texas Borderland Review, Rat's Ass Review, UpTheStairCaseQuarterly, Black Napkin Press, Chicago Literati, Milk Journal, FreezeRay, Glass Poetry & others. She has upcoming work in Mercurial Noodle Anthology & The Hysteria Anthology, with Lucky Bastard Press. She's been nominated for Best New Poets, Best of the Net, and Pushcart Prize, and she is crossing her fingers-- in the meantime she is growing her afro so tall, God will mistake it for a mic and speak into her.\n\nScott Beal’s first full-length collection, Wait ‘Til You Have Real Problems, was published by Dzanc Books in November 2014. His poems have appeared in Rattle, Prairie Schooner, Beloit Poetry Journal, Indiana Review, Muzzle, Southern Indiana Review, The Collagist, Sonora Review, and many other journals. He's won several awards, including a 2014 Pushcart Prize for the poem “Things to Think About.” Beal teaches full-time in the Sweetland Center for Writing, the English Department Writing Program, and the Lloyd Hall Scholars Program at the University of Michigan, and serves as Dzanc Writer-in-Residence for Ann Arbor Open School. He has led poetry and fiction workshops for the Neutral Zone, the InsideOut Literary ArtsProject, 826michigan, and other organizations. He earned his MFA from the University of Michigan in 1996, where he received several Hopwood Awards. Beal has competed in the Individual World Poetry Slam and has been a featured performer at schools, bookstores, and poetry slams around the country, including the Green Mill in Chicago, the Nuyorican Poet’s Cafe in New York, and the Cantab Lounge in Boston. He curates and co-hosts the Skazat! monthly poetry series in Ann Arbor, Michigan.", "url": "https://www.facebook.com/events/1041959882596378/", "source": "Facebook", "name": "Open Mic and Double Feature: Siaara Freeman and Scott Beal"}, {"date": "2016-12-04T19:00:00-05:00", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/1825737647671780/", "source": "Facebook", "name": "The Arcade - A Pointless Improv Jam"}, {"date": "2016-12-05T14:00:00-05:00", "description": "Ann Arbor Civic Theatre announces auditions for its main stage production of John Cariani’s Almost Maine, directed by Kat Walsh. Auditions take place Sunday, December 4th at 2pm and Monday, December 5th at 6:30 pm at 6155 Jackson Rd., Ann Arbor, MI 48103. (PLEASE NOTE: the general audition sessions are offsite). Callbacks are Tuesday, December 6th at 6:30 pm at the Ann Arbor Civic Theatre Studio. Those auditioning should attend one of the two regular audition dates, and should be available for callbacks. No pre-registration is required. All actors cast must attend a mandatory workshop on Saturday, January 7, 2017, from 1-6 pm. Rehearsals begin January 16. Production dates are March 9-12, 2017 at the Arthur Miller Theatre on UM’s North Campus.\n\nOne cold, clear Friday night in the middle of winter, while the northern lights hover in the sky above, Almost’s residents find themselves falling in and out of love in the strangest ways. Knees are bruised. Hearts are broken. Love is lost, found, and confounded. And life for the people of Almost, Maine will never be the same. \n\nThe show has 19 characters, but the director may double cast roles based on talent at auditions. Those auditioning do not need to prepare anything. Please wear movement clothes. \n\nPLOT AND CHARACTER BREAKDOWN:\n\n\nAlmost, Maine by John Cariani comprises nine short plays that explore love and loss in a remote, mythical almost-town called Almost, Maine. Almost, Maine is a town that’s so far north, it’s almost not in the United States—it’s almost in Canada. And it almost doesn’t exist. Because its residents never got around to getting organized. So it’s just…Almost. One cold, clear Friday night in the middle of winter, while the northern lights hover in the sky above, Almost’s residents find themselves falling in and out of love in the strangest ways. Knees are bruised. Hearts are broken. Love is lost, found, and confounded. And life for the people of Almost, Maine will never be the same. A note about this play from the playwright: \n\n\nThe people of Almost, Maine are not quaint, quirky eccentrics. They don't wear funny clothes and funny hats.  They don't have Maine accents.  They are not \"Down Easters.\"  They are not fishermen or lobstermen.  They don't wear galoshes and rain hats. They don't say, \"Ayuh.\" \n\nThe people of Almost, Maine are ordinary people. They work hard for a living.  They are extremely dignified. They are honest and true.  They are not cynical. They are not sarcastic. They are not glib. But this does not mean that they are dumb.  They're very smart. They just take time to wonder about things.  They speak simply, honestly, truly, and from the heart. They are never precious about what they say or do.", "url": "https://www.facebook.com/events/1051418098337234/", "source": "Facebook", "name": "Auditions for Almost, Maine"}, {"date": "2016-12-05T17:00:00-05:00", "description": "Calling all Ann arbor Beer Lovers!! \n\nThe revered head brewers of Arbor Brewing Company (Chris), Blue Tractor (Pat) and Grizzly Peak (Duncan) joined forces to bring you Washingtonacity, an English Bitter brewed at each location by all 3 brewers.\n\nWe are together hosting a Washington Street pub crawl starting at 5PM Monday, December 5th. Blue Tractor BBQ & Brewery, Arbor Brewing Company and Grizzly Peak Brewing Company will each be serving their versions of the collaboration beer. Each beer was brewed with the same malts and hops, while featuring a different traditional yeast strain at each brewery.\n\nThe brewers will kick off the crawl at Blue Tractor at 5, moving to ABC at 6, and to the GP Den at 7. \n\nThe event is open to the public and we hope to see our collective fans there!", "url": "https://www.facebook.com/events/205495663241203/", "source": "Facebook", "name": "Washingtonacity Pub Crawl"}, {"date": "2016-12-06T10:00:00-05:00", "description": "Don't miss our holiday display Avant Garden: Weaving Fashion & Nature Together. The exhibit explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs Saturday, November 26, 2016-Sunday, January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "url": "https://www.facebook.com/events/723312037871156/", "source": "Facebook", "name": "Holiday Exhibit - Avant Garden"}]