[{"date": "2016-03-22T17:30:00-04:00", "source": "Facebook", "description": "Free and open to the public. Seating is first come, first serve.\n\nIn his video work Metamorphosis Chat, on view at UMMA through March 27, Turkish artist Ferhat Özgür offers a warm and intensely personal experience of what has become a complex moral debate within Turkish culture: wearing the headscarf. Two women, clearly dear friends, decide to swap clothing—one woman is wearing a headscarf and no other adornment, the other more modern attire—and experience what it's like to literally and figuratively walk in each other's shoes. Their expressions of friendship, compassion, and respect for one another, are symbolic of the potential for human kinship and understanding. Join U-M Institute for the Humanities Curator Amanda Krugliak, and Professors Gottfried Hagen (Turkish and Near Eastern Studies), Christiane Gruber (History of Art), and Heidi Kumao and David Chung (School of Art and Design), for an informal and dynamic discussion that will consider Özgür’s piece from cultural as well as artistic points of view.\n \n5:30 pm Metamorphosis Chat (9:25 min), Media Gallery\n6-7 pm Discussion, Multipurpose Room\n\n\nThis program is presented in partnership with the U-M Institute for the Humanities and co-sponsored by the Islamic Studies Program and the Weiser Center for Emerging Democracies.\n\nLead support for Ferhat Özgür: Metamorphosis Chat is provided by SAHA – Supporting Contemporary Art from Turkey, the University of Michigan Institute for the Humanities, and the Herbert W. and Susan L. Johe Endowment. Additional support is provided by the University of Michigan Islamic Studies Program, the Institute for Research on Women and Gender, the Weiser Center for Emerging Democracies, the Center for Middle Eastern and North African Studies, and Women’s Studies.", "url": "https://www.facebook.com/events/752170941481803/", "name": "Metamorphosis Chat: Of Turkish Living Rooms and Transformation"}, {"date": "2016-03-22T17:30:00-04:00", "source": "Facebook", "description": "Two years ago, in the DeBoer v Snyder case, Judge Bernard Friedman opened a window for marriage equality. The window lasted less than 24 hours. In that time 320 same-sex couples in four counties married.\n\nMartin and I were one of those couples. We plan on celebrating with any other couples who would like to join us. We picked early evening so there is time for folks to continue the celebration on their own.\n\nPlease join us for a champagne toast and light hors d'ouevres as we celebrate this important date in our collective lives.\n\nLet us know in the comments section if you will be joining us. All are welcome, with special hope that some of our fellow-anniversaires can join us.", "url": "https://www.facebook.com/events/1583067855352851/", "name": "Over 300 Club 2nd Anniversary"}, {"date": "2016-03-22T19:00:00-04:00", "source": "Facebook", "description": "Featuring Pio Tosini Prosciutto di Parma \n\nThis sweet ham, cured in the town of Langhirano, Italy, bears the honorable mark of the Consorzio del Prosciutto di Parma signifying its exceptional quality and rigorous curing processes. The family-owned and operated Pio Tosini company has become one of the most credible and sought-after producers of Prosciutto di Parma and has been in operation for over 80 years. There are only four ingredients that go into this ham and they are Italian pigs, salt, air and time. At Pio Tosini, a curing time of over 500 days (more than 100 days longer than typical prosciutto production) allows for slow and even salt penetration, assuring the sweetness of the hams. Each ham is trimmed, deboned by hand and personally selected.\n\nThe roots of the Pio Tosini company run deep and date back to the beginning of the last century (1905) in the heart of northern Italy, where Ferrante Tosini (Pio Tosini’s father) started his business slaughtering pigs and curing his own cuts of pork meat in the back room of the family’s grocery store. After World War I he was assisted by his young son Pio and together they gradually improved the business, experimenting with new processing techniques and curing methods. Today Pio Tosini is still a family company, with Ferrante’s great-grandson and Pio’s grandson Giovanni Bianchi carrying out the traditions of the 111 year old company.\n\nChef Alex and Giovanni have collaborated on a menu that highlights the complex flavors of the ham throughout the meal, each course celebrating the sweetness of the hams. Giovanni will be at the Roadhouse to share his family’s story and lead us through a tasting of these delicious hams.\n\n$80 a person (price includes dinner, tax and gratuity - beverages additional)\n\nAmuse Bouche\nBurrata with Prosciutto and Hazelnut Romesco\n\nAppetizer Course\nTorta Fritta with Prosciutto and Fig Preserves\n\nSoup Course\nFennel Soup with Pecorino and Crispy Prosciutto\n\nEntree Course\nJohn Dory with Potatoes de Parma and Roasted Pepper Coulis\n\nDessert Course\nSweet Ricotta Balls with Maraschino Soaked Orange", "url": "https://www.facebook.com/events/217835468568017/", "name": "A Parma Farmhouse Dinner"}, {"date": "2016-03-22T19:00:00-04:00", "source": "Facebook", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-          March 22 – Kevin Devine\nKevin Devine is an Ann Arbor-based singer, songwriter and entertainer whose fans range in age from kindergartners to 106- year-olds. Kevin has performed thousands of shows from Berlin, Massachusetts to Wetumpka, Alabama to Sunville, Michigan and everywhere in between, including children's and family concerts, senior citizen sing-alongs and \"big kid\" shows in pubs and clubs with various bands, like his current Ann Arbor band, Kevin & the Glen Levens, a roots/Celtic/Americana band. His shows feature a fast-paced ramble through a dozen genres with an emphasis on novelty songs, audience participation and improvisation bordering on chaos.  And accordions.\n\n-      March 29 - Dave Menzo\nhttp://www.davemenzo.com/\nDave Menzo is a solo artist who has the pleasure of playing with a few bands and many talented musicians.\n\nAPRIL\n\n-          April 5 - Bob Skon \nhttp://bobskon.com/\n\"Bob is a musician best described in the singer / songwriter style, blended with a healthy dose of folk-rock, and a touch of jazz.... He has a wonderful ability to use intelligent wordplay for capturing those moments in life we can all identify with. In this Bob could be a peer of the legendary Ray Davies.\" - The Bodhisattva Beat\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/822282524550244/", "name": "Acoustic Tuesdays: Kevin Devine"}, {"date": "2016-03-22T20:00:00-04:00", "source": "Facebook", "description": "It's that time of the year! This is the annual LGBTQ+ dance party you do not want to miss. Theme: SUPERQUEEROES! Dress to the nine or come casual.\n\nLocation: EMU Student Center Ballroom\nContact: Chase Anderson\nPhone: 734.487.4149\nEmail: lgbtrc@emich.edu\nCost: Free\nOpen to the public\nLBC Approved: No", "url": "https://www.facebook.com/events/154938721559419/", "name": "EMU Pride Prom 2016"}, {"date": "2016-03-23T10:00:00-04:00", "source": "Facebook", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "url": "https://www.facebook.com/events/1716312661946739/", "name": "TheRide’s ServiceFest"}, {"date": "2016-03-23T18:00:00-04:00", "source": "Facebook", "description": "Join us for this free event!\n\nOur March Artists' Meet & Greet topic is \"How to write an artist statement\". \n\nSPEAKER: Maya West\n\nMaya West is a freelance writer, translator, and designer splitting her time between Ann Arbor, Michigan and Seoul, Korea. She currently works in administration at the Helen Zell Writers' Program at the University of Michigan, where she graduated with an MFA in Fiction in 2014.\n\n---------------------------\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/", "url": "https://www.facebook.com/events/968784676489949/", "name": "How to Write an Artist Statement"}, {"date": "2016-03-24T11:00:00-04:00", "source": "Facebook", "description": "What is it?\nWe are working with the community to help\ncreate a light rail transit system that will\nconnect downtown to world-class medical\ncenters. Central Campus to North Campus.\nPlymouth Road to Main Street shops. All with\ngreater capacity. Greater comfort. More\nsustainably powered. Faster, more reliable\nservice. And setting Ann Arbor up for the next\ncentury.\n\nThese Open House Events will include\nproject staff and representatives from\nthe collaborating organizations to answer\nquestions and record comments.\nWe’ll provide an overview of the project to\ndate and the draft recommendations of\nthe consultant and Project Management\nCommittee.\n\nAreas of discussion:\n• Type of transit technology\n• Configuration of the route\n• Station locations\n• Cost estimate\n• Future expansion possibilities\n\nThis is the fourth in a series of public input\nopportunities. Previous meetings were held in\nDecember 2012, June 2013, and November,\n2013.\n\nFor more information about the project, please\ncontact us at info@aaconnector.com", "url": "https://www.facebook.com/events/1053725137981528/", "name": "Connector Open House"}, {"date": "2016-03-24T17:30:00-04:00", "source": "Facebook", "description": "The Zell Visiting Writers Series Presents:\n\nLyrae Van-Clief Stefanon Q&A\nThursday, March 24th, 2pm\nHopwood Room\n\nLyrae Van-Clief Stefanon Poetry Reading & Book Signing\nThursday, March 24th, 5:30 pm\nUMMA Helmut Stern Auditorium \n\nAll events free & open to the public.\n\n* * *\nLyrae Van Clief-Stefanon is the author of Open Interval, a 2009 National Book Award finalist,and Black Swan, winner of the 2001 Cave Canem Poetry Prize, as well as Poems in Conversation and a Conversation, a chapbook in collaboration with Elizabeth Alexander. Her work has appeared in such journals as African American Review, Callaloo, Crab Orchard Review, Gulf Coast, and Shenandoah, and in the anthologies Bum Rush the Page, Role Call, Common Wealth, Gathering Ground, and The Ringing Ear: Black Poets Lean South. She is currently at work on a third collection, The Coal Tar Colors.\n\nFor more info, please visit: https://events.umich.edu/event/26827", "url": "https://www.facebook.com/events/837658899685192/", "name": "Lyrae Van-Clief Stefanon Poetry Reading & Book Signing"}, {"date": "2016-03-24T18:00:00-04:00", "source": "Facebook", "description": "What is it?\nWe are working with the community to help\ncreate a light rail transit system that will\nconnect downtown to world-class medical\ncenters. Central Campus to North Campus.\nPlymouth Road to Main Street shops. All with\ngreater capacity. Greater comfort. More\nsustainably powered. Faster, more reliable\nservice. And setting Ann Arbor up for the next\ncentury.\n\nThese Open House Events will include\nproject staff and representatives from\nthe collaborating organizations to answer\nquestions and record comments.\nWe’ll provide an overview of the project to\ndate and the draft recommendations of\nthe consultant and Project Management\nCommittee.\n\nAreas of discussion:\n• Type of transit technology\n• Configuration of the route\n• Station locations\n• Cost estimate\n• Future expansion possibilities\n\nThis is the fourth in a series of public input\nopportunities. Previous meetings were held in\nDecember 2012, June 2013, and November,\n2013.\n\nFor more information about the project, please\ncontact us at info@aaconnector.com", "url": "https://www.facebook.com/events/1650481561881321/", "name": "Connector Open House"}]