[{"description": "Become a part of NAP’s Volunteer Burn Crew! This is the required training session for anyone interested in assisting with NAP’s controlled burns. Meet at Leslie Science and Nature Center’s Nature House. Burns typically take place Monday through Friday between noon and 7 p.m. Registration is required by February 21, as enrollment is limited. Call 734.794.6627 or email NAP@a2gov.org to register or for more information", "date": "2017-02-23T12:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/383615658683165/", "name": "Volunteer Burn Crew Training"}, {"description": "Literati is pleased to welcome Eleni Sikelianos in support of her most recent work, Make Yourself Happy.\n\nUsing text and images, moving spikily across the page and across ideas in ever-expanding loops, Make Yourself Happy is devoted to one of the oldest and most important human questions: how to live. Humanity, happiness, and the survival of the biosphere spin each section forward, species are wiped out, yet the poem endures. \n\n“In Make Yourself Happy, Eleni Sikelianos evinces a neuro-psychological state counter to the miswrought biology that has haunted the Occident since the dawn of Roman times. These poems open the neurology to its whole participation in the psycho-physical field and are not unlike the seminal amplification of indigenous culture, where the language of the body simultaneously circulates with living metastates. These poems organically form as environmental respiration that only the poet can approach in the latter days of this techno-hypercritical epoch.” —Will Alexander\n\n“This poem is addressed to you. You want to be happy, don’t you? In deceptively simple sentences, it tells you how to ‘make yourself happy.’ You might aspirate on honey, for instance. Play connect the dots and the extinct animals pop out. Did you kill them all to make yourself happy? Here you will bask in the syllabic glow of the ‘shirred / aggregates / mineral iridium / irresidue.’ This book is your invitation to the post-human pool party of the future.” —Rae Armantrout\n\n“With her native Greek wisdom and her American exuberance, Eleni takes us into the different layers which make our daily lives, perceptions, thoughts . . . as they take form, and thanks to her become an initiatique, even archeological, journey. Besides the pleasure we feel, we see here a moral endeavor, an invitation to make ourselves happy. Her journey finds its energy in her perfect ear for language and immense generosity of heart. Her openness lets in the sinuosities and cracks of what we may well end up calling ‘being,’ in her great project of telling us, in these worst moments of actual history, to be (urgently) happy because we are . . . happy. And let me share at least one epiphany: ‘to graze in / winter in snow- / free meadows.’” —Etel Adnan\n\nEleni Sikelianos is the author of six books of poetry, most recently The Loving Detail of the Living and the Dead and The California Poem, which was a Barnes & Noble Best of the Year, as well as hybrid memoirs, The Book of Jon and You Animal Machine (The Golden Greek). Sikelianos teaches in the Creative Writing Program at the University of Denver. A California native, longtime New Yorker, and world traveler, she now lives in Boulder with her husband, the novelist Laird Hunt, and their daughter, Eva Grace.\n\nEvent date: \nThursday, February 23, 2017 - 7:00pm", "date": "2017-02-23T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1997490890478309/", "name": "Poetry at Literati: Eleni Sikelianos"}, {"description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "date": "2017-02-23T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/254338798323472/", "name": "Sing Happy!"}, {"description": "Test Batch features the newest crop of improv groups in our community. Come and watch these troupes test their chops on the Pointless stage. When they are all inevitably famous, you can say \"I saw them way back when....\"\n​\nThis month's line up:\n- &mpersand\n- The Shadow League\n- Mountain Dude\n- Low Estrogen\n- The Travel Band", "date": "2017-02-23T19:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1637034633267865/", "name": "Test Batch - February"}, {"description": "React Presents...\n\n:: REZZ ::\n\nAbout REZZ: Isabelle Rezazadeh, better known as Rezz, is an Electronic music producer from Niagara Falls, Ontario.\n\nIn high school, she was a track and field athlete and attended numerous raves throughout North America. After questioning her path in life, Rezz started producing music in November of 2013. Ever since, she has spent hours of perfecting her craft by spending 14 hours a day creating tracks and mixes on her computer.\n\nRezz wears glasses as an ode to hypnosis and has built her brand around it. Her idea of live shows is trying to hypnotize the audience in a trance. Her preferred BPM is 100.\n\nwith opening sets from AceMyth & Quarter Royce\n\nWatch: https://www.youtube.com/channel/UCtwUQkIwxND316D_kx0yBdg/videos\nListen: https://soundcloud.com/official-rezz\nTalk: https://twitter.com/OfficialRezz\nMeet: https://www.facebook.com/OfficialREZZ/\nPeek: https://www.instagram.com/officialrezz\n\nDoors at 9:00pm | 18+ Welcome with proper ID | VIP Services available. Contact: VIP@necto.com\n\nNecto\n516 E. Liberty\nAnn Arbor, MI\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet\n\nConnect with Necto\nwww.necto.com\nwww.facebook.com/NectoNightclub\nwww.twitter.com/Necto\nwww.instagram.com/nectonightclub", "date": "2017-02-23T21:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1831441243800571/", "name": "Rezz: Something Wrong Here Tour - Ann Arbor"}, {"description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "date": "2017-02-24T10:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/230775294023258/", "name": "Exhibit: Avant Garden-Fashion & Plants Together!"}, {"description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "date": "2017-02-24T11:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1724899501156129/", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration"}, {"description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "date": "2017-02-24T15:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1138729056224663/", "name": "Drink & Draw / Imbibe & Inscribe"}, {"description": "There's no winter warmer like the Winter Beer Festival! Join us in Comstock Park for the Michigan Brewers Guild's annual Winter Beer Festival. Beer list forthcoming! Saturday is sold out, but get your Friday tickets here: http://www.mibeer.com/winter-festival", "date": "2017-02-24T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/634509003388839/", "name": "Winter Beer Festival"}, {"description": "Coffee and board games are a part of a long, sacred partnership; each is enhanced and made better by the other. Scholars have argued that neither can actually be enjoyed at all on their own and I think that they may be on to something. 'Twas ever thus. \n\nIn the spirit of this storied tradition, Vault of Midnight is happy to be partnering up with our friends over at Roos Roast for what is destined to be a pretty kick butt night of board gaming, friendship building, and coffee drinking. \n\nFor a mere $8, you may secure your spot and join in the raucous game-playing and general merriment. Tickets are available at Vault of Midnight Ann Arbor and will not only grant you entry to this event, but will also serve as a voucher for one Roos Roast beverage. AND THAT'S SOMEHOW NOT ALL: your ticket ALSO acts as a 10% off one game coupon! What a busy little ticket!\n\nTICKETS ON SALE NOW!", "date": "2017-02-24T18:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/225509001252321/", "name": "Game Night at Roos Roast"}]