[{"date": "2017-07-23T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/185948751938446/", "name": "Beer and Board Games", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor."}, {"date": "2017-07-23T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/159270494616757/", "name": "Open Stage", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 8 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters.\n\nSpace is limited, so the first 12 to sign up get a spot!\n\n​Sign up here: https://goo.gl/forms/wi2xBVkQ8eFSa8RD3\n\nFree for performers, pay-what-you-can for spectators."}, {"date": "2017-07-24T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1671598346477834/", "name": "Summer Drama Camp: \"Under the Sea\"", "description": "Join us for a week filled with fun as we swim down below the deep blue sea to become the animals and sea life. Glub glub glub. . . .\n​\nOur drama day camps are focused on providing young people with a safe place to explore their creativity. This class includes warm up exercises, drama games, improvisation exercises, crafts, and of course lots of fun. The activities will be focused on all things ocean related, both real and imagined.\n​\nOn the last day of class we will have a showcase of some of the skills the children have learned throughout the course.\n​\nThe class will take place at the Pointless School of Improv, 3060 Packard, Suite B in Ann Arbor (6 doors down from the main Pointless). The Friday showcase will take place at 11:30 am on the Pointless Stage, 3014 Packard.\n\nJuly 24 - 28, 9:00 am - noon\nAges 5 - 9\n$170"}, {"date": "2017-07-24T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1370541529708778/", "name": "Straight Up | Featuring Shingo Brown", "description": "Join us at Alley Bar on Monday, July 24 at 7pm for a one night only, pop-up art show and sale featuring work by Shingo Brown, with a DJ set and drink specials all night!\n\nThis event is free and open to the public\n\nLearn more: https://goo.gl/jZ23jR"}, {"date": "2017-07-25T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/135719100347452/", "name": "Skazat! Poetry Series featuring A2 Youth Poetry Slam Team", "description": "Help us welcome home the Ann Arbor Youth Slam Team, who will just be returning from competing at Brave New Voices in San Francisco! Kick back some coffee and treats at Sweetwaters Coffee & Tea Washington St. and let these high schoolers wow you with their words. Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\nSign up! 7:00 p.m.\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Readers\nThis month's feature: A2 YOUTH SLAM TEAM!\n\nThe winners of the Ann Arbor Youth Poetry Slam who will be representing Ann Arbor at the Brave New Voices competition in San Francisco this summer are Dea Chappell (Pioneer), Sam Kass (Pioneer), Dylan Gilbert (Pioneer), Zaphra Stupple (Pioneer), Theo Rowe (Community), and Kyndall Flowers (Pioneer/Community).\n\nNext month: No Skazat! We'll be taking our annual summer break. But join us in September for TODD KANEKO!"}, {"date": "2017-07-25T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/468341660180680/", "name": "Discussing Detroit w/ Rebecca J. Kinney & Stephen M. Ward", "description": "Literati is pleased to welcome Rebecca J. Kinney and Stephen M. Ward for a discussion of their recent books about Detroit and the people who form its heart.\n\nWhat is the “new Detroit” that everyone keeps talking about? In Beautiful Wasteland: The Rise of Detroit as America's Postindustrial Frontier, Rebecca J. Kinney reveals that the contemporary story of Detroit’s rebirth is an upcycled version of the American Dream, which has long imagined access to work, home, and upward mobility as race-neutral projects. She tackles key questions about the future of postindustrial America, and shows how the narratives of Detroit’s history are deeply steeped in material and ideological investments in whiteness.\n\nRebecca J. Kinney, who grew up in metropolitan Detroit, is assistant professor in the School of Cultural and Critical Studies at Bowling Green State University.\n\nIn Love and Struggle: The Revolutionary Lives of James and Grace Lee Boggs details both the personal and the political dimensions of the Boggses' lives, highlighting the vital contributions these two figures made to black activist thinking. At once a dual biography of two crucial figures and a vivid portrait of Detroit as a center of activism, Ward's book restores the Boggses, and the intellectual strain of black radicalism they shaped, to their rightful place in postwar American history.\n\nStephen Ward is associate professor in the Department of Afroamerican and African Studies (DAAS) and the Residential College at the University of Michigan. He is also a board member of the James and Grace Lee Boggs Center to Nurture Community Leadership in Detroit."}, {"date": "2017-07-26T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/715559035303413/", "name": "BYOBG - Bring your own Board Game!", "description": "Bring a game! Bring your friends! \n\nPlay board games with your friends at Glasshouse Brewing on Wednesday, get happy hour all night! That means $1 off pints while you play. What a deal!"}, {"date": "2017-07-26T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1951094685109319/", "name": "Daniel Magariel, with John Ganiard", "description": "Literati is delighted to welcome staff-favorite Daniel Magariel in support of his debut novel, One of the Boys, a Literati Cultura selection. Daniel will be joined in conversation by Literati's event manager John Ganiard, a graduate of the Helen Zell Writers' Program.\n\nA “gripping and heartfelt” (The New York Times Book Review) story about two young brothers contending with the love they have for their abusive father, One of the Boys is a stunning, compact debut by a major new talent. The three of them—a twelve-year-old boy, his older brother, their father—have won the war: the father’s term for his bitter divorce and custody battle. They leave their Kansas home and drive through the night to Albuquerque, eager to begin again, united by the thrilling possibility of carving out a new life together. The boys go to school, join basketball teams, make friends. Meanwhile their father works from home, smoking cheap cigars to hide another smell. But soon the little missteps—the dead-eyed absentmindedness, the late night noises, the comings and goings of increasingly odd characters—become worrisome, and the boys find themselves watching their father change, grow erratic, then dangerous.\n\nSet in the sublimely stark landscape of suburban New Mexico and a cramped apartment shut tight to the world, One of the Boys conveys with propulsive prose and extraordinary compassion a young boy’s struggle to hold onto the pieces of his shattered family. Tender, moving and beautiful, Daniel Magariel’s masterful debut is a story of resilience and survival: two foxhole-weary brothers banding together to protect each other from the father they once trusted, but no longer recognize. With the emotional core of A Little Life and the speed of We the Animals, One of the Boys is among the most remarkable debut novels you’ll ever read.\n\nDaniel Magariel is a fiction writer from Kansas City. He has a BA from Columbia University, as well as an MFA from Syracuse University, where he was a Cornelia Carhart Fellow. He has lived in Kansas, Missouri, New Mexico, Florida, Colorado, and Hawaii. He currently lives in New York with his wife. One of the Boys is his first novel."}, {"date": "2017-07-26T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/850240101794549/", "name": "Toastmaster's at Sweetwaters", "description": "Sweetwaters and Toastmaster community members are creating a new Toastmasters Club at Sweetwaters! We will have 1 or 2 prepared speeches, showcase some of our (kind, encouraging and gentle) evaluations of the speeches, and some opportunities for people to have impromptu speaking fun. There will also be a chance for Q & A during the meeting too.\n\nCome a little early and pick-up a beverage or snack from the cafe and have fun making new friendships with encouraging and supportive people!\n\nCheck out the Ann Arbor Toastmasters MeetUp page here-> https://www.meetup.com/Ann-Arbor-Area-Toastmasters/"}, {"date": "2017-07-26T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/653229371548149/", "name": "Underground Yoga - Deep House Vinyasa at Necto (7/26)", "description": "Southpaw Events presents...\n\n:: Underground Yoga - Deep House Vinyasa ::\nPowered by Lolë Ann Arbor\n\nLocation:\nNecto Nightclub\n516 E. Liberty St.\nAnn Arbor, MI 48104\nAll ages welcome\n\nWe're welcoming the summer with open arms! Resident instructor Carol Ann guides yogis through a playful vinyasa while Avyu supplies the rhythmic vibrations. \n\nEvery attendee to this event with recieve a $10 Gift Card from our amazing sponsors Lolë Ann Arbor \n\nThis class is available to all skill levels. Mats are available for rent."}]