[{"date": "2017-01-26T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network", "url": "https://www.facebook.com/events/324709987912141/", "source": "Facebook"}, {"date": "2017-01-26T16:00:00-05:00", "description": "The City of Ann Arbor has scheduled a Public Information Meeting from 4:00 p.m. to 6:30 p.m. on Thursday, January 26, 2017 in the basement conference room at the Ann Arbor City Hall, 301 E. Huron Street, Ann Arbor, Michigan 48104.\n\nAn Environmental Assessment (EA) was prepared in 2010 to evaluate the social, economic, and environmental aspects of proposed improvements to the Ann Arbor Municipal Airport. The proposed improvements focus on shifting and extending Runway 6/24, the primary runway, to address the needs of the existing critical aircraft that use the airport. Alternatives were developed to provide options for extending the existing runway by 795 feet, from 3,505 feet to 4,300 feet, while extending the existing parallel taxiway to the same length.  \n\nThe original 2010 Environmental Assessment has been revised and updated, however the proposed improvements have not changed between the original 2010 EA and the recently revised EA.\n\nThe revised EA is available for public review starting today until February 10, 2017 at the following locations:\nAnn Arbor Municipal Airport\n801 Airport Drive\nAnn Arbor, MI 48108\n\nAnn Arbor Public Library 343 S. Fifth Avenue\nAnn Arbor, MI 48104\n\nAnn Arbor Municipal Airport website\t\nhttp://www.a2gov.org/departments/fleet-facility/Airport/Pages/AirportNewsProjects.aspx\n\nAnn Arbor City Hall\n301 E. Huron Street\nAnn Arbor, MI 48104\n\nPittsfield Township Administrative Offices \n6201 W. Michigan Avenue\nAnn Arbor, MI 48108\n\nMDOT – Office of Aeronautics website\nhttp://www.michigan.gov/aero/\n\nThe purpose of the Public Information Meeting is to answer questions regarding the revised EA, or the Preferred Alternative, and to solicit constructive input from interested citizens regarding the social, economic, and environmental impacts of the proposed improvements. Maps, drawings and other pertinent information, including the EA document, will be available for public information. Please take an opportunity to review the EA at one of the locations listed above prior to the meeting as there will be no formal presentation.  Written comments may be submitted during the Public Information Meeting or may be mailed or e-mailed to the following address. All comments must be received by 5:00 p.m. on February 10, 2017 to be included in the study record.\n\nContact Name:\t\tMr. Steve Houtteman\nContact Address:\tOffice of Aeronautics\nMichigan Department of Transportation\n2700 Port Lansing Road\nLansing, MI 48906\nEmail Address: \tHouttemanS@michigan.gov", "name": "Ann Arbor Airport EA Public Information Meeting", "url": "https://www.facebook.com/events/1282795971759170/", "source": "Facebook"}, {"date": "2017-01-26T17:00:00-05:00", "description": "It happens every day, that creeping question that lingers in the back of our minds until we have to figure it out- what's for dinner?! Join Victoria, our culinary manager, for some easy ways to add our house-made salads and entrees into your meal, and great tips to make your dinner game strong. Our chef's case makes dinner decisions delicious!", "name": "Dinner 101 with Victoria", "url": "https://www.facebook.com/events/2197830000442548/", "source": "Facebook"}, {"date": "2017-01-26T18:00:00-05:00", "description": "Our January Artists Meet & Greet session will be an interesting discussion with the founders of Ypsi Alloy Studios: Elize Jekabson, Jessica Tenbusch and Ilana Houten: MAKE, CREATE, COLLABORATE.\n\nOne of the most important assets for an artist is community and facilities to make that art happen. Elize Jekabson, Jessica Tenbusch and Ilana Houten will talk about their journey to creating Ypsi Alloy Studios, how they operate and what it means for their art practices.\n\nOur monthly Artists Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists, and attend artist talks by guest speakers.\n\nThis is a free event. Please join us!\n\nLearn more about our Artist Meet & Greet Events:\nhttp://www.annarborartcenter.org/artists-meet-greet/", "name": "Artists Meet & Greet", "url": "https://www.facebook.com/events/1737481436571426/", "source": "Facebook"}, {"date": "2017-01-26T19:00:00-05:00", "description": "Don't miss our most popular wine tasting event of the year! 🍷\n\nVino Value is coming on Thursday, January 26. Enjoy 30 wines with light hors d'oerves for only $30! Call (734) 222-9841 for reservations ~ space is limited.", "name": "Vino Value", "url": "https://www.facebook.com/events/250945518667724/", "source": "Facebook"}, {"date": "2017-01-26T21:00:00-05:00", "description": "Necto presents...\n\nWORTHY (Dirtybird • Anabatic) One on One Tour with Golf Clap (Country Club Disco)\n\nopening set by ADMN (Anabatic)\n\nAbout Worthy:  When it comes down to all the hype, his name says it all. He is Worthy. With an in-depth knowledge of production, mixing, and performance, Worthy has the insight to play for his audience, cultivating intense positive energy on the dance floor. From salty aired islands to dark club basements, over the past 10 years, Worthy has paid reverence to the traditional form of classic house while tripping off the mark and sinking into the euphoric less-charted territories of booty-clapping bass. As Carl Cox said, \"The Worthy sound has always been powerful, rocking, funky, bass-driven music at its best, and for me this is the new wave in house music.\" He establishes an energetic dance floor camaraderie that makes even the most skeptic hater’s booty shake.\n\nGrowing up in Washington DC, Worthy was inspired by the early American rave scene. Upon moving to New York in the late 90’s, he was exposed to artists like LTJ Bukem and Stacey Pullen whose music inspired him to play records across multiple genres, from techno and breaks to hiphop and drum n’ bass. In 2001 he swapped coastlines, moving to San Francisco to pursue his music career. There he teamed up with Claude Von Stroke and Justin and Christian Martin, becoming one of the four founding fathers of the Dirtybird party, Worthy’s breakout track, Irst Te, released on the Dirtybird label in 2007, quickly established his notoriety as a producer. With other bangers like Shy Look, Tric Trac (co-produced with Eats Everything) and the recently release track, Dip, Worthy has been rocking the “Dirtybird” sound for nearly a decade now.\n\nConcurrently, Worthy has established his own label, Anabatic Records, which has allowed him to be a bit more experimental with his production, and expand his reach as an artist. Some of the songs that have charted on sites such as Beatport include Concubia, Work The Walls, and Flashin. In 2014 Worthy released his debut full-length album, Disbehave, a genre-defying rebellion against the house producers status quo. Breaking down rules and boundaries, Worthy has sought to set himself apart from the mundane world of expectation, striking out to release something unexpected. Disbehave was accepted with critical acclaim and received notable press attention.\n\nEarly Spring 2015, Worthy will release a two part remix album of Disbehave with artists including Thugfucker, Stanton Warriors, Yolanda be Cool, Matt Tolfrey, and a slough of other amazing producers. He is also back with another Dirtybird release called \"So Delicious\", among other tracks that will be due out later this year.\n\nAbout Golf Clap:  DJs; producers; club headliners; after-party enthusiasts: Golf Clap are Hugh Cleal and Bryan Jones, a Detroit duo with an unmatched passion for house music and a seemingly endless supply of studio and club-focused creativity. And with releases on some of the world’s most influential house labels already under their belts, along with a lauded Boiler Room session and beyond, they’re only just getting started.\n\nWith roots in the Detroit underground, booking local and international DJs to play at their own parties, Golf Clap have established themselves as in-demand artists and performers in their own right, via an irresistible combination of hard work, talent and consistently being the last guys standing, wherever the party ends up.\n\nReleases on Simma Black, their own Country Club Disco imprint, and Kerri Chandler’s Madtech have announced Golf Clap as a musical force to be reckoned with, however it’s behind the decks where they truly come into their own. They are regulars at esteemed clubs such as Output in New York, Primary in Chicago, and Grasshopper Underground in Detroit. They have also performed at Movement, Electric Forest, Mysteryland, Spring Awakening, North Coast, and Brooklyn Electronic Music Festival, and are adept at crafting highly creative, energetic sets across four decks: masters of live remixing, tweaking and layering up effects and of teasing out the music for maximum dancefloor impact.\n\nWhether they’re playing clubs, warehouse shows, or at an impromptu after-party – which they more than likely arranged themselves – the sheer love these guys have for playing records and making people dance is evident. Just ask Lee Foss, Shiba San, Skream, or any of the other DJs who’ve shared the decks with them for a B2B session: Golf Clap can mix it with the very best of them.\n\nAs with every movement worth being a part of, Golf Clap’s self-made community started small: a group of like-minded artists and fans giving one another exactly what they needed to throw incredible parties. But as their profile has increased, word has spread both across the US and internationally. Go to any electronic music festival now and you’ll find a strong showing for their Country Club Disco merchandise and an ever-growing army of fans.\n\n2016 has already seen the release of yet more essential Golf Clap material, including remixes for Simma Black and Sleazy G, original productions ‘All You Need’ and ‘Feel It’ on Country Club Disco and most recently their remix of Skapes ‘Deeper Love’. Add to this a flourishing gig schedule, including a European tour, and 2016 looks set to be a landmark year for the boys from Detroit.\n\nWatch: https://www.youtube.com/user/djworthysf/videos\nListen: https://soundcloud.com/worthy\nTalk: https://twitter.com/w_o_r_t_h_y\nMeet: https://www.facebook.com/WorthySF\nPeek: https://www.instagram.com/itsworthy/\n\nDoors at 9pm • 18 & over welcome with proper ID • VIP services available contact: VIP@necto.com • 734-994-5436 • necto.com", "name": "Worthy with Golf Clap at Necto", "url": "https://www.facebook.com/events/981986061934932/", "source": "Facebook"}, {"date": "2017-01-27T17:00:00-05:00", "description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "name": "Sunseed Farm CSA Pickup", "url": "https://www.facebook.com/events/731926473638010/", "source": "Facebook"}, {"date": "2017-01-27T18:30:00-05:00", "description": "It's sad to hear the news that the Blind Pig is up for sale.  I am truly hoping this Ann Arbor iconic venue will remain a concert venue for many years to come.  I have made so many great memories at this venue as a musician and a fan.   I love playing theaters but there is something special about rocking a high energy club.  The thought of not being able to play here again with my busy schedule is alarming to say the least... so I am not going to let that happen.  I am happy to announce that I am going to rock the Blind Pig on January 27th and hopefully it won't be my last!   I am going to play two shows with doors at 6:30PM and at 10PM.  Tickets go on sale this Tuesday at 11AM.   \n\nEarly Show Doors 6:30PM (all ages w/ parent) \nLate Show Doors 10PM 18+\n$20ADV/$25Door \n\nOn Sale 1/10 at noon! \nhttp://www.blindpigmusic.com/calendar.html#!/events", "name": "Laith Al-Saadi / 1/27 FRI / Blind Pig / Ann Arbor / 2 Shows", "url": "https://www.facebook.com/events/1807445812843154/", "source": "Facebook"}, {"date": "2017-01-27T19:00:00-05:00", "description": "Literati is beyond delighted to celebrate Ann Arbor legend Keith Taylor and his latest collection of poems, The Bird-while, illustrated by Tom Pohrt.\n\n\"In a natural chronometer, a Bird-while may be admitted as one of the metres, since the space most of the wild birds will allow you to make your observations on them when they alight near you in the woods, is a pretty equal and familiar measure\" (Ralph Waldo Emerson’s Journal, 1838). Without becoming didactic or pedantic about the spiritual metaphor hidden in the concept of the \"bird-while,\" Keith Taylor’s collection evokes certain Eastern meditative poets who often wrote in an aphoristic style of the spirit or the mind mirroring specific aspects of the natural world.\n\nThe Bird-while is a collection of forty-nine poems that meditate on the nature—both human and non-human—that surrounds us daily. Taylor is in the company of naturalist poets such as Gary Snyder and Mary Oliver—poets who often drew from an Emersonian sensibility to create art that awakens the mind to its corresponding truths in the natural world. The book ranges from the longer poem to the eight line, unrhymed stanza similar to that of the T'ang poet Han-Shan. And without section breaks to reinforce the passing of time, the collection creates greater fluidity of movement from one poem to the next, as if there is no beginning or end, only an eternal moment that is suspended on the page. Tom Pohrt’s original illustrations are scattered throughout the text, adding a stunning visual element to the already vivid language. The book moves from the author’s travel accounts to the destruction of the natural world, even species extinction, to more hopeful poems of survival and the return of wildness. The natural rhythm is at times marred by the disturbances of the twenty-first century that come blaring into these meditations, as when a National Guard jet rumbles over the treeline upsetting a hummingbird, and yet, even the hummingbird is able to regain its balance and continue as before. At its core, Taylor’s collection is a reminder of Emerson’s idea that natural facts are symbols of spiritual facts.\n\nKeith Taylor teaches at the University of Michigan. He has published many books over the years: collections of poetry, a collection of very short stories, co-edited volumes of essays and fiction, and a volume of poetry translated from Modern Greek.\n\nTom Pohrt is a self-taught artist who has illustrated numerous books including The New York Times bestseller Crow and Weasel by Barry Lopez. He recently illustrated Terrapin and Other Poems by Wendell Berry and Careless Rambles, a selection of poems by John Clare. He lives in Ann Arbor, Michigan.\n\nEvent date: \nFriday, January 27, 2017 - 7:00pm", "name": "Poetry at Literati: Keith Taylor", "url": "https://www.facebook.com/events/1194461353983196/", "source": "Facebook"}, {"date": "2017-01-27T20:00:00-05:00", "description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "name": "Wine, Women, and Song XV", "url": "https://www.facebook.com/events/195810100885174/", "source": "Facebook"}]