[{"source": "Facebook", "date": "2017-02-08T08:00:00-05:00", "url": "https://www.facebook.com/events/1155317887914307/", "description": "Our whole body care department is 30% off on Wednesday only! Hair care, lotions, lipbalms, skin care, and more, just in time to trat yo' self or someone you like for Valentine's- or Galentine's!- Day <3", "name": "Body Care 30% Off- One Day Only"}, {"source": "Facebook", "date": "2017-02-08T08:00:00-05:00", "url": "https://www.facebook.com/events/324709987912141/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network"}, {"source": "Facebook", "date": "2017-02-08T11:45:00-05:00", "url": "https://www.facebook.com/events/747034225465983/", "description": "Today's technologies are growing faster than we can keep up. How do we know which available resources will help us market our businesses? What resources are free to use? How do we know when to use paid advertising, and which will help us the most?\n\nEric Wortman, Senior Account Executive at Google will present the \"Insiders Guide to Google: How to Apply Big Brand Strategies to Small Businesses\". Eric will walk us through all of the resources that Google has to offer to help businesses market and grow their brands.\n\nEric has a tremendous amount of experience in paid and social marketing with stops at Pure Visibility and iProspect before his current role at Google's Sports & Live Events Team.", "name": "An Insiders Guide to Google with Eric Wortman"}, {"source": "Facebook", "date": "2017-02-08T17:00:00-05:00", "url": "https://www.facebook.com/events/731926473638010/", "description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "name": "Sunseed Farm CSA Pickup"}, {"source": "Facebook", "date": "2017-02-08T18:30:00-05:00", "url": "https://www.facebook.com/events/1804153909846774/", "description": "The mission of The Open Organization Of Lockpickers is to advance the general public knowledge about locks and lockpicking. By examining locks, safes, and other such hardware and publicly discussing our findings, we hope to strip away the mystery with which so many of these products are imbued.\n\nAll are welcome.  If you have any locks or tools, feel free to bring\nthem.  If not, there is plenty to go around.  Meetings generally\nconsist of people picking locks while we talk about physical or cyber security, or just about anything else. \n\nhttp://a2-locksport.org/", "name": "The Open Organization Of Lockpickers (second Wed of the month)"}, {"source": "Facebook", "date": "2017-02-08T19:00:00-05:00", "url": "https://www.facebook.com/events/375198702857165/", "description": "Rise Again Community Sing-Along with Jeanne Mackey • Feb. 8, Mar. 15; 7 p.m. in the Crazy Wisdom Community Room • Join song leader Jeanne Mackey for a community sing-along from the recently released Rise Again Songbook, a guide with lyrics to over 100 songs, from Beatles to ballads, Dylan to Broadway. Purchase the songbook at Crazy Wisdom or use the store copy. Shower singers welcome! Suggested donation $5. Call 665-2757 or email info@crazywisdom.net.", "name": "Rise Again Community Sing-Along with Jeanne Mackey"}, {"source": "Facebook", "date": "2017-02-08T19:30:00-05:00", "url": "https://www.facebook.com/events/254338798323472/", "description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "name": "Sing Happy!"}, {"source": "Facebook", "date": "2017-02-09T08:00:00-05:00", "url": "https://www.facebook.com/events/280243392370950/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network"}, {"source": "Facebook", "date": "2017-02-09T18:30:00-05:00", "url": "https://www.facebook.com/events/368216473550243/", "description": "Marriot Marquis, Meeting Level One\nThe Catholic Room\n\nAWP Reception for the University of Michigan's Helen Zell Writers' Program — an opportunity for current program faculty and students to gather with alumni and friends. Light refreshments will be available.", "name": "AWP 2017 Michigan Reception (Helen Zell Writers' Program)"}, {"source": "Facebook", "date": "2017-02-09T19:00:00-05:00", "url": "https://www.facebook.com/events/239816876464532/", "description": "Gather, share, learn, and enjoy with other woodworkers. More info at http://semiww.org/ and here on Facebook at https://www.facebook.com/groups/156651268065872/", "name": "Southeast Michigan Woodworkers (second Thursday of the month)"}]