[{"description": "For just one day, our whole supplements department is 30% off! Vitamins, protein supplements, tinctures, and so much more- stock up on wellness!", "name": "30% Off Supplements- One Day Only!", "source": "Facebook", "date": "2016-06-15T07:00:00-04:00", "url": "https://www.facebook.com/events/599624360199105/"}, {"description": "We are gearing up for another week of culinary bliss during Ann Arbor's summer Restaurant Week! \n\nWe are featuring these special menus available in addition to our regular menu all week long.  \n-------------------------------------------------------------------------------\nSummer Restaurant Week 2016\n-------------------------------------------------------------------------------\nTwo for $15 lunch\nTax and gratuity not included\n•\tChoose one entrée for each person\no\tBBQ Tofu Sandwich\no\tWhitefish Po-boy\no\tChicken BLT\no\tCaesar Salad\no\tCherry Almond Salad\n-------------------------------------------------------------------------------\nTwo for $28 dinner per person\nTax and gratuity not included\n\nAppetizer\nTo share, please choose one\n•\tFried Pickle Spears \n•\tTruffle Sprouts\n•\tHummus and Pita \n\nEntree\nEach guest chooses one entree\n•\tMac and Cheese\n•\tFish and Chips\n•\tUrban Cowboy Bean Burger\n•\tAr-burger\n\nDessert or Beer\nTo share, please choose one\n•\tStout Chocolate pudding cake\n•\tStrawberries and Cream Belgian waffle\n•\tMaple Bourbon Bread Pudding\n\nNot interested in dessert? Swap it out for your choice of two 16oz drafts", "name": "Restaurant Week", "source": "Facebook", "date": "2016-06-15T11:00:00-04:00", "url": "https://www.facebook.com/events/1008482025896787/"}, {"description": "Thursdays through Sundays June 9-26.  Check out Tickets Available link for arb member advance ticket info plus note Summer 2016 construction impacting arboretum area parking & traffic.  Arrive early for tickets and time to walk to location of the first scene.", "name": "Shakespeare in the Arb 2016 - Love's Labour's Lost Opening Week", "source": "Facebook", "date": "2016-06-15T18:30:00-04:00", "url": "https://www.facebook.com/events/235874080125426/"}, {"description": "Literati is pleased to host Megan Tompkins-Stange in support of her book Policy Patrons: Philanthropy, Education Reform, and the Politics of Influence.\n\nPolicy Patrons offers a rare behind-the-scenes view of decision making inside four influential education philanthropies: the Ford Foundation, the W. K. Kellogg Foundation, the Bill & Melinda Gates Foundation, and the Eli and Edythe Broad Foundation. The outcome is an intriguing, thought-provoking look at the impact of current philanthropic efforts on education. Over a period of several years, Megan E. Tompkins-Stange gained the trust of key players and outside observers of these four organizations. Through a series of confidential interviews, she began to explore the values, ideas, and beliefs that inform these foundations’ strategies and practices. The picture that emerges reveals important differences in the strategies and values of the more established foundations vis-à-vis the newer, more activist foundations—differences that have a significant impact on education policy and practice, and have important implications for democratic decision making. In recent years, the philanthropic sector has played an increasing role in championing and financing education reform. Policy Patrons makes an original and invaluable contribution to contemporary discussions about the appropriate role of foundations in public policy and the future direction of education reform.\n\n\"Policy Patrons takes us deep inside traditional and venture philanthropies to learn, in the unfiltered words of decision makers, about profound shifts affecting public education and the practice of democracy. Tompkins-Stange has delivered an eye-opening portrait of this fast-changing field.\" — Dale Russakoff, author of The Prize: Who’s in Charge of America’s Schools?\n\nMegan E. Tompkins-Stange is an assistant professor at the  Gerald R. Ford School of Public Policy  at the University of Michigan.", "name": "Megan Tompkins-Stange", "source": "Facebook", "date": "2016-06-15T19:00:00-04:00", "url": "https://www.facebook.com/events/661311077358368/"}, {"description": "Crazy Wisdom Book Event • WHEN WE FIGHT, WE WIN! Twenty-First Century Social Movements and the Activists That Are Transforming Our World.\nCome join the co-authors Greg Jobin-Leeds, Dey Hernández, Jorge Diaz and movement leaders for a multi-media hour of art, theatre and lively conversation. Longtime social activist Greg Jobin-Leeds joins forces with AgitArte—a collective of innovative artists and organizers—to capture the stories, philosophies, tactics, and art of six of today’s most pressing movements: immigrant rights, the LGBTQ movement, the fight for quality public education, the prison justice movement, the struggle for economic power, and the environmental movement.\n\nWith a foreword by Colorlines’ Rinku Sen and an afterword by celebrated author Antonia Darder, WHEN WE FIGHT, WE WIN! weaves together personal interviews with today’s most successful activists and artists—from Patrisse Cullors-Brignac, Bill McKibben, Clayton Thomas-Müller and Karen Lewis to Favianna Rodríguez, Rea Carey, and Gaby Pacheco. Recently published by The New Press, WHEN WE FIGHT was highly praised by Noam Chomsky, Amy Goodman and Thom Hartmann.\n\nFREE TO ATTEND\n\nhttp://thenewpress.com/books/when-we-fight-we-win\nhttp://www.whenwefightwewin.com/", "name": "Crazy Wisdom Book Event • WHEN WE FIGHT, WE WIN!", "source": "Facebook", "date": "2016-06-15T19:00:00-04:00", "url": "https://www.facebook.com/events/1715742452030493/"}, {"description": "Join us for the Grand Opening of the first 5 mile loop of this highly-anticipated new mountain bike trail (also open to foot travel) at Waterloo State Recreation Area.  Be among the first to use this state-of-the-art, modern and sustainable trail, built using \"flow trail\" construction.  We will also be revealing the rebranding of the trail to the community, including a new trail name and logo. \n\nMeet at the trailhead (west off M-52, 5 miles north of Chelsea and 1/2 mile south of North Territorial Rd) at 10:45am for the 11:00am trail dedication and ribbon cutting, followed immediately by the inaugural 5 mile ride/hike/run on the new trail. \n\nBottled water and cookies will be provided.\n\nREI will be on site offering light mechanical support beginning at 9:30am. If you need air in your tires, lubrication on your chain, saddle position adjustment, etc., just come out early and REI will be there to help you before the ride.\n\nImmediately after, we will continue the celebration at Chelsea Alehouse with lunch and beverages.  A celebration cake will be provided by Potawatomi Mountain Biking Association.\n\nCan’t make it out that early? Join us for an after work ride, hike, or run! \n\nMeet at the new trailhead at 6:00pm for a 6:15pm departure.  We will follow up the evening ride/hike/run with pizza and beverages at Jet’s Pizza in Chelsea.  After ride cake will be provided by Potawatomi Mountain Biking Association.", "name": "Waterloo Trail Grand Opening, Ribbon Cutting and Renaming Cermony", "source": "Facebook", "date": "2016-06-16T10:45:00-04:00", "url": "https://www.facebook.com/events/571486126359926/"}, {"description": "frontier ruckus is an American folk-rock band from Michigan.   Frontier Ruckus was named \"Best Folk Group\" in Detroit by Real Detroit Weekly.  They’re centered on the lyrically intensive songs of Matthew Milia, and was formed by Milia and banjo player David Winston Jones while living in Metro Detroit.   Frontier Ruckus released their fourth full-length album, Sitcom Afterlife. Prior to the complete album release, the tracks \"Sad Modernity\", \"Bathroom Stall Hypnosis\", and \"Darling Anonymity\" were released individually, highlighting the band's shift toward a greater focus on classic power pop arrangements, while still remaining densely lyrical\nhttp://www.frontierruckus.com\n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Frontier Ruckus / June 16th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE", "source": "Facebook", "date": "2016-06-16T12:00:00-04:00", "url": "https://www.facebook.com/events/1722976337920509/"}, {"description": "I hope you can come to the reception of Aura's photography exhibition, but the show is up until June 29.   http://www.kerrytownconcerthouse.com/index.php/events/event/aura_glaser_photographer/", "name": "Aura Glaser - Photography Exhibit Reception", "source": "Facebook", "date": "2016-06-16T17:00:00-04:00", "url": "https://www.facebook.com/events/1132383946823737/"}, {"description": "Join us every Thursday in June to help support our community partner, Growing Hope! From 6-9 pm, $1 of each beer sold will be donated towards Growing Hope's efforts to educate, inspire, and empower the community through gardening and access to healthy food.", "name": "Hops for Hope", "source": "Facebook", "date": "2016-06-16T18:00:00-04:00", "url": "https://www.facebook.com/events/1576623099301542/"}, {"description": "Thursdays through Sundays through June 26. Check out Tickets Available link for arb member advance ticket info plus note Summer 2016 construction impacting arboretum area parking & traffic. Arrive early for tickets and time to walk to location of the first scene.", "name": "Shakespeare in the Arb 2016 Love's Labour's Lost Week 2", "source": "Facebook", "date": "2016-06-16T18:30:00-04:00", "url": "https://www.facebook.com/events/799178996885556/"}]