[{"date": "2016-06-01T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1745052782438333/", "description": "Experience the flavors of the season and try our new Spring menu. Featuring new food and beverages you are sure to love! \nBut, don't worry we have kept some of the classics on our menu too.\nYou can make your reservation with OpenTable link above.", "name": "Spring Menu Launch"}, {"date": "2016-06-01T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1676510779282378/", "description": "The first one was so much fun, we're going to do it again! The second Food Truck Rally of the season is here! Bring your friends and enjoy a beautiful summer evening eating delicious, local food! Hope to see you there!\n\nDon't forget to tag us in your pictures with #a2rally We're on Twitter and Instagram too! \n\nUpcoming Rallies:\nJune 1st\nJuly 6th\nAugust 3rd\nSeptember 7th\nOctober 5th", "name": "First Wednesday Food Truck Rally"}, {"date": "2016-06-01T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/274191096260542/", "description": "Literati is pleased to welcome Jon M. Sweeney in support of his most recent title, The Enthusiast: How the Best Friend of Francis of Assisi Almost Destroyed What He Started.\n\nPopular historian and award-winning author Jon M. Sweeney relates the untold story of St. Francis’s friendship with Elias of Cortona, the man who helped him build the Franciscan movement. Sweeney uses the complexities of their relationship in a gripping narrative of how their efforts changed the world and how Elias’s enthusiasm betrayed the ideals of his friend.\n\nBlending history and biography, Sweeney reveals how Francis and Elias rebuilt churches, aided lepers, and entertained as “God’s troubadours” to the delight of everyday people who had grown tired of a remote and tumultuous Church. At the height of their spiritual renaissance, however, Elias became “the devil” to many of the other friars; they believed him to be a traitor to their ideals. After Francis’s premature death, the movement fractured. Scorned by most of the Franciscan leadership, Elias followed a path that would leave him a lonely, broken man. Sweeney shows how Elias’s undoing was rooted in his attempts to honor his old friend.\n\nJon M. Sweeney is an independent scholar and one of religion’s most respected writers. His work has been hailed by everyone from PBS and James Martin, S.J., to Fox News and Dan Savage. He’s been interviewed on CBS Saturday Morning, Fox News, CBS-TV Chicago, Religion and Ethics Newsweekly, and on the popular program Chicago Tonight. Several of his books have become Book-of-the-Month Club and Quality Paperback Book Club selections. His popular medieval history, The Pope Who Quit, was published by Image/Random House and optioned by HBO. It was a selection of the History Book Club and received a starred review in Booklist. His book, When Saint Francis Saved the Church, received a 2015 award for excellence in history from the Catholic Press Association. His other words include Inventing Hell, The Complete Francis of Assisi, and The St. Francis Prayer Book. Sweeney writes regularly for America and The Tablet, and is also the editorial director at Franciscan Media. He is married, the father of three, and lives in Vermont.\nEvent date: \nWednesday, June 1, 2016 - 7:00pm", "name": "Jon M. Sweeney: The Enthusiast"}, {"date": "2016-06-01T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/557587411082458/", "description": "Phantom Chips makes her own wearable synthesizers that can be stretched and squeezed to create sound. Her homemade ‘lectronix squeals create bent charm and harsh mangled tones through tactile electronics. Concocting rhythms from an array of homemade electronic instruments, samplers and wearable noisemakers Phantom Chips gets the audience wearing electronics and making noise.http://www.phantomchips.com/audio/\n\nBased out of Brisbane, Australia, home-recording artist Laura Hill started working under the name Scraps as the banner for her homespun synth pop. Armed with subdued vocals, lo-fi keyboards, and various electronic takes on dreamy songwriting. Since 2011 Scraps has released albums with Bedroom Suck (AU) and Fire Records. Her latest album will be coming out on Not Not Fun in April 2016. You can listen to her last album on Fire Records here http://www.firerecords.com/site/index.php?p=r&rid=01005&dv=1&rcode=Scfdhe9801005\n\nSolypsis Solypsis inhabits a harsh world specializing in speaker shredding frequencies and fucked up non dancefloor smashes.\nhttps://www.discogs.com/artist/138751-Solypsis\n\nPsychicEyeClix is a musician, a/v artist and instrument maker based in London and has been performing since 2001.  \nHe performs with circuit bent/rewired games consoles/drum machines/synths, camcorders pointed at the audience and glitched up. All his equipment is recycled.  By rewiring old redundant equipment he  circuit bends them into new and more exciting instruments. His live performance invokes entropy with visuals & audio that are continuously mutating and interacting - glitching in time.\nhttps://psychiceyeclix.wordpress.com\n\n\nWatabou (Hiatus Hiatus Edition):\n\nIn her own words: \"Yeah yeah yeah I know I said I was going on hiatus, but I'm putting that hiatus on hiatus for a second to support these rad touring acts. Expect some cool things from some sets in the past that have varying levels of remaining context. If you get the jokes you'll laugh with me and if you don't you'll probably just laugh at me. Either way there will be excessive gabbers and excessive social dialogue. I am sure I am really selling this, huh?\" \n\nhttps://soundcloud.com/watabou\nhttps://watabou.bandcamp.com\n\n\nGuest DJs and resident wavebenders:\nPat in the Hat & Jeff Garcia\nhttps://soundcloud.com/patinthehatdoe\nhttps://www.mixcloud.com/ClubFaygo\n\nDoors at 9pm | 18 and up welcome\n\nClub Above\n215 N Main Street\nDowntown Ann Arbor", "name": "Phantom Chips \\\\ Solypsis Solypsis \\\\ Watabou \\\\ Scraps \\\\ Psychiceyeclix \\\\ DJs Pat in the Hat & Jeff Garcia"}, {"date": "2016-06-02T11:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/138543229893757/", "description": "Your favorite dinner spot just became your favorite lunch spot.\nBringing great food, and quick service to your lunch break. Offering paella for two, Spanish flatbreads, salads, and more!\nCheck out the new menu with the link listed above.", "name": "Aventura Spring Menu Launch"}, {"date": "2016-06-02T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/272381566427718/", "description": "Wild Belle\n – multi-instrumentalist Elliott Bergman and his younger sister Natalie Bergman – is an American indie reggae and rock band based in Chicago. Their debut studio album Isles was released 2012.  Wild Belle's latest album, Dreamland was released in April of 2016. \nElliot and Natalie Bergman are two of four children born to musician parents, who brought them up in a house full of music. Elliot, the older sibling, is a multi-instrumentalist studied at the University of Michigan where he started an Afrobeat band called Nomo. His younger sister, Natalie, started performing with Nomo, playing tambourine and singing backing vocals when she was sixteen. Elliott and Natalie decided to branch off with their own project and chose the name, Wild Belle. Wild Belle has gained recognition through touring with Toro y Moi in the past. Wild Belle will continue with their touring kick by appearing at music festivals across the United States, including Lollapalooza, Coachella, Forecastle Festival, and others. http://www.wildbelle.com \n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\n Sonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Wild Belle / June 2nd / Bank of Ann Arbor's Sonic Lunch / 12PM FREE"}, {"date": "2016-06-02T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1149030195130531/", "description": "We're super excited for our very first tap takeover with none other than our good friends from Founders Brewing Company. 5 taps of local hoppy hour goodness- we can hardly wait!", "name": "Tap Takeover with Founders Brewing Company"}, {"date": "2016-06-02T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/498663607009941/", "description": "$2 pints and custom coloring pages- Thursday is the new Friday! Bonus- Founders Brewing Co.will be here from 5-7 for a tap takeover <3", "name": "Adult Coloring Night"}, {"date": "2016-06-02T18:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/583947551773311/", "description": "Join us every Thursday in June to help support our community partner, Growing Hope! From 6-9 pm, $1 of each beer sold will be donated towards Growing Hope's efforts to educate, inspire, and empower the community through gardening and access to healthy food.", "name": "Hops for Hope"}, {"date": "2016-06-02T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/612017728947333/", "description": "Join the Roadhouse and Zingerman's Camp Bacon® as we celebrate the pig with author Mark Essig, sharing stories from his new book \"Lesser Beasts: A Snout-to-Tail History of the Humble Pig.\" Mark and Chef Alex have created a menu featuring bacon throughout the courses, showing no part of the pig is to be taken for granted.\n\nAMUSE\nSorghum and Long Pepper Pork Belly on Scrapple\n\nFIRST COURSE\nMilk-Braised Pork Pie with Grilled Ramps\n\nSECOND COURSE\nAsparagus with a Smoked Hock-Red Pea Vinaigrette\n\nENTREE COURSE\nGuanciale-Wrapped Cobia with Low Country Red Rice and Creamed Kale\n\nDESSERT COURSE\nChocolate Dipped Bacon Lollipops", "name": "The Annual Bacon Ball: A Snout-to-Tail History of the Humble Pig"}]