[{"date": "2016-11-12T08:00:00-05:00", "source": "Facebook", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/324709987912141/", "name": "10% For Good for Community Action Network"}, {"date": "2016-11-12T09:30:00-05:00", "source": "Facebook", "description": "Dr. Sally Cornelison, Professor of Italian Renaissance art at Syracuse University, will provide the keynote talk for this U-M History of Art Graduate Student Symposium. Eight graduate students in Art History and related fields from the University of Michigan and other institutions will present papers that examine the visual implications of magnificence and display from a broad range of theoretical and methodological approaches. These graduate student presentations vary widely in geographic locations and historical time periods.", "url": "https://www.facebook.com/events/625992070896001/", "name": "U-M History of Art Graduate Student Symposium"}, {"date": "2016-11-12T10:00:00-05:00", "source": "Facebook", "description": "Find out why soups are the universal comfort food! Please join us at the Matthaei Botanical Gardens for some cooking fun! Kids will follow recipes and prepare a treat from scratch to take home. Participants will also create their own recipe books so the fun can continue at home. \n\nChildren ages 5 and up are welcome to join in for this event. Please RSVP for the Kids are Chefs event using the link below. In order to be registered for this event, you must RSVP through the Matthaei website. A Facebook RSVP will not guarantee your child a spot at the event. \n\nhttp://mbgna-peony.miserver.it.umich.edu/shop/youth-programs", "url": "https://www.facebook.com/events/680374305459820/", "name": "Kids are Chefs – Melting Pot Soups at Matthaei Botanical Gardens"}, {"date": "2016-11-12T11:00:00-05:00", "source": "Facebook", "description": "Saturday, November 12, 11 a.m.–1 p.m. & 2–4 p.m.\nMultipurpose Room\n\nFree. Registration is required: email umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11:00 a.m. session or the 2:00 p.m. session and how many adults and children are in your group.\n\nCreate your own project inspired by the ceramics in UMMA's collection. UMMA docents will lead a tour of the galleries to look at different examples of the possibilities for making objects out of clay followed by a hands-on workshop led by local artist Nora Venturelli. Designed for families with children ages six and up to experience art together. Parents must accompany children.\n\nFamily Art Studio is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "url": "https://www.facebook.com/events/231873220561389/", "name": "Family Art Studio: Clay Across Cultures"}, {"date": "2016-11-12T11:00:00-05:00", "source": "Facebook", "description": "We're whipping up our Thanksgiving turkey and sides to show off to you! We're offering a taste of our holiday fare so you can decide what's going on your table this year. Come hungry, and yes, it's free!", "url": "https://www.facebook.com/events/1219237928134084/", "name": "Holiday Tasting Fair"}, {"date": "2016-11-12T11:15:00-05:00", "source": "Facebook", "description": "Children ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. The story on November 12 will focus on ceramics in UMMA’s collection. Meet in front of the UMMA Store.\n\nStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "url": "https://www.facebook.com/events/982437515219356/", "name": "Storytime at the Museum"}, {"date": "2016-11-12T16:00:00-05:00", "source": "Facebook", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/146099882522728/", "name": "Icebreakers^2"}, {"date": "2016-11-12T17:00:00-05:00", "source": "Facebook", "description": "Join us November 12th for Parent's Night Out: Critters that Squirm in the Night! It's a night out for grown-ups while the kids enjoy an exciting evening at LSNC. Get down and dirty with the tiny world of insects, worms, and spiders as you play games, complete challenges, and more. Then, visit live critters to see the insect life cycle and food chain in action! Parents’ Night Out includes pizza and carrots for dinner as well as a late-night popcorn snack. Activities will be outside as much as possible, so please come dressed for the weather!", "url": "https://www.facebook.com/events/152572795205460/", "name": "Parents' Night Out"}, {"date": "2016-11-12T20:00:00-05:00", "source": "Facebook", "description": "Sat. November 12 | 8pm | 18+ | $12 adv./ $15 day of\n\nSANDY Alex G with: LVL UP & Brandon Can't Dance\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/766", "url": "https://www.facebook.com/events/990524291045821/", "name": "Alex G 11/12/16 at Blind Pig - Ann Arbor"}, {"date": "2016-11-12T20:00:00-05:00", "source": "Facebook", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Either Who\nGroup 2: Quicksand\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/331136867249405/", "name": "Pointless Improv with Either Who and Quicksand"}]