[{"description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/", "source": "Facebook", "name": "POP-X", "date": "2016-10-07T12:00:00-04:00"}, {"description": "Another fall season arrives not only with crisp air and beautiful weather, but also ABC's much anticipated festival, Oktoberfest! The celebration of beers, brats and Leiderhosen. \nWe're once again closing off the street and putting up the beer tents for our annual Oktoberfest street party! Join us at the corner of Main and Washington to enjoy a cool autumn evening under the stars with beer, brats, music, and dancing.\n(Parking available at the 4th and Washington parking structure) \n\n* 5-12 Friday \n* Live music provided by the Immigrant Sons. \nGet ready to Polka!! Friday night will feature the best Oom Pah Pa Band playing Traditional German Oktoberfest Music. The inception of Immigrant Sons is the culmination of all the musical history and heritage of the band members.  Immigrant Son plays a variety of music that makes people want to dance and tap their feet, creating the kind of fun that builds life long memories. \n\n* 5-12 Saturday\n* We're shaking things up for 2016 and are excited to announce that Saturday night's headlining band is our local favorite, Third Coast Kings!\n\nHailing from the Metro Detroit area in southeast Michigan, Third Coast Kings are a deep funk and heavy soul outfit that brings back the era of music one can only find on dusty old 45 records. Right from the beginning in 2007 the band delved into the old, funky catalog of vinyl records that DJ's and beat makers were using to get crowds moving. Over the years they have refined this sound into their own unique blend of the old and the new\n\n* No cover. \n* Must be 21 with valid ID. Children welcome with parents. \n* Brats, veggie brats, chips, pretzels, beer, wine, and soda will be available for purchase. \n* Call Beth at 734-213-1393 for more information. \n\nLeiderhosen optional (but pants required).", "url": "https://www.facebook.com/events/1785779555021709/", "source": "Facebook", "name": "Oktoberfest", "date": "2016-10-07T17:00:00-04:00"}, {"description": "Another fall season arrives not only with crisp air and beautiful weather, but also ABC's much anticipated festival, Oktoberfest. a celebration of beers, brats and Leiderhosen. \nWe're once again closing off the street and putting up the beer tents for our annual Oktoberfest street party! Join us at the corner of Main and Washington to enjoy a cool autumn evening under the stars with beer, brats, music, and dancing.\n(Parking available at the 4th and Washington parking structure) \n\n* 5-12 Friday \n* Live music provided by the Immigrant Sons. \nGet ready to Polka!! Friday night will feature the best Oom Pah Pa Band playing Traditional German Oktoberfest Music. The inception of Immigrant Sons is the culmination of all the musical history and heritage of the band members.  Immigrant Son plays a variety of music that makes people want to dance and tap their feet, creating the kind of fun that builds life long memories. \n\n* 5-12 Saturday\n* We're shaking things up for 2016 and are excited to announce that Saturday night's headlining band is our local favorite, Third Coast Kings!\nHailing from the Metro Detroit area in southeast Michigan, Third Coast Kings are a deep funk and heavy soul outfit that brings back the era of music one can only find on dusty old 45 records. Right from the beginning in 2007 the band delved into the old, funky catalog of vinyl records that DJ's and beat makers were using to get crowds moving. Over the years they have refined this sound into their own unique blend of the old and the new\n\n* No cover. \n* Must be 21 with valid ID. Children welcome with parents. \n* Brats, veggie brats, chips, pretzels, beer, wine, and soda will be available for purchase. \n* Call Beth at 734-213-1393 for more information.", "url": "https://www.facebook.com/events/524013431141295/", "source": "Facebook", "name": "Oktoberfest!", "date": "2016-10-07T17:00:00-04:00"}, {"description": "Friday, October 7, 7–8 p.m.\r Helmut Stern Auditorium\r.\nFree and open to the public. Seating is first come, first serve.\n\nOne MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.\rThis week's reading features Sam Jensen (Introduced by Yasin Abdul-Muqit) & A.S. Gorsuch (Introduced by Sierra Brown).\rSamuel Jensen is a writer from Texas. His fiction has appeared in The Masters\rReview and has been honored in a handful of contests, including the Hopwood Awards.\rA.S. Gorsuch was born in Akron, Ohio, grew up outside of Grand Rapids, Michigan, and\r￼￼￼ \rhas attended both Michigan State University and University of Michigan. On all counts, she is undecided.", "url": "https://www.facebook.com/events/1122525487797115/", "source": "Facebook", "name": "Mark Webster Reading Series", "date": "2016-10-07T19:00:00-04:00"}, {"description": "Literati is thrilled to welcome our friends at harlequin creature back to the store for the launch of their latest, greatest issues.\n\nAbout the journal: 2016 marks five years of harlequin creature, and to celebrate, we're launching a special double issue. please join us for the launch of issues 8/9 with an evening of readings. issue 8, \"not a metaphor,\" was curated by a group of guest editors from across the country, including JP Howard & Casey Rocheteau (poetry), Ginger Buswell (prose), & Alisha Wessler (art). it includes the poetry of Tara Betts, Destiny O. Birdsong, Amber Flame, Micaela Foley, Alexis Pauline Gumbs, Amanda Johnston, Stacey Knecht, and Pamela L. Laskin, prose by Emily Hunt and Meg Whiteford, and art by Matt Neff. cover design by Kayla Romberger. issue 9, \"sitting between chairs,\" is dedicated to translation and was shaped by guest editors Kristin Dickinson, Emily Goedde, and Anne Posten, and features translations from a wide range of languages, including serbian, welsh, portugese, ukrainian and hungarian.\n\nEvent date: \nFriday, October 7, 2016 - 7:00pm", "url": "https://www.facebook.com/events/512603802273198/", "source": "Facebook", "name": "Harlequin Creature", "date": "2016-10-07T19:00:00-04:00"}, {"description": "What The Sound is back with more! Please join us for another eclectic showcase on Friday, October 7th in Ann Arbor. Tickets can be purchased online or at the door. The concert is 18+ and $7 (21+) or $10 (18+). See below so you're in the know about who will be playing. \n\nCooper Anstett - Continuing to develop his song-writing skills as a Michigan student, Cooper released his first EP that reached #12 on the iTunes singer songwriter chart in 2014.  He has honed his own mature, rich organic vocal that is being compared to George Ezra and Sam Hunt.  His single “Move”  is currently featured on a Chevy in the D commercial and will be featured on a second EP to be released later this fall.  With a couple of internships at major record labels in Los Angeles and Nashville, Cooper is looking to continue building his career as a songwriter with a music publisher. Hear Cooper's music here: http://bit.ly/CooperAnstettMusic\n\nThe Gravity Club - a dynamic group composed of singer and guitarist Jake LeMond, saxophonist Joe May, bassist Karl Heitman, drummer Todd Watts, and University of Michigan’s own violinist Avery Bruni. Besides their wildly unique sound that blends classical, alternative, and pop influences, their everyday style takes them way out of orbit from everyone else. Their first album, A Faint Impression, was released in November 2015. Hear that album right here: https://thegravityclub.bandcamp.com/album/a-faint-impression\n\nNathan K. - is one of Michigan's most beloved singer-songwriters who is \"on the cusp of being part of the next generation of artists to achieve success along the lines of Bright Eyes, Sufjan Stevens, Jens Lekman, etc.\" (Songs Illinois) Listen for yourself here: https://nathank.bandcamp.com/album/methodist-girls\n\nZander Michigan - a singer/songwriter from Detroit, MI. His throwback 60's folk style makes him a classic musician in the modern age. Hear Zander Michigan's music here: https://zandermichigan.bandcamp.com/album/zander-the-great and be on the lookout for his upcoming \"Zander, MI 48018.\"\n\nAnu Vora is making her first solo appearance at the Blind Pig! She previously performed here with her EDM co-producers, Brahj, but she is currently exercising a new musical muscle: R&B/Jazz. Check out her new acoustic sound and listen to older tunes on Soundcloud at soundcloud.com/anuvora.", "url": "https://www.facebook.com/events/1211253632247571/", "source": "Facebook", "name": "Cooper Anstett / Gravity Club / Nathan K / Zander, MI / Anu Vora", "date": "2016-10-07T20:00:00-04:00"}, {"description": "Join Kerrytown Concert House as we celebrate the lead-up to the 20th anniversary of our avant-garde jazz festival Edgefest (October 26-29) with a series of free concerts throughout Ann Arbor!\n\nSince his 2007 debut as a leader, 7th Heaven (Between the Lines), Samuel Blaser has grown at an almost incomprehensible rate, from straight-ahead hard bopper in his mid-twenties to innovative free player and ever-searching composer and bandleader in his early thirties, one whose improvisational strength has received praise from sources like Audiophile Audition, citing Blaser’s music as occupying “ambient/free jazz terrain that has a depth of vision and clarity revealing musical maturity beyond Blaser’s nearly three decades of life.”\n\nGerry Hemingway, now a resident of Luzern, Switzerland, is a recipient of a Guggenheim Fellowship. He has had a long and admirable career, as he has been composing and performing solo, ensemble, and orchestral music since 1974. As bandleader, Hemingway has led various quartets and quintets since the mid-1980′s. He has also performed with the great Anthony Braxton, Ray Anderson, and many others. For nuscope, Hemingway previously recorded the challenging Subsymbolism (CD 1010) with Georg Graewe and Ernst Reijseger.\n\nTogether, the two will perform an evening of innovative compositions and improvisations with a quiet intensity that beats its own path while paying homage to tradition.\n\nThis performance is made possible through the generous sponsorship of The Maxine and Stuart Frankel Foundation in honor of Maurice and Linda Binkow on the occasion of her 80th birthday and their 60th wedding anniversary. Additional support for this performance is provided by Encore Records. \n \nThis concert is a part of the Warming Up The Edge series leading up to Kerrytown Concert House's Edgefest festival of creative music in celebration of the festival's 20th anniversary.", "url": "https://www.facebook.com/events/1580066205632601/", "source": "Facebook", "name": "Blaser & Hemingway at Encore | Warming Up the Edge Series", "date": "2016-10-07T20:00:00-04:00"}, {"description": "Lou and Peter Berryman were both raised in Appleton, WI, and began playing music together in high school during the sixties. During the following nomadic decade, Lou studied classical voice and music theory in college while Peter continued an unfocused fascination with surrealist art, beatnik poetry, and jug band music. Early influences of American and British musical comedy and folk music fed a growing repertoire of original songs. A brief marriage in the early seventies resolved into a lifelong friendship, and by the late seventies and early eighties the two were honing their skills playing regular weekly concerts in Madison, becoming full-time musicians and songwriters in 1979. During those early years they wrote new songs every week, many about the history, cheese, beer and strange politics of their home state. By the mid '80s they were traveling all across the country, still writing and singing, but now with a broader perspective, finding that the quirks of their home state were not so much Midwestern as human. In twenty-five years of performing together, Lou and Peter have released twenty albums and four songbooks worth of hilarious, quirky, yet oddly profound songs, rich with word play and interesting images. Pete Seeger, Tom Paxton and Tom Lehrer count themselves among their fans. Their work has appeared in numerous compilations such as the popular \"Rise Up Singing\" songbook, in periodicals like \"SING OUT! Magazine\", and in many audio compilations. Berryman songs are being sung around the world by a legion of professional musicians including Peter, Paul and Mary, Garrison Keillor and Peggy Seeger. They have appeared numerous times on such national programs as NPR's \"A Prairie Home Companion\" and \"Weekend Edition.\"\nwww.louandpeter.com", "url": "https://www.facebook.com/events/964923176923370/", "source": "Facebook", "name": "Lou and Peter Berryman at Green Wood Coffee House", "date": "2016-10-07T20:00:00-04:00"}, {"description": "Maize & Blue Velvet: a benefit concert for the David Lynch Foundation\nTicket proceeds to benefit the Chicago division of the David Lynch Foundation and the Ann Arbor Film Festival\n\nwith special guests\n\nWindy & Carl\n\nWolf Eyes\n\nAaron Dilloway\n\nDJ stylings by Dykehouse (Ghostly International)\n\nAbout the Foundation\nThe David Lynch Foundation’s core mission is to heal traumatic stress and raise performance in at risk populations, including veterans suffering from PTSD and mothers and their families who have lost loved ones to violence. Specifically through the implementation of Transcendental Meditation (TM) programs in order to improve their health, cognitive capabilities and performance in life.\nwww.davidlynchfoundation.org\n\nAbout the Ann Arbor Film Festival\nThe Ann Arbor Film Festival is the longest standing experimental film festival in the country and serves as an Academy Award®-qualifying festival in the United States for the Short Films category.\nhttp://www.aafilmfest.org/\n\n8pm doors | 21 and up event\n$20 advance  tickets | $25 at the door\n\nTickets available at: https://www.eventbrite.com/e/wolf-eyes-windy-carl-aaron-dilloway-benefit-for-david-lynch-foundation-tickets-27309124326\n\nTickets also available in store at Encore Records (Ann Arbor) and stormy records (Dearborn)\n\nClub Above\n215 North Main Street\nDowntown Ann Arbor\nabove the Heidelberg Restaurant\nwww.club-above.com", "url": "https://www.facebook.com/events/325333901135326/", "source": "Facebook", "name": "Wolf Eyes, Windy & Carl, Aaron Dilloway: benefit concert", "date": "2016-10-07T20:00:00-04:00"}, {"description": "Stewardship Workday\nSaturday, October 8\nMarshall Nature Area\n9 a.m. to noon\nThis large nature area, which extends into a county park and University of Michigan property, is a valuable piece of wildlife habitat in the northeast part of the city. Come out to help us improve the habitat by removing invasive buckthorn and honeysuckle. This amazing nature area is sure to provide an incredible outdoor experience. Meet in the parking lot off Dixboro Road, north of Plymouth Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/1737852759803500/", "source": "Facebook", "name": "Stewardship Workday-Marshall Nature Area", "date": "2016-10-08T09:00:00-04:00"}]