[{"description": "How do you use computer-controlled (“CNC”) tools?  It may look like magic when the ShopBot, plasma cutter, Tormach, or other machine accurately cuts an intricate shape, but in fact we have some powerful software tools that  let even beginners create fantastic projects.\n\nThis class is an overview of “CNC”–that is, computer controlled machines.  You’ll learn what CAD means, the difference between 2D and 3D, and other concepts.  We will do some very simple hands-on activities, including creating a drawing in a CAD program, using a CAM program to generate code to run on a CNC machine, and each person will send their job to a simple CNC machine and see it run!\n\nIf you have no CNC experience, this would be a great class to take before checkout classes for specific CNC machines. \n\nThere is no prerequisite for this class, but familiarity with using software on a computer will be needed–things like clicking with the mouse and so on.\n\nNotes and other handouts will be provided.\n\nBe sure to check out our CNC toolchain map (which we’ll explain in class) and CNC glossary at http://maker-works.com/cadcam-toolchain/\n\n1 class: 1.5 hours\nClass size: 4 people\n$25\n\nPlease arrive 10 minutes early if this is your first time to Maker Works.\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=24&month=10&year=2016&view=day to sign up!", "date": "2016-10-24T15:00:00-04:00", "name": "Intro to CNC", "source": "Facebook", "url": "https://www.facebook.com/events/1105739719547225/"}, {"description": "Come make an awesome fascinator with our hat enthusiast Je’Tone. Be the most stylish masquerader at your next ball and sport the Awesome Tiny Top Hat that you made! You will be guided through step by step instruction resulting in the construction and customization of your own mini top hat. Sign up soon, space is limited. Call us or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=24&month=10&year=2016&view=day", "date": "2016-10-24T18:00:00-04:00", "name": "Tiny Top Hats", "source": "Facebook", "url": "https://www.facebook.com/events/953789494747183/"}, {"description": "Every improv education starts somewhere - yours starts here. Learn the fundamentals of improvisation, basic games, scene work and skills. Get used to being on stage and working with others in safe, supportive environment. For ages 18 and up.\n​\nMondays @ 7:00 - 10:00 pm\nOctober 24 – December 12, 2016\nTeacher: Jason Valentini\n \nCost: $225\n\nVisit www.pointlessbrew.com/adult-improv-classes for more info.", "date": "2016-10-24T19:00:00-04:00", "name": "Intro 1: Welcome to Improv", "source": "Facebook", "url": "https://www.facebook.com/events/234725403596039/"}, {"description": "Literati is thrilled to welcome artist Michele Oka Doner in support of her most recent work, Into the Mysterium, a book that reveals the wondrous marine creatures deep in the heart of the endangered oceans that cover most of our planet. Michele will be joined in conversation by Jennifer Friess, the assistant curator of photography at the UMMA: University of Michigan Museum of Art.\n\nWith the oceans covering over 70 percent of the Earth’s surface, our planet can be called a marine planet. Beneath the waves are millions of remarkable creatures—beautiful big whales, dangerous jellyfish, legions of phytoplankton—but also, perhaps least known, are the marine invertebrates who make up an essential part of marine life. At the University of Miami, Florida, one museum is devoted to the study of Atlantic and Eastern Pacific marine invertebrates—over 93,000 specimens. Many of them were pulled from the Gulf of Panama, throughout the Caribbean, the Florida Keys, and the eastern Pacific over the last fifty years. They represent creatures that may never be seen again as the oceans grow ever more polluted and as global warming wreaks havoc on these ecosystems. Here, in lavishly beautifully photographs, nearly 100 of the rarest, most wondrous, mystifying, and entrancing specimens are brought into the light. From rare seahorses to now extinct corals, these invertebrates leave one gasping again at the extraordinary beauty and mystery of our world.\n\nMichele Oka Doner is an internationally renowned artist whose career spans four decades. The breadth of her artistic production encompasses sculpture, furniture, jewelry, public art, functional objects, video, as well as costume and set design. She is well-known for creating numerous public art installations throughout the United States, including Radiant Site at New York's Herald Square subway, Flight at Washington's Reagan International Airport, and A Walk on the Beach at the Miami International Airport. Her artwork can be found in the collections of the Metropolitan Museum of Art, the Whitney Museum of American Art, the Art Institute of Chicago, the Louvre, the Yale Art Gallery, the Princeton University Art Museum, and many others. (Author photo: Bruce Weber.)\n\nEvent date: \nTuesday, October 25, 2016 - 7:00pm", "date": "2016-10-25T07:00:00-04:00", "name": "Michele Oka Doner", "source": "Facebook", "url": "https://www.facebook.com/events/298097580571988/"}, {"description": "Jim Cherewick; he plays songs. Wanna hear? \nhttp://www.soundcloud.com/gymsee \n\nHe's the 4 eyed singer from the Ypsi rock band Congress and 1/4 of detroits pop outfit, Best Exes. Have a Beer while he rolls you through some one sided love songs and disfigured vignettes. You might laugh, cry, or even love again. For fans of Vic Chesnutt, Silver Jews, Neil Young, Sparklehorse & Modest Mouse", "date": "2016-10-25T19:00:00-04:00", "name": "Acoustic Tuesday: Jim Cherewick", "source": "Facebook", "url": "https://www.facebook.com/events/1690734551165586/"}, {"description": "Can't wait until Wednesday for the Edgefest fun to begin? Whet your Edgefest appetite with this informal, improvisational Fringe performance at one of our favorite places in town, Encore Records! Join us for a double feature, with a solo set from violinist/violist Jason Kao Hwang and a performance from the Daher-Malis Duo (Michael Malis, piano; Matt Daher, drums) featuring special guest John Lindberg on bass.\n\nThis performance is a part of the Fringe at the Edge series, celebrating the spirit of Edgefest through free public performances throughout downtown Ann Arbor. Support for this performance is provided by Encore Records.", "date": "2016-10-25T20:00:00-04:00", "name": "Daher/Malis Duo w/John Lindberg & Jason Kao Hwang", "source": "Facebook", "url": "https://www.facebook.com/events/1009989992480776/"}, {"description": "Tue. October 25 | 9pm | 18+ | $15 adv./ $20 day of\n\nPresented by ann arbor's 107one\n\nFoy Vance knows how to write a song. It’s a naturally-born but dedicatedly-finessed skill that has led him to collaborate with artists as diverse as Plan B, Sheryl Crow and Rudimental, synced his music on multiple TV shows ranging from Grey’s Anatomy to the finale of Sons Of Anarchy, and caught the ears of some of the biggest players (in every sense) in music, from Elton John to Ed Sheeran. \n\nSo it is that in the run-up to the release of his new album, Vance travelled to Nashville. It’s a long way from home for the Irishman, both from the place of his birth (Bangor, Northern Ireland) and the place of his residence (Aberfeldy, Scotland). But for an inveterate songwriter, Music City is an irresistible draw, a place where Vance can work with the best of the best. Not, Vance clarifies, for himself or his own material. For one thing, he’s already completed his new album, and with songs of the calibre and single-minded brilliance of the dozen that comprise The Wild Swan, there’s no need for any outside assistance. \n\nWSG: Trevor Sensor\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/681", "date": "2016-10-25T21:00:00-04:00", "name": "Foy Vance w/ Trevor Sensor 10/25/16 at Blind Pig - Ann Arbor", "source": "Facebook", "url": "https://www.facebook.com/events/1158475607517012/"}, {"description": "Artistic Director Shawn McDonald and other Arbor Opera Theater artists will perform Broadway favorites.\nTickets may be purchased online for the concert and the luncheon that follows. Tickets for the concert only may be purchased at the door beginning at 10 a.m.", "date": "2016-10-26T10:30:00-04:00", "name": "Ann Arbor Society for Musical Arts Concert", "source": "Facebook", "url": "https://www.facebook.com/events/1831074080507588/"}, {"description": "AOT Artistic Director Shawn McDonald and friends will perform Broadway selections. Buy tickets for the concert and the meet-the-artist luncheon here. http://annarborsma.org/purchase-tickets/\nIf you are able to attend the concert, but can't stay for  the luncheon, you can arrive at 10 and buy tickets at the door. \nHere is additional information http://annarborsma.org/", "date": "2016-10-26T10:30:00-04:00", "name": "Ann Arbor Society for Music Arts Concert", "source": "Facebook", "url": "https://www.facebook.com/events/1199670356770424/"}, {"description": "Join us in welcoming Wil Wheaton at this stop on his tour, advocating support for Presidential Candidate Hillary Clinton. He will be visiting Vault of Midninght for one hour and one hour only. Don't miss it!", "date": "2016-10-26T11:00:00-04:00", "name": "Wil Wheaton talks Hillary Clinton", "source": "Facebook", "url": "https://www.facebook.com/events/263263914068936/"}]