[{"date": "2017-02-18T10:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/239475296510133/", "description": "Join our Little Peeps crew for a celebration of love and friendship. The morning will include a short interactive performance, drama activities, and a craft centered on the theme.\n\nRecommended for pre-k through grade 5.\nTickets: $7 for the first child, $5 for each additional child\nAdults are free.", "name": "Little Peeps - Love"}, {"date": "2017-02-18T11:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1724899501156129/", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration"}, {"date": "2017-02-18T11:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/245767159212723/", "description": "Children ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. The story on February 18 will focus on Protecting Wisdom: Tibetan Book Covers from the MacLean Collection and stories of the Buddha. Meet in front of the UMMA Store.\n\nStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.\n\nLead support for Protecting Wisdom: Tibetan Book Covers from the MacLean Collection is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, and the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund and the Department of Asian Languages and Cultures.", "name": "Storytime at the Museum"}, {"date": "2017-02-18T13:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1574304402584366/", "description": "AOT will be holding their auditions for the 2017-18 season, including productions of Puccini's Suor Angelica and Tosca.  To find out all the information and how to apply for a live audition or submit recordings for consideration, follow the link below.\n\nhttp://www.arboropera.com/index.php/blog/auditions", "name": "Auditions for 2017-18 season"}, {"date": "2017-02-18T14:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1808370372757609/", "description": "Ann Arbor Civic Theatre is pleased to offer a 3- hour introduction to stage combat, focusing on unarmed combat technique on Saturday, February 18 from 2-5 PM at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI 48104. The class will offer rehearsal strategies of use to any actor, stage manager, or director approaching stage combat or physical contact onstage.  The workshop will be taught by Melissa Freilich, Society of American Fight Director Advanced Actor Combatant and Dueling Arts International Associate Instructor, and A2CT director and fight choreographer.\n\nThis workshop is open to those ages 18 and up at a cost of $20 for A2CT members and $25 for non-members. \n\n***Due to limited space, pre-registration is required. ***\n\nThose interested may sign up by emailing manager@a2ct.org or calling the office at 734-971-2228.  You may also email or call with any questions.\n\nA2CT plans to offer additional in-depth classes focusing on various weapons, and culminating in testing and Dueling Arts certification in the near future. This introductory workshop is a great first step for those potentially interested in certification.", "name": "Intro to Stage Combat"}, {"date": "2017-02-18T14:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/320748034986024/", "description": "Winter Dreams:\nA Chamber Music Benefit Recital Supporting the Dexter Community Orchestra’s Youth Artist Competition\n\nElizabeth Dale, violin\nMargaret Weiss, cello\nKathryn West, piano\nGail Green, flute\nCarrie Burdzinski, oboe\nMary Cupery, clarinet\nErik Zuiderweg, violin\nLarisa Jaskiewicz, violin\nJoseph Lange, viola\nTom Lehker, trumpet\nEric Krukonis, trumpet\nHeidi Riggs, horn\nKen Houser, trombone\nJohn Schumacher, tuba\n\n$15 General Admission\n\nThe Dexter Community Orchestra presents an afternoon of chamber music, including a piano trio, string quartet, wind trio and brass quintet.\n\nThe proceeds from this event will go towards the continued funding of the orchestra's Youth Artist Competition. Selected by audition from the very best that the Ann Arbor area has to offer, these student musicians receive a cash prize and an opportunity to perform in concert with the orchestra. This year's recipient will be chosen in March 2017 and will join the orchestra on stage on May 7, 2017 at 4:00pm at the Dexter High School Center for the Performing Arts. More information is available on the Dexter Community Orchestra website at www.DexterCommunityOrchestra.org.", "name": "Winter Dreams"}, {"date": "2017-02-18T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1121164158013958/", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2"}, {"date": "2017-02-18T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1626637407643238/", "description": "In 1902 Alfred Stieglitz and other Pictorialist photographers founded the Photo-Secession in New York to position photography as a legitimate aesthetic art form of the highest quality. In conjunction with UMMA's exhibition The Aesthetic Movement in America: Artists of the Photo-Secession, Professor Andrew Jennings and student chamber music ensembles present works which reach beyond traditional boundaries, legitimizing popular music practices, speech, and other sounds as worthy of the concert hall.\n\nThe SMTD@UMMA performance series is generously supported by the Katherine Tuck Enrichment Fund and the Greg Hodes and Heidi Hertel Hodes—Partners in the Arts Endowment Fund.\n\nLead support for The Aesthetic Movement in America: Artists of the Photo-Secession is provided by the Herbert W. and Susan L. Johe Endowment.", "name": "Elevation: SMTD at UMMA"}, {"date": "2017-02-18T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1756234927931657/", "description": "Ping Chong + Company creates theater that crosses boundaries of identity, community, and form.\n\nHis projects have explored a wide variety of subject matter, from a hidden genocide in Africa to class struggles in America and modernization in China, but the common thread is a unifying commitment to artistic innovation and social responsibility.\n\nThis interview-based theater production, part of Chong’s 25-year series entitled Undesirable Elements, explores the diverse experiences of young Muslim New Yorkers. The five participants in Beyond Sacred share the common experience of coming of age in a post-9/11 New York City, at a time of increasing Islamophobia. Participants come from a range of cultural and ethnic backgrounds and include young men and women who reflect a range of Muslim identities, including those who converted to Islam, those who were raised Muslim but have since left the faith, those who identify as “secular” or “culturally” Muslim, and those who are observant on a daily basis.\n\nMore info: http://ums.org/performance/beyond-sacred-voices-of-muslim-identity/", "name": "Beyond Sacred: Voices of Muslim Identity: Ping Chong + Company"}, {"date": "2017-02-18T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1848964212052082/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Bun Boiz \nGroup 2: Worklight\nGroup 3: The League of Pointless Improvisers", "name": "Pointless Improv with Bun Boiz and Worklight"}]