[{"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/324709987912141/", "source": "Facebook", "name": "10% For Good for Community Action Network", "date": "2016-12-07T08:00:00-05:00"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/1171307782957839/", "source": "Facebook", "name": "10% For Good for Community Action Network", "date": "2016-12-07T09:00:00-05:00"}, {"description": "Come join us for some Holiday Make & Take family fun!\nCreate your own \"traditional\" style Holiday stocking or make a fun paw print stocking for the four-legged member of your family. This workshop gives a soft introduction to machine sewing paired with vinyl cutter fun and sealed with our heat press. No prior knowledge or experience necessary, fun for all ages!\n\nPlease arrive 10 minutes early if this is your first time to Maker Works. \nRegister at http://www.supersaas.com/schedule/makerworks/CheckOut?day=7&month=12&year=2016&view=day or call 734-222-4911.", "url": "https://www.facebook.com/events/1742137892777150/", "source": "Facebook", "name": "Family Make & Take: Holiday Stockings - $35/person - 1.5hrs", "date": "2016-12-07T16:00:00-05:00"}, {"description": "Ballast Point Brewing & Spirits is our December Brewery of the Month! This Califorina craft brewery is responsible for some pretty fine beers, so come on over and taste for yourself.", "url": "https://www.facebook.com/events/229793134110358/", "source": "Facebook", "name": "Ballast Point Tasting", "date": "2016-12-07T17:00:00-05:00"}, {"description": "25 Artists Celebrate the Leslie Science & Nature Center's 30th Anniversary with an art show \"Raptors, Woods, and Critters\". The pieces in this collection have been inspired by LSNC's buildings and site, animals, and natural surroundings. Join us for the opening reception, December 7th, to meet the artists and hear how they were inspired to create their beautiful pieces.", "url": "https://www.facebook.com/events/1844345069135371/", "source": "Facebook", "name": "LSNC Art Show \"Raptors, Woods, and Critters\"", "date": "2016-12-07T17:00:00-05:00"}, {"description": "This program is free and open to the public. Seating is first-come, first-served.\n\nLaura De Becker, the Helmut and Candis Stern Associate Curator of African Art, will bring to life the biography of a Chokwe mask and trace its journey from its point of origin in northern Angola, to the art markets of Germany and Belgium, and to its current home in Ann Arbor.\n\nLead support for the exhibition Traces: Reconstructing the History of a Chokwe Mask is provided by the James and Vivian Curtis Endowment. Additional generous support is provided by the University of Michigan Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund, the African Studies Center, and the Department of Afroamerican and African Studies.", "url": "https://www.facebook.com/events/229922860775804/", "source": "Facebook", "name": "Curator Lecture: Traces and Fragments: the Life of a Chokwe Mask", "date": "2016-12-07T17:30:00-05:00"}, {"description": "Friends! Loved Ones! Enemies! Join us!\n\nOn December 7th at 6pm, we will be officially lighting our magnificent (non-denominational) holiday tree! Enjoy the spectacle of electric lights, meticulous decorations, and a very special tree-topper. Be ready to exchange holiday good moods and high fives, hugs, etc. PLUS coffee and baked goods provided by some of our favorite local cafes and bakeries. \n\nBring us an ornament for our new tree and receive a very special surprise while supplies last! Free gift wrapping will be available throughout the evening.\n\nWe love this time of year at Vault of Midnight and we can't wait to share in some genuine holiday spirit with you. See you on December 7th!", "url": "https://www.facebook.com/events/1776900222559219/", "source": "Facebook", "name": "Tree Lighting Soiree", "date": "2016-12-07T18:00:00-05:00"}, {"description": "This is the mack daddy of all of our beer tasting events! We have curated an amazing list of 24+ exceptional and rare offerings perfect for the holiday season.  A tasting not to be missed!\n\nFrom our own tanks and cellar we'll be featuring Fig Jam, Brune (, Divette, Framboise, Special Reserve, Unbridled, Bully Pulpit, Hitch Slap, Peches en Regalia, Eik Zon, a Velvet Hammer Vertical, and some vintage dated sours from the brewpub.  Guest offerings include Almanac Grand Cru Sour Tart Red and White (this bad boy is over $200/case!), a Dark Horse Four Elf Vertical, Bells Xmas Ale, Bruery Nine Ladies Dancing,Cuvee des Jacobins, Petrus Sour Quad, Serious Silly Sour, Affligem Noel (last chance to get this beer  since the brewery was bought by AB inbev, and Gouden Carolus Christmas.  \n\n7-9 PM \n$35 \nTickets include beer samples, fajita bar, tasting notes and entry into our door prize drawing!\n\nTickets are available at the brewpub or on Eventbrite", "url": "https://www.facebook.com/events/803421669798306/", "source": "Facebook", "name": "Winter Beer Tasting", "date": "2016-12-07T19:00:00-05:00"}, {"description": "Literati is pleased to welcome Jason Corey and Stephen Rush for an evening of music in celebration of their recent publications.\n\nJason Corey is an Associate Dean and Associate Professor of Music at the University of Michigan. He is a recipient of the Paul D. Fleck Fellowship at The Banff Centre in Banff, Canada, where he has worked as an Audio Research Associate. He has presented his research at conferences in Europe, Canada, and the United States. His research and education have been supported by the Audio Engineering Society Educational Foundation (New York), Bang & Olufsen A/S (Denmark), McGill University Stern Fellowship for Doctoral Studies in Music, Natural Sciences and Engineering Research Council of Canada (NSERC), Pioneer Electronic Corporation (Japan), and TC Electronic A/S (Denmark). Professor Corey has been a member of the Audio Engineering Society since 1995, and is also a member of the Acoustical Society of America, the International Computer Music Association, College Music Society, and the Society for Music Perception and Cognition.\n\nStephen Rush is Professor of Music at the University of Michigan School of Music, Theatre & Dance, where he founded the Digital Music Ensemble, which he has directed for 25 years. He has had over 200 premieres in five continents and released over 30 CDs, as well as a book on Jazz theology, Better Get It In Your Soul. His new book is Free Jazz, Harmolodics, and Ornette Coleman. Rush has premiered and recorded his classical and jazz compositions worldwide and performed with Roscoe Mitchell, Henry Grimes, Steve Swell, Eugene Chadbourne, Pauline Oliveros, his band \"Yuganaut\", “Blue” Gene Tyranny, and the late Peter Kowald. His music has been performed by Leonard Slatkin, Neeme Jaarvi (Detroit Symphony Orchestra) and recorded by members of the Cleveland Orchestra and the New York Philharmonic.\n\nEvent date: \nWednesday, December 7, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1820143591575269/", "source": "Facebook", "name": "Jason Corey & Stephen Rush", "date": "2016-12-07T19:00:00-05:00"}, {"description": "Come join us for some Holiday Make & Take family fun!\nCreate your own \"traditional\" style Holiday stocking or make a fun paw print stocking for the four-legged member of your family. This workshop gives a soft introduction to machine sewing paired with vinyl cutter fun and sealed with our heat press. No prior knowledge or experience necessary, fun for all ages!\n\nPlease arrive 10 minutes early if this is your first time to Maker Works. \nRegister at http://www.supersaas.com/schedule/makerworks/CheckOut?day=7&month=12&year=2016&view=day or call 734-222-4911.", "url": "https://www.facebook.com/events/103626220129328/", "source": "Facebook", "name": "Family Make & Take: Holiday Stockings - $35/person - 1.5hrs", "date": "2016-12-07T19:00:00-05:00"}]