[{"date": "2016-11-04T08:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1819752938314291/", "description": "Yes, it's true- Friday only, wine is 25% off! Here are some reasons you might want to stock up:\n\nThanksgiving is coming!\nWinter is coming!\nThe election is almost over!\nBecause wine!\n(Insert your own reason here)", "name": "One Day Sale- 25% Off Wine"}, {"date": "2016-11-04T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/261603764205728/", "description": "Fri. November 4 | 8pm | $25 Cover | 18+\n\nThe Randy & Mr Lahey LIVE show is a silly, sexist, drunken hour and a half of songs and skits, audience participation, profanity, Shakespeare, and general hilarity. Over the past eight years it has developed into the fastest moving two man show in the known universe.\n\nFrom Newfoundland to Vancouver Island several hundred thousand people have thrilled to Randy and Lahey's shennanigins. It's a constantly moving showcase of two television icons who pull no punches when battering the audience with \"Batman and Robin\" or \"The Shit Rap.\" The innocent honesty of an out- of-control drunken ex-cop Trailer Park Supervisor and his side-kick Randybobandy the cheeseburger eating ex male prostitute, weekend Trailer Park Supervisor is pants pissing humour at its warmest.\n\nThe show itself is roughly based on the T.V. series and movies, but being live, necessitates a different format and different is the operative word here. There is nothing like it anywhere. Shit talk and poetry; sodomy and sweet talk all thrown together with music and mayhem. What more could a room full of fun seekers want.", "name": "Randy & Mr. Lahey 11/4/16 at Blind Pig - Ann Arbor"}, {"date": "2016-11-04T10:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/174417866346098/", "description": "Ernestine and Herbert Ruben Study Center for Works on Paper\nSpace is limited and registration is required. Please email umma-program- registration@umich.edu. This workshop requires a reading fluency of Japanese and a basic knowledge of Kabuki theater and the cultural history of the late Edo period.\nExhibition co-curators Natsu Oyobe and Mariko Okada will lead an in-depth exploration of Kabuki prints in conjunction with the UMMA exhibition Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art. This workshop is designed for a general audience. Participants will become familiar with Kabuki prints and theater, as well as the popular culture and society of the late Edo period.\n\nKabuki prints are filled with information on the popular culture and human experience of the late Edo Period. Kabuki attracted enormous attention and developed a huge following in the late Edo Period—a phenomenon comparable to contemporary movie and television stars. The prints’ enormous popularity contributed to advances in print technology, facilitating an unprecedented speed of production and a sophisticated system of distribution and circulation.\nThis workshop requires a reading fluency of Japanese and a basic knowledge of Kabuki theater and the cultural history of the late Edo period.\n\nLead support for this exhibition is provided by the University of Michigan Office of the Provost, the National Endowment for the Arts, the William T. and Dora G. Hunter Endowment, AISIN, the E. Rhodes and Leona B. Carpenter Foundation, and the University of Michigan Center for Japanese Studies. Additional generous support is provided by the Japan Foundation and the University of Michigan Institute for Research on Women and Gender.", "name": "An Intimate Look: Images of Kabuki Theaters and Actors"}, {"date": "2016-11-04T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1133872453393355/", "description": "This class will introduce you to the Epilog 50watt Laser Cutter/Engraver. Learn how to cut and engrave lots of different materials such as paper, fabric, plastics, wood and more! The Epilog Laser can handle many different file formats such as pdf, Adobe illustrator and photoshop, jpgs, dwg, dxf, eps and more. You will learn basic operation of this tool with an emphasis on safety. With the successful completion of this class you will be certified to use the Epilog Laser Cutter/Engraver on your own. Find additional information about this tool here: www.epiloglaser.com/how_lasers_work.htm\n\nRegister by calling 734-222-4911 or visiting http://www.supersaas.com/schedule/makerworks/CheckOut?day=4&month=11&year=2016&view=day\n\nPlease arrive 10 minutes early if this is your first time to Maker Works.", "name": "Learn to use a 50W laser - $25 - 1 Hr"}, {"date": "2016-11-04T16:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1355627344447428/", "description": "Beginning November 4th, GameStart will be hosting a six-week series of Open House workshops called GameLab. Each week will feature a FREE to participate class, rotating* between two of GameStarts most popular courses: Game Creation with Unity and Minecraft Python Programming. Students are invited to try out and retake each class as often as they'd like during the six-week term.\n\nGameLab Course Schedule:\nNovember 4th, 4:00pm - 5:00pm: Minecraft Python Programming\nNovember 11th, 4:00pm - 5:00pm: Game Creation with Unity\nNovember 18th, 4:00pm - 5:00pm: Minecraft Python Programming\nNovember 25th, 4:00pm - 5:00pm: Game Creation with Unity\nDecember 2nd, 4:00pm - 5:00pm: Minecraft Python Programming\nDecember 9th, 4:00pm - 5:00pm: Game Creation with Unity\n \n*Note: Course topics will be repeated between each rotating week, but students are invited to experiment with the material in as many ways as they'd like during each visit.", "name": "GameLab: Open House Events"}, {"date": "2016-11-04T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1795645250721047/", "description": "Comparable to the celebrity culture surrounding movie and television stars today, Kabuki attracted enormous attention in nineteenth century Japan. Co-curators of the exhibition Japanese Prints of Kabuki Theater, Natsu Oyobe and Mariko Okada, will explore the methods used by print artists to create these spectacular and much-loved Kabuki actor prints, as well as the cultural context of their production.\n\nMariko Okada is Associate Professor at Faculty of Humanities, J. F. Oberlin University, Tokyo, Japan. Dr. Okada received her Ph.D. from Waseda University in Tokyo in 2011. Her book The Birth of Kyōmai: Inoue-ryu Dance in Nineteenth-Century Kyoto,\nJapan was released in 2013 and received several awards. Her current research interest is fan culture of Kabuki and diversities of Kabuki culture. Dr. Okada is the co-curator for Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art.\n\nNatsu Oyobe is UMMA's Curator for Asian Art and co-curator for Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art.\n\nLead support for this exhibition is provided by the University of Michigan Office of the Provost, the National Endowment for the Arts, the William T. and Dora G. Hunter Endowment, AISIN, the E. Rhodes and Leona B. Carpenter Foundation, and the University of Michigan Center for Japanese Studies. Additional generous support is provided by the Japan Foundation and the University of Michigan Institute for Research on Women and Gender.", "name": "UMMA Dialogue: Celebrity Culture and the Japanese Arts"}, {"date": "2016-11-04T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1123889174359512/", "description": "In this basic soldering workshop, Moldover will take you through the steps to build your own Light-Theremin CD case (http://www.youtube.com/watch?v=T8UzSVFUIc0).  Even if you've never soldered before, this workshop will give you the confidence in two hours.  If you do have experience you'll learn how to solder better, and walk away with a fun and unique instrument, plus a copy of Moldover's album.  \n\nNo experience required\nNo equipment required: soldering stations & Light Theremin kits provided\nThis is an all ages, hands-on workshop\nCost: $35 for kit/materials\nCan't afford a kit, but seriously dedicated to learning? Talk to us!\nSpace is limited, please come early\n\nAfter the workshop Moldover will give a presentation on the design of The Light-Theremin CD Case, and his other circuit-board artworks.\n\nAbout the artist\n”A musician at heart, inventor born of curiosity, and innovator by necessity, I believe the world calls him the 'Godfather of Controllerism' for damned good reasons\". -John Tackett, Crowd Wire\n\nHistorically there are only a handful of artists who have pushed the limits both with their music and with the instruments of its creation.  What Bach was to the keyboard, what Hendrix was to the guitar, this is what Moldover is to the controller.  Disillusioned with \"press play DJs”, fans from all walks are drawn to Moldover shows, eager to witness electronic music’s return to virtuosity, improvisation, and emotional authenticity.  Dig deeper into Moldover’s work and you’ll uncover a subversive cultural icon who has redefined physical media with his Instrument-Albums, revolutionized musical collaboration with his custom Jamboxes, and is inspiring an entire generation of forward thinking music-makers by openly sharing his methods and madness.", "name": "Build your own Light-Theremin with Moldover"}, {"date": "2016-11-04T19:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/925912874179745/", "description": "Tony Award winner John Cameron Mitchell wants to make sure you vote this November 8, and to help inspire you to do so he'll be here in person to offer live commentary during a screening of his iconic punk musical masterpiece, which follows the punk cabaret show of a transgender woman from Berlin as she tells her life story. This motivational Get Out the Vote screening is happening one night only here in Ann Arbor!", "name": "Hedwig and the Angry Inch with Live Commentary"}, {"date": "2016-11-04T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/241375029564095/", "description": "Nashville-based artist and Wrensong Publishing writer Sally Barris has managed to be successful in the mainstream world of country music without giving up her folk and Celtic roots. Her unique style, influenced by artists such as Tony Rice, Dougie Maclean and Richard Thompson, is what makes her stand out in a city known for “cookie cutter” talent. Her songwriting highlights include, “Let The Wind Chase You” (Trisha Yearwood), “Reluctant Daughter” (Martina McBride), “Some Things I Know” (Lee Ann Womack), “I’m On My Way” (Kellie Pickler), “The Innocent Years” (Kathy Mattea) and “Honeysuckle Sweet” (Jessi Alexander), which was featured in the Miramax film, “An Unfinished Life.”  The Minnesota native is currently on tour with her latest CD, \"The Road In Me.\"\n“Sally Barris has a voice like sparkling crystal. You could have knocked me over with a feather the first time I heard her. Her writing is from a deep, yet innocent, place and her point of view is just a bit off center. I am excited for her; she is standing at the beginning of her journey in this town, with all of it ahead of her. It reminds me of the first time I heard Beth Nielson-Chapman or Nanci Griffith. It’s going to be fun to watch.” – Kathy Mattea    www.sallybarris.com", "name": "Sally Barris at Green Wood Coffee House"}, {"date": "2016-11-04T21:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/350007328674614/", "description": "DEEPCONNEXION\n\ntechno | house\n215 n. main st\nann arbor, mi\n$7   |   9pm-2am\n\n--selectors--\n\nMonty Luke (Black Catalogue)\n\nAlan Bogl\n\nJeff Garcia\n\nLa Vici x Dom V (MEDMA)\n\nUNI STRUT SOUNDSYSTEMS", "name": "Deepconnexion: monty luke at club above"}]