[{"description": "This week, all our body care is 25% off! Skin care, hair care, cosmetics, soaps- it's all on sale, just in time for your holiday shopping. And with prices like this, you can pick up a few things to treat yo' self, too <3", "name": "25% Off Body Care", "source": "Facebook", "date": "2016-12-19T10:00:00-05:00", "url": "https://www.facebook.com/events/381601068852607/"}, {"description": "You know what would be great in the midst of your holiday hustle & bustle? A poetry break! Join us at Sweetwaters Coffee & Tea for some mid-winter writing and warm drinks. Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Readers\n\nThis month's feature: CASEY ROCHETEAU!\n\nCasey Rocheteau was born on Cape Cod, and raised as a sea witch. Winner of inaugural Write A House permanent residency in Detroit in 2014, Casey has attended Callaloo Writer’s Workshop, Cave Canem, and Bread Loaf Writers’ Conference in Sicily. They are a Writer in Residence at InsideOut Literary Arts in Detroit and editor-in-chief at Kinfolks Quarterly and Heart Online Journal. Their second poetry collection, The Dozen, was released on Sibling Rivalry Press in 2016.\n\n\nNext month: NANDI COMER!\n\nAnd don't forget: Starting in January, we'll be on the FOURTH Tuesday of the month instead of the third.", "name": "Skazat! Poetry Series featuring Casey Rocheteau", "source": "Facebook", "date": "2016-12-20T19:00:00-05:00", "url": "https://www.facebook.com/events/1172030442832043/"}, {"description": "Kick off your holiday season with some joy and a special edition of College Nights: Tek-Mazter & Friends\n\nPrimo drink & food specials and Kelsey whipping up magic behind the bar\n\nDJ lineup featuring:\n\nSecrt Asian Mn\n\nStrange Infinity\n\nSkybow\n\nNickyBoom\n\nTek-Mazter\n\nLadies always free | Gentlemen 21+ $3 | Under 21 $8", "name": "College Nights: Tek-Mazter & Friends Edition", "source": "Facebook", "date": "2016-12-20T21:00:00-05:00", "url": "https://www.facebook.com/events/1824611671140387/"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network", "source": "Facebook", "date": "2016-12-21T08:00:00-05:00", "url": "https://www.facebook.com/events/280243392370950/"}, {"description": "And now for something new from Entre-SLAM. We're on a mission.\nTo help EVERY entrepreneur find their voice and OWN IT in 2017. Everybody has a unique vision that needs a compelling message. But before that happens, you need support to make it happen. The support will come from others who are exploring the same thing and fussing with the same challenges. Together we will shift and evolve out them. So, every third Wednesday of each month, a tribe of innovators, dreamers and all-around rabble rousers will gather to talk about:\n\n- Breaking through\n- Finding traction\n- Discovering our voice\n\nOn the 21st, we'll have our first gathering, a pre-flight, if you will, to help you define your mission in 2017. It's a low-stress, high impact experience. We'll talk about the tools that we'll be using on our journey and go over any of your questions. You'll receive your link to the private Facebook group as well.\n\n\"There is no greater agony than bearing an untold story inside you.\" -Maya Angelou\n\nLet's get 'it' done in 2017.\n\nWe're proud of you and guess what... YOU'VE GOT THIS!!-", "name": "Own it in 2017", "source": "Facebook", "date": "2016-12-21T19:00:00-05:00", "url": "https://www.facebook.com/events/1891400097756647/"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network", "source": "Facebook", "date": "2016-12-22T09:00:00-05:00", "url": "https://www.facebook.com/events/1171307782957839/"}, {"description": "THROWBACK THURSDAY \nAll Your Favorite Music from the 80's, 90's & early 00's\nFREE for 21+ | $10 for 18-20\n\nwith DJ\nKevin Michael\nhttps://soundcloud.com/kevinmichaelofficial/\n\nTotally Awesome Drink Specials:\n$3.50 Well drinks\n$2.50 Fireball shots\n3 for $10 Jaeger Bombs\n$2 Miller Lite Bottles\n\nGet social:\nnecto.com\nfacebook.com/NectoNightclub\ntwitter.com/Necto\ninstagram.com/nectonightclub", "name": "Throwback Thursday at Necto", "source": "Facebook", "date": "2016-12-22T22:00:00-05:00", "url": "https://www.facebook.com/events/1736467956681248/"}, {"description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "name": "Exhibit: Avant Garden-Fashion & Plants Together!", "source": "Facebook", "date": "2016-12-23T10:00:00-05:00", "url": "https://www.facebook.com/events/230775294023258/"}, {"description": "Special guest group \"Caldwell & Bill\" will be joining us for one night only. \n\nJoe Bill is one of the co-founders of the Annoyance Theater, where he performed in and directed over 50 productions from 1987-2000, including smash hits Co-ed Prison Sluts, The Real Live Brady Bunch and The Screw Puppies. At iO, Bill has coached and performed with numerous ensembles since 1985, including the legendary team Georgia Pacific and the innovative lights out long-form, The Bat. Bill can be seen performing with fellow Annoyance co-founder Mark Sutton, in the nationally touring production Bassprov, (which headlined the 2003 Chicago Improv Festival with special guest Fred Willard). Bassprov has toured the United States since 2002, and also was named one of the top 10 comedy shows in Toronto in that same year. Bill teaches improvisation for iO, the Second City Conservatory and Training Center, the Annoyance, the Playground and around the U.S., Canada, UK and Netherlands. He started doing improv in 1977.\n\nGeorgie Caldwell spent her youth in the suburbs of Detroit. She moved to New York City for NYU Tisch Shool of the Arts earning her BFA and studying at the Atlantic Acting School. After 10 years in the concrete jungle acting and finding improv, Chicago called and she answered. Shes honored and thrilled to be on the iO Chicago roster. Follow her on social media: @georgiecaldwell or visit her website: www.georgiecaldwell.com for more fun!\n\nThese shows are completely improvised, and star an impressive cast of experienced improvisers, including our resident company The League of Pointless Improvisers. \n\nThe League will invite volunteers from the audience to share stories about their holidays  funny, awkward, sad, or wacky  and then they will perform scenes inspired by these tales.\n\nGroup 1: The League of Pointless Improvisers\nGroup 2: Caldwell & Bill\nGroup 3: The League of Pointless Improvisers", "name": "Holiday Improv Show with special guests Caldwell & Bill", "source": "Facebook", "date": "2016-12-23T20:00:00-05:00", "url": "https://www.facebook.com/events/1151303158292125/"}, {"description": "Mazinga, Counter Cosby, Daughters of Eternity and Human Skull play the Blind Pig on the Eve of Christmas Eve, you know, Xmas Eve Eve!", "name": "Xмas Eve Eve Extravaganza!", "source": "Facebook", "date": "2016-12-23T21:30:00-05:00", "url": "https://www.facebook.com/events/213842219071093/"}]