[{"url": "https://www.facebook.com/events/268595390193528/", "description": "Now through next Thursday, all our Private Label supplements and essential oils are 25% off! Stock up on nutritional support, tintures, essential oils for health or aromatherapy, vitamins, and more. While supplies last.", "source": "Facebook", "date": "2016-08-08T10:00:00-04:00", "name": "25% Off Lucky's Market Supplements"}, {"url": "https://www.facebook.com/events/276789659379778/", "description": "A2CT presents Othello, directed by David Widmayer.\n\nAuditions at the A2CT Studio (322 W. Ann Street):\nSunday, August 7 at 4:00 PM\nMonday, August 8 at 7:00 PM\n\nCallbacks @ 7:00 PM on Wednesday, 8/10, location TBA.\n\nText work will begin Wednesday, August 24, and rehearsals start Sunday, September 4. Production dates are October 27-30 at the Arthur Miller Theatre on U-M’s North Campus.\n\nAnn Arbor Civic Theatre is seeking ten to fifteen diverse actors for a production of Othello. With the original Shakespearean language intact, this production will be set at a lavish hotel in Saigon during the height of the Vietnam War. A new cut of the script by director David Widmayer emphasizes the role of war abroad and dramatic social change at home in shaping the characters’ attitudes and actions. No stage combat experience is necessary - actors will all have the opportunity to work with Melissa Freilich, a stage combat professional.\n\nActors must be age 16 or older to audition. Many roles will be available to actors of any gender identity. We hope that the cast will represent the growing diversity of the desegregated armed forces in the Vietnam War era, and strongly encourage actors of all ethnic backgrounds to audition. Auditioners may prepare a short (1-2 minute) Shakespearean monologue of their choice, or receive a monologue at auditions for a cold reading. At the audition, it is most important that actors demonstrate their ability to clearly convey the story - not just using the text, but using their body and range of emotional expression as well.\n\nPlease email the director with any questions, including requests for an alternate audition time. djwidmayer@gmail.com", "source": "Facebook", "date": "2016-08-08T16:00:00-04:00", "name": "Othello Auditions"}, {"url": "https://www.facebook.com/events/1542034336104534/", "description": "Are you interested in learning more about how to care for our natural areas? Then join the Stewardship Network's Huron Arbor cluster for an informal discussion on a monthly topic with volunteer and professional land stewards, plus others interested in nature. Free! This month’s topic: Kerry Gray will be talking about forest pests:  Our woods are under attack - You may know all about Emerald Ash Borer, but can you identify signs of Oak Wilt or other tree pests? Bring your questions and join us for a discussion about threats to urban forests.", "source": "Facebook", "date": "2016-08-09T07:30:00-04:00", "name": "Stewards' Circle- Forest Pests"}, {"url": "https://www.facebook.com/events/1114924125197190/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nIsaac Berkowitz and Chris Bota are guitarists in the Michigan rock band, Desmond Jones. As an acoustic duo, they blend blugrass and country acoustic guitar style with their band's original tunes. \nDesmond Jones is a five-piece funk/rock/jazz fusion band from Grand Rapids, Michigan. With original music written to compliment the group's sound as a whole, the music is centered around melodic guitar riffs, smooth bass lines, funky drum beats, and some saxophone.\n\nNever a cover\nAlways a good time", "source": "Facebook", "date": "2016-08-09T19:00:00-04:00", "name": "Acoustic Tuesdays: Isaac Berkowitz and Chris Bota"}, {"url": "https://www.facebook.com/events/1135308653198154/", "description": "You capture audiences with savvy electronic marketing.  But how do you captivate others in person?  Every marketing brand has people behind it. People, who must connect with clients in person, on the phone, or virtually.  You and your employees are the presence and continuation of your brand.  In today's world, people can tune you out (not just your clients). There IS something YOU CAN DO to be listened to and understood.\nYou will instantly see it's more than just what you say, that will capture your audience!", "source": "Facebook", "date": "2016-08-10T11:45:00-04:00", "name": "Speak So They Listen - Transforming How We Communicate"}, {"url": "https://www.facebook.com/events/268595390193528/", "description": "Now through next Thursday, all our Private Label supplements and essential oils are 25% off! Stock up on nutritional support, tintures, essential oils for health or aromatherapy, vitamins, and more. While supplies last.", "source": "Facebook", "date": "2016-08-11T10:00:00-04:00", "name": "25% Off Lucky's Market Supplements"}, {"url": "https://www.facebook.com/events/267031343632872/", "description": "The Ragbirds\nFor years, “home” was a place The Ragbirds rarely visited. The band’s music — a genre-bending hybrid of indie-pop melodies, global rhythms and songwriting styles influenced from all over the world — was as broad as their audience, which stretched from the group’s hometown of Ann Arbor, Michigan, to the shores of Osaka, Japan (where they scored a Number One pop hot with the song “Book of Matches”). Show by show, in venues ranging from rock clubs and performing arts centers to festivals encompassing everything from bluegrass to electronica, The Ragbirds developed a well-deserved reputation as one of the most dynamic, high-spirited live bands in roots music.\nThe Ragbirds albums have received local and national praise, hailed “Highly impressive!” by USA Today and touted as “Astounding international eclecticism” by Reveal Arts.  The band has performed in over forty-five states to a tune of 150+ shows a year, The Ragbirds have become festival favorites.  They have won over crowds at  Electric Forest, 10,000 Lakes, CMJ Music Marathon, Summer Camp, Wheatland, Blissfest, Wookiefoot’s Harvest Fest,  Ann Arbor Folk Festival, Hookahville, to name a few; and have shared stages with Brandi Carlile, Rusted Root, Matisyahu, Railroad Earth, John Butler Trio,  Toubab Krewe,  Cornmeal, Greensky Bluegrass, Hot Buttered Rum,  Jeff Daniels, The Everyone Orchestra, The Duhks, and many others.For all their traveling, The Ragbirds maintain a steady connection to their home base.  While reflecting on Michigan, Erin had this to say “… It’s a beautiful place to be, snuggled in the Great Lakes, close enough to hold hands with Canada. It is connected to a secret, mysterious, magical place called the U.P., but most of all there is an amazingly talented and humbly supportive music community that spreads through the state, clustered into groups in Ann Arbor and Lansing, Grand Rapids, Flint, Traverse City and Detroit. The scene (and scenery) keeps us fueled with love and inspiration.”\n\n2016 Lineup \n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "source": "Facebook", "date": "2016-08-11T12:00:00-04:00", "name": "The Ragbirds / August 11th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE"}, {"url": "https://www.facebook.com/events/907978549331891/", "description": "Our Brewery of the Month for August is Brewery Vivant!  Come drink some of their fine beer, and learn about how this local brewery is changing the sustainability game. Cheers!", "source": "Facebook", "date": "2016-08-11T17:00:00-04:00", "name": "Beer Tasting with Brewery Vivant"}, {"url": "https://www.facebook.com/events/1778863865683283/", "description": "Featuring the newly released Zingerman’s Guide to Good Leading, Part 4; A Lapsed Anarchist’s Approach to the Power of Beliefs in Business (a copy of the book is included in the price of each seat.)\n\nAlthough most of us don’t realize it, our beliefs have a major impact on how things go in our lives. What we believe may or may not be true, but unknowingly most of us will behave in ways that reinforce our beliefs anyways. At this breakfast, Ari Weinzweig, Co-Founder and CEO of Zingerman’s Community of Businesses, will take a look at how the impact of those beliefs likely play out in our day to day experiences in the workplace, and how we and our workplaces are impacted by those beliefs. Whether we accept it or not, what we believe about ourselves, about our organization, our co-workers, our boss, the work that we do and our ability to do it will significantly alter the outcomes we are seeking to achieve. And how, by becoming more mindful of our beliefs, we can effectively backtrack—by altering our beliefs, we change the way we see our work and the world and then, in turn, significantly alter the outcomes we get from our efforts.\n\nIt is our belief you will leave breakfast with a full stomach and a full mind - with new insights, tips and techniques into how you can become more mindful of your own beliefs and how you can positively affect your surroundings by changing your beliefs.\n\nBreakfast is served!\n- Fresh Fruit Platter\n- Zingerman’s Bakehouse Coffee Cakes\n- Corned Beef Hash\n- Applewood Smoked Bacon\n- Zingerman’s Coffee Co. Roadhouse Joe and Detroit St. Decaf", "source": "Facebook", "date": "2016-08-12T08:00:00-04:00", "name": "Beliefs, Business and Breakfast"}, {"url": "https://www.facebook.com/events/626712344171582/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "source": "Facebook", "date": "2016-08-12T15:00:00-04:00", "name": "Drink & Draw / Imbibe & Inscribe"}]