[{"description": "To celebrate Cinco de Mayo, we're doing made-to-order tostadas, just 2/$5. Olé!\n\n12-2\n\n5-7", "url": "https://www.facebook.com/events/775039052632347/", "source": "Facebook", "date": "2016-05-05T12:00:00-04:00", "name": "Cinco de Mayo Tostada Bar"}, {"description": "To celebrate Cinco de Mayo, we're doing made-to-order tostadas, just 2/$5. Olé!\n\n12-2\n\n5-7", "url": "https://www.facebook.com/events/271437596531040/", "source": "Facebook", "date": "2016-05-05T12:00:00-04:00", "name": "Cinco de Mayo Tostada Bar"}, {"description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 12 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 12, in store or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse = 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "url": "https://www.facebook.com/events/110005266066559/", "source": "Facebook", "date": "2016-05-05T12:00:00-04:00", "name": "Fresh + Fit!"}, {"description": "Literati is thrilled to welcome Jennifer Haigh in support of her latest novel, Heat and Light, a staff favorite and our Literati Cultura pick for May!\n\nMairead's review:\n\n“Heat & Light is a many-voiced and multi-faceted portrait of a place--small-town, fracking-bound Pennsylvania--and its people: pastors and farmers, environmentalists and drill rig workers, prison guards and their prisoners. The book is wildly ambitious--spanning more than thirty years, its many events seen through the eyes of a dozen different characters--and just as wildly successful. In prose that zips and smarts, taut and electric, Haigh renders every one of her many characters in all their moving and human complexity. The result is a fully realized world, and an unforgettable novel.”\n\nJennifer Haigh returns to the Pennsylvania town at the center of her iconic novel Baker Towers, in this ambitious, achingly human story of modern America and the conflicting forces at its heart.\n\nForty years ago, Bakerton coal fueled the country. Then the mines closed, and the town wore away like a bar of soap. Now Bakerton has been granted a surprise third act: it sits squarely atop the Marcellus Shale, a massive deposit of natural gas. To drill or not to drill?  Prison guard Rich Devlin leases his mineral rights to finance his dream of farming. He doesn’t count on the truck traffic and nonstop noise, his brother’s skepticism or the paranoia of his wife, Shelby, who insists the water smells strange and is poisoning their frail daughter.  Meanwhile his neighbors, organic dairy farmers Mack and Rena, hold out against the drilling—until a passionate environmental activist disrupts their lives.\n\nHeat and Light depicts a community blessed and cursed by its natural resources. Soaring, ambitious, it zooms from drill rig to shareholders’ meeting to the Three Mile Island nuclear reactor to the ruined landscape of the “strippins,” haunting reminders of Pennsylvania’s past energy booms.  This is a dispatch from a forgotten America—a work of searing moral clarity from one of the finest writers of her generation, a courageous and necessary book.\n\n“Heat and Light achieves pure novelistic virtuosity. It’s brilliant beginning to end.” — Richard Ford\n\n“Heat and Light is a work of tremendous sweep and ambition, a timely, inventive novel powered by Jennifer Haigh’s remarkable compassion for her characters.” — Jess Walter, author of Beautiful Ruins\n\n“Paragraph by paragraph, the prose is full of marvelous texture and material sensation. Heat and Light is an intricate and ambitious novel, firmly grounded in history and our time. The narrator’s encyclopedic knowledge and keen insights about the physical world and social life make the novel a thrilling page turner.” —Ha Jin, National Book Award-winning author of Waiting\n\nJennifer Haigh is the author of four previous novels: Faith, The Condition, Baker Towers, and Mrs. Kimble, winner of the PEN/Hemingway Award for debut fiction. Her short story collection News from Heaven won the Massachusetts Book Award and the PEN New England Award in Fiction. Haigh's short stories have appeared in The Atlantic, Granta, The Best American Short Stories and many other places. She lives in Boston.", "url": "https://www.facebook.com/events/264298877243879/", "source": "Facebook", "date": "2016-05-05T19:00:00-04:00", "name": "Fiction at Literati: Jennifer Haigh"}, {"description": "Learn how to make beautiful paper flowers while helping AOT prepare for the inaugural James K. Berg Award gala on May 20th.  The paper flowers will be sold to raise funds and awareness of an upcoming tour of our “La Traviata” adaptation, which addresses the stigma surrounding mental illness and suicide.  They will also be used to create large topiaries that will be featured at the gala.  No experience is necessary, but it would be useful to bring a good pair of paper scissors and a glue gun (if you have one).  We will provide the papers, the instruction and other tools needed to create gorgeous, paper flowers.  They’d even make a wonderful gift for any woman you wish to honor this mother’s day.\n\nLight refreshments will be provided - Park along the street, as this is the home of artistic director, Shawn McDonald", "url": "https://www.facebook.com/events/1084674421593287/", "source": "Facebook", "date": "2016-05-05T19:00:00-04:00", "name": "Paper Flower Making Party 2"}, {"description": "http://cafegive.com/make_the_match/boaa-volunteermatch\nWe believe everyone should have the chance to make a difference. That's why United Way of Washtenaw County's Volunteer Center makes it easy for good people and good causes to connect. The Bank of Ann Arbor is a proud sponsor and matching all donations up to $3,000 for a grand total of $3,000 for this amazing volunteer program. www.volunteerwashtenaw.org\n\nPlease share this on your social media to help us hit our goal!!", "url": "https://www.facebook.com/events/1739721849644306/", "source": "Facebook", "date": "2016-05-06T14:00:00-04:00", "name": "Bank of Ann Arbor is matching donation up to a total of $3,000 for United Way's Volunteer program"}, {"description": "First Fridays Ypsilanti is back and we are ready to celebrate this monthly art & culture walk right here in Ypsi.\n\nCultivate, in partnership with the bank of ann arbor bring to you two local musicians that we love, Nicole P'Simer and Spencer Michaud.  \n\n7 PM Nicole P'Simer is local acoustic guitarist, singer, songwriter & self-proclaimed maker of utter silliness. \n\n8-10 PM  Spencer Michaud is a narrative singer-songwriter that uses an elastic tenor voice to cover an incredible range of genres and emotions.  \n\nMatthew Altruda, host of Tree Town Sound and curator of Bank of Ann Arbor's Sonic Lunch will be bartending and donating his tips for the night as well. \n\nThe full list of events around town can be found at First Fridays Ypsi: MAY 2016.", "url": "https://www.facebook.com/events/1704282199819271/", "source": "Facebook", "date": "2016-05-06T18:00:00-04:00", "name": "First Fridays Featuring Spencer Michaud wsg/ Nicole P'Simer"}, {"description": "Literati is pleased to welcome poet Maggie Smith in support of her most recent collection, The Well Speaks of Its Own Poison.\n\nDelving into the depths of fairy tales to transform the daily into encounters with the marvelous but dangerous, Maggie Smith’s poems question whether the realms of imagination and story can possibly be safe. Even as her compressed stories are unfolding on a suburban cul de sac, they are deep in the mythical woods, “where children, despite their commonness, / are a delicacy.”\n\n“Maggie Smith’s collection is magical and troubling.… Time alternates between the forest where there are refrigerator magnets and safety belts, and The Forest where you, a now-human you, once preened ‘your blue-black wings.’… Time stops for violence and passion. Be intrigued. Find yourself welcome.” — Kimiko Hahn\n\n“Some kind of primary mythic world lies behind and throughout these adult tales of ultimate matters.… as much about the terrible and beautiful dreams of children as it is about waking up as a parent. This is a rare book of poems.” — Stanley Plumly\n\n“Enchantment: that rarest of all poetic gifts. As when the neurons, in the kaleidoscopic movie they call a “functional MRI,” speak to us in colors on a screen from the deepest recesses of what we already know. Maggie Smith’s are poems of transformation: haunting, gorgeous, intimately unsettling. I cannot remember when I last read a book to match her powers of delight.” — Linda Gregerson\n\n“Folk tales and their eerie, animistic wisdom are a wellspring for these powerful lyrics. The poems are ethereal and dark, brimming with dread, beauty, and rapture. The Bloody Chamber, Angela Carter’s arresting prose engagement with fairy tales, comes to mind. Smith updates motifs of the pacts children make with nature, the power of luck and curses, loss of innocence, the vulnerable and the sinister, primal fears of being eaten, and much more. The images are so fresh and inventive they shimmer. Original, cautionary, rich, delicious, The Well Speaks…is a spellbinding collection.” — Amy Gerstler\n\nMaggie Smith holds a BA from Ohio Wesleyan University and an MFA from The Ohio State University. Her previous books are Lamp of the Body (Red Hen Press, 2005) and three prizewinning chapbooks, Disasterology (Dream Horse Press, forthcoming), The List of Dangers (Kent State/Wick Poetry Series, 2010), and Nesting Dolls (Pudding House, 2005). She lives with her husband and two children in Bexley, Ohio, where she works as a freelance writer and editor.\n\nEvent date: \nFriday, May 6, 2016 - 7:00pm", "url": "https://www.facebook.com/events/462393273957118/", "source": "Facebook", "date": "2016-05-06T19:00:00-04:00", "name": "Poetry at Literati: Maggie Smith"}, {"description": "Vocalist and composer Carla Cooke is the youngest daughter of the legendary Sam Cooke, whose musical life encompassed religion, romance, and history. Carla’s career mirrors that of her father, in that she crafted her sound in the church. Carla sought not to use her father’s name, but to build her own reputation. Now the younger Cooke knows that her roots are firmly entwined in her father's as she connects with them through his music.\n\nCarla Cooke’s style is diverse in gospel, Christian, R&B, soul, and pop styles. With a strong vocal range and warm personality, Carla shows that the apple doesn't fall far from the tree, as she channels the raw talent, emotion, beauty, and charisma of the Cooke family persona. www.carlacooke.com", "url": "https://www.facebook.com/events/919947144747827/", "source": "Facebook", "date": "2016-05-06T20:00:00-04:00", "name": "An Evening of Sam Cooke by Daughter Carla Cooke"}, {"description": "Garlic Mustard Weed-Out Day is an annual tradition! On one day, volunteers hand-pull invasive garlic mustard in natural areas all around Ann Arbor! Garlic mustard is an aggressive invasive plant which can quickly crowd out native plant species and decrease natural diversity in the woods. Identifying and pulling garlic mustard is fun and easy for all ages, making this is a great volunteer opportunity for families. \nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free. \nParticipating parks:\n•\tArgo - Meet at the north end of the Argo Canoe Livery parking lot near the entrance to the woods, 1055 Longshore Drive.\n•\tCedar Bend  - Meet us at the Island Park parking lot, at the end of Island Drive\n•\tHannah - Meet at the west end of Bath Street, off 7th, just north of Huron.\n•\tMarshall - Meet in the parking lot off Dixboro Road, north of Plymouth Road\n•\tMiller - Meet at the Arborview Boulevard entrance, just east of Wildwood Avenue.\n•\tWhite Oak - Meet at the park entrance on White Oak Drive.", "url": "https://www.facebook.com/events/1699521606955785/", "source": "Facebook", "date": "2016-05-07T09:00:00-04:00", "name": "Garlic Mustard Weed-Out Day!"}]