[{"description": "From epicraces.com: You’re no weekend running hobbyist. You’re the real deal. Other people’s workouts are your warm up. Wind, rain, snow, and darkness don’t faze you: just point you at a trail, mount you on a bike, aim you at a lake and you’re ready to roll. You eat miles for breakfast. You’ve been waiting for the Michigan triathlon that’s just as tough as you.  And now it’s here: the Ann Arbor Triathlon, presented by the Wolverine State Brewing Company. No maize and blue. No adamantium claws. Just you and nature, baby… and beer at the finish line. Rock on!\n\nThe 2016 Ann Arbor Triathlon will be held on Sunday, August 7, 2016 at Halfmoon Lake in the Pinckney State Recreation Area, one of the largest state parks in all of Michigan. You’ll swim the open waters of Halfmoon, bike the rolling country roads of the surrounding rural area, then run the 5-mile classic Poto Trail course to complete your mission: showing the world that you’re a rock star.\n\nTo register and for more information, go to epicraces.com!", "url": "https://www.facebook.com/events/1034739496621459/", "source": "Facebook", "name": "WolverineMan: The Ann Arbor Tri", "date": "2016-08-07T07:30:00-04:00"}, {"description": "We'll have our super fresh, flavorful, delicious tacos for you, just 3/$5. Taco 'bout it :)", "url": "https://www.facebook.com/events/1050308838398352/", "source": "Facebook", "name": "Taco 'Bout It", "date": "2016-08-07T15:00:00-04:00"}, {"description": "A2CT presents Othello, directed by David Widmayer.\n\nAuditions at the A2CT Studio (322 W. Ann Street):\nSunday, August 7 at 4:00 PM\nMonday, August 8 at 7:00 PM\n\nCallbacks @ 7:00 PM on Wednesday, 8/10, location TBA.\n\nText work will begin Wednesday, August 24, and rehearsals start Sunday, September 4. Production dates are October 27-30 at the Arthur Miller Theatre on U-M’s North Campus.\n\nAnn Arbor Civic Theatre is seeking ten to fifteen diverse actors for a production of Othello. With the original Shakespearean language intact, this production will be set at a lavish hotel in Saigon during the height of the Vietnam War. A new cut of the script by director David Widmayer emphasizes the role of war abroad and dramatic social change at home in shaping the characters’ attitudes and actions. No stage combat experience is necessary - actors will all have the opportunity to work with Melissa Freilich, a stage combat professional.\n\nActors must be age 16 or older to audition. Many roles will be available to actors of any gender identity. We hope that the cast will represent the growing diversity of the desegregated armed forces in the Vietnam War era, and strongly encourage actors of all ethnic backgrounds to audition. Auditioners may prepare a short (1-2 minute) Shakespearean monologue of their choice, or receive a monologue at auditions for a cold reading. At the audition, it is most important that actors demonstrate their ability to clearly convey the story - not just using the text, but using their body and range of emotional expression as well.\n\nPlease email the director with any questions, including requests for an alternate audition time. djwidmayer@gmail.com", "url": "https://www.facebook.com/events/276789659379778/", "source": "Facebook", "name": "Othello Auditions", "date": "2016-08-07T16:00:00-04:00"}, {"description": "At the Kerrytown Concert House this summer: Oscar Wilde’s The Importance of Being Earnest, directed by James Ingagiola.  Unbeknownst to his friends and acquaintances, John Worthing leads a double life:  He is Jack, a respectable landowner, in the country and Ernest in the city.  But when the love of his life, the elegant Gwendolyn Fairfax, insists that her dream is to marry a man named Ernest, John must abandon his dual identity–which may prove harder than it seems…especially when his friend Algernon visits John’s country estate pretending to be Ernest!  This “Trivial Comedy for Serious People” is truly one of the wittiest, funniest plays in the English language.  \n\nThe show will run August 4-6, with 8 p.m. start times on Thursday, Friday and Saturday, PLUS a 2 p.m. matinee on Saturday (there is no show on Sunday).\n\nThe cast will feature Amanda Barnett, Ethan Gibney, Elizaveta McFall, Amanda Photenhauer, Jan Romans, Annaliese Romans, Elizabeth Wagner, and Catherine Zudak.\n\nTickets are $15 for adults/$5 for students.  Visit http://www.kerrytownconcerthouse.com/index.php/events/event/BTE_earnest_thu/, call 734-769-2999 or email reservations@kerrytown.com for tickets.", "url": "https://www.facebook.com/events/1597811077198277/", "source": "Facebook", "name": "The Importance of Being Earnest", "date": "2016-08-07T20:00:00-04:00"}, {"description": "Now through next Thursday, all our Private Label supplements and essential oils are 25% off! Stock up on nutritional support, tintures, essential oils for health or aromatherapy, vitamins, and more. While supplies last.", "url": "https://www.facebook.com/events/268595390193528/", "source": "Facebook", "name": "25% Off Lucky's Market Supplements", "date": "2016-08-08T10:00:00-04:00"}, {"description": "A2CT presents Othello, directed by David Widmayer.\n\nAuditions at the A2CT Studio (322 W. Ann Street):\nSunday, August 7 at 4:00 PM\nMonday, August 8 at 7:00 PM\n\nCallbacks @ 7:00 PM on Wednesday, 8/10, location TBA.\n\nText work will begin Wednesday, August 24, and rehearsals start Sunday, September 4. Production dates are October 27-30 at the Arthur Miller Theatre on U-M’s North Campus.\n\nAnn Arbor Civic Theatre is seeking ten to fifteen diverse actors for a production of Othello. With the original Shakespearean language intact, this production will be set at a lavish hotel in Saigon during the height of the Vietnam War. A new cut of the script by director David Widmayer emphasizes the role of war abroad and dramatic social change at home in shaping the characters’ attitudes and actions. No stage combat experience is necessary - actors will all have the opportunity to work with Melissa Freilich, a stage combat professional.\n\nActors must be age 16 or older to audition. Many roles will be available to actors of any gender identity. We hope that the cast will represent the growing diversity of the desegregated armed forces in the Vietnam War era, and strongly encourage actors of all ethnic backgrounds to audition. Auditioners may prepare a short (1-2 minute) Shakespearean monologue of their choice, or receive a monologue at auditions for a cold reading. At the audition, it is most important that actors demonstrate their ability to clearly convey the story - not just using the text, but using their body and range of emotional expression as well.\n\nPlease email the director with any questions, including requests for an alternate audition time. djwidmayer@gmail.com", "url": "https://www.facebook.com/events/276789659379778/", "source": "Facebook", "name": "Othello Auditions", "date": "2016-08-08T16:00:00-04:00"}, {"description": "Are you interested in learning more about how to care for our natural areas? Then join the Stewardship Network's Huron Arbor cluster for an informal discussion on a monthly topic with volunteer and professional land stewards, plus others interested in nature. Free! This month’s topic: Kerry Gray will be talking about forest pests:  Our woods are under attack - You may know all about Emerald Ash Borer, but can you identify signs of Oak Wilt or other tree pests? Bring your questions and join us for a discussion about threats to urban forests.", "url": "https://www.facebook.com/events/1542034336104534/", "source": "Facebook", "name": "Stewards' Circle- Forest Pests", "date": "2016-08-09T07:30:00-04:00"}, {"description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nIsaac Berkowitz and Chris Bota are guitarists in the Michigan rock band, Desmond Jones. As an acoustic duo, they blend blugrass and country acoustic guitar style with their band's original tunes. \nDesmond Jones is a five-piece funk/rock/jazz fusion band from Grand Rapids, Michigan. With original music written to compliment the group's sound as a whole, the music is centered around melodic guitar riffs, smooth bass lines, funky drum beats, and some saxophone.\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/1114924125197190/", "source": "Facebook", "name": "Acoustic Tuesdays: Isaac Berkowitz and Chris Bota", "date": "2016-08-09T19:00:00-04:00"}, {"description": "You capture audiences with savvy electronic marketing.  But how do you captivate others in person?  Every marketing brand has people behind it. People, who must connect with clients in person, on the phone, or virtually.  You and your employees are the presence and continuation of your brand.  In today's world, people can tune you out (not just your clients). There IS something YOU CAN DO to be listened to and understood.\nYou will instantly see it's more than just what you say, that will capture your audience!", "url": "https://www.facebook.com/events/1135308653198154/", "source": "Facebook", "name": "Speak So They Listen - Transforming How We Communicate", "date": "2016-08-10T11:45:00-04:00"}, {"description": "Now through next Thursday, all our Private Label supplements and essential oils are 25% off! Stock up on nutritional support, tintures, essential oils for health or aromatherapy, vitamins, and more. While supplies last.", "url": "https://www.facebook.com/events/268595390193528/", "source": "Facebook", "name": "25% Off Lucky's Market Supplements", "date": "2016-08-11T10:00:00-04:00"}]