[{"date": "2016-11-17T17:30:00-05:00", "description": "Free and open to the public. Seating is first come, first served.\nColm Tóibín is an Irish novelist, short story writer, essayist, playwright, journalist, critic, and poet. His seventh novel, Brooklyn, was recently adapted into a major motion picture, and his most recent novel, Nora Webster, received the Hawthornden Prize in 2015. Tóibín has been shortlisted for the Booker Prize on three different occasions, and been awarded the Los Angeles Times Novel of the Year, the Lamda Literary Award, the Costa Novel Award, and the Irish PEN Award, among many others. A celebrated essayist as well, Tóibín’s latest nonfiction book, On Elizabeth Bishop, offers a deeply personal introduction to the work and life of the American poet, who was one of his most important literary influences.", "url": "https://www.facebook.com/events/952333384898221/", "name": "Zell Visiting Writers Series: Colm Tóibín", "source": "Facebook"}, {"date": "2016-11-17T18:00:00-05:00", "description": "Yoga in the Gulo Room is back! Earn your beer with Robin Schultz-Purves, owner of Yoga Rising. $20 gets you one hour of all-levels vinyasa yoga followed by a pint of your choice at the end of class. Bring your friends and a mat -- register here! https://www.universe.com/wsbcpintsandposes", "url": "https://www.facebook.com/events/718292594988796/", "name": "Pints and Poses", "source": "Facebook"}, {"date": "2016-11-17T18:30:00-05:00", "description": "Gobble gobble! Feast your eyes on the lineup for NNA2 #40, featuring a hearty helping of some of the best folks from Ann Arbor's food scene. Joel Panozzo of The Lunch Room guides us through his approach to veganism, including his take on tofu. Ann Arbor Distilling Company's Phil Attee gives us a glimpse into how booze is born, and walks us through a day in the life of a distiller. Last, but certainly not least, Mike White from Zingerman's slices us off a hunk of some pungent, delectable cheese knowledge. So put on your elastic-waist pants and turkey-trot your way over to Live — and raise a glass with your fellow nerds!\n\nWhen: Thursday, November 17, 2016, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER, thanks to your friendly neighborhood AADL!", "url": "https://www.facebook.com/events/1794382900803666/", "name": "Nerd Nite Treats: A Cornucopia of Cheese, Cocktails, and Vegan E", "source": "Facebook"}, {"date": "2016-11-17T19:00:00-05:00", "description": "Literati is pleased to welcome Terri Tate in support of her memoir A Crooked Smile.\n\nIn A Crooked Smile, Terri Tate shares the compelling story of her journey through cancer diagnosis, multiple surgeries, and the inner path of self-discovery. With her wry ability to illuminate the profound and the absurd, she invites us to experience her ride on the emotional roller-coaster of fear and hope; personal experiences with nearly every spiritual practice ever devised; and her discovery that miracles, healing, and guidance can come to us in the most unexpected ways.\n\n\"Thrilling in its insight and first-rate storytelling! Terri writes like a dream, she describes dark material in a way that is totally honest, yet also jaunty and visceral, and makes it easy to read about.I laughed out loud while reading this book, over and over, and marked up it up like a student.\"--Anne Lamott, New York Times bestselling author of Bird by Bird and Traveling Mercies\n\nTerri Tate is a clinical nurse specialist, teacher, and humorist. Terri was first diagnosed with oral cancer in 1991, and is now a nationally recognized speaker; a consultant and therapist who uses lessons from her own struggle to help support anyone facing life challenges; and a stand-up comedienne with a popular one-woman show, Shopping As a Spiritual Path.", "url": "https://www.facebook.com/events/1168237243257470/", "name": "Terri Tate", "source": "Facebook"}, {"date": "2016-11-17T19:30:00-05:00", "description": "This program is free and open to the public. Seating is first-come, first-served.\n\nStudents from the Department of Dance, under the mentorship of Dance faculty members Sandra Torijano and Peter Sparling, will present dances in response to the works of Europe on Paper: The Ernst Pulgram and Frances McSparran Collection.\nThese drawings, paintings and watercolors of Austrian and German expressionist artists, will inspire performances by U-M Dance students that interpret the emotion, line and color of works by Gustav Klimt, Egon Schiele, Ernst Kirchner and Oskar Kokoschka.\nThe SMTD@UMMA performance series is generously supported by the Katherine Tuck Enrichment Fund and the Greg Hodes and Heidi Hertel Hodes—Partners in the Arts Endowment Fund.", "url": "https://www.facebook.com/events/584679638387596/", "name": "SMTD at UMMA: Image in Motion", "source": "Facebook"}, {"date": "2016-11-17T19:30:00-05:00", "description": "Test Batch features the newest crop of improv groups in our community. Come and watch these troupes test their chops on the Pointless stage. When they are all inevitably famous, you can say \"I saw them way back when....\"\n​\nThe Line Up:\n   - Longboard Form\n   - Unfiltered\n   - Bad Disco\n   - Gladstoned\n   - The Ice Cream Social\n   - Those Two", "url": "https://www.facebook.com/events/103556473455592/", "name": "Test Batch - November", "source": "Facebook"}, {"date": "2016-11-17T21:00:00-05:00", "description": "Thursday, November 17 | 9pm | 18+ | $14 adv./ $16 day of\n\nEl Ten Eleven wsg: Bayonne\n\n\"It’s surprising this record even got made,” bass player and songwriter Kristian Dunn reflects. “[Drummer] Tim’s dad died just before the recording was to begin. Obviously he needed to go back to Pittsburgh to be with his family. He returned to California relatively quickly, ready to work, and then I was struck with serious food poisoning.”\n\nAs soon as one band member in the duo was ready to work, it seemed the other had something come up. Even their engineer, Chris Cheney, had to leave in the middle of recording to go DJ for the Arizona Diamondbacks baseball team. Deadlines were rapidly approaching and the record wasn’t finished. “It was stressful, but it seemed to all work out,” Tim Fogarty adds.\n\nAppropriately, the record is all about family and the connection between parent and child. Opening with “Point Breeze” (an area in Pittsburgh in which Tim’s dad used to hang out when young) and moving right into “Scott Township” (an area of Pittsburgh where Fogarty did the same), the record is alive with sounds both futuristic and anachronistic.\n\nThe album is full of parental nods. “’Fast Forward’ is a band name my dad would always suggest when I was starting new bands in high school. I thought it was stupid and would blow him off! Now I actually think it’s cool. It really represents something that is old, but also forward looking and inventive.” Dunn explains. “Peter and Jack” is a thank you to father and son team Peter Hook (of New Order and Joy Division) and Jack Bates who, after playing some shows with El Ten Eleven, suggested to Dunn that he employ one of the six string basses they were using.\n\n“Not to exaggerate, but the effect those two had on El Ten Eleven is sort of incalculable. I wouldn’t have even considered the Bass VI if it weren’t for them. And the direction of the band definitely changed because of it,” Dunn says.\n\nThe record was written at their homes and practice studio in Atwater Village, and recorded with Cheney at Costa Mesa Recording Studio in Costa Mesa, CA. Dunn and Fogarty are the only musicians that appear on Fast Forward; everything you hear was done by the two of them using two basses, electronic drums, acoustic drums, and myriad looping pedals and effects.\n\nWhile most artists use looping technology improvisationally, Dunn and Fogarty see the loopers themselves as another instrument. Over a decade plus together they’ve attained hard-won virtuosity with the devices, and can now concentrate on songwriting itself rather than logistics. “Nothing we do is improvised” explains Dunn. “When we first started playing shows we’d sometimes run into troubles with the loops and have to stop and retry songs!”\n\n“It’s almost like our rig itself is an instrument we’ve had to master,” he continues. “I’ll loop Tim’s electronic drums with one of my pedals while looping my own bassline, then switch to my six string bass midsong while he moves to playing acoustic drums, layering up the sonics and shaping the song as it all grows.” By refusing to use anything pre-recorded live they’ve pushed themselves into new territory, now able to deftly recreate their complex compositions nightly.", "url": "https://www.facebook.com/events/619658961515550/", "name": "El Ten Eleven w/ Bayonne 11/17/16 at Blind Pig - Ann Arbor", "source": "Facebook"}, {"date": "2016-11-18T15:00:00-05:00", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/360781184260443/", "name": "Drink & Draw / Imbibe & Inscribe", "source": "Facebook"}, {"date": "2016-11-18T16:00:00-05:00", "description": "Bring your well-worn items that could use a tune up, and we'll take a look at them! \n\nOr, make someone else's day by volunteering at Fix-It Friday and repairing their items.\n\nFix-It Friday:\nThink of this as the last chance before you get rid of something; Free, but no Guarantee.\n\nWe will:\n- try to diagnose what is wrong\n- tell you if we think we may be able to fix it today\n- tell you if you'll need a part, and where you might be able to get it\n- try to fix it to the best of our ability, but in the limited time we have\n\nHowever, we may not be able to fix it. Many products are not designed to be fixed, and just opening them up may damage them. Furthermore, we may not have someone on hand with the expertise to do a proper repair. Also, it may require a special part, tools, information, or materials to repair, or it may just require more time than we have.\n\nWe may end up damaging your item even more. Please let the repairer know how comfortable you are at each stage of diagnosis and repair.\n\nItems that are often easier to repair: lamps, types of toys, broken wires, things that need epoxy/wood glue\n\nItems that are often very difficult to repair: consumer electronics such as CD/Cassette boom boxes, TVs, radios, CD players, VCRs, and DVD players", "url": "https://www.facebook.com/events/1430807266946738/", "name": "Fix-It Friday (third Friday of every month)", "source": "Facebook"}, {"date": "2016-11-18T16:00:00-05:00", "description": "Beginning November 4th, GameStart will be hosting a six-week series of Open House workshops called GameLab. Each week will feature a FREE to participate class, rotating* between two of GameStarts most popular courses: Game Creation with Unity and Minecraft Python Programming. Students are invited to try out and retake each class as often as they'd like during the six-week term.\n\nGameLab Course Schedule:\nNovember 4th, 4:00pm - 5:00pm: Minecraft Python Programming\nNovember 11th, 4:00pm - 5:00pm: Game Creation with Unity\nNovember 18th, 4:00pm - 5:00pm: Minecraft Python Programming\nNovember 25th, 4:00pm - 5:00pm: Game Creation with Unity\nDecember 2nd, 4:00pm - 5:00pm: Minecraft Python Programming\nDecember 9th, 4:00pm - 5:00pm: Game Creation with Unity\n \n*Note: Course topics will be repeated between each rotating week, but students are invited to experiment with the material in as many ways as they'd like during each visit.", "url": "https://www.facebook.com/events/1714187022234961/", "name": "GameLab: Open House (3/6)", "source": "Facebook"}]