[{"url": "https://www.facebook.com/events/280243392370950/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "source": "Facebook", "date": "2017-02-09T08:00:00-05:00", "name": "10% For Good for Community Action Network"}, {"url": "https://www.facebook.com/events/368216473550243/", "description": "Marriot Marquis, Meeting Level One\nThe Catholic Room\n\nAWP Reception for the University of Michigan's Helen Zell Writers' Program — an opportunity for current program faculty and students to gather with alumni and friends. Light refreshments will be available.", "source": "Facebook", "date": "2017-02-09T18:30:00-05:00", "name": "AWP 2017 Michigan Reception (Helen Zell Writers' Program)"}, {"url": "https://www.facebook.com/events/239816876464532/", "description": "Gather, share, learn, and enjoy with other woodworkers. More info at http://semiww.org/ and here on Facebook at https://www.facebook.com/groups/156651268065872/", "source": "Facebook", "date": "2017-02-09T19:00:00-05:00", "name": "Southeast Michigan Woodworkers (second Thursday of the month)"}, {"url": "https://www.facebook.com/events/1638288823141376/", "description": "Board+Brew is back online and  the Bar @ 327 is hosting our evening! Come play games, enjoy some fine foods, and choice beverages with us.", "source": "Facebook", "date": "2017-02-09T19:00:00-05:00", "name": "Board+Brew with the Bar at 327 Braun Ct"}, {"url": "https://www.facebook.com/events/576635379198686/", "description": "Our featured author is Cole Lavalais whose short stories can be found in Obsidian, Apogee, Warpland, Tidal Basin Review, Aquarius Press, and more. She is a fellow of the Kimbilio Center for Black Fiction, VONA and the Callaloo Writing Workshops. She's been awarded writing residencies at the Vermont Studio Center and The Noepe Center for the Literary Arts. She holds an M.F.A. from Chicago State University, and a Ph.D. in Creative Writing from University of Illinois at Chicago. \n\nAs a born and raised Chicagoan, she believes in encouraging, fostering, and championing writing by writers of color across genres. Cole has taught writing for over ten years and currently teaches community-based writing workshops on the south side of Chicago. Summer of the Cicadas is her debut novel.\n\nThe event begins with an Open Mic session when area poets can read their own work or share a favorite poem by another author in a welcoming atmosphere. This event is part of a series held on the second Thursday of most months at 7pm in partnership with  Les Go Social Media Marketing and Training.", "source": "Facebook", "date": "2017-02-09T19:00:00-05:00", "name": "Open Mic & Share Series feat Cole Lavalais"}, {"url": "https://www.facebook.com/events/246354659147851/", "description": "$5 / Under 21 $8 - 18+ - Doors 9:30 p.m. \n\n- GRIFFIN SCHULTZ - \nTechnometalloid sunshine. Electronic acoustic melodies with sweet guitar espresso. Local music boy. \n (❀˙˘˙)♡(˙˘˙❀)\nsoundcloud.com/worksboom\n\n- THE 4TH WALL - \nSome guy playing guitar and singing along to some homemade funky electronic beats.\n-- Link:  soundcloud.com/natezuellig\n\n- DAVE MENZO -\nKnown for his 'one man band on steroids' show, Dave has an elaborate looping setup that allows him to create dynamic tracks on the spot. His loops are controlled live, and operate as his backing band while he shreds and sings.\n-- Link: soundcloud.com/davemenzo\n\n- PAJAMAS -\nAnn Arbor based jam trio with an emphasis on high energy improvisation and booty movement. The trio is complete with intricate drumming, soaring lead guitar, and melodic, slap laden bass. Each performance is a musical experiment attempting to redefine performance as a righteous, never ending journey and not simply a list of songs back to back.\n-- Link: Facebook.com/pajamasband\n\n\n'Twil be a night of electro-acoustic fusion, funk, and vibratory liberation. Come and get down.", "source": "Facebook", "date": "2017-02-09T22:30:00-05:00", "name": "Dave Menzo / Pajamas / Griffin Schultz / the 4th Wall - LIVE 2/9"}, {"url": "https://www.facebook.com/events/1279411065486061/", "description": "This class will introduce you to the Amaya Bravo 16-Thread CNC Embroidery Machine and the Design Shop software that lets you create digitalized embroidery files from an image file. This machine is great for monogramming shirts or towels, decorating bags and accessories and making patches! Use the Design Shop software and design your own. There is also a baseball cap attachment! You will learn the basic operation with an emphasis on safety. With the successful completion of this class you will be certified to use the Amaya CNC Embroidery Machine on your own.", "source": "Facebook", "date": "2017-02-10T10:00:00-05:00", "name": "Learn to use the Amaya CNC Embroidery Machine"}, {"url": "https://www.facebook.com/events/1197760063612471/", "description": "Joins us for our special Valentine's Day creations all weekend long all they way through Valentine's Day. \n\nWe'll be featuring some great Food & Beverage Specials. To make your reservations visit SavasRestaurant.com/reservations or call us at 734-623-2233\n\nDRINK SPECIALS\n__________________\n\nA FRENCH ROSE\ncreme yvette, cocchi americano rosa, parigot rosé\n\nQUEEN OF HEARTS\nhendrick's gin, st. germain, lavender syrup, lemon juice, cranberry juice, apple-cranberry cider\n\nKING OF HEARTS\njohnnie walker red, averna, carpano antica, chocolate bitters\n\nDINNER SPECIALS\n__________________\n\nFILET & PRAWNS\nchoice grade 6 oz. filet with 2 jumbo prawns and beurre maître d’hotel. With pommes fondant and veal glazed carrots\n\nMOULES  CHAMPAGNE \nbay harbor mussels steamed in an herbed champagne cream broth, served with baguette\n\nOYSTERS\noysters, black pepper-balsamic sorbet, minced shallot, micro radish, cucumber brunoise\n\nHALF-ROAST CHICKEN\nbrined half-chicken, roasted fingerling potatoes, warm spinach salad with apple, sarvecchio and creamy bacon vinaigrette\n\nRISOTTO STUFFED SQUASH\nbutternut squash risotto, wild mushroom blend, braised leeks, roast acorn squash, curried romesco, roasted asparagus", "source": "Facebook", "date": "2017-02-10T17:00:00-05:00", "name": "Sava's Valentine's Day Featured Food & Beverage Specials"}, {"url": "https://www.facebook.com/events/1814728462131014/", "description": "Join us on Friday, February 10th for a tasting of our bottled offerings at Lucky's Market! We'll be on site to answer your beer questions and send you home with some stickers. See you there!", "source": "Facebook", "date": "2017-02-10T17:00:00-05:00", "name": "Lucky's Market Tasting"}, {"url": "https://www.facebook.com/events/377472489259538/", "description": "Don't miss Artini 2017, which in its 9th edition will once again transform the Downtown Ann Arbor area into a festive competition between the finest bars and restaurants, where the goal is to design the city's most artful martini!\n\nArtini will be on Friday, February 10, from 6:30 to 10:00 pm. Tickets will be for sale on Wednesday, January 4th for members of the Ann Arbor Art Center and on Friday, January 6th for all! As usual tickets will sell fast, so please make sure you purchase yours as soon as possible (in 2016 we sold out in 10 days!) to guarantee your spot.\n\nWHAT IS ARTINI?\n\nArtini is an annual fundraiser hosted by the Ann Arbor Art Center in which local bars and restaurants are invited to compete to create the most artful and innovative martini cocktail. Guests purchase tickets to participate in a fun bar crawl amongst the participating venues and spend the evening walking in Downtown Ann Arbor for the search of the best tasting martini.\n\nParticipating Venues (with new ones added daily!)\nAlley Bar\nAventura Ann Arbor\nBabs' Underground\nThe Beer Grotto Ann Arbor\nBlack Pearl\nConor O'Neills Ann Arbor\nFelix Bistro & Bar\nIsalita\nMélange\nThe Pretzel Bell\nThe Ravens Club\n\n*Attendees must be 21 or older by 2/10/2017. Ticket prices are $55 and are non-refundable. The Ann Arbor Art Center is a 501©(3) and $25 of your Artini ticket is tax deductible.\n\n#A2ARTINI\n\n--------------\n\nArtini 2017 is sponsored by Alex Milshteyn Real Estate Associates \n\nBeverage sponsor Two James Spirits", "source": "Facebook", "date": "2017-02-10T18:30:00-05:00", "name": "Artini 2017"}]