[{"date": "2016-10-09T09:00:00-04:00", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "url": "https://www.facebook.com/events/1676692335988216/", "name": "Maker Space Operations Bootcamp", "source": "Facebook"}, {"date": "2016-10-09T09:00:00-04:00", "description": "Stewardship Workday\nSaturday, October 8\nMarshall Nature Area\n9 a.m. to noon\nThis large nature area, which extends into a county park and University of Michigan property, is a valuable piece of wildlife habitat in the northeast part of the city. Come out to help us improve the habitat by removing invasive buckthorn and honeysuckle. This amazing nature area is sure to provide an incredible outdoor experience. Meet in the parking lot off Dixboro Road, north of Plymouth Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/1737852759803500/", "name": "Stewardship Workday-Marshall Nature Area", "source": "Facebook"}, {"date": "2016-10-09T09:30:00-04:00", "description": "Sylvie Granatelli Workshop\nSaturday, October 8 – Sunday, October 9 \n9:30am-4:30pm\n\nIn this two day demonstration workshop Silvie will work with porcelain clay, throwing a variety of forms. The pieces will be altered and built upon to demonstrate how she makes pots and thinks about design and function. The workshop will also focus on surface design and embellishment using slip trailing, carving and line drawing. Silvie is deeply engaged in practice of making functional pots and the theater and atmosphere of the dining experience. Silvie states: “I am interested in discussing how we learn techniques, develop ideas and evolve as innovators rather than imitators. Ideas come easily, but meaning seems to come in layers over decades of time. It is meaning that gives strength to good ideas.” Silvie invites participants to bring images of their work for discussion and questions and themes that we might discuss and all benefit from. How we evolve as makers in our increasingly technological world is a favorite topic of mine.\n\nSilvie Granatelli received her BFA from Kansas City Art Institute and her MFA from Montana State University. Since 1982 she has maintained a home and studio in Floyd, Virginia. Granatelli exhibits her work throughout the United States. She is a seasoned workshop presenter and teacher having taught students in colleges and art centers throughout the US and abroad.\n\nPlease take a moment to watch this interview with Silvie that is available on her website:\nhttp://silviegranatelli.com/interview/\nView less", "url": "https://www.facebook.com/events/1579703035671405/", "name": "Ceramics Workshop: Sylvie Granatelli", "source": "Facebook"}, {"date": "2016-10-09T10:00:00-04:00", "description": "Sunday, October 9, 10 a.m.–12 p.m. Starting Location: UMMA Store\r\n\nOn Sunday, October 9, UMMA will open from 10 a.m.–12 p.m. exclusively for a FREE ASD friendly program allowing families to enjoy art in a fun and welcoming atmosphere. Families will have access to special hands-on activities in the galleries that will help encourage exploration and discovery. Sketching and or writing materials will be available for children who prefer to work independently.\r\n\nThe Museum will also offer sunglasses, noise reducing earmuffs, and a quiet area with tactile toys for families who need to step away from the activities for a bit.\rThis event is recommended for ages 5-18, however all are welcome to participate. Registration is required and opens one month before the event date.\r\n\nVisit myturn.eventbrite.com to register!\rFor more information, please go to www.myturncommunity.org or call 734-647-0522.\r\n\n\"My Turn\" programs are coordinated by the Ann Arbor Hands-On Museum and take place on second Sundays throughout the year.", "url": "https://www.facebook.com/events/867216546711499/", "name": "My Turn Special ASD Access Hours", "source": "Facebook"}, {"date": "2016-10-09T10:00:00-04:00", "description": "Join us for Intuitives Interactive's 4th Annual FALL HOLISTIC & PSYCHIC EXPO! The largest event of its kind in Michigan! Once again, TWO DAYS LONG! Saturday-Sunday, October 8-9, 2016\n\nLOCATION: \nThe beautiful EMU Student Center\nEastern Michigan University in Ypsilanti (next-door to Ann Arbor)\n900 Oakwood Street, 2nd floor Ballroom and Auditorium \n(ground floor as you enter from the parking lot)\nYpsilanti, MI 48197\n~ TONS of FREE PARKING ~ \n(on Oakwood Street and N. Huron River Drive)\n\nSPONSORED BY: Body Mind Spirit Guide & Body Mind Spirit Radio, Crazy Wisdom Bookstore & Tea Room, and the Enlightened Soul Center\n\n- SATURDAY, OCTOBER 8, 2016 - 10:00 am - 6:00 pm\n      Doors open 9:30 am for registration on Saturday\n- 6 pm Saturday: STAY for the SPECIAL PRESENTATION:\n      International Psychic Medium LORI LIPTEN!!\n- SUNDAY, OCTOBER 9, 2016 - 11:00 am - 5:00 pm\n     Doors open 10:30 am for registration on Sunday\n\n**FIRST 50 PAID ATTENDEES EACH DAY**\nGET A GIFT BAG valued at $20 & CHANCE TO WIN A FULL-LENGTH HEALING or READING!\nEnergy Work/Medical Intuitive Session with Lori Irvin, ZSource\nConnection, OR a Channeled Psychic Reading with Amy Garber, Metafizzy LLC, Show Co-Director; Co-Founder, Intuitives Interactive\n\nThe READER ROOM IS FULL! See the readers who will be in our exclusive quiet, private room with concierge service:\nhttp://www.holisticpsychicexpo.com/readers-1\n\nTO APPLY FOR A BOOTH as a bodyworker, reader, or vendor in the Ballroom: http://www.holisticpsychicexpo.com/#!apply-1/dyc85\nAPPLICATION DEADLINE: September 9\nLate applications will be accepted until we are full, but may not be included in the promotions or handouts.\n\nADMISSION: \n$10 Daily Adult Ticket / $9 Online in advance by Oct. 6\n$15 Adult Weekend Pass / $13 Online in advance by Oct. 6\n$8 College students (daily pass)\n$5 Kids 12-17 yrs / Under 12 free \nPAID ADMISSION includes FREE presentations both days! \n\nADVANCE DISCOUNTED TICKETS ONLINE (thru Oct. 6):\nhttp://www.holisticpsychicexpo.com/#!purchase-tickets/p2a3m\n\n~ FEATURED PRESENTATION ~\nSaturday, October 8, 6:00 PM in the Auditorium:\nMEDIUMSHIP GALLERY READING with\n internationally acclaimed Psychic Medium LORI LIPTEN! \nREADINGS of DEPARTED LOVED ONES for the audience\nand sometimes CELEBRITIES COME THROUGH TOO!\n~ FREE with paid Expo Admission ~\n\nREADINGS: BOTH IN OUR PRIVATE READER ROOM (with Concierge Service and no interruptions) & AROUND THE VENDOR BALLROOM! \nThere will be Mediums, Psychics, Tarot & Angel Card Readers, and Intuitive & Channeled Readings...and more! \nSPECIALTY READINGS: Crystal Ball, Rare Hungarian Gypsy Cards, Runes, Numerology, Psychic Artist, Shamanic Stone Bowl...and more!\nhttp://www.holisticpsychicexpo.com/#!readers-1/xuu0n\nhttp://www.holisticpsychicexpo.com/vendors\n\nOTHER GREAT OFFERINGS INCLUDE: Aura Photography, Pyramids, Body & Energy Workers, Essential Oils, Vendors of Holistic & Metaphysical Products, Crystals & Stones, Jewelry, FREE Yoga Demos, and More!\nhttp://www.holisticpsychicexpo.com/#!vendors/tcvqd\n\nSCHEDULE of PRESENTATIONS free with Expo admisison at:\nhttp://www.holisticpsychicexpo.com/#!presentations/zngx1\n\nVOLUNTEERS NEEDED! Volunteers get special perks in exchange for their dedicated service. SIGN UP NOW at:\nhttp://www.holisticpsychicexpo.com/#!volunteer/glc6s\n\nMAILING LIST: Join our mailing list by filling out the form at:\nhttp://holisticpsychicexpo.com/\n\nThanks and we look forward to seeing YOU and your friends at this transformative event!!!", "url": "https://www.facebook.com/events/749295545208940/", "name": "4th Fall Holistic & Psychic Expo, Oct. 8-9, 2016", "source": "Facebook"}, {"date": "2016-10-09T11:00:00-04:00", "description": "Saturday, October 8, 11:15 a.m.–12 p.m. Meet by UMMA Store\r\n\nChildren ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. Meet in front of the UMMA Store.\rStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "url": "https://www.facebook.com/events/1013140175465605/", "name": "Storytime at the Museum", "source": "Facebook"}, {"date": "2016-10-09T13:00:00-04:00", "description": "Stewardship Workday\nSunday, October 9\nMary Beth Doyle Park\n1 to 4 p.m. \nThe 81 acres of Mary Beth Doyle Park include a nature area, disc golf course, playground and a storm water retention pond. Help us manage the nature area and improve wildlife habitat by gathering and dispersing seeds and removing invasive shrubs like honeysuckle and buckthorn. Please meet at the park entrance at the end of Verle Avenue. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/1362411323773466/", "name": "Stewardship Workday- Mary Beth Doyle Park", "source": "Facebook"}, {"date": "2016-10-09T15:00:00-04:00", "description": "http://bit.ly/2b6eyb1\n\nJonathan Rudinger, RN LMT has been instrumental in developing the field of canine massage for people at home and PetMassageTM at the professional level since the mid-1990’s. PetMassage workshops draw students from all over the worlds.  Jonathan has authored several books and DVD’s and taught over 300 professional level canine massage workshops. \n\nJonathan is often called upon for interviews in national media, invited to lecture about canine massage, and is recognized as a lobbyist supporting the rights for animal massage practitioners to practice legally. Recognized as an authority on massage for dogs, he has been featured in Whole Dog Journal, Dog Fancy Magazine, Natural Dog, Cosmopolitan, AARP, Glamour, Massage Magazine, Animal Wellness Magazine, Massage Today, Massage Therapy Journal, the New York Times and Wall Street Journal.  Jonathan has given live demonstrations at human massage, dog training, and veterinary conferences, at the Westminster Dog Show in New York and Crufts in the United Kingdom.\n\nJonathan's vision for the canine massage industry expands beyond this school. He is the founder and president of the International Association of Animal Massage and Bodywork. www.iaamb.org.", "url": "https://www.facebook.com/events/1820337424868650/", "name": "Art & Essence of Canine Massage Disccusion w/Demos", "source": "Facebook"}, {"date": "2016-10-09T20:00:00-04:00", "description": "COMICS and PERFORMERS: Please click \"See More\" below for spot request instructions for 10/9/16.\n\nWatch old comics develop new bits and new comics just develop at the UNclub (TM) at The Madhouse in Ypsilanti, MI.\n\nFor non-performers, a $5 suggested donation at the door to cover overhead.\n\nComics and performers, please follow these procedures for stage time:\n\n- Click \"Going\" on this Facebook Event. Even if you are thinking about it, you can click \"Interested\" so you can get updates on this page. Do this by 4:00pm, the day of the show. This does not guarantee you a spot, but not doing it puts you at the bottom of the list.\n- After 4:00pm Sunday, \"show ups\" can \"go up\" only if spots are available.\n- The line-up will be created just before showtime.\n- Those arriving after the line-up is finalized will be given spots as time permits.\n- Length of stage time will depend largely on the turn out, performer's experience, and the show-runner's discretion.\n- As always, if you show up and do not get a spot, you will be put at the top of the list for the next show.\n- Please refrain from bringing alcohol. Beer and wine will be available for purchase. You will need to buy a membership to drink, $2 for the day, or $10 for the whole year. Layout will be basically what we had before in Ypsi, boxes and cans with a container for money. \n\n--- Want to increase your odds of getting a spot? Here's some DO's and DON'T's\nDO . . . . Share this event page with your fans on your fan page, your facebook page, your website, or your tweets, or any other social media.\nDO . . . . Volunteer for less time. If you are willing to do 3 rather than 5, or 4 rather than 7, then you are more likely to get a spot.\nDO . . . . Come to the paid shows.\nDO . . . . Stay for \"meet and greet\" after shows.\nDO . . . . Answer poll questions whenever they appear on the event page.\nDO . . . . Bring people. This is not, I repeat NOT, a \"bringer.\" But if somebody has come to see you, it will be very hard to deny you a spot. In the past, we've had shows where we've added a minute of time for every person the comic brought as a non-performing audience member. Bring three people and a five minute spot becomes an eight minute spot.\n\nContact Mark at: www.facebook.com/marksweetman\n\nChili Challis, former staff writer for The Tonight Show with Jay Leno and nationally known comedian, writer and teacher says about The UNclub,\n\n\"The ... UNclub IS as close to a pure artist's way of pursuing, grasping and understanding comedy as I have ever known; not to mention it's open and fair to every talent, EVERY talent, even ones right off the street. Comics are allowed to go 'out there' and they're permitted to fail and still be welcomed back. It doesn't get any better than that as far as I'm concerned, and I've been known to be a bit fussy. This special venue is poised for the big wave, it is so ready and worthy of being discovered by an audience...and when they do it will be pure addiction.\"﻿", "url": "https://www.facebook.com/events/1762464237317178/", "name": "The UNclub wsg/ Andy Jentzen, at the Madhouse, October 9", "source": "Facebook"}, {"date": "2016-10-09T21:00:00-04:00", "description": "Reggae Workers of the World\nhttps://www.facebook.com/ReggaeWorkers/?fref=ts\n Vic Ruggiero ( The Slackers), Jesse Wagnerr ( The Aggrolites) and Nico Leonard ( Moon Invaders and The Caroloregians)\n\nDirty Notion\n https://www.facebook.com/DirtyNotion/?fref=ts\n$8\n \nmore tba", "url": "https://www.facebook.com/events/531633113686471/", "name": "Reggae Workers of the World / Dirty Notion( Scarboni's B Day )", "source": "Facebook"}]