[{"url": "https://www.facebook.com/events/1676692335988216/", "source": "Facebook", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "date": "2016-10-06T09:00:00-04:00", "name": "Maker Space Operations Bootcamp"}, {"url": "https://www.facebook.com/events/178290599278647/", "source": "Facebook", "description": "Thursday, October 6, 5:30–6:30 p.m.\r\nHelmut Stern Auditorium\n\nChina Miéville lives and works in London. He is a three-time winner of the prestigious Arthur C. Clarke Award (Perdido Street Station, Iron Council, and The City & the City) and has also won the British Fantasy Award twice (Perdido Street Station and The Scar). The City & The City, an existential thriller, was published in 2009 to dazzling critical acclaim and drew comparison with the works of Kafka and Orwell (The Times) and Phillip K. Dick (The Guardian). The City & The City recently won the British Science Fiction Award, the Arthur C. Clarke Award, and tied with Paolo Bacigalupi's The Windup Girl for the 2010 Hugo Award. It was also shortlisted for the Nebula.\rUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. \n\nThe Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please \rsee lsa.umich.edu/writers/readingsevents/zellvisitingwritersseries.com", "date": "2016-10-06T17:30:00-04:00", "name": "Zell Visiting Writers Series: China Miéville in conversation"}, {"url": "https://www.facebook.com/events/850779015057470/", "source": "Facebook", "date": "2016-10-06T17:30:00-04:00", "name": "China Miéville In Conversation with Josh Miller"}, {"url": "https://www.facebook.com/events/664614673705320/", "source": "Facebook", "description": "Thursday, October 6, 6–7:30 p.m. \nThe Silver Club\n\nIn this interactive, 90-minute program, University of Michigan Museum of Art docents and staff will demonstrate their use of art, music, storytelling and touch to create successful and rewarding experiences for visitors with memory loss, their families, and care-partners. The evening will also include tips and ideas from UMMA and Silver Club for using these modes to connect with loved ones at home or anywhere.\r￼The University of Michigan Museum of Art’s Meet Me Program has served people with\r \rmemory loss and their families and care partners for the last six years in partnership with Silver Club.\rThis program is free and light refreshments will be served.\rSilver Club will also provide a respite of alternative activities and refreshments for Silver Club members, or guests with memory loss during the program.\r\n\nRegistration: \rPlease register by emailing umma-program-registration@umich.edu so that we can accommodate all of your party, including people with memory loss who will join the Silver Club activity session.\r\n\nLocation\r: The Silver Club, 2401 Plymouth Road, Suice C Ann Arbor, Michigan 48105.\r\n\nQuestions:\r For more information about this program, please call Mary LaVenture at 734-647-0522 or The Silver Club Programs at 734-998-9349.\r\n\nMeet Me at UMMA is generously supported by the Monroe-Brown Foundation Discretionary Fund for Outreach to the State of Michigan and individual donors.", "date": "2016-10-06T18:00:00-04:00", "name": "The Senses are Alive and Well: Art, Music, and Connecting"}, {"url": "https://www.facebook.com/events/588314098007062/", "source": "Facebook", "description": "Nature Walk with Ann Arbor District Library\nThursday, October 6\n6 to 7:30 p.m. \nMary Beth Doyle Park\nMary Beth Doyle Park is an 81-acre park located a couple blocks east of the Malletts Creek branch of the AADL. It has both paved and unpaved trails that meander through woods and wetlands. A large pond near the center of the park is a wonderful area for wildlife viewing. During October, late fall wildflowers will be in bloom!\nThe nature walks are a collaboration between the AADL and Natural Area Preservation that take place once a month throughout the summer and fall. This is the final one of 2016! We'll be meeting in the parking area off Packard Road just east of Cobblestone Farm on the south side of the street. Wear comfortable clothes and bring water if desired. Some of the AADL Science Tools will be available for use during the walk, too!", "date": "2016-10-06T18:00:00-04:00", "name": "Nature Walk with Ann Arbor District Library- Mary Beth Doyle Park"}, {"url": "https://www.facebook.com/events/338071319866890/", "source": "Facebook", "description": "This event will take place on our main floor.\n\nLiterat is pleased to welcome Edward Dusinberre, author of Beethoven For a Later Age, in conversation with Steven Whiting, professor of musicology at the University of Michigan. This event is being held in conjunction with the UMS presentation of the Takács Quartet on October 8 and 9, at Rackham Auditorium. For more information or to purchase tickets, please visit ums.org.\n\n'They are not for you but for a later age!' -Ludwig van Beethoven, on the Opus 59 quartets\n\nBeethoven's sixteen string quartets are some of the most extraordinary and challenging pieces of music ever written. They have inspired artists of all kinds - not only musicians - and have been subject to endless reinterpretation. What does it feel like to be a musician taking on these iconic works? And how do the four string players who make up a quartet interact, both musically and personally?\n\nThe Takács is one of the world's pre-eminent string quartets. Performances of Beethoven have shaped their work together for over forty years. Using the history of both the Takács Quartet and the Beethoven quartets as the backbone to his story, Edward Dusinberre, first violinist of the Takács since 1993, recounts the exhilarating challenge of tackling these pieces. Beethoven for a Later Age takes the reader inside the daily life of a quartet, vividly showing the necessary creative tension between individual and group expression and how four people can enjoy making music together over a long period of time.\n\nThe key, the author argues, is in balancing continuity with change and experimentation - a theme that lies at the heart of Beethoven's remarkable compositions. No other composer has posed so many questions about the form and emotional content of a string quartet, and come up with so many different answers. In an accessible style, suitable for novices and chamber music enthusiasts alike, Dusinberre illuminates the variety and inherent contradictions of Beethoven's quartets, composed against the turbulent backdrop of the Napoleonic Wars and their aftermath, and shows that engaging with this radical music continues to be as invigorating now as it was for its first performers and audiences.\n\nEdward Dusinberre was born in 1968 in Leamington Spa, England, and has enjoyed playing the violin from a young age. His early experiences as concertmaster of the National Youth Orchestra of Great Britain encouraged him to choose music as a profession. He studied with the Ukrainian violinist Felix Andrievsky at the Royal College of Music in London and at the Juilliard School with Dorothy DeLay and Piotr Milewski. In 1990 he won the British Violin Recital Prize and gave his debut recital in London at the Purcell Room, South Bank Centre. Upon completion of his studies at Juilliard Dusinberre auditioned for the Takács Quartet, which he joined in 1993 as first violin.\n\nSteven Whiting, a native of Chicago, graduated from Macalester College in 1975 with a major in music (voice, piano) and a minor in German.He studied musicology at Christian-Albrechts-Universitaet in Kiel, Germany, on a Fulbright grant (1975–77) and sang for a season with the Chicago Symphony Chorus before pursuing graduate work at the University of Illinois. There he took an M.M. in Musicology with a thesis on “Erik Satie and Parisian Musical Entertainment,” and his Ph.D. with a dissertation on Beethoven’s early variations (“To the ‘New Manner’ Born”). Between degrees, he spent four years as a desk editor at A-R Editions of Madison, Wisconsin, sang with several early music groups, and performed in contemporary music ensembles. After teaching for two years at the University of Illinois, he came to the University of Michigan in 1991 as a visiting assistant professor.", "date": "2016-10-06T19:00:00-04:00", "name": "Edward Dusinberre with Steven Whiting"}, {"url": "https://www.facebook.com/events/1646167612272291/", "source": "Facebook", "description": "Author: \n\nLaurie Halse Anderson is a New York Times bestselling author known for tackling tough subjects with humor and sensitivity. Her work has earned numerous ALA and state awards. Two of her books, Speak and Chains, were National Book Award finalists. Chains also received the 2009 Scott O’Dell Award for Historical Fiction, and Laurie was chosen for the 2009 Margaret A. Edwards Award. Mother of four and wife of one, Laurie lives in Northern New York, where she likes to watch the snow fall as she writes. You can follow her adventures on Twitter @HalseAnderson, or visit her at www.MadWomaninthForest.com\n\nBook: \n\nReturn to the American Revolution in this blistering conclusion to the trilogy that began with the bestselling National Book Award Finalist Chains and continued with Forge, which The New York Times called “a return not only to the colonial era but to historical accuracy.”\n\nAs the Revolutionary War rages on, Isabel and Curzon have narrowly escaped Valley Forge—but their relief is short-lived. Before long they are reported as runaways, and the awful Bellingham is determined to track them down. With purpose and faith, Isabel and Curzon march on, fiercely determined to find Isabel’s little sister Ruth, who is enslaved in a Southern state—where bounty hunters are thick as flies.\n\nHeroism and heartbreak pave their path, but Isabel and Curzon won’t stop until they reach Ruth, and then freedom, in this grand finale to the acclaimed Seeds of America trilogy from Laurie Halse Anderson.", "date": "2016-10-06T19:00:00-04:00", "name": "Children's Author Laurie Halse Anderson Discussion & Signing"}, {"url": "https://www.facebook.com/events/317680438623928/", "source": "Facebook", "description": "No better way to throw a proper party than with GOLF CLAP & Friends!\n\nCountry Club Disco presents... Golf Clap\nwith opening sets by the Ghita Sisters & Brahj\n\nDJs; producers; club headliners; after-party enthusiasts: Golf Clap are Hugh Cleal and Bryan Jones, a Detroit duo with an unmatched passion for house music and a seemingly endless supply of studio and club-focussed creativity. And with releases on some of the world’s most influential house labels already under their belts, along with a lauded Boiler Room session and beyond, they’re only just getting started.\n\nProduced by Necto & Southpaw Events\n\nDoors open at 10pm | 18 + welcome with proper ID\n21+ get in FREE | $10 for 18-20\n\nhttps://countryclubdisco.com\nhttps://www.facebook.com/golfclapdet/\nhttps://soundcloud.com/golfclapdet\nhttps://twitter.com/golfclapdet\nhttps://boilerroom.tv/recording/golf-clap/\n\nwww.necto.com", "date": "2016-10-06T22:00:00-04:00", "name": "Golf Clap at Necto"}, {"url": "https://www.facebook.com/events/585713071616738/", "source": "Facebook", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "date": "2016-10-07T12:00:00-04:00", "name": "POP-X"}, {"url": "https://www.facebook.com/events/1785779555021709/", "source": "Facebook", "description": "Another fall season arrives not only with crisp air and beautiful weather, but also ABC's much anticipated festival, Oktoberfest! The celebration of beers, brats and Leiderhosen. \nWe're once again closing off the street and putting up the beer tents for our annual Oktoberfest street party! Join us at the corner of Main and Washington to enjoy a cool autumn evening under the stars with beer, brats, music, and dancing.\n(Parking available at the 4th and Washington parking structure) \n\n* 5-12 Friday \n* Live music provided by the Immigrant Sons. \nGet ready to Polka!! Friday night will feature the best Oom Pah Pa Band playing Traditional German Oktoberfest Music. The inception of Immigrant Sons is the culmination of all the musical history and heritage of the band members.  Immigrant Son plays a variety of music that makes people want to dance and tap their feet, creating the kind of fun that builds life long memories. \n\n* 5-12 Saturday\n* We're shaking things up for 2016 and are excited to announce that Saturday night's headlining band is our local favorite, Third Coast Kings!\n\nHailing from the Metro Detroit area in southeast Michigan, Third Coast Kings are a deep funk and heavy soul outfit that brings back the era of music one can only find on dusty old 45 records. Right from the beginning in 2007 the band delved into the old, funky catalog of vinyl records that DJ's and beat makers were using to get crowds moving. Over the years they have refined this sound into their own unique blend of the old and the new\n\n* No cover. \n* Must be 21 with valid ID. Children welcome with parents. \n* Brats, veggie brats, chips, pretzels, beer, wine, and soda will be available for purchase. \n* Call Beth at 734-213-1393 for more information. \n\nLeiderhosen optional (but pants required).", "date": "2016-10-07T17:00:00-04:00", "name": "Oktoberfest"}]