[{"description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "url": "https://www.facebook.com/events/189417071550325/", "source": "Facebook", "name": "Women's History Month and Planned Parenthood", "date": "2017-03-16T10:00:00-04:00"}, {"description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "url": "https://www.facebook.com/events/1839182856327434/", "source": "Facebook", "name": "Women's History Month and Planned Parenthood", "date": "2017-03-16T11:00:00-04:00"}, {"description": "Join us at Sava's to Celebrate St. Patrick's Day with our take on some traditional Irish Classics.\n\nFOOD SPECIALS\n\nPOTATO & PARSNIP SOUP\nleeks, garlic, cream, buttermilk, nutmeg, cracked black pepper, chives, toasted irish soda bread with cultured butter     $6\n\nBEER CHEESE BALL\nsharp cheddar, brown ale, spicy mustard, cayenne, chives, celery seed, sesame seeds, scallion, crackers, crudités, quick pickled vegetables, pretzel bread     $9\n\nCORNED BEEF SANDWICH\nbraised corned beef, brinery sauerkraut, horseradish cheddar, gruyère, farm bread, with french fries      $12\n\nCORNED BEEF BRISKET\nbraised cabbage and onions, roasted carrots and fennel with caraway seeds, smashed redskin potatoes with kale and chives, spicy horseradish cream      $18\n\nDRINK SPECIALS\n\nJAMESON IRISH WHISKEY\n$5 shots\n\nSNAKES ON A SHAMROCK\n$4 pints wolverine state brewing co. | irish red lager", "url": "https://www.facebook.com/events/404085033287135/", "source": "Facebook", "name": "Sava's St. Patrick's Day Featured Specials", "date": "2017-03-16T17:00:00-04:00"}, {"description": "We're so excited to launch the all new Vinology Wine Club!\n\nJoin our wine tasting event to kick start the wine club.  Admission included for club members, and half off any guest!", "url": "https://www.facebook.com/events/239307969872948/", "source": "Facebook", "name": "Wine Tasting & Launch Of The Vinology Wine Club", "date": "2017-03-16T17:00:00-04:00"}, {"description": "Marie Howe was born in 1950 in Rochester, New York. She worked as a newspaper reporter and teacher before receiving her MFA from Columbia University in 1983. Her most recent book, The Kingdom of Ordinary Time (W. W. Norton, 2009) was a finalist for the Los Angeles Times Book Prize. Her other collections of poetry include What the Living Do (1998) and The Good Thief (Persea, 1988), which was selected by Margaret Atwood for the 1987 National Poetry Series. Her other awards include grants from the John Simon Guggenheim Foundation, the Bunting Institute, and the National Endowment for the Arts. She has taught at Tufts University and Dartmouth College, among others. Currently she teaches at Sarah Lawrence College, New York University, and Columbia University. She lives in New York City with her daughter.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon ’13). For more information, please visit the Zell Visiting Writers Series webpage.", "url": "https://www.facebook.com/events/1212441305476608/", "source": "Facebook", "name": "Zell Visiting Writers Series: Marie Howe, Poetry", "date": "2017-03-16T17:30:00-04:00"}, {"description": "Literati is delighted to welcome Dan Chaon in support of his latest novel, the staff-favorite Ill Will. Dan will be joined for a post-reading conversation by UM MFA first year in fiction Sam Krowchenko.\n\nTwo sensational unsolved crimes—one in the past, another in the present—are linked by one man’s memory and self-deception in this chilling novel of literary suspense from National Book Award finalist Dan Chaon. “We are always telling a story to ourselves, about ourselves.” This is one of the little mantras Dustin Tillman likes to share with his patients, and it’s meant to be reassuring. But what if that story is a lie? A psychologist in suburban Cleveland, Dustin is drifting through his forties when he hears the news: His adopted brother, Rusty, is being released from prison. Thirty years ago, Rusty received a life sentence for the massacre of Dustin’s parents, aunt, and uncle. The trial came to epitomize the 1980s hysteria over Satanic cults; despite the lack of physical evidence, the jury believed the outlandish accusations Dustin and his cousin made against Rusty. Now, after DNA analysis has overturned the conviction, Dustin braces for a reckoning.\n\nMeanwhile, one of Dustin’s patients has been plying him with stories of the drowning deaths of a string of drunk college boys. At first Dustin dismisses his patient’s suggestions that a serial killer is at work as paranoid thinking, but as the two embark on an amateur investigation, Dustin starts to believe that there’s more to the deaths than coincidence. Soon he becomes obsessed, crossing all professional boundaries—and putting his own family in harm’s way. From one of today’s most renowned practitioners of literary suspense, Ill Will is an intimate thriller about the failures of memory and the perils of self-deception. In Dan Chaon’s nimble, chilling prose, the past looms over the present, turning each into a haunted place.\n\n“Dan Chaon’s new novel is subtly, steadily unnerving—like a scalpel slipping under your skin and prying it, ever so slowly, from the muscle beneath. Ill Will is a dark Möbius strip of a thriller that will leave you questioning what’s perceived and what’s imagined, and whether the reverberations of tragedy ever truly come to an end.”—Celeste Ng, author of Everything I Never Told You\n\nDan Chaon is the acclaimed author of Among the Missing, which was a finalist for the National Book Award, and You Remind Me of Me, which was named one of the best books of the year by The Washington Post, Chicago Tribune, San Francisco Chronicle, The Christian Science Monitor, and Entertainment Weekly, among other publications. Chaon’s fiction has appeared in many journals and anthologies, including The Best American Short Stories, Pushcart Prize, and The O. Henry Prize Stories. He has been a finalist for the National Magazine Award in Fiction, and he was the recipient of the 2006 Academy Award in Literature from the American Academy of Arts and Letters. Chaon lives in Cleveland, Ohio, and teaches at Oberlin College, where he is the Pauline M. Delaney Professor of Creative Writing.\n \n\nEvent date: \nThursday, March 16, 2017 - 7:00pm\nEvent address: \nLiterati Bookstore\n124 E. Washington St.\nAnn Arbor, MI 48104", "url": "https://www.facebook.com/events/1825093764374957/", "source": "Facebook", "name": "Dan Chaon, w/ Sam Krowchenko", "date": "2017-03-16T19:00:00-04:00"}, {"description": "Our first chapter meeting of the year will be held at Wolverine State Brewing at 7:00 p.m on Thursday, March 16th in the Gulo Room. The address for Wolverine State Brewing is: 2019 W Stadium Blvd, Ann Arbor, MI 48103. \n \nAt this meeting we'll be discussing :\n -The 2017 plans for the DTE Energy Foundation Trail\n -Events that are being planned for the coming year\n -Status of the trails, scheduled trail days and other plans for maintenance \n\nWe will also be inducting our new officers for 2017.  They will be:\n\nPresident - Carl Loomis\nVice-President - Jenny Schultz\nTreasurers - Mike & Michelle Balhorn\nSecretary - Andy Joseph\n\nHope to see you there!\n \nThe Poto Chapter Board", "url": "https://www.facebook.com/events/211470225987655/", "source": "Facebook", "name": "Poto Chapter Meeting", "date": "2017-03-16T19:00:00-04:00"}, {"description": "This once Texan, now New York-based quasi-collective has gone from a best-kept secret to one of the biggest bands on the international scene.\n\nAlthough still “underground” in many respects, the band followed up its first Grammy in 2014 (“Best R&B Performance”) with its second this past February for “Best Contemporary Instrumental Album.” They have earned high praise from critical stalwarts like the BBC, Village Voice, The Guardian, and the New York Times, as well as from the world’s most respected musicians, from Pat Metheny to Prince. Formed in 2004 at the acclaimed music school of the University of North Texas, the group was voted “Best Jazz Group” in Downbeat’s 2015 Reader’s Poll as well as “Best New Artist” in JazzTimes’s 2014 Reader’s Poll. Their music is a mixture of funk, jazz, gospel, rock, and R&B that strikes a perfect balance between pure musical virtuosity and raw soulful simplicity.\n\nMore info: http://ums.org/performance/snarky-puppy/", "url": "https://www.facebook.com/events/1742640832682915/", "source": "Facebook", "name": "Snarky Puppy", "date": "2017-03-16T19:30:00-04:00"}, {"description": "Join the Michigan Refugee Assistance Program (MRAP) as they host their capstone event on March 16, 2017 from 7:30-10:00 p.m. at the University of Michigan Museum of Art. At this event, the audience will have the opportunity to hear from former refugees who will be sharing their moving stories about resettling in the United States. The event will also host photographer Jim Lommasson, who will speak about his current project What We Carried, which depicts stories of displacement, loss, and the preservation of identity through objects brought from displaced Syrian and Iraqi refugees. Professionals in the refugee sector will then provide insight into the largest humanitarian crisis of our generation and how we can take action. This event will be followed by a reception with Jim Lommasson and members of the refugee community.\n\nOrganized by the Michigan Refugee Assistance Program, with support from the U-M LSA Student Government, Language Resource Center, International Institute, Multi-Ethnic Student Association, and the University of Michigan Museum of Art.\n\nTicket requires.", "url": "https://www.facebook.com/events/181895582297944/", "source": "Facebook", "name": "What We Carried: A Glimpse Into the Refugee Crisis", "date": "2017-03-16T19:30:00-04:00"}, {"description": "Thu. March 16 | 8pm | 18+ | $20 Cover\n\nKeller Williams\nDefinition: ADM (Acoustic Dance Music), solo acoustic guitar and voice with every other song walking the line of electronica. If you need a title to file under try electro-hippie acoustic downtempo.\n\n“What kind of definition is that?  It’s the kind of definition that will take you actually going to a show to decide for yourself and put it to your own words.  This element of my life is what I refer to as my day job. Which is essentially me finding new ways to entertain myself on stage in front of an audience.  Using technology and a technique, described by Dr. Didg, as live phrase sampling or looping, I am able to entertain myself for two sets. Nothing is prerecorded and all sounds and beats are created live by layering loops on top of one another and then singing or soloing over top if all if it.\n\nSee what I mean? Only being there can explain it.  The thousands of hours on YouTube cannot describe the feeling and vibe of one of my solo shows…..at least the feeling that I get. Drawing from almost 2 dozen releases as well as a ridiculous amount of covers, hours are spent on set lists that often get abandoned for requests from the audience. So much fun, it should be illegal and in some counties it is.” –Kw", "url": "https://www.facebook.com/events/1766983153566289/", "source": "Facebook", "name": "An Evening with Keller Williams 3/16/17 at Blind Pig - Ann Arbor", "date": "2017-03-16T20:00:00-04:00"}]