[{"source": "Facebook", "date": "2016-11-03T17:30:00-04:00", "name": "Zell Visiting Writers Series: Donovan Hohn and Rachel Richardson", "description": "Free and open to the public. Seating is first come, first served.\nDonovan Hohn is the recipient of the Whiting Writers’ Award, A National Endowment for the Arts Creative Writing Fellowship, and a Knight-Wallace Fellowship. His work has appeared in Harper’s Magazine, The New York Times Magazine, and Outside, among other publications. His book, Moby-Duck, was a finalist for the Helen Bernstein Prize for Excellence in Journalism, and runner-up for both the PEN/E. O. Wilson Literary Science Writing Award and the PEN/John Kenneth Galbraith Award for Nonfiction. A former features editor of GQ and contributing editor of Harper’s, Hohn now teaches creative writing at Wayne State University and lives with his family in Ann Arbor, where he is working on his second book.\n \nRachel Richardson is the author of two books of poetry, Copperhead (2011) and Hundred-Year Wave (2016), both selections in the Carnegie Mellon Poetry Series. She has received fellowships from the National Endowment for the Arts, the Sewanee Writers’ Conference, and the Wallace Stegner Program at Stanford University. Her poetry and prose have appeared in The New York Times, Guernica, New England Review, Kenyon Review Online, the Poetry Foundation website, The Rumpus, and elsewhere. Richardson is a contributing editor at Memorious and directs poetry programming for the Bay Area Book Festival. She lives with the writer David Roderick and their two children in Berkeley, California.", "url": "https://www.facebook.com/events/1804342093174211/"}, {"source": "Facebook", "date": "2016-11-03T18:15:00-04:00", "name": "Zell Visiting Writer Series", "description": "Donovan Hohn is the recipient of the Whiting Writers’ Award, A National Endowment for the Arts Creative Writing Fellowship, and a Knight-Wallace Fellowship. His work has appeared in Harper’s Magazine, The New York Times Magazine, and Outside, among other publications. His book, Moby-Duck, was a finalist for the Helen Bernstein Prize for Excellence in Journalism, and runner-up for both the PEN/E. O. Wilson Literary Science Writing Award and the PEN/John Kenneth Galbraith Award for Nonfiction.\n\n A former features editor of GQ and contributing editor of Harper’s, Hohn now teaches creative writing at Wayne State University and lives with his family in Ann Arbor, where he is Rachel Richardson is the author of two books of poetry, Copperhead (2011) and Hundred- Year Wave (2016), both selections in the Carnegie Mellon Poetry Series. She has received fellowships from the National Endowment for the Arts, the Sewanee Writers’ Conference, and the Wallace Stegner Program at Stanford University. Her poetry and prose have appeared in The New York Times, Guernica, New England Review, Kenyon Review Online, the Poetry Foundation website, The Rumpus, and elsewhere. Richardson is a contributing editor at Memorious and directs poetry programming for the Bay Area Book Festival. She lives with the writer David Roderick and their two children in Berkeley, California.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64).", "url": "https://www.facebook.com/events/1672019293126958/"}, {"source": "Facebook", "date": "2016-11-03T19:00:00-04:00", "name": "Julia Sonnevend with William Uricchio", "description": "Literati is pleased to welcome Julia Sonnevend in support of her book Stories without Borders: The Berlin Wall and the Making of a Global Iconic Event. Julia will be joined in conversation by Professor William Uricchio. This event is cosponsored by the Global Media Studies Initiative in the Department of Communication Studies and the Sheldon Cohn Fund in the Department of Screen Arts & Cultures at the University of Michigan.\n\nWhat comes to be known and seen as a global iconic event? Focusing on news coverage of the fall of the Berlin Wall and on contemporary retellings of the event, Julia Sonnevend discusses how storytellers build up certain events so that people remember them for a long time. The East German border opening that we know as the \"fall of the Berlin Wall\" was in fact unintentional, confusing, and prompted in part by misleading media coverage of bureaucratic missteps. But its global message is not about luck or accident or happenstance in history. Incarnated as a global iconic event, the fall of the Berlin Wall has come to communicate the momentary power that ordinary people can have. The event's story, branded as a simple phrase, a short narrative and a recognizable visual scene, provides people from China to Israel to the United States with a powerful social myth. This myth shapes our debates about separation walls and fences, borders, and refugees, and the possibilities of human freedom to this day.\n\nJulia Sonnevend is Assistant Professor of Communication Studies at the University of Michigan. She was a Lady Davis Fellow at the Truman Research Institute for the Advancement of Peace in Israel in 2014 and a Leibniz Fellow at the Center for Contemporary History in Germany in 2015. She is co-editor of Education and Social Media: Toward a Digital Future (forthcoming with MIT Press in 2016). She is author and co-author of articles published in journals including Journalism Studies, Columbia Journalism Review and The New Everyday. Her work also appears in edited collections including Digital Keywords: A Vocabulary of Information Society and Culture (Ed. Benjamin Peters, Princeton University Press, forthcoming in 2016), Iconic Power: Materiality and Meaning in Social Life (Eds. Jeffrey C. Alexander et al, Palgrave Macmillan, 2012) and Theorizing Visual Studies: Writing Through the Discipline (Eds. James Elkins et al, Routledge, 2012). She received her Ph.D. in Communications from Columbia University, her Master of Laws degree from Yale Law School and her Juris Doctorate and Master of Arts degrees in German Studies and Aesthetics from Eötvös Loránd University in Budapest.\n\nWilliam Uricchio revisits the histories of old media when they were new; explores interactive and participatory documentary; writes about the past and future of television; thinks a lot about algorithms and archives; and researches cultural identities and the question of \"Americanization\" in the 20th and 21st centuries. He is Professor of Comparative Media Studies at MIT, Principal Investigator of the MIT Open Documentary Lab, and faculty director of the MISTI-Netherlands Program. He is also Professor of Comparative Media History at Utrecht University in the Netherlands and has held visiting professorships at the Freie Universität Berlin, Stockholm University, the Georg-August-Universität Göttingen (Lichtenberg-Kolleg), China University of Science and Technology, and in Denmark where he was DREAM professor. He has been awarded Guggenheim, Humboldt and Fulbright fellowships and the Berlin Prize; and is currently Holtzbrinck Fellow at the American Academy in Berlin. His publications include Reframing Culture (Princeton); We Europeans? Media, Representations, Identities (Chicago/Intellect); Media Cultures (Heidelberg); hundreds of essays and book chapters … and, timed to coincide with the Batman-Superman big screen face-off, a forthcoming collection entitled Many More Lives of the Batman (BFI/Palgrave). He is currently completing a book on new forms of documentary; and another on games and playing with history and historiography after post-structuralism.\n\n \nEvent date: \nThursday, November 3, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1292501757449172/"}, {"source": "Facebook", "date": "2016-11-03T19:00:00-04:00", "name": "Meet Jessica Lipowski - Discussion & Signing 'Flavors of Life'", "description": "Flavors of Life (ISBN: 978-90-825238-0-5) is a collection of inspirational biographies, sharing the stories of 62 entrepreneurs from around the world. Ranging from a famous Swiss drummer to an American ballet dancer, they are connected by a common thread: all own a restaurant in Amsterdam. Discover how these diverse individuals landed in the same city, in the same industry, with a shared passion - a love for food. While the restaurateurs live in Amsterdam, the stories have universal themes. The book examines culture, lifestyle, entrepreneurship, food, and family values. Regardless or whether someone has visited Amsterdam or not, readers can find a piece of themselves in this book. If you’d like, you can read more on my website: https://jessicalipowski.com/\n\nJessica Lipowski is the author of Flavors of Life (2016). Jessica, originally from Troy, Michigan and a graduate of Michigan State University, moved to the Netherlands in February 2011. With previous journalistic work published on 10Best.com (part of USAToday) and in The Washington Times, she is now an author. She is also a permanent host of two travel-related Twitter chats, #TRLT (The Road Less Travelled) and #CultureTrav.The book, in combination with Jessica’s past work experience, travels, and life as an expat, has enabled her to view food, travel, and culture through a different lens.", "url": "https://www.facebook.com/events/284880815244660/"}, {"source": "Facebook", "date": "2016-11-03T19:30:00-04:00", "name": "The Florence Flood on Film: Days of Deconstruction and Restorati", "description": "The Florence Flood happened 50 years ago on November 3 and 4, 1966. Although communication to the outside world was limited, Florentine film director Franco Zeffirelli, who was editing his Taming of the Shrew in Rome, heard about it and rushed to his beloved city to film the days immediately after the flood. His documentary is titled Per Firenze (For Florence), and the English version is Florence: Days of Destruction; both are narrated by Richard Burton. The English version will be shown at this event. A year after the flood, Roger Hill, instructor of film-making at the Royal College of Art, London, documented the conservation and restoration efforts at the National Library, Florence, where over a million books were damaged during the flood. Shown in this film are scenes of the conservation of mud-covered, battered books as well as demonstrations of a limp- vellum and a full-leather binding, the techniques and materials used to recover thousands of books missing their bindings. Hill's film is titled: The Restoration of Books, Florence, 1968.\n\nThis program is part of the national symposium, “The Flood in Florence, 1966: A Fifty-Year Retrospective” that explores the transformative effects of this disaster on the preservation field. The symposium is organized by the University of Michigan Library and the School of Information. For more information, please visit http://www.lib.umich.edu/flood-florence- 1966-fifty-year-retrospective.\n\nThanks to the University of Maryland–College Park for permission to show the Zeffirelli film, and to the University of Utah and Roger Hill for permission to show his film.", "url": "https://www.facebook.com/events/1790249907853404/"}, {"source": "Facebook", "date": "2016-11-04T08:00:00-04:00", "name": "One Day Sale- 25% Off Wine", "description": "Yes, it's true- Friday only, wine is 25% off! Here are some reasons you might want to stock up:\n\nThanksgiving is coming!\nWinter is coming!\nThe election is almost over!\nBecause wine!\n(Insert your own reason here)", "url": "https://www.facebook.com/events/1819752938314291/"}, {"source": "Facebook", "date": "2016-11-04T09:00:00-04:00", "name": "Randy & Mr. Lahey 11/4/16 at Blind Pig - Ann Arbor", "description": "Fri. November 4 | 8pm | $25 Cover | 18+\n\nThe Randy & Mr Lahey LIVE show is a silly, sexist, drunken hour and a half of songs and skits, audience participation, profanity, Shakespeare, and general hilarity. Over the past eight years it has developed into the fastest moving two man show in the known universe.\n\nFrom Newfoundland to Vancouver Island several hundred thousand people have thrilled to Randy and Lahey's shennanigins. It's a constantly moving showcase of two television icons who pull no punches when battering the audience with \"Batman and Robin\" or \"The Shit Rap.\" The innocent honesty of an out- of-control drunken ex-cop Trailer Park Supervisor and his side-kick Randybobandy the cheeseburger eating ex male prostitute, weekend Trailer Park Supervisor is pants pissing humour at its warmest.\n\nThe show itself is roughly based on the T.V. series and movies, but being live, necessitates a different format and different is the operative word here. There is nothing like it anywhere. Shit talk and poetry; sodomy and sweet talk all thrown together with music and mayhem. What more could a room full of fun seekers want.", "url": "https://www.facebook.com/events/261603764205728/"}, {"source": "Facebook", "date": "2016-11-04T10:00:00-04:00", "name": "An Intimate Look: Images of Kabuki Theaters and Actors", "description": "Ernestine and Herbert Ruben Study Center for Works on Paper\nSpace is limited and registration is required. Please email umma-program- registration@umich.edu. This workshop requires a reading fluency of Japanese and a basic knowledge of Kabuki theater and the cultural history of the late Edo period.\nExhibition co-curators Natsu Oyobe and Mariko Okada will lead an in-depth exploration of Kabuki prints in conjunction with the UMMA exhibition Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art. This workshop is designed for a general audience. Participants will become familiar with Kabuki prints and theater, as well as the popular culture and society of the late Edo period.\n\nKabuki prints are filled with information on the popular culture and human experience of the late Edo Period. Kabuki attracted enormous attention and developed a huge following in the late Edo Period—a phenomenon comparable to contemporary movie and television stars. The prints’ enormous popularity contributed to advances in print technology, facilitating an unprecedented speed of production and a sophisticated system of distribution and circulation.\nThis workshop requires a reading fluency of Japanese and a basic knowledge of Kabuki theater and the cultural history of the late Edo period.\n\nLead support for this exhibition is provided by the University of Michigan Office of the Provost, the National Endowment for the Arts, the William T. and Dora G. Hunter Endowment, AISIN, the E. Rhodes and Leona B. Carpenter Foundation, and the University of Michigan Center for Japanese Studies. Additional generous support is provided by the Japan Foundation and the University of Michigan Institute for Research on Women and Gender.", "url": "https://www.facebook.com/events/174417866346098/"}, {"source": "Facebook", "date": "2016-11-04T12:00:00-04:00", "name": "Learn to use a 50W laser - $25 - 1 Hr", "description": "This class will introduce you to the Epilog 50watt Laser Cutter/Engraver. Learn how to cut and engrave lots of different materials such as paper, fabric, plastics, wood and more! The Epilog Laser can handle many different file formats such as pdf, Adobe illustrator and photoshop, jpgs, dwg, dxf, eps and more. You will learn basic operation of this tool with an emphasis on safety. With the successful completion of this class you will be certified to use the Epilog Laser Cutter/Engraver on your own. Find additional information about this tool here: www.epiloglaser.com/how_lasers_work.htm\n\nRegister by calling 734-222-4911 or visiting http://www.supersaas.com/schedule/makerworks/CheckOut?day=4&month=11&year=2016&view=day\n\nPlease arrive 10 minutes early if this is your first time to Maker Works.", "url": "https://www.facebook.com/events/1133872453393355/"}, {"source": "Facebook", "date": "2016-11-04T16:00:00-04:00", "name": "GameLab: Open House Events", "description": "Beginning November 4th, GameStart will be hosting a six-week series of Open House workshops called GameLab. Each week will feature a FREE to participate class, rotating* between two of GameStarts most popular courses: Game Creation with Unity and Minecraft Python Programming. Students are invited to try out and retake each class as often as they'd like during the six-week term.\n\nGameLab Course Schedule:\nNovember 4th, 4:00pm - 5:00pm: Minecraft Python Programming\nNovember 11th, 4:00pm - 5:00pm: Game Creation with Unity\nNovember 18th, 4:00pm - 5:00pm: Minecraft Python Programming\nNovember 25th, 4:00pm - 5:00pm: Game Creation with Unity\nDecember 2nd, 4:00pm - 5:00pm: Minecraft Python Programming\nDecember 9th, 4:00pm - 5:00pm: Game Creation with Unity\n \n*Note: Course topics will be repeated between each rotating week, but students are invited to experiment with the material in as many ways as they'd like during each visit.", "url": "https://www.facebook.com/events/1355627344447428/"}]