[{"description": "We know how tough it can be when a food you love doesn't love you back, so we're bringing out some of our favorite gluten, dairy, soy, and peanut alternatives. Life after gluten? We promise!", "name": "Allergy-Friendly Tasting", "source": "Facebook", "date": "2016-09-08T17:00:00-04:00", "url": "https://www.facebook.com/events/162980124110886/"}, {"description": "Nature Walk with Ann Arbor District Library\nThursday, September 8\n6:30 to 8 p.m.\nStapp Nature Area\nStapp Nature Area is a small park adjacent to the Traverwood Branch of the AADL. It contains mature oak-hickory forest and a vernal pond that is home to plentiful frogs, toads, turtles and salamanders! The nature area was named after William Stapp, who was a Professor of Environmental Education at the School of Natural Resources of the University of Michigan. Professor Stapp was internationally known for founding environmental education programs in 135 countries.\nThis nature walk is a collaboration between the AADL and Natural Area Preservation, and is part of a series that takes place each month throughout the summer and fall. For this one, parking will be available at the Traverwood Branch of the AADL, and we will meet just down the road at the entrance to the park. Wear comfortable shoes and bring water and bug spray if desired. Some of the AADL Science Tools will be available for use during the walk, too!", "name": "Nature Walk with Ann Arbor District Library-Stapp Nature Area", "source": "Facebook", "date": "2016-09-08T18:30:00-04:00", "url": "https://www.facebook.com/events/615888508589460/"}, {"description": "Peter Ho Davies is the author of two novels, The Fortunes and The Welsh Girl (long-listed for the Man Booker Prize), and two short story collections, The Ugliest House in the World(winner of the John Llewelyn Rhys Prize) and Equal Love (A New York Times Notable Book).\n\nHis work has appeared in Harpers, The Atlantic, The Paris Review, The Guardian and Washington Post among others, and has been widely anthologized, including selections for Prize Stories: The O. Henry Awards and Best American Short Stories. In 2003 Granta magazine named him among its Best of Young British Novelists.\n\nThe Book: \nSly, funny, intelligent, and artfully structured, The Fortunes recasts American history through the lives of Chinese Americans and reimagines the multigenerational novel through the fractures of immigrant family experience.Inhabiting four lives—a railroad baron’s valet who unwittingly ignites an explosion in Chinese labor, Hollywood’s first Chinese movie star, a hate-crime victim whose death mobilizes Asian Americans, and a biracial writer visiting China for an adoption—this novel captures and capsizes over a century of our history, showing that even as family bonds are denied and broken, a community can survive—as much through love as blood.Building fact into fiction, spinning fiction around fact, Davies uses each of these stories—three inspired by real historical characters—to examine the process of becoming not only Chinese American, but American.", "name": "Peter Ho Davies for 'The Fortunes'", "source": "Facebook", "date": "2016-09-08T19:00:00-04:00", "url": "https://www.facebook.com/events/945414925587833/"}, {"description": "We're kicking off our fall Open Mic series by celebrating RHINO's 40th birthday as part of their #RHINO40Readings40Cities project.\n\nWe begin with a brief open mic session followed by poets who have appeared in the RHINO poetry journal including Matthew Landrum and Simon Mermelstein, along with Monica Rico, Jennifer Metsker, Julie Babcock, John Buckley, and Ashwini Bhasi.", "name": "RHINO 40 Readings 40 Cities - Ann Arbor Edition", "source": "Facebook", "date": "2016-09-08T19:00:00-04:00", "url": "https://www.facebook.com/events/1253843057967373/"}, {"description": "Ann Arbor Civic Theatre opens their 2016-2017 season with the musical comedy The 25th Annual Putnam County Spelling Bee, directed by Wendy Sielaff, September 8-11, 2016, at UM’s Lydia Mendelssohn Theatre, 911 N. University, Ann Arbor, 48109.  Performances are Thursday at 7:30 pm, Friday and Saturday at 8pm, with a 2pm matinee on Sunday.  Friday, Saturday and Sunday tickets are $26, with tickets at $23 for seniors and $14 for students. On Thursday only, all seats are $20, with $14 tickets for students. Tickets and information are available online at www.a2ct.org, through the A2CT office at 734-971-2228, or at the door of the theater before each performance.\n\nWinner of a Tony and a Drama Desk Award for Best Book, The 25th Annual Putnam County Spelling Bee sees six contestants in a high school gym vie for the title of Spelling Bee Champion. It’s a fast-paced, uproariously funny and wild ride, complete with audience participation.  Says director, Wendy Sielaff, “Don't be fooled by the age of our spellers - each of them comes with their own quirks. In a very funny score, creative dancing, and of course some spelling we see each speller truly trying to win the trophy.” With its terrific book and score and impressive cast, Spelling Bee is a witty and touching production that is sure to spell F-U-N. \n\nThe show does contain some mature content, and is recommended for those 16 and up.\n\nMusic direction for The 25th Annual Putnam County Spelling Bee is by Debra Nichols, with choreography by Reilly Conlon. The talented cast includes Allison Ackerman as Rona Lisa Peretti, Brandon Cave as Douglas Panch, Emily Fishman as Olive Ostrovsky, Hallie Fox as Marcy Park,Nick Rapson as Mitch Mahoney, Nathan King as Leaf Coneybear, Keshia Oliver as Logainne Schwartzandgrubenierre,Bob Cox as Chip Tolentino, and Connor Rhoades as William Barfee.", "name": "The 25th Annual Putnam County Spelling Bee", "source": "Facebook", "date": "2016-09-08T19:30:00-04:00", "url": "https://www.facebook.com/events/1364500856898234/"}, {"description": "Nights at the Museum, UMMA’s first-ever exterior media art initiative, is open to the public, and will run from September 2-9 from 8:30 p.m. to dawn along its State Street-side facade.\n\nNights at the Museum begins Friday, Sept. 2, during Artscapade!, a Welcome Week event for new U-M students, and concludes on Friday, Sept. 9 at UMMA’s twice-annual After Hours community celebration.\n\nOn Friday, Saturday, and Sunday, from dusk to dawn, UMMA will showcase a digital art installation by Quayola called Pleasant Places. Inspired by the work of Vincent Van Gogh, Quayola has returned to the same countryside of Provence 125 years later to create of a series of digital paintings exploring the boundary between representation and abstraction. Pleasant Places will also be projected overnight throughout the remainder of the week. \n\nFor the Full Schedule Check Here: http://www.umma.umich.edu/news/2016/umma-to-light-up-campus-with-nights-at-the-museum", "name": "Nights at the Museum", "source": "Facebook", "date": "2016-09-08T20:30:00-04:00", "url": "https://www.facebook.com/events/1770837316505091/"}, {"description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "name": "Sweetwaters Westgate Grand Opening!", "source": "Facebook", "date": "2016-09-09T09:00:00-04:00", "url": "https://www.facebook.com/events/1090878344334512/"}, {"description": "The second Great Lakes Herb Faire will be happening this September 9-11th, 2016 in Chelsea, MI. Register now for an herbal educational extravaganza! We will offer dozens of classes on Herbal Medicine from well seasoned herbalists such as Matt Wood, Jim McDonald, Dr. Jody Noe, Lisa Rose and many more! Some class titles include \"Wisdom of Nature: What we Gain as Herbalists in Service of Nature\", \"Medical Herbal Strategies for Integrative Cancer Therapies\", \"Blessed Bitters\" and \"Introduction to West African Herbalism\". There will be kids classes such as\"Let’s Meddle with Nettles!\" and \"Wisdom of the Elders\".  There will be delicious and nutritious food available for those who sign up and music, entertainment and additional classes in the evenings for all. The Tree of Life Drummers and Dancers will get the Faire going at opening ceremony and Saturday night \"Eyes Unclouded\", an amazing local band will play. We will also have an open mic of sorts on Friday evening so bring your talents!\n\nDon't miss out on this amazing an unique opportunity! There will be much to be learned by both beginning and experienced herbalists, many connections will be made with other regional herbalists as well as with the beautiful lands of the Waterloo Recreation area.\n\nPlease see our website for more details!\nhttp://www.greatlakesherbfaire.org\n\nSee you at the Faire!\n-The Great Lakes Herb Faire organizers", "name": "The Second Great Lakes Herb Faire", "source": "Facebook", "date": "2016-09-09T16:30:00-04:00", "url": "https://www.facebook.com/events/631172927032422/"}, {"description": "Come get scholarly about some of our favorite beers!", "name": "Back to School Beer Tasting", "source": "Facebook", "date": "2016-09-09T17:00:00-04:00", "url": "https://www.facebook.com/events/1761402564145210/"}, {"description": "The kids are back in school, now it's wine time! We're pouring some of our favorites to help you celebrate.", "name": "Back to School Wine Tasting", "source": "Facebook", "date": "2016-09-09T17:00:00-04:00", "url": "https://www.facebook.com/events/322134998120508/"}]