[{"source": "Facebook", "date": "2016-07-23T16:00:00-04:00", "url": "https://www.facebook.com/events/882484321863214/", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2"}, {"source": "Facebook", "date": "2016-07-23T20:00:00-04:00", "url": "https://www.facebook.com/events/284018695285506/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Lady Parts\" starring Sara Constantakis, Corene Ford, Amy Oprean, Amy Phillips, and Anne Marie Sumner.\n\nGroup 2: \"Presto Change-O\" starring Chris DiAngelo, Matt Naas, Erik Heilner, Tim Kay, and James Quesada\n\nGroup 3: \"The League of Pointless Improvisers\" starring Andy Reid, Steve Oliver, Corene Ford, Matthew Flickinger, and Gary Lehman", "name": "Pointless Improv with Lady Parts and Presto Change-O"}, {"source": "Facebook", "date": "2016-07-23T22:00:00-04:00", "url": "https://www.facebook.com/events/1805428946359627/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Presto Change-O\" starring Chris DiAngelo, Matt Naas, Erik Heilner, Tim Kay, and James Quesada\n\nGroup 2: \"Lady Parts\" starring Sara Constantakis, Corene Ford, Amy Oprean, Amy Phillips, and Anne Marie Sumner.\n\nGroup 3: \"The League of Pointless Improvisers\" starring Andy Reid, Steve Oliver, Corene Ford, Matthew Flickinger, and Gary Lehman", "name": "Pointless Improv with Presto Change-O and Lady Parts"}, {"source": "Facebook", "date": "2016-07-24T10:00:00-04:00", "url": "https://www.facebook.com/events/994376950635153/", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "name": "The 2016 Ann Arbor Art Fair"}, {"source": "Facebook", "date": "2016-07-24T10:00:00-04:00", "url": "https://www.facebook.com/events/487403974717996/", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "name": "State Street Art Fair"}, {"source": "Facebook", "date": "2016-07-24T14:00:00-04:00", "url": "https://www.facebook.com/events/211191845942511/", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.\nEngaging with Art tours are generously supported by the Berkowitz Family Endowed Fund.", "name": "Guided Tour: Engaging with Art"}, {"source": "Facebook", "date": "2016-07-24T15:00:00-04:00", "url": "https://www.facebook.com/events/1630667003917227/", "description": "This program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.\n\nIn 700 Nimes Road, photographer Catherine Opie creates a portrait of the icon Elizabeth Taylor by capturing the intimate spaces and personal treasures that make up the actress’s home in Bel Air, California. Join Assistant Curator of Photography, Jennifer Friess, for an exploration of how Opie’s images reveal facets of Taylor’s identity from the humble to the glamorous.\n\nCatherine Opie: 700 Nimes Road is organized by The Museum of Contemporary Art, Los Angeles. This exhibition is made possible with lead support provided by J.P. Morgan Private Bank and major support from Jamie McCourt, and Gilena Simons.\n\nLead support for UMMA’s installation is provided by the University of Michigan Health System, Bank of America and Merrill Lynch, and Alan Hergott and Curt Shepard. Additional generous support is provided by the University of Michigan Department of the History of Art, Department of Screen Arts and Cultures, and Department of American Culture.", "name": "In Conversation: Pomp, Privacy, and Portraiture at 700 Nimes Road"}, {"source": "Facebook", "date": "2016-07-24T16:00:00-04:00", "url": "https://www.facebook.com/events/243670042686210/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games"}, {"source": "Facebook", "date": "2016-07-24T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-07-24T19:00:00-04:00", "url": "https://www.facebook.com/events/587266381434863/", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "name": "Open Stage"}, {"source": "Facebook", "date": "2016-07-25T19:00:00-04:00", "url": "https://www.facebook.com/events/247351522324237/", "description": "Peter Geye received his MFA from the University of New Orleans and his PhD from Western Michigan University, where he was editor of Third Coast. He was born and raised in Minneapolis and still lives there with his wife and children. He is the author of multiple award-winning novels.\n\nA highly acclaimed novelist now gives us a true epic: a love story that spans sixty years, generations worth of feuds, and secrets withheld and revealed. \n\nThe two principal stories at play in \"Wintering \"are bound together when the elderly, demented Harry Eide escapes his sickbed and vanishes into the forbidding, northernmost wilderness that surrounds the town of Gunflint, Minnesota instantly changing the Eide family, and many other lives, forever. He d done this once before, more than thirty years earlier in 1963, fleeing a crumbling marriage and bringing along Gustav, his eighteen-year-old son, pitching this audacious, potentially fatal scheme winter already coming on, in these woods, on these waters as a reenactment of the ancient voyageurs journeys of discovery. \n\nIt's certainly something Gus has never forgotten, nor the Devil's Maw of a river, a variety of beloved (possibly fantastical) maps, the ice floes and waterfalls (neither especially appealing from a canoe), a magnificent bear, the endless portages, a magical abandoned shack, Thanksgiving and Christmas improvised at the far end of the earth, the brutal cold and sheer beauty of it all. And men hunting other men. \n\nNow with his father pronounced dead Gus relates their adventure in vivid detail to Berit Lovig, who d spent much of her life waiting for Harry, her passionate conviction finally fulfilled over the last two decades. So, a middle-aged man rectifying his personal history, an aging lady wrestling with her own, and with the entire saga of a town and region they d helped to form and were in turn formed by, relentlessly and unforgettably.", "name": "Peter Geye - Award Winning Author"}, {"source": "Facebook", "date": "2016-07-26T19:00:00-04:00", "url": "https://www.facebook.com/events/259400431102202/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nHeather Schwartz \nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "name": "Acoustic Tuesdays: Heather Schwartz"}, {"source": "Facebook", "date": "2016-07-26T21:00:00-04:00", "url": "https://www.facebook.com/events/1778243405753481/", "description": "Tue. July 26 | 9pm | 18+ | $20 adv./ $23 day of\n\nFusion Shows Presents: Mekaaly Hasan Band\n\nMekaal Hasan Band Band (MHB) was formed in 2000 by guitarist/composer Mekaal Hasan.The music that MHB plays is a fusion between the melodic sensibility of the East and the harmonic sophistication of the West.\n\nMekaal Hasan Band's Indo Pak line up is truly unique in it's assembly of talent and diversity. It features the artistry of musicians from India and Pakistan with flautist Mohd. Ahsan Papu, guitarist and founder Mekaal Hasan, bassist Sheldon D'Silva, drummer Gino Banks and vocalist extraordinaire Sharmistha Chatterjee.\nThe Mekaal Hasan Band is continuing to explore an exciting blend of traditional Eastern Classical and folk music set to jazz harmony and progressive rock sounds and arranging styles, in a series of live performances, studio recordings and videos that are drawing music enthusiasts in large numbers.", "name": "Mekaal Hasan Band 7/26/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-07-27T10:00:00-04:00", "url": "https://www.facebook.com/events/994376950635153/", "description": "Artists from around the world return to the streets of Ann Arbor, Michigan July 21-24th for one of the nation's best art fairs. #AnnArborArtFair", "name": "The 2016 Ann Arbor Art Fair"}, {"source": "Facebook", "date": "2016-07-27T10:00:00-04:00", "url": "https://www.facebook.com/events/487403974717996/", "description": "Premier artists from around the country come to the District and mix with our local businesses for four days of art fair excitement.", "name": "State Street Art Fair"}, {"source": "Facebook", "date": "2016-07-27T19:00:00-04:00", "url": "https://www.facebook.com/events/1803129396573702/", "description": "Literati is delighted to welcome Blair Braverman in support of her memoir, Welcome to the Goddamn Ice Cube: Chasing Fear and Finding Home in the Great White North. Blair will be joined in conversation by UM MFA alum Mindy Misener.\n\nBlair Braverman fell in love with the North at an early age: By the time she was nineteen, she had left her home in California, moved to Norway to learn how to drive sled dogs, and worked as a tour guide on a glacier in Alaska. By turns funny and sobering, bold and tender, Welcome to the Goddamn Ice Cube charts Blair’s endeavor to become a “tough girl”—someone who courts danger in an attempt to become fearless. As she ventures into a ruthless arctic landscape, Blair faces down physical exhaustion—being buried alive in an ice cave, and driving a dogsled across the tundra through a whiteout blizzard in order to avoid corrupt police—and grapples with both love and violence as she negotiates the complex demands of being a young woman in a man’s land.\n\nBrilliantly original and bracingly honest, Welcome to the Goddamn Ice Cube captures the triumphs and the perils of the journey to self-discovery and independence in a landscape that is as beautiful as it is unforgiving.\n\nBlair Braverman graduated from the University of Iowa’s Nonfiction Writing Program, where she was also an Arts Fellow. She has been a resident fellow at Blue Mountain Center and the MacDowell Colony and her work has appeared in Buzzfeed, The Atavist, The Best Women’s Travel Writing, Orion, AGNI, High Country News, Waging Nonviolence, and on This American Life. She lives in Mountain, Wisconsin.", "name": "Blair Braverman"}, {"source": "Facebook", "date": "2016-07-27T19:00:00-04:00", "url": "https://www.facebook.com/events/1155777777799289/", "description": "Meet freelance writer Larry Olmstead and Radio Personality Micheal Patrick Shiels with an Olive Oil Tasting from Zingerman's.\n\nLarry Olmsted, a prolific freelance writer who has published thousands of articles in national publications, including Outside, Playboy, USA Today, and Inc., is a contributing editor to numerous publications, and was a longtime columnist for Investor's Business Daily. He lives in Vermont.\n\nYou ve seen the headlines: Parmesan cheese made from sawdust. Lobster rolls containing no lobster at all. Extra-virgin olive oil that isn t. Fake foods are in our supermarkets, our restaurants, and our kitchen cabinets. Award-winning food journalist and travel writer Larry Olmsted exposes this pervasive and dangerous fraud perpetrated on unsuspecting Americans. \"Real Food/Fake Food\" brings readers into the unregulated food industry, revealing that this shocking deception extends from high-end foods like olive oil, wine, and Kobe beef to everyday staples such as coffee, honey, juice, and cheese. It's a massive bait and switch where counterfeiting is rampant and where the consumer ultimately pays the price. But Olmsted does more than show us what foods to avoid. A bona fide gourmand, he travels to the sources of the real stuff, to help us recognize what to look for, eat, and savor: genuine Parmigiano-Reggiano from Italy, fresh-caught grouper from Florida, authentic port from Portugal. Real foods that are grown, raised, produced, and prepared with care by masters of their craft. Part cautionary tale, part culinary crusade, \"Real Food/Fake Food\" is addictively readable, mouth-wateringly enjoyable, and utterly relevant. Larry Olmsted convinces us why real food matters.", "name": "Larry Olmstead & Olive Oil Tasting by Zingerman's"}, {"source": "Facebook", "date": "2016-07-27T20:00:00-04:00", "url": "https://www.facebook.com/events/1616853798644437/", "description": "23rd annual Week After Art Fair Song Fest\nWednesday through Friday, July 27-29\nKerrytown Concert House, Ann Arbor\n\nWednesday July 27, 8:00 pm:\nSongs We Love to Sing\nVarious composers, various singers\n\nThursday July 28, 8:00 pm:\nChemins de l'amour:  The Lyrical Legacy of Francis Poulenc\n\nFriday July 29, 8:00 pm:\nOur annual Cabaret night! \nSpeak Low: Songs of Weill and Sondheim\n\nFor ticket information, visit www.kerrytownconcerthouse.com, or call 734-769-2999.\n\n2016 ARTIST ROSTER\nKevin Bylsma, piano\nSOPRANOS\nEmily Benner\nClaire Chardon\nChelsea Cloeter\nJenny Cresswell\nMadeline Harts\nTeri Herron\nRebekah Kroesing\nHillary LaBonte\nJane Schoonmaker Rodgers\nLeslie Smith\n\nMEZZOS\nChristine Amon\nLaura Reaper\nDeanna Relyea\nEllen Strba Scholl\nMonica Swartout-Bebow\n\nTENORS\nGregory Ashe\nJohn Hopkins\nChristopher Scholl\n\nBARITONES\nChy Billings\nJohn Mink\nRobert Peavler\nDale Schriemer", "name": "2016 Week After Art Fair Song Fest"}, {"source": "Facebook", "date": "2016-07-28T11:30:00-04:00", "url": "https://www.facebook.com/events/814563692008977/", "description": "Brett Dennen - Youthful West Coast singer/songwriter Brett Dennen, with a fragile, high-pitched voice that makes him sound at times like a cross between Tracy Chapman, Paul Simon and Neil Young, first drew attention in 2004 with the single \"Desert Sunrise.\" The tune, with its easy groove and soulful phrasing, garnered enough spins on KCRW to warrant the release of his self-titled debut the following year. In 2006, Dennen signed with Dualtone and released So Much More. Hope for the Hopeless followed on the same imprint in 2008. Dennen's fourth studio effort, Loverboy, which featured subtle African rhythms and more of a pop veneer, arrived in April of 2011, followed in 2013 by the sparser acoustic-based Smoke and Mirrors and 2014 \nrelease of Out of My Head.  Brett’s latest release Por Favor is getting released on May 20th, 2016.   http://brettdennen.net\n\n\nMulti-instrumentalists Katie Larson and Savannah Buist are creating quite a name for themselves among music lovers of all genres. Described as, “A duo giving an edge to folk with unique instrumentation,\" Z93 FM DJ, Matt Mansfield writes: “Combine musicality, originality and melodic beauty with a welcome and unexpected bite to clever lyrics and you've got Accidentals music. Songwriters, look no farther to find a new pairing to be jealous of, especially with such a bright future ahead of them.”\nThey met in 2011 at their public high school. Katie (15) was a freshman cello player, “playing up” in the Philharmonic Orchestra and Savannah (16) was Concert Master, violinist. They volunteered for a class assignment that threw them together for their first rehearsal and The Accidentals were born. \nGrowing up in musical families with professional pianists for fathers and vocalist for mothers, their influences bounced between classical, jazz, bluegrass, country, alt-rock, and the obscure. Their collective playlist you won’t find on mainstream radio\nIn 2015, the band won Traverse Magazine’s “Red Hot Best” of Northern Michigan Music for their third year in a row, The Emerging Artists Series at Summerfest hey were named one of the top seven breakout artists at SXSW 2015 by Billboard Magazine. Their album, Bittersweet, won \"Album of the Year\" and the band landed, \"Best New Artist\" 2015 WYCE Jammie awards. Their song, The Silence, won St. Cecilia, Art Prize People's Choice. \nhttp://www.moreaccidentals.com \n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Brett Dennen w/s/g The Accidentals / July 28th / Bank of Ann Arbor's Sonic Lunch / FREE 12PM"}, {"source": "Facebook", "date": "2016-07-28T20:00:00-04:00", "url": "https://www.facebook.com/events/1616853798644437/", "description": "23rd annual Week After Art Fair Song Fest\nWednesday through Friday, July 27-29\nKerrytown Concert House, Ann Arbor\n\nWednesday July 27, 8:00 pm:\nSongs We Love to Sing\nVarious composers, various singers\n\nThursday July 28, 8:00 pm:\nChemins de l'amour:  The Lyrical Legacy of Francis Poulenc\n\nFriday July 29, 8:00 pm:\nOur annual Cabaret night! \nSpeak Low: Songs of Weill and Sondheim\n\nFor ticket information, visit www.kerrytownconcerthouse.com, or call 734-769-2999.\n\n2016 ARTIST ROSTER\nKevin Bylsma, piano\nSOPRANOS\nEmily Benner\nClaire Chardon\nChelsea Cloeter\nJenny Cresswell\nMadeline Harts\nTeri Herron\nRebekah Kroesing\nHillary LaBonte\nJane Schoonmaker Rodgers\nLeslie Smith\n\nMEZZOS\nChristine Amon\nLaura Reaper\nDeanna Relyea\nEllen Strba Scholl\nMonica Swartout-Bebow\n\nTENORS\nGregory Ashe\nJohn Hopkins\nChristopher Scholl\n\nBARITONES\nChy Billings\nJohn Mink\nRobert Peavler\nDale Schriemer", "name": "2016 Week After Art Fair Song Fest"}, {"source": "Facebook", "date": "2016-07-29T15:00:00-04:00", "url": "https://www.facebook.com/events/1816550935245704/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe"}, {"source": "Facebook", "date": "2016-07-29T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-07-29T19:00:00-04:00", "url": "https://www.facebook.com/events/1615653315411397/", "description": "Literati is pleased to welcome Margaret Wappler in support of her debut novel, Neon Green.\n\nIt's the summer of 1994 in suburban Chicago: Forrest Gump is still in theaters, teens are reeling from the recent death of Kurt Cobain, and you can enter a sweepstakes for a spaceship from Jupiter to land in your backyard. Welcome to Margaret Wappler's slightly altered 90s. Everything's pretty much the way you remember it, except for the aliens. When a flying saucer lands in the Allens' backyard, family patriarch and environmental activist Ernest is up in arms. According to the company facilitating the visits, the spaceship is 100 percent non-toxic, but as Ernest's panic increases, so do his questions: What are the effects of longterm exposure to the saucer and why is it really here? The family starts logging the spaceship's daily fits and starts but it doesn't get them any closer to figuring out the spaceship's comically erratic behavior. Ernest s wife Cynthia and their children, Alison and Gabe, are less concerned with the saucer, and more worried about their father s growing paranoia (not to mention their mundane, suburban existences). Set before the arrival of the internet, Neon Green will stun, unnerve, and charm readers with its loving depiction of a suburban family living on the cusp of the future.\n\nMargaret Wappler has written about the arts and pop culture for the Los Angeles Times, Rolling Stone, Elle, The Believer, The Village Voice, and several other publications. Her work has appeared in Black Clock, Public Fiction, and the anthology Joyland Retro. Neon Green is her first novel. She lives in Los Angeles.", "name": "Fiction: Margaret Wappler"}, {"source": "Facebook", "date": "2016-07-29T19:00:00-04:00", "url": "https://www.facebook.com/events/1108266935906140/", "description": "Come join friends & neighbors alike for a fun, slow, community bike ride through Ann Arbor.\n\nThe fun starts at the Ann Arbor Farmers Market and will continue at a leisurely pace around town, where we will \"bike-in\" to the Sic Transit Cycles Showroom on Swift St. (https://goo.gl/maps/eGwYfrTDTLq) for some post-ride refreshments and shop discounts.\n\nSic Transit is a full-service bicycle shop specializing in urban cycling, commuting, touring, cyclocross bikes and all levels of road riding. They're super friendly, too!\n\nMeet up time is 7:00 PM (departing 7:15 PM). Plan on a nice & easy route, 10 miles or less, within city limits. Check back later this month for route & other details to come. Until then, ride safe, be friendly, and have fun!\n\n\nWhat's Bike-in?\nSee the community page:\nhttps://www.facebook.com/bikeinannarbor/info?tab=page_info\n\nOR read below\n\nBike-in is: Slow bike rides throughout Ann Arbor for everyone. Post-ride fun with friends, neighbors, and visitors around the community.\n\nEach ride we will begin at the listed location & time, ride casually, then finish the ride by \"biking-in\" to a post-ride time together at a local establishment, green space, or other friendly host setting (i.e. Bike-in :: Movie (outdoor), Creamery (ice cream), Picnic (potluck), Garden (beer garden), etc.).\n\nRides will be open and friendly to all. For gathering information, times, locations, riding routes, weather updates, etc. like/follow the page or visit for updates.\n\nPlease practice safe riding and abide by all legal riding rules at all times, especially while riding with a Bike-in community. Be sure to provide your own helmet, riding lights, and other appropriate accessories.", "name": "Bike-in :: Sic Transit"}, {"source": "Facebook", "date": "2016-07-29T20:00:00-04:00", "url": "https://www.facebook.com/events/1759561060951794/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"MATCH\" starring Matt Pendrige and Mitch Socia\n\nGroup 2: \"50 States of Cray Cray\" \n\nGroup 3: \"The League of Pointless Improvisers\" starring Corene Ford, Jason Valentini, Moni Jones, and Mitch Socia", "name": "Pointless Improv with MATCH and 50 States of Cray Cray"}, {"source": "Facebook", "date": "2016-07-29T22:00:00-04:00", "url": "https://www.facebook.com/events/295103527490250/", "description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring Corene Ford, Jason Valentini, Moni Jones, and Mitch Socia", "name": "A Pointless Display of Improvised Feats"}, {"source": "Facebook", "date": "2016-07-30T09:00:00-04:00", "url": "https://www.facebook.com/events/636137526533231/", "description": "This park along the river has lots of great ecological diversity, including restored prairie and oak savanna. Help is needed to protect it from invasive weeds that crowd out natives and  maintaining the Native Garden at this park. The Garden is a living demonstration of the beauty of native wildflowers, both a help for identification and an example of how they can be used in landscaping. Please meet in the parking lot off of Fuller Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Furstenberg Park Stewardship Workday"}, {"source": "Facebook", "date": "2016-07-30T11:00:00-04:00", "url": "https://www.facebook.com/events/1185908814776939/", "description": "Moving Image: Landscape explores traditional notions of landscape through four very different time-based works by artists Jim Campbell, Antti Laitinen, Joanie Lemercier, and Rick Silva.\n\nCampbell’s recent body of work, including Seal Rock, presents pixilated images of landscapes created with grids of LEDs. The low-resolution LEDs create a tension between representation and abstraction, provoking viewers to interpret visual information on their own. In the three-channel video, It’s My Island, Laitinen builds his own island in the Baltic Sea by dragging two hundred sand bags into the water over a period of three months. The work explores ideas of nationality, citizenship, and identity as the artist creates his own single-citizen micro-nation. Lemercier’s computer-generated print Landform uses patterns of black dots and projected light to create the illusion of three-dimensionality and movement when seen from a distance. The effects are more realistic than a still image, butstill unsettlingly artificial. Silva’s Render Garden explores the digitized landscape, including remix and glitch aesthetics, through software that endlessly generates new plant combinations.\n\nThroughout the next year, UMMA will present three exhibitions drawn from the Borusan Contemporary Art Collection in Istanbul. The Borusan’s 30-year-old collection includes significant works across a variety of genres, and since 2011 it has focused on media arts. The works exhibited here address formal concerns such as abstraction and color, and conceptual topics such as identity or ecological issues; many represent traditional categories such as portraiture and landscape that find new resonance when explored through the strategies of dynamic technology.\n\nLead support for this exhibition is provided by Susan and Richard Gutow Fund, the Herbert W. and Susan L. Johe Endowment, and the University of Michigan Institute for the Humanities and Penny W. Stamps School of Art and Design.", "name": "Moving Image: Landscape"}, {"source": "Facebook", "date": "2016-07-30T16:00:00-04:00", "url": "https://www.facebook.com/events/982202251896415/", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2"}, {"source": "Facebook", "date": "2016-07-30T20:00:00-04:00", "url": "https://www.facebook.com/events/1616853798644437/", "description": "23rd annual Week After Art Fair Song Fest\nWednesday through Friday, July 27-29\nKerrytown Concert House, Ann Arbor\n\nWednesday July 27, 8:00 pm:\nSongs We Love to Sing\nVarious composers, various singers\n\nThursday July 28, 8:00 pm:\nChemins de l'amour:  The Lyrical Legacy of Francis Poulenc\n\nFriday July 29, 8:00 pm:\nOur annual Cabaret night! \nSpeak Low: Songs of Weill and Sondheim\n\nFor ticket information, visit www.kerrytownconcerthouse.com, or call 734-769-2999.\n\n2016 ARTIST ROSTER\nKevin Bylsma, piano\nSOPRANOS\nEmily Benner\nClaire Chardon\nChelsea Cloeter\nJenny Cresswell\nMadeline Harts\nTeri Herron\nRebekah Kroesing\nHillary LaBonte\nJane Schoonmaker Rodgers\nLeslie Smith\n\nMEZZOS\nChristine Amon\nLaura Reaper\nDeanna Relyea\nEllen Strba Scholl\nMonica Swartout-Bebow\n\nTENORS\nGregory Ashe\nJohn Hopkins\nChristopher Scholl\n\nBARITONES\nChy Billings\nJohn Mink\nRobert Peavler\nDale Schriemer", "name": "2016 Week After Art Fair Song Fest"}, {"source": "Facebook", "date": "2016-07-30T20:00:00-04:00", "url": "https://www.facebook.com/events/1754076671528232/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Thursday Interns\"\n\nGroup 2: \"Birdbox\" \n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Andy Reid, Erik Heilner, and Doug Kolbicz", "name": "Pointless Improv with Thursday Interns and Birdbox"}, {"source": "Facebook", "date": "2016-07-30T22:00:00-04:00", "url": "https://www.facebook.com/events/1713879478876127/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Birdbox\" \n\nGroup 2: \"Thursday Interns\"\n\nGroup 3: \"The League of Pointless Improvisers\" starring Aaron Johnstone, Andy Reid, Erik Heilner, and Doug Kolbicz", "name": "Pointless Improv with Birdbox and Thursday Interns"}, {"source": "Facebook", "date": "2016-07-31T09:00:00-04:00", "url": "https://www.facebook.com/events/1082355035168457/", "description": "A patch of dry prairie lines the Border-To-Border Trail in this park along the river, with many plants that are uncommon in our area. Help maintain this patch of special habitat by hand-pulling exotic weeds. Please meet at the south end of the park, in the parking lot off Lake Shore Drive (via Main Street).\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Bandemer Park Stewardship Workday"}, {"source": "Facebook", "date": "2016-07-31T14:00:00-04:00", "url": "https://www.facebook.com/events/552448484956885/", "description": "The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink celebrates gifts to the Museum from two accomplished scholars with eclectic interests, a keen appreciation of form, and a love of learning from objects. Nesta Spink, curator at UMMA from 1967 to 1979, is regarded as the preeminent authority on the lithographs of James McNeill Whistler. U-M professor emeritus Walter Spink is a world-renowned specialist on early Buddhist art and architecture in India. UMMA docents will discuss the exquisite Whistler prints, a rich representation of South Asian folk art, and other highlights from their gifts.", "name": "Guided Tour - Connoisseurs’ Legacy: Collection of Nesta and Walter Spink"}, {"source": "Facebook", "date": "2016-07-31T16:00:00-04:00", "url": "https://www.facebook.com/events/1727899334148540/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games"}, {"source": "Facebook", "date": "2016-07-31T19:00:00-04:00", "url": "https://www.facebook.com/events/254156904947652/", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "name": "The Arcade - A Pointless Improv Jam"}, {"source": "Facebook", "date": "2016-08-01T19:00:00-04:00", "url": "https://www.facebook.com/events/149741905431016/", "description": "Literati is pleased to welcome Monica A. Coleman in support of her memoir, Bipolar Faith: A Black Woman's Journey Through Depression and Faith.\n\nIn a new memoir, Coleman reflects on the legacies of slavery, poverty, war, and alcoholism, and how these conditions can mask a history of mental illness. At once spiritual autobiography and memoir of madness, Bipolar Faith is the book Dr. Coleman was hoping to find when she was diagnosed with bipolar II, a mental illness. She could not find a single memoir written about living with bipolar II, which is characterized by periods of deep depressions balanced by periods of productivity and energy. Moreover, she found precious few memoirs that engage religion and faith in truly constructive ways. \n\nWhile the taboo around depression in the African-American faith community is diminishing, \"I think there are people suffering from depression and bipolar disease who are also striving to maintain their faith. There are few guides or safe places where they can discuss their feelings,\" says Coleman. This book is for them and their allies.\n\n“Monica Coleman writes with the artistry of a poetic storyteller, the intimacy of someone who has studied depression from the inside, and the courageous transparency of someone who knows the cost of silence. Weaving cultural truths with the reality of hope and despair, Coleman’s latest book is a testimony that unmasks psychological struggles, family discord, and the quest for wholeness. As a scholar and minister, Coleman has crafted a book that creates a safe space for people of faith to reflect on their journey toward truth, balance, and self acceptance.”—Thema Bryant-Davis, Past President, Society for the Psychology of Women, and Co-Editor, Womanist and Mujerista Psychologies: Voices of Fire, Acts of Courage\n\nMonica A. Coleman, MDiv, PhD, teaches theology and African-American religions at Claremont School of Theology in Claremont, CA. At CST, she was recently promoted to the position of full professor--making her the first African-American woman full professor at CST. She is a philosophical theologian who works with a process metaphysic, and the black and womanist theological traditions. Her writings cover womanist theology, sexual abuse, and the African-American experience.\n\nDr. Coleman is an ordained elder in the African Methodist Episcopal Church and a sought-after speaker and preacher. In 2005, the African American Pulpit names Coleman one of the \"Top 20 to Watch--The New Generation of Leading Clergy: Preachers under 40.\" Dr. Coleman has been featured as an expert in religion and mental health on NPR, Beliefnet.com, PsychCentral.com, and Huffington Post Live. She blogs on faith and depression at www.beautifulmindblog.com", "name": "Monica A. Coleman"}, {"source": "Facebook", "date": "2016-08-02T19:00:00-04:00", "url": "https://www.facebook.com/events/131557547268185/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nBrant Losinski , the compassionate, complicated, and charismatic leader of Rootstand, plays country blues, Irish pub classics and favorites with friends.  A lively, dance friendly street party ringing with traditional sounds and the essence of modern dance music.\n\nNever a cover\nAlways a good time", "name": "Acoustic Tuesdays: Brant Losinski"}, {"source": "Facebook", "date": "2016-08-03T17:00:00-04:00", "url": "https://www.facebook.com/events/465808310277103/", "description": "Missed the first few rallies? Don't worry! We're back at it again! Join us for this month's Food Truck Rally on August 3rd! Your favorite trucks are here to serve you some fresh, local dinner and desserts! Bring your friends, family, neighbors and anyone else you want to enjoy a summer night in Ann Arbor with! We'll see you there!\n\nDon't forget to tag us in your pictures with #a2rally We're on Twitter and Instagram too!\n\nUpcoming Rallies:\nAugust 3\nSeptember 7\nOctober 5\n\nBigalora Wood Fired Food Truck\nCheese Street\nDelectabowl Food Truck & Catering\nHero Or Villain Van\nHello! Ice Cream & Gelato\nMatt & Mo's\nMI Pops\nPetey's Donuts\nTHE PITA POST\nShimmy Shack\n\nIsosceles\nWest Park Music Society\nTeam Love", "name": "First Wednesday Food Truck Rally"}, {"source": "Facebook", "date": "2016-08-04T12:00:00-04:00", "url": "https://www.facebook.com/events/1572682933024198/", "description": "Joshua Davis's amazing talent led him on a journey that landed him as a finalist on the most recent series of NBC’s The Voice.   Michigan’s Joshua Davis was raised in the folk tradition: the music, the social movements, the land.   He writes songs that blend the roots of American music with gritty rock n' roll and vintage soul.   For over 15 years Joshua has made his living sharing his songs, stories and knowledge across the US and Canada at festivals, concert halls, coffeehouses and dives - as a solo act, front man for roots ensemble \"Steppin' In It\", classic swing band \"Shout Sister Shout\", songwriter showcase band \"The Starlight Six\" and frequently as a workshop facilitator, presenter or instructor. \nhttp://www.joshuadavismusic.com \n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Joshua Davis / August 4th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE"}, {"source": "Facebook", "date": "2016-08-04T18:00:00-04:00", "url": "https://www.facebook.com/events/1099742733428684/", "description": "Get your geek on! Board games, card games, everything is in play- we'll have a selection of old standbys and new favorites, or you can feel free to bring your own. Bonus- Short's Brewing Company will be doing a tap takeover, and pints are just 2 for $3. Beer+Games=Good Times", "name": "Short's Brewing Tap Takeover & Game Night"}, {"source": "Facebook", "date": "2016-08-04T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-08-04T19:00:00-04:00", "url": "https://www.facebook.com/events/536543129884608/", "description": "Literati is pleased to welcome Madeline Diehl and Jennifer Metsker in support of the anthology Show Me All Your Scars: True Stories of Living with Mental Illness. \n\nAbout the book:\n\nEvery year, one in four American adults suffers from a diagnosable mental health disorder. In these true stories, writers and their loved ones struggle as their worlds are upended. What do you do when your father kills himself, or your mother is committed to a psych ward, or your daughter starts hearing voices telling her to harm herselfor when you yourself hear such voices? Addressing bipolar disorder, OCD, trichillomania, self-harm, PTSD, and other diagnoses, these stories depict the difficulties and sorrows--and sometimes, too, the unexpected and surprising rewards--of living with mental illness.\n\nAbout the speakers:\n\nJennifer Metsker lives in Ann Arbor, Michigan where she is the Writing Coordinator at the Stamps School of Art and Design. Her poetry, which often addresses issues related to mental illness, has appeared or is forthcoming in many journals including The Cincinnati Review, Cimarron Review, Gulf Coast, The Seattle Review, Whiskey Island, Rhino, Cream City Review, and Birdfeast. She has written art reviews for Arthopper and Carbon Culture and recently was awarded the Third Coast Audio Shortdoc Prize for an audio piece that she created with artist Stephanie Rowden. \n\nMadeline Strong Diehl has worked as a magazine journalist, editor, and grant writer for almost 30 years. She has won the T.S. Eliot poetry prize from the University of Kent at Canterbury and published a book of poetry, Wrestling with Angels (2013). Her comedies have been produced Off-Broadway and around the Midwest, and she has published dozens of humorous essays, believe it or not.", "name": "Madeline Diehl & Jennifer Metsker"}, {"source": "Facebook", "date": "2016-08-04T19:00:00-04:00", "url": "https://www.facebook.com/events/212274295832362/", "description": "Kuebler Langford Nature Area is a 31-acre park tucked into a sharp curve of Huron River Drive. Part of the park is old field, and contains native dry prairie species. A deep ravine bisects the park, and moist woods cover its slopes. The park connects to Bird Hills Nature Area.\nThis nature walk is a collaboration between the AADL and Natural Area Preservation and is one of a series that take place each month throughout the summer and fall. For this one, we will meet in the parking lot on the western shoulder of Huron River Drive. Wear comfortable clothes and bring water and bug spray if desired. Some of the AADL science tools will be available for use during the walk, too!", "name": "Nature Walk with Ann Arbor District Library"}, {"source": "Facebook", "date": "2016-08-04T20:00:00-04:00", "url": "https://www.facebook.com/events/1597811077198277/", "description": "At the Kerrytown Concert House this summer: Oscar Wilde’s The Importance of Being Earnest, directed by James Ingagiola.  Unbeknownst to his friends and acquaintances, John Worthing leads a double life:  He is Jack, a respectable landowner, in the country and Ernest in the city.  But when the love of his life, the elegant Gwendolyn Fairfax, insists that her dream is to marry a man named Ernest, John must abandon his dual identity–which may prove harder than it seems…especially when his friend Algernon visits John’s country estate pretending to be Ernest!  This “Trivial Comedy for Serious People” is truly one of the wittiest, funniest plays in the English language.  \n\nThe show will run August 4-6, with 8 p.m. start times on Thursday, Friday and Saturday, PLUS a 2 p.m. matinee on Saturday (there is no show on Sunday).\n\nThe cast will feature Amanda Barnett, Ethan Gibney, Elizaveta McFall, Amanda Photenhauer, Jan Romans, Annaliese Romans, Elizabeth Wagner, and Catherine Zudak.\n\nTickets are $15 for adults/$5 for students.  Visit http://www.kerrytownconcerthouse.com/index.php/events/event/BTE_earnest_thu/, call 734-769-2999 or email reservations@kerrytown.com for tickets.", "name": "The Importance of Being Earnest"}, {"source": "Facebook", "date": "2016-08-05T18:00:00-04:00", "url": "https://www.facebook.com/events/1871445973082972/", "description": "Coming Friday, August 5\n\nPOP-IN: Intermitten Edition [intermitten.org]\nWorks that showcase the intersection of Art and Tech\n\nFREE ADMISSION\n6:00PM – 9:00PM \n\nJoin us for POP-IN: one night only pop-up expressions of creativity by local artists that will immerse you in unusual, accessible experiences.\n\nCurated by and in partnership with the Intermitten conference, where influential leaders reveal how harnessing creativity transforms industries\n\nMusic Performances by:\n\nShigeto\nCharles Trees\nwith virtual reality experience provided by ICON Interactive\nFeaturing:\nCreative learning environment with a “hacked piano” by Sam Pierce Lolla\nSound installation booth by Anna Nuxoll\nThe artwork of Jeremy Wheeler\nLive screen dance by Sean Hoskins\nDrop-in origami making and origami exhibition by Beth Johnson\n\nand more!", "name": "Pop in Intermitten Edition"}, {"source": "Facebook", "date": "2016-08-05T19:00:00-04:00", "url": "https://www.facebook.com/events/1312355338789742/", "description": "For the second year running, Literati is pleased to help celebrate MGoBlog's Hail To The Victors--an indepedent, definitive, in-depth guide to the upcoming Michigan Football Season--with an event in its honor. The evening will again feature a presentation from the issue's contents, and additional copies will be available for sale. This year's event will take place at Circus Bar & Billiards. Purchase a drink from their full bar, grab a bowl of free popcorn, revel in the football previewing. Free and open to the public. 7pm.\n\nFeatured in Hail To The Victors 2016: \n\nMGoBlog's Brian Cook writes a team preview covering about a third of the book, offers an opinion on the overall state of the offense, defense, and special teams, and then plunks down a prediction that will no longer be roundly mocked because Michigan's coaching staff is no good. Probably.\nAce Anbender surveys the opposition with savage intent. Buckeye Grove's Ross Fulton rounds out the Ohio State preview; Ross's in-depth knowledge of the Buckeyes and surprising sanity are an excellent combination.\nAdam Schnepp sits down with tight end Jake Butt and discusses Harbaugh, the NFL, his decision to avoid it, and many other topics. Michael Elkon on expectations in year two of Harbaugh.\nSBNation's Ian Boyd on John O'Korn and how he fits into Harbaugh's passing game. Steve Sharik on Don Brown's dudes and what he plans to accomplish with them.\nSeth Fisher and Mel Newman on when Texas A&M tried to buy Bo... and failed. John Kryk on The Guarantee, 30 years later. Steve Sapardanis on the Six Penny Defense, or when Bo invented the dime package. Craig Ross on how Michigan more or less invented all of football, from the forward pass to platoons.", "name": "MGoBlog's Hail to the Victors 2016 at Circus Bar"}, {"source": "Facebook", "date": "2016-08-05T20:00:00-04:00", "url": "https://www.facebook.com/events/503218819864337/", "description": "Join us on Friday, Saturday & Sunday, August 5-7 for OUTFest 2016! \n\n~~Friday Night~~ \nMovie at Braun Court: 8:00 pm\nNecto Pride night at Necto: 9:00 pm - 2:00 am\n\n~~Saturday~~\nExhibit Booths: 10:00 am - 8:00 pm\nMusic & Entertainment: 10:00 am - midnight\nJim Toy Center Open House: 10:00 am - 5:00 pm\nKid Zone: Noon - 6:00 pm\nDrag Revue: 3:00 - 4:30 pm\nBeer & Wine Garden: 4:00 pm - midnight\nSilent Auction: 4:00 - 7:00 pm\nPoetry Slam: 5:00 - 6:00 pm\nBoard Game Night: 6:00 - 10:00 pm\nOUTFest Drag Revue: 8:00 - 9:00 pm\nNecto Pride Dance Party: 9:00 pm - midnight\nCircus Afterparty: Midnight - 2:00 am\n\n~~Sunday~~\nWashtenaw County Pride Picnic at Wheeler Park\nNoon - 4:00 pm\n\nSee website for more detailed schedule!\nA2outfest.com\n\nPresenting Sponsors:\nComcast Michigan\nBetween The Lines Newspaper\nWolverine State Brewing Co.\nBarefoot Wine & Bubbly\n\nSponsors:\nMANI Osteria & Bar & Isalita\nDomino's Pizza\nComerica Bank\nNecto Pride\nCare One, Inc.\nVisit Ann Arbor! & Ypsi Real\nOut Post\nBill's Beer Garden\nTrillium Real Estate\nBlue Cross Blue Shield of Michigan\nbank of ann arbor\nPNC\nAut Bar & Common Language Bookstore\nUNIFIED - HIV Health and Beyond\nAmerican Red Cross, Southeastern Michigan Region\nUniversity of Michigan Spectrum Center\nCorner Health Center\nWoodland Mews\n327 Braun Court\nThe Wurst Bar\nMighty Good Coffee\nBrillig Dry Bar\nWilson P. Tanner III, PLC\nCircus Bar and Billiards Ann Arbor\nColor Pet Productions\n\nFriend of Jim Toy:\n Zingerman’s, Queer Young Professionals, Plum Market\n\nHonorary Chairs:\nJim Toy, Sheriff Jerry Clayton, State Representative Adam Zemke, State Representative Kristy Pagan, Commissioner Felicia Brabec,  Commissioner Andy LaBarre, Commissioner Yousef Rabhi, City Council member Anne Brown, Leigh Greden, Jason Frenzel, Cynthia Dunitz, Jim Simpson, Jeremy Merklinger, Heather Wold-Gallagher, Jennie Hale, Mary Larkin, Renee & John Greden\n\nWe are currently accepting sponsorships, exhibitor applications. Please email: Lcartier@annarbor.org for more information. \n\nOur Mission: We envision an inclusive community where people of diverse sexual orientation and gender identity are visible and live together in equality, respect and happiness.", "name": "OUTFest & Pride Picnic 2016"}, {"source": "Facebook", "date": "2016-08-05T20:00:00-04:00", "url": "https://www.facebook.com/events/1597811077198277/", "description": "At the Kerrytown Concert House this summer: Oscar Wilde’s The Importance of Being Earnest, directed by James Ingagiola.  Unbeknownst to his friends and acquaintances, John Worthing leads a double life:  He is Jack, a respectable landowner, in the country and Ernest in the city.  But when the love of his life, the elegant Gwendolyn Fairfax, insists that her dream is to marry a man named Ernest, John must abandon his dual identity–which may prove harder than it seems…especially when his friend Algernon visits John’s country estate pretending to be Ernest!  This “Trivial Comedy for Serious People” is truly one of the wittiest, funniest plays in the English language.  \n\nThe show will run August 4-6, with 8 p.m. start times on Thursday, Friday and Saturday, PLUS a 2 p.m. matinee on Saturday (there is no show on Sunday).\n\nThe cast will feature Amanda Barnett, Ethan Gibney, Elizaveta McFall, Amanda Photenhauer, Jan Romans, Annaliese Romans, Elizabeth Wagner, and Catherine Zudak.\n\nTickets are $15 for adults/$5 for students.  Visit http://www.kerrytownconcerthouse.com/index.php/events/event/BTE_earnest_thu/, call 734-769-2999 or email reservations@kerrytown.com for tickets.", "name": "The Importance of Being Earnest"}, {"source": "Facebook", "date": "2016-08-05T20:00:00-04:00", "url": "https://www.facebook.com/events/1029166527138447/", "description": "It's movie night at Pointless! \"Silver Screenings Playbook\" is a curated collection of comedic video shorts from Detroit area filmmakers and actors. Our League of Pointless Improvisers will open the show with some hilarious improv, then the films start rolling, giving you a wide variety of some of the best homegrown comedy around. One weekend only!\n\nFriday, August 5 @ 8 pm\nSaturday, August 6 @ 8 pm", "name": "Silver Screenings Playbook"}, {"source": "Facebook", "date": "2016-08-05T20:00:00-04:00", "url": "https://www.facebook.com/events/301838690156473/", "description": "join us as we communicate with the other side, special guest THE FRIEND will be our medium for the evening. Matilda will be providing the visual circle of hands\n\nThe Friend\nhttps://soundcloud.com/thefriend\n\nother participants include\n\nsuitor\nhttps://soundcloud.com/suitor-1\n\njimmy k\nhttps://soundcloud.com/jimmykdetroit\n\nPAT in the HAT\nhttps://soundcloud.com/patinthehatdoe\n\njeff garcia\nhttps://mixcloud.com/garconsrustiques/\n\nsanford\n\nVISUALS\n\nUnofficial: Matilda", "name": "Summer Seance wsg The Friend (how to kill) at Club Above"}, {"source": "Facebook", "date": "2016-08-06T09:00:00-04:00", "url": "https://www.facebook.com/events/247419802290299/", "description": "What was once a construction yard for M-14 is now a natural grassland. Exotic invasive plants are invading this open habitat, and volunteer help is needed to remove them. Please meet at the park entrance on Beechwood Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Kuebler Langford Park Stewardship Workday"}, {"source": "Facebook", "date": "2016-08-06T10:00:00-04:00", "url": "https://www.facebook.com/events/1254446424585433/", "description": "Happy Birthday Ann Arbor Farmers Market! This year we're celebrating 97 years of bringing the community together over fresh, local, delicious food and more! Join us as we thank our vendors and community for their loyal support.  We're one year closer to the big 100! \n\nIn addition to the regular market hours 7am-3pm, we are so excited to have games and activities for market-goers of all ages 10am-2pm on Detroit Street. Come decorate a birthday card for a market vendor and pick up some tasty treats from some of our favorite local food trucks.\n\nFood Gatherers will be onsite 7am-3pm, accepting donations of fresh fruits and vegetables. This is fantastic opportunity to give back right at the market! The market's birthday kicks off this fantastic partnership, which will be ongoing throughout the month of August.\n\nLiterati Bookstore will be showcasing local food, cooking and gardening books with great examples for ingredients that you can buy right at the market!\n\nA #TasteofMusic performance by the Ann Arbor Symphony Orchestra starting at 12:30 with an instrument petting zoo for kids of all ages from 10am-2pm.\n\nDon't forget to tag us in your pictures with #a2marketbday\nWe're on Twitter and instagram too!", "name": "97th Birthday Celebration!"}, {"source": "Facebook", "date": "2016-08-06T11:00:00-04:00", "url": "https://www.facebook.com/events/1673599989630250/", "description": "Calling all IPA lovers!! Today we come together to share our love of Humulus lupulus!\nWe will feature 5 ABC IPA's on tap kicking off at 11:00am.\n\n- Precious Metal IPA\n6.8% ABV 43 IBU\nSingle-Hopped IPA with El Dorado\n\n- Shark Jumper DIPA\n8.9% ABV 90 IBU\nResinous and dank with hints of apricot and meyer lemon.\n\n- Sacred Cow Cask IPA\n6.9% ABV 80 IBU\nTangy, citrusy hops with distinct ruby-red grapefruit\n\n- Buzzsaw American IPA\n7.5% ABV 51 IBU\nBold hop-forward west coast style with notes of pine, grapefruit, and apricot\n\n - Largebeat Wheat IPA\n8% ABV 90 IBU\nImperial wheat IPA with loads of hops", "name": "IPA Day!"}, {"source": "Facebook", "date": "2016-08-06T13:00:00-04:00", "url": "https://www.facebook.com/events/238795023164171/", "description": "Walk along Malletts Creek, watch the birds at the pond, play a game of disc golf, or ride your bike on the paved path – no matter what you’re doing in this park, you’re sure to see the effects of ongoing restoration work. Mary Beth Doyle Park has been transformed by volunteers! Help continue the effort by removing trash and invasive weeds in the open areas of this park. Please meet at the end of Verle Road, two blocks west of Platt Road. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Mary Beth Doyle Nature Area Park Stewardship Workday"}, {"source": "Facebook", "date": "2016-08-06T17:00:00-04:00", "url": "https://www.facebook.com/events/1558006737841380/", "description": "This is your last chance to see the Ann Arbor Derby Dimes play at Buhr Park this year!!!! Come watch these two fabulous bouts for one low price!\n\n6:00- Arbor Bruising Co. vs. Flint City Derby Girls\n\n7:30- Ypsilanti Vigilantes vs. Killamazoo Derby Darlins Kill Squad \n\nBouts include kid-friendly activities, half-time entertainment, sponsored concessions, and giveaways! \n\nDoors open at 5:00, first whistle at 6:00!\n\nAfter party location: * Aubree's Pizzeria and Grill* 39 E. Cross Street, Ypsilanti, MI 48198 * http://aubrees.com/", "name": "Ann Arbor Roller Derby Double Header"}, {"source": "Facebook", "date": "2016-08-06T20:00:00-04:00", "url": "https://www.facebook.com/events/503218819864337/", "description": "Join us on Friday, Saturday & Sunday, August 5-7 for OUTFest 2016! \n\n~~Friday Night~~ \nMovie at Braun Court: 8:00 pm\nNecto Pride night at Necto: 9:00 pm - 2:00 am\n\n~~Saturday~~\nExhibit Booths: 10:00 am - 8:00 pm\nMusic & Entertainment: 10:00 am - midnight\nJim Toy Center Open House: 10:00 am - 5:00 pm\nKid Zone: Noon - 6:00 pm\nDrag Revue: 3:00 - 4:30 pm\nBeer & Wine Garden: 4:00 pm - midnight\nSilent Auction: 4:00 - 7:00 pm\nPoetry Slam: 5:00 - 6:00 pm\nBoard Game Night: 6:00 - 10:00 pm\nOUTFest Drag Revue: 8:00 - 9:00 pm\nNecto Pride Dance Party: 9:00 pm - midnight\nCircus Afterparty: Midnight - 2:00 am\n\n~~Sunday~~\nWashtenaw County Pride Picnic at Wheeler Park\nNoon - 4:00 pm\n\nSee website for more detailed schedule!\nA2outfest.com\n\nPresenting Sponsors:\nComcast Michigan\nBetween The Lines Newspaper\nWolverine State Brewing Co.\nBarefoot Wine & Bubbly\n\nSponsors:\nMANI Osteria & Bar & Isalita\nDomino's Pizza\nComerica Bank\nNecto Pride\nCare One, Inc.\nVisit Ann Arbor! & Ypsi Real\nOut Post\nBill's Beer Garden\nTrillium Real Estate\nBlue Cross Blue Shield of Michigan\nbank of ann arbor\nPNC\nAut Bar & Common Language Bookstore\nUNIFIED - HIV Health and Beyond\nAmerican Red Cross, Southeastern Michigan Region\nUniversity of Michigan Spectrum Center\nCorner Health Center\nWoodland Mews\n327 Braun Court\nThe Wurst Bar\nMighty Good Coffee\nBrillig Dry Bar\nWilson P. Tanner III, PLC\nCircus Bar and Billiards Ann Arbor\nColor Pet Productions\n\nFriend of Jim Toy:\n Zingerman’s, Queer Young Professionals, Plum Market\n\nHonorary Chairs:\nJim Toy, Sheriff Jerry Clayton, State Representative Adam Zemke, State Representative Kristy Pagan, Commissioner Felicia Brabec,  Commissioner Andy LaBarre, Commissioner Yousef Rabhi, City Council member Anne Brown, Leigh Greden, Jason Frenzel, Cynthia Dunitz, Jim Simpson, Jeremy Merklinger, Heather Wold-Gallagher, Jennie Hale, Mary Larkin, Renee & John Greden\n\nWe are currently accepting sponsorships, exhibitor applications. Please email: Lcartier@annarbor.org for more information. \n\nOur Mission: We envision an inclusive community where people of diverse sexual orientation and gender identity are visible and live together in equality, respect and happiness.", "name": "OUTFest & Pride Picnic 2016"}, {"source": "Facebook", "date": "2016-08-06T20:00:00-04:00", "url": "https://www.facebook.com/events/1029166527138447/", "description": "It's movie night at Pointless! \"Silver Screenings Playbook\" is a curated collection of comedic video shorts from Detroit area filmmakers and actors. Our League of Pointless Improvisers will open the show with some hilarious improv, then the films start rolling, giving you a wide variety of some of the best homegrown comedy around. One weekend only!\n\nFriday, August 5 @ 8 pm\nSaturday, August 6 @ 8 pm", "name": "Silver Screenings Playbook"}, {"source": "Facebook", "date": "2016-08-06T21:00:00-04:00", "url": "https://www.facebook.com/events/1729703780616950/", "description": "Saturday, August 6 | 9pm | 18+ | $8 adv./ $10 day of\n\nPhish Tribute feat: The Powerful Pills - Phish Tribute", "name": "Phish Tribute: Powerful Pills & Dead Ahead Ohio 8/6/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-08-07T07:30:00-04:00", "url": "https://www.facebook.com/events/1034739496621459/", "description": "From epicraces.com: You’re no weekend running hobbyist. You’re the real deal. Other people’s workouts are your warm up. Wind, rain, snow, and darkness don’t faze you: just point you at a trail, mount you on a bike, aim you at a lake and you’re ready to roll. You eat miles for breakfast. You’ve been waiting for the Michigan triathlon that’s just as tough as you.  And now it’s here: the Ann Arbor Triathlon, presented by the Wolverine State Brewing Company. No maize and blue. No adamantium claws. Just you and nature, baby… and beer at the finish line. Rock on!\n\nThe 2016 Ann Arbor Triathlon will be held on Sunday, August 7, 2016 at Halfmoon Lake in the Pinckney State Recreation Area, one of the largest state parks in all of Michigan. You’ll swim the open waters of Halfmoon, bike the rolling country roads of the surrounding rural area, then run the 5-mile classic Poto Trail course to complete your mission: showing the world that you’re a rock star.\n\nTo register and for more information, go to epicraces.com!", "name": "WolverineMan: The Ann Arbor Tri"}, {"source": "Facebook", "date": "2016-08-07T20:00:00-04:00", "url": "https://www.facebook.com/events/1597811077198277/", "description": "At the Kerrytown Concert House this summer: Oscar Wilde’s The Importance of Being Earnest, directed by James Ingagiola.  Unbeknownst to his friends and acquaintances, John Worthing leads a double life:  He is Jack, a respectable landowner, in the country and Ernest in the city.  But when the love of his life, the elegant Gwendolyn Fairfax, insists that her dream is to marry a man named Ernest, John must abandon his dual identity–which may prove harder than it seems…especially when his friend Algernon visits John’s country estate pretending to be Ernest!  This “Trivial Comedy for Serious People” is truly one of the wittiest, funniest plays in the English language.  \n\nThe show will run August 4-6, with 8 p.m. start times on Thursday, Friday and Saturday, PLUS a 2 p.m. matinee on Saturday (there is no show on Sunday).\n\nThe cast will feature Amanda Barnett, Ethan Gibney, Elizaveta McFall, Amanda Photenhauer, Jan Romans, Annaliese Romans, Elizabeth Wagner, and Catherine Zudak.\n\nTickets are $15 for adults/$5 for students.  Visit http://www.kerrytownconcerthouse.com/index.php/events/event/BTE_earnest_thu/, call 734-769-2999 or email reservations@kerrytown.com for tickets.", "name": "The Importance of Being Earnest"}, {"source": "Facebook", "date": "2016-08-09T07:30:00-04:00", "url": "https://www.facebook.com/events/1542034336104534/", "description": "Are you interested in learning more about how to care for our natural areas? Then join the Stewardship Network's Huron Arbor cluster for an informal discussion on a monthly topic with volunteer and professional land stewards, plus others interested in nature. Free! This month’s topic: Kerry Gray will be talking about forest pests:  Our woods are under attack - You may know all about Emerald Ash Borer, but can you identify signs of Oak Wilt or other tree pests? Bring your questions and join us for a discussion about threats to urban forests.", "name": "Stewards' Circle- Forest Pests"}, {"source": "Facebook", "date": "2016-08-09T19:00:00-04:00", "url": "https://www.facebook.com/events/1114924125197190/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nIsaac Berkowitz and Chris Bota are guitarists in the Michigan rock band, Desmond Jones. As an acoustic duo, they blend blugrass and country acoustic guitar style with their band's original tunes. \nDesmond Jones is a five-piece funk/rock/jazz fusion band from Grand Rapids, Michigan. With original music written to compliment the group's sound as a whole, the music is centered around melodic guitar riffs, smooth bass lines, funky drum beats, and some saxophone.\n\nNever a cover\nAlways a good time", "name": "Acoustic Tuesdays: Isaac Berkowitz and Chris Bota"}, {"source": "Facebook", "date": "2016-08-11T12:00:00-04:00", "url": "https://www.facebook.com/events/267031343632872/", "description": "The Ragbirds\nFor years, “home” was a place The Ragbirds rarely visited. The band’s music — a genre-bending hybrid of indie-pop melodies, global rhythms and songwriting styles influenced from all over the world — was as broad as their audience, which stretched from the group’s hometown of Ann Arbor, Michigan, to the shores of Osaka, Japan (where they scored a Number One pop hot with the song “Book of Matches”). Show by show, in venues ranging from rock clubs and performing arts centers to festivals encompassing everything from bluegrass to electronica, The Ragbirds developed a well-deserved reputation as one of the most dynamic, high-spirited live bands in roots music.\nThe Ragbirds albums have received local and national praise, hailed “Highly impressive!” by USA Today and touted as “Astounding international eclecticism” by Reveal Arts.  The band has performed in over forty-five states to a tune of 150+ shows a year, The Ragbirds have become festival favorites.  They have won over crowds at  Electric Forest, 10,000 Lakes, CMJ Music Marathon, Summer Camp, Wheatland, Blissfest, Wookiefoot’s Harvest Fest,  Ann Arbor Folk Festival, Hookahville, to name a few; and have shared stages with Brandi Carlile, Rusted Root, Matisyahu, Railroad Earth, John Butler Trio,  Toubab Krewe,  Cornmeal, Greensky Bluegrass, Hot Buttered Rum,  Jeff Daniels, The Everyone Orchestra, The Duhks, and many others.For all their traveling, The Ragbirds maintain a steady connection to their home base.  While reflecting on Michigan, Erin had this to say “… It’s a beautiful place to be, snuggled in the Great Lakes, close enough to hold hands with Canada. It is connected to a secret, mysterious, magical place called the U.P., but most of all there is an amazingly talented and humbly supportive music community that spreads through the state, clustered into groups in Ann Arbor and Lansing, Grand Rapids, Flint, Traverse City and Detroit. The scene (and scenery) keeps us fueled with love and inspiration.”\n\n2016 Lineup \n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "The Ragbirds / August 11th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE"}, {"source": "Facebook", "date": "2016-08-11T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-08-12T08:00:00-04:00", "url": "https://www.facebook.com/events/1778863865683283/", "description": "Featuring the newly released Zingerman’s Guide to Good Leading, Part 4; A Lapsed Anarchist’s Approach to the Power of Beliefs in Business (a copy of the book is included in the price of each seat.)\n\nAlthough most of us don’t realize it, our beliefs have a major impact on how things go in our lives. What we believe may or may not be true, but unknowingly most of us will behave in ways that reinforce our beliefs anyways. At this breakfast, Ari Weinzweig, Co-Founder and CEO of Zingerman’s Community of Businesses, will take a look at how the impact of those beliefs likely play out in our day to day experiences in the workplace, and how we and our workplaces are impacted by those beliefs. Whether we accept it or not, what we believe about ourselves, about our organization, our co-workers, our boss, the work that we do and our ability to do it will significantly alter the outcomes we are seeking to achieve. And how, by becoming more mindful of our beliefs, we can effectively backtrack—by altering our beliefs, we change the way we see our work and the world and then, in turn, significantly alter the outcomes we get from our efforts.\n\nIt is our belief you will leave breakfast with a full stomach and a full mind - with new insights, tips and techniques into how you can become more mindful of your own beliefs and how you can positively affect your surroundings by changing your beliefs.\n\nBreakfast is served!\n- Fresh Fruit Platter\n- Zingerman’s Bakehouse Coffee Cakes\n- Corned Beef Hash\n- Applewood Smoked Bacon\n- Zingerman’s Coffee Co. Roadhouse Joe and Detroit St. Decaf", "name": "Beliefs, Business and Breakfast"}, {"source": "Facebook", "date": "2016-08-12T20:00:00-04:00", "url": "https://www.facebook.com/events/494075117454653/", "description": "“Art is made in the freedom of the imagination with no rules”\n\n\"bobrauschenbergamerica\" is a fast paced non-traditional slice of life story revolving around relationships, explored through wacky images, poetry, jokes, dance, and more, providing a wild look at American culture. \n\nWritten by Charles L. Mee. Featuring: Danielle Clevenger, Elizabeth Dieterich, Rick Eva, Alanna Elling, Mark Isler, Kelsea Kerkes, Josie Lapczynski, Sara Long, Jeffery Stringer, and James Walrod. \n\nFriday, August 12 @ 8 pm \nSaturday, August 13 @ 8 pm\nSunday, August 14 @ 7 pm", "name": "Bobrauschenbergamerica"}, {"source": "Facebook", "date": "2016-08-13T09:00:00-04:00", "url": "https://www.facebook.com/events/280716698937457/", "description": "This park has come a long way from its past as a gravel quarry. Now bicyclists, dog owners, soccer players and hikers all use it. Volunteers are needed to hand-pull invasive weeds where they are invading open meadows. There are several uncommon species of butterflies in this park that use these open spaces. Please meet at the entrance on Dhu Varren Road, just east of Pontiac Trail. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Olson Park Stewardship Workday"}, {"source": "Facebook", "date": "2016-08-13T20:00:00-04:00", "url": "https://www.facebook.com/events/494075117454653/", "description": "“Art is made in the freedom of the imagination with no rules”\n\n\"bobrauschenbergamerica\" is a fast paced non-traditional slice of life story revolving around relationships, explored through wacky images, poetry, jokes, dance, and more, providing a wild look at American culture. \n\nWritten by Charles L. Mee. Featuring: Danielle Clevenger, Elizabeth Dieterich, Rick Eva, Alanna Elling, Mark Isler, Kelsea Kerkes, Josie Lapczynski, Sara Long, Jeffery Stringer, and James Walrod. \n\nFriday, August 12 @ 8 pm \nSaturday, August 13 @ 8 pm\nSunday, August 14 @ 7 pm", "name": "Bobrauschenbergamerica"}, {"source": "Facebook", "date": "2016-08-13T20:00:00-04:00", "url": "https://www.facebook.com/events/868707606568472/", "description": "Electric Playground Entertainment presents:\n\nKTRL\n\n     Having roots in Chicago, KTRL is redefining the music scene with his unique sound. With a catalogue of released music on a multitude of labels such as Buygore, EDM.com, Resistance Records and a few others, Adam is gaining support from the likes of Oliver Hendens, Dr. Fresch, Borgore, Ghastly, and more.\n     KTRL is hastily readying for what the future is going to bring; with a backlog of unreleased music being meticulous planned to be released throughout the remainder of 2016 and multiple shows already being lined up, KTRL will be on the tip of everyone’s tongue in 2017.\n\nNickyBoom\n\n     Nick Stong AKA NickyBoom. 29 years old originally from Milwaukee, WI. Now I live in the music heavy Detroit. I've been listening to electronic music since I've been 13 and produced my first track when I was 20. I've played alongside artists as Datsik, Excision, Luminox, Protohype, InIt, Riot Ten and AFK. Music is what defines me and I just like to get down, and when I'm playing I just like everyone to dance with me. That's what it's all about. Forget the genres, forget the drama....just dance. New music coming soon! Be on the lookout for what I release! And enjoy what I do. \n\nTrauma Kidd\n\n     Trauma Kidd has been involved in Electronic music since the late 90's being involved in the warehouse scene in columbus Ohio. Many years went by as a spectator until recently when he decided to hit the decks all over again. Inspired by the variety of electronic music out there depending on the crowd and location no one set is the same. He has been tearing it up in North carolina for the last two years. He is an up and coming talent you won't want to miss in columbus. He has opened for AC Slater, Roevy, Buku,Rusko, Trill Clinton, Crizzly, Milo& Otis, and regulators. Look for his EP to drop 2015.\n\nCass Wasacz\n\n     Cameron “Cass” Wasacz is a 21 year old DJ/Music Producer, Drummer, and Lighting Specialist. Raised in Detroit, MI, Cam infuses his love for Metal/Rock/Funk with electronic production. And not only stops at sound design but brings the full show to his live performances with a spectacular lighting experience. He’s transformed the underground scene with his lighting company ProLux Entertainment. Allowing upcoming bands, rappers and produces like himself to experience the next level during their performances. \n\n     Cass has supported many names that have made their way through michigan including: Kayzo, Liquid Stranger, Jackal, Party Thieves, Vaski, MUST DIE!, TrollPhace, Eptic and soon to include DiscoTech Heroes!\n\nQuack Attak\n\n     Quack Attak is an up and coming Detroit based DJ and producer dedicated to various genres of house and techno. Growing up in, and around Detroit, he was influenced by many genres of music such as motown, disco, funk, soul, house, techno, and many more. Quack Attak began his quest to express himself through the speakers after being reintroduced to the dance music scene in 2013. Since then, he has dedicated his life to sharing his experiences with the next generation of music lovers. He has performed throughout Michigan from Detroit to Grand Rapids, in Columbus, OH at Red Club, and has made national news bringing the house down at Project P in 2014.\n\nPocketMonsta\n\nAt level 21, the dirty beat challenger Shay Smith aka PocketMonsta has been making her way into Detroit’s electronic music scene. Born and raised in Metro Detroit by a tech head/rocker father she was hooked on dirty beats at a young age. Some of her early influences include LCD Soundsystem, Nine Inch Nails, and The Flaming Lips. She began her musical journey with the guitar and flute, which she hopes to incorporate into some filthy tunes.  Currently she’s in the works of producing a variety of genres that come from the rhythm of the heart and her desire to inspire. From her bouncy house drops to her love of percussive, funky beats, she aims to provide a brilliant booty shakin experience that makes you let it all loose on the dance floor.\n___________________________________________________\n\nLighting provided by ProLux Entertainment\n\nProLux Entertainment focuses on putting on the best quality show for every event! We specialize in lighting/sound & stage production and offer multiple stage set ups - perfect for any venue space.\n___________________________________________________\n\nVendors\n\nPhiber Printing\n\nPhiber. /Fy-búr/. \n\n1. The movement of who you are, what you believe and the means to express it. \n\nODRD Collective\n\nMusic/Art/Lifestyle brand. Creators/Curators\nForward thinking individuals\n\nHeather Alyson - Cosmic Kisses\n___________________________________________________\n\nPhotography by CUTE but PSYCHO Photography\n___________________________________________________\n\n18+ with a valid ID\n21+ to drink\n\nTickets: Eventbrite.com/e/ktrl-at-club-above-tickets-26675849183", "name": "KTRL at Club Above"}, {"source": "Facebook", "date": "2016-08-15T20:00:00-04:00", "url": "https://www.facebook.com/events/494075117454653/", "description": "“Art is made in the freedom of the imagination with no rules”\n\n\"bobrauschenbergamerica\" is a fast paced non-traditional slice of life story revolving around relationships, explored through wacky images, poetry, jokes, dance, and more, providing a wild look at American culture. \n\nWritten by Charles L. Mee. Featuring: Danielle Clevenger, Elizabeth Dieterich, Rick Eva, Alanna Elling, Mark Isler, Kelsea Kerkes, Josie Lapczynski, Sara Long, Jeffery Stringer, and James Walrod. \n\nFriday, August 12 @ 8 pm \nSaturday, August 13 @ 8 pm\nSunday, August 14 @ 7 pm", "name": "Bobrauschenbergamerica"}, {"source": "Facebook", "date": "2016-08-17T19:00:00-04:00", "url": "https://www.facebook.com/events/301784066833678/", "description": "Learn the fundamentals of improvisation, basic games, scene work and skills. Get used to being on stage and working with others in safe, supportive environment. For ages 18 and up. Every Sunday for 8 weeks.", "name": "Intro 1: Welcome to Improv"}, {"source": "Facebook", "date": "2016-08-18T12:00:00-04:00", "url": "https://www.facebook.com/events/1751795881730523/", "description": "Joe Hertler & The Rainbow Seekers will make a sprightly young groove doctor out of anyone. With spectacular energy pulsating from every member of the band, its no wonder why they are headlining festivals and one of Michigan’s top rising stars.  Lead singer and Amish excommunicate Joe Hertler splashes through lyrical puddles of golden rain, leaving his audience wearing flowery headdresses and bubbling smiles. A ride on the Rainbow will take you across the mountains of Motown, through the fjords of folk, over the archipelagos of Americana, and—at last—into a funky firth, where only the fiercest of friendships can be found.   Their new album “Terra Incognita “ goes beyond their comfort limits into new styles, new instruments, and new vocals. Everything works out in favor of Joe Hertler & The Rainbow Seekers. It might be early to say, but Terra Incognita could be just what they need to push them over the threshold. Fans that love Joe Hertler & The Rainbow Seekers for their folk melodies will not be disappointed. Though they’ve gone in new directions, the new album still features songs similar to those on On Being. With slow, precise fingerpicking Joe gently sings poetry similar to their old stuff in “Betelgeuse” and “Red Wings.”\nhttp://www.joehertler.com \n\n2016 Lineup \n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Joe Hertler & The Rainbow Seekers / August 18th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE"}, {"source": "Facebook", "date": "2016-08-18T19:00:00-04:00", "url": "https://www.facebook.com/events/1032923290126826/", "description": "Detroit News features reporter Stephanie Steinberg, editor of In the Name of Editorial Freedom: 125 Years at the Michigan Daily, will give a book talk at Literati Bookstore in Ann Arbor Aug. 18.\n\nCome hear how the University of Michigan's student-run newspaper, The Michigan Daily, got started in 1890 and how it has kickstarted the careers of journalists working at top media outlets from The New York Times to ESPN. Stephanie will share a few stories from the collection of essays by Daily alumni. A Q&A and book signing will follow. \n\nBooks will be available for purchase for $28.95. For more information on the book, visit: https://www.press.umich.edu/7864923/in_the_name_of_editorial_freedom\n\nFor more event details visit http://www.literatibookstore.com/event/stephanie-steinberg-name-editorial-freedom", "name": "Book Talk at Literati"}, {"source": "Facebook", "date": "2016-08-18T19:30:00-04:00", "url": "https://www.facebook.com/events/287837741565552/", "description": "Three years ago, a cranky Chinese-American concluded a quest to find his ancestors that led him across four continents and four thousand years. Now, in the midst of a new identity crisis, the champion of negative thought is going back to China.\nWhether he's beating the streets of Beijing in pursuit of a stolen backpack or confronting Communism in an Emperor's tomb, engaging in a battle of wits with overzealous tour guides or performing a pig sacrifice in his ancestral village, internationally touring storyteller phillip low returns with more mystery, more musings, and of course more angst, in his first travelogue since the 2007 hit Descendant of Dragons (Minnesota Fringe Festival Encore winner).\n\n\"It's a mystery story that satisfies because it is about more than the nuts and bolts of solving a puzzle. It's a family story that doesn't shy away from the difficult moments, but also doesn't dissolve into sentimentality. It's a window into another culture, without being a dry sociology lesson. It's a globe-trotting journey that doesn't fall into \"look at these slides of my vacation\" territory. Amazingly, it's just one guy, standing on a stage, telling a compelling story, with very little in the way of theater tricks to back him up. Because he doesn't need them.\"\n-Matthew Everett, playwright (five star review)\n \nGuest artist Maximum Verbosity brings this one-person show to the Pointless stage for one night only.", "name": "Pissing on the Great Wall"}, {"source": "Facebook", "date": "2016-08-18T20:00:00-04:00", "url": "https://www.facebook.com/events/564009510445180/", "description": "Midwest Fest at the Blind Pig for the first time ever!\nDoors 8pm | 18+ | Tix $10 / $20 for all three days (limited availability)  Visit www.blindpigmusic.com for tickets\n\nTHURS 8/18\nThe Go Rounds - https://thegorounds.bandcamp.com/\nMinihorse - https://www.facebook.com/minihorseband/\nThe Antivillians - www.theantivillains.com\nSteven Leaf & the Ex Pats - https://www.facebook.com/steveleafandtheexpats/\nMichigander - https://www.facebook.com/michiganderband\n\nFRI 8/19\nThe Soil & the Sun - www.thesoilandthesun.com/\nMike Adams At His Honest Weight - www.mikeadams.info/\nBig Sherb - https://www.facebook.com/bigsherb/\nBoudoir Noir - https://boudoirnoir.bandcamp.com/\nAncient Language - https://www.facebook.com/AncientLanguageMusic\n \nSAT 8/20\nGuilty Simpson - http://rapraprapraprap.com/\nMister - http://rapraprapraprap.com/\nRed Pill - https://www.facebook.com/redpillrap\nLast Gasp - https://www.facebook.com/LastGaspCollective/?fref=ts\nAlexander Lynch - https://soundcloud.com/alexanderlynch", "name": "Midwest Fest IX August 18-20 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-08-19T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-08-19T19:00:00-04:00", "url": "https://www.facebook.com/events/1003638856420336/", "description": "Are you a big know it all? Come see if you've got what it takes to win a $25 gift card in our Trivia Night! You can enjoy beer and wine in our cafe, too ;)", "name": "Trivia Night!"}, {"source": "Facebook", "date": "2016-08-19T20:00:00-04:00", "url": "https://www.facebook.com/events/564009510445180/", "description": "Midwest Fest at the Blind Pig for the first time ever!\nDoors 8pm | 18+ | Tix $10 / $20 for all three days (limited availability)  Visit www.blindpigmusic.com for tickets\n\nTHURS 8/18\nThe Go Rounds - https://thegorounds.bandcamp.com/\nMinihorse - https://www.facebook.com/minihorseband/\nThe Antivillians - www.theantivillains.com\nSteven Leaf & the Ex Pats - https://www.facebook.com/steveleafandtheexpats/\nMichigander - https://www.facebook.com/michiganderband\n\nFRI 8/19\nThe Soil & the Sun - www.thesoilandthesun.com/\nMike Adams At His Honest Weight - www.mikeadams.info/\nBig Sherb - https://www.facebook.com/bigsherb/\nBoudoir Noir - https://boudoirnoir.bandcamp.com/\nAncient Language - https://www.facebook.com/AncientLanguageMusic\n \nSAT 8/20\nGuilty Simpson - http://rapraprapraprap.com/\nMister - http://rapraprapraprap.com/\nRed Pill - https://www.facebook.com/redpillrap\nLast Gasp - https://www.facebook.com/LastGaspCollective/?fref=ts\nAlexander Lynch - https://soundcloud.com/alexanderlynch", "name": "Midwest Fest IX August 18-20 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-08-19T22:00:00-04:00", "url": "https://www.facebook.com/events/732695640204235/", "description": "8-Bit Above is back with another round of Chiptune !!!\n\nBoaconstructor (Seattle)\nTrap and Techno chiptune. get ready for some dirty beats! You know him, you love him, you miss him so don't miss him!\nhttps://soundcloud.com/boaconstructorbeats\n\nKite Splash (aka Barbeque)\nDance and Hip Hop chilled out Chiptune. Kite Splash will take you to another dimension! \nhttps://soundcloud.com/kitesplash\n\nDollfin\nDirty bass and trap chiptune for all your sea animal needs! What does that even mean? come find out!\nhttps://soundcloud.com/dollfinchiptune\n\nInfodrive\nTotal badass Infodrive returns to 8-bit above for some deep programming dance floor killers! Don't miss this one :3\nhttps://soundcloud.com/infodrive", "name": "8-Bit Above w/ Boaconstructor , Kite Splash , Dollfin , Infodrive"}, {"source": "Facebook", "date": "2016-08-20T09:00:00-04:00", "url": "https://www.facebook.com/events/2028242233962716/", "description": "This large park (almost 90 acres) is next to natural areas some owned by the County and the University of Michigan. The large area of natural habitat makes each part of it that much more valuable for conservation. Volunteers are needed to help remove invasive plant species that are invading the open woodlands and meadows here. Meet in the parking lot off Dixboro Road, north of Plymouth Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Marshall Nature Area Stewardship Workday"}, {"source": "Facebook", "date": "2016-08-20T10:00:00-04:00", "url": "https://www.facebook.com/events/1072810779472102/", "description": "You've come to your local theatre/brewery to see the premiere of \"Happy Hour,\" a brand new play, only to find that you've stepped right into a space-time anomaly. The actors are all missing and the oblivious bartender doesn't know he's caught in a time loop - but he'll still serve you drinks! You and your team have one hour to find clues and solve puzzles in order to repair the timeline and, more importantly, escape the room. \n\nAdventure Lab is a new business specializing in escape rooms and other live-action puzzle games. If you enjoy puzzles, fun, adventures, games, or improving your small group communication skills, then you won't want to miss this unique event at Pointless!\n\nSelect the time and date you would like to attend. Each time slot is limited to 3-6 people.\nAdventures are:\nSaturday, August 20 @ 10 am\nSaturday, August 20 @ 12 pm\nSaturday, August 20 @ 2 pm", "name": "Trappy Hour! A brand new escape room adventure"}, {"source": "Facebook", "date": "2016-08-21T20:00:00-04:00", "url": "https://www.facebook.com/events/564009510445180/", "description": "Midwest Fest at the Blind Pig for the first time ever!\nDoors 8pm | 18+ | Tix $10 / $20 for all three days (limited availability)  Visit www.blindpigmusic.com for tickets\n\nTHURS 8/18\nThe Go Rounds - https://thegorounds.bandcamp.com/\nMinihorse - https://www.facebook.com/minihorseband/\nThe Antivillians - www.theantivillains.com\nSteven Leaf & the Ex Pats - https://www.facebook.com/steveleafandtheexpats/\nMichigander - https://www.facebook.com/michiganderband\n\nFRI 8/19\nThe Soil & the Sun - www.thesoilandthesun.com/\nMike Adams At His Honest Weight - www.mikeadams.info/\nBig Sherb - https://www.facebook.com/bigsherb/\nBoudoir Noir - https://boudoirnoir.bandcamp.com/\nAncient Language - https://www.facebook.com/AncientLanguageMusic\n \nSAT 8/20\nGuilty Simpson - http://rapraprapraprap.com/\nMister - http://rapraprapraprap.com/\nRed Pill - https://www.facebook.com/redpillrap\nLast Gasp - https://www.facebook.com/LastGaspCollective/?fref=ts\nAlexander Lynch - https://soundcloud.com/alexanderlynch", "name": "Midwest Fest IX August 18-20 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-08-24T18:30:00-04:00", "url": "https://www.facebook.com/events/1060068290701625/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by The New York Times, this world famous high-wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high-wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with a grand flourish, be awestruck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets must be purchased in advance, the circus tent is wheelchair accessible and capacity is limited.\n\n$20 Kids & $30 Adult - General Admission\nParking at the Burns Park Elementary School\n\nSponsored by: Toyota USA\nPresented in part with support from: National Endowment for the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nAugust 24 @ 6:30 pm, Burns Park \nAugust 25 @ 6:30 pm, Burns Park\nAugust 26 @ 6:30 pm, Burns Park \nAugust 27 @ 6:30 pm, Burns Park \nAugust 28 @ 6:30 pm, Burns Park\n\nWatch the videos:\nThe Show: https://youtu.be/TB0Oyl1gSNk\n\nHighwire Stunts: https://www.youtube.com/watch?v=rqCzjvM3_Sc\n\nOn a Treadmill: https://www.youtube.com/watch?v=oxrqksjrMf0", "name": "One-Man Circus (L’homme Cirque)"}, {"source": "Facebook", "date": "2016-08-25T12:00:00-04:00", "url": "https://www.facebook.com/events/1107421282648487/", "description": "Bank of Ann Arbor is excited to announce that Michigan born rocker, Mitch Ryder will close out the 9th consecutive year for Sonic Lunch. Ryder, a music legend with hits like Sock It To Me Baby and Devil with a Blue Dress On will take the stage at noon on August 25th in Liberty Plaza.\nDue to unforseen circumstances, Serena Ryder is not able to perform, as previously announced.\n“Mitch Ryder is the legendary link between classic Motown R&B and hard rocking Detroit-area bands like the MC5 and the Stooges. The Hamtramck native has recorded over two dozen albums in a career that stretches back to the mid-60s, and he still captivates audiences with his fiery vocals and commanding stage presence. He was in fine form the last time he performed at Sonic Lunch, so expect another great set of timeless hits when Mitch Ryder closes out the 9th season of Sonic Lunch on Thursday, August 25th” Martin Bandyke, ann arbor's 107one\n“Good fortune smiled upon Ann Arbor this week when we learned that Mitch was going to play Sonic Lunch for us again. His pervious Sonic Lunch performance left us dancing in the streets and singing his classic songs throughout his entire show,” said Tim Marshall, President and CEO of Bank of Ann Arbor. “When we learned that his schedule opened up, we jumped on it.”\n\n2016 Lineup \n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Mitch Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "name": "Mitch Ryder & The Detroit Wheels / August 25th Sonic Lunch / Noon Free"}, {"source": "Facebook", "date": "2016-08-25T18:30:00-04:00", "url": "https://www.facebook.com/events/217304028639529/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by The New York Times, this world famous high-wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high-wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with a grand flourish, be awestruck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets must be purchased in advance, the circus tent is wheelchair accessible and capacity is limited.\n\n$20 Kids & $30 Adult - General Admission\nParking at the Burns Park Elementary School\n\nSponsored by: Toyota USA\nPresented in part with support from: National Endowment for the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nAugust 24 @ 6:30 pm, Burns Park \nAugust 25 @ 6:30 pm, Burns Park\nAugust 26 @ 6:30 pm, Burns Park \nAugust 27 @ 6:30 pm, Burns Park \nAugust 28 @ 6:30 pm, Burns Park\n\nWatch the videos:\nThe Show: https://youtu.be/TB0Oyl1gSNk\n\nHighwire Stunts: https://www.youtube.com/watch?v=rqCzjvM3_Sc\n\nOn a Treadmill: https://www.youtube.com/watch?v=oxrqksjrMf0", "name": "One-Man Circus (L’homme Cirque)"}, {"source": "Facebook", "date": "2016-08-26T18:30:00-04:00", "url": "https://www.facebook.com/events/1705218533059185/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by The New York Times, this world famous high-wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high-wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with a grand flourish, be awestruck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets must be purchased in advance, the circus tent is wheelchair accessible and capacity is limited.\n\n$20 Kids & $30 Adult - General Admission\nParking at the Burns Park Elementary School\n\nSponsored by: Toyota USA\nPresented in part with support from: National Endowment for the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nAugust 24 @ 6:30 pm, Burns Park \nAugust 25 @ 6:30 pm, Burns Park\nAugust 26 @ 6:30 pm, Burns Park \nAugust 27 @ 6:30 pm, Burns Park \nAugust 28 @ 6:30 pm, Burns Park\n\nWatch the videos:\nThe Show: https://youtu.be/TB0Oyl1gSNk\n\nHighwire Stunts: https://www.youtube.com/watch?v=rqCzjvM3_Sc\n\nOn a Treadmill: https://www.youtube.com/watch?v=oxrqksjrMf0", "name": "One-Man Circus (L’homme Cirque)"}, {"source": "Facebook", "date": "2016-08-27T09:00:00-04:00", "url": "https://www.facebook.com/events/1128116093920058/", "description": "This riverside park has open old field habitat that that is used by American woodcock, field sparrows, and other breeding birds. Help pull invasive species in these open grasslands, creating  more space for native grasses and wildflowers. Meet at the Barton Dam parking lot on Huron River Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Barton Nature Area Stewardship Workday"}, {"source": "Facebook", "date": "2016-08-27T16:00:00-04:00", "url": "https://www.facebook.com/events/1342236555804958/", "description": "Join us for our Tigers bus trip on Saturday, August 27th! Meet at the brewery at 4 pm. The bus leaves at 4:30 and goes directly to the Detroit Beer Co for brews and food, and then we walk to the game from there! Game begins at 7:10 pm and is followed immediately after by fireworks! The bus will pick us up at a designated spot outside the stadium right after the fireworks. \n\nEach $70 ticket includes round-trip transportation, a ticket to the game, and beers on the bus!", "name": "Tigers Bus Trip"}, {"source": "Facebook", "date": "2016-08-27T18:30:00-04:00", "url": "https://www.facebook.com/events/467970253401536/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by The New York Times, this world famous high-wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high-wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with a grand flourish, be awestruck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets must be purchased in advance, the circus tent is wheelchair accessible and capacity is limited.\n\n$20 Kids & $30 Adult - General Admission\nParking at the Burns Park Elementary School\n\nSponsored by: Toyota USA\nPresented in part with support from: National Endowment for the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nAugust 24 @ 6:30 pm, Burns Park \nAugust 25 @ 6:30 pm, Burns Park\nAugust 26 @ 6:30 pm, Burns Park \nAugust 27 @ 6:30 pm, Burns Park \nAugust 28 @ 6:30 pm, Burns Park\n\nWatch the videos:\nThe Show: https://youtu.be/TB0Oyl1gSNk\n\nHighwire Stunts: https://www.youtube.com/watch?v=rqCzjvM3_Sc\n\nOn a Treadmill: https://www.youtube.com/watch?v=oxrqksjrMf0", "name": "One-Man Circus (L’homme Cirque)"}, {"source": "Facebook", "date": "2016-08-28T18:30:00-04:00", "url": "https://www.facebook.com/events/1556374641333780/", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by The New York Times, this world famous high-wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high-wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with a grand flourish, be awestruck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets must be purchased in advance, the circus tent is wheelchair accessible and capacity is limited.\n\n$20 Kids & $30 Adult - General Admission\nParking at the Burns Park Elementary School\n\nSponsored by: Toyota USA\nPresented in part with support from: National Endowment for the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nAugust 24 @ 6:30 pm, Burns Park \nAugust 25 @ 6:30 pm, Burns Park\nAugust 26 @ 6:30 pm, Burns Park \nAugust 27 @ 6:30 pm, Burns Park \nAugust 28 @ 6:30 pm, Burns Park\n\nWatch the videos:\nThe Show: https://youtu.be/TB0Oyl1gSNk\n\nHighwire Stunts: https://www.youtube.com/watch?v=rqCzjvM3_Sc\n\nOn a Treadmill: https://www.youtube.com/watch?v=oxrqksjrMf0", "name": "One-Man Circus (L’homme Cirque)"}, {"source": "Facebook", "date": "2016-08-28T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-09-07T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-09-09T16:30:00-04:00", "url": "https://www.facebook.com/events/631172927032422/", "description": "The second Great Lakes Herb Faire will be happening this September 9-11th, 2016 in Chelsea, MI. Register now for an herbal educational extravaganza! We will offer dozens of classes on Herbal Medicine from well seasoned herbalists such as Matt Wood, Jim McDonald, Dr. Jody Noe, Lisa Rose and many more! Some class titles include \"Wisdom of Nature: What we Gain as Herbalists in Service of Nature\", \"Medical Herbal Strategies for Integrative Cancer Therapies\", \"Blessed Bitters\" and \"Introduction to West African Herbalism\". There will be kids classes such as\"Let’s Meddle with Nettles!\" and \"Wisdom of the Elders\".  There will be delicious and nutritious food available for those who sign up and music, entertainment and additional classes in the evenings for all. The Tree of Life Drummers and Dancers will get the Faire going at opening ceremony and Saturday night \"Eyes Unclouded\", an amazing local band will play. We will also have an open mic of sorts on Friday evening so bring your talents!\n\nDon't miss out on this amazing an unique opportunity! There will be much to be learned by both beginning and experienced herbalists, many connections will be made with other regional herbalists as well as with the beautiful lands of the Waterloo Recreation area.\n\nPlease see our website for more details!\nhttp://www.greatlakesherbfaire.org\n\nSee you at the Faire!\n-The Great Lakes Herb Faire organizers", "name": "The Second Great Lakes Herb Faire"}, {"source": "Facebook", "date": "2016-09-09T20:00:00-04:00", "url": "https://www.facebook.com/events/1675656812706888/", "description": "There are songs that transport you to good times remembered. Songs like, “I’d Really Love To See You Tonight,” “Nights Are Forever Without You,” and, “Love Is The Answer” have that effect on many of us. These songs and numerous others have made John Ford Coley a singing legend.\nJohn is most revered as half of the duo England Dan and John Ford Coley. The classically-trained pianist and talented guitarist continues performing the gold and platinum record hits for audiences around the world. Some of Coley’s other hits are, “Gone Too Far,” “We’ll Never Have To Say Goodbye Again,” and, “Sad To Belong.\"\nJohn’s experiences comprise a broad background. Although he performed throughout high school and college as a classical and rock pianist, he chose to major in English Literature in college, and is an avid student of history. In the mid-1980’s, John began acting in television and in feature films. He recently penned a book, \"Backstage Pass,\" about his years in the music industry.\nwww.johnfordcoley.com", "name": "John Ford Coley at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-09-13T19:00:00-04:00", "url": "https://www.facebook.com/events/249910972068199/", "description": "When the Roadhouse opened in 2003 Chef Alex had a vision for hosting monthly dinners featuring specific regions, cuisines, chefs and authors that brought together our community to enjoy a great meal and hear great stories. Thirteen years later we are honored and humbled to be celebrating Special Dinner #200. It is fitting this dinner falls in the peak of the harvest season and is just 2 days before our anniversary of opening our doors.\n\nTo celebrate we have invited back to the Roadhouse award-winning cookbook author Amelia Saltsman. Author of The Santa Monica Farmers' Market Cookbook and the newly released The Seasonal Jewish Kitchen, Amelia's passion for making the connection between seasonal, small-farmed foods and real-life meals makes her the perfect guest speaker and collaborator on the menu with Chef Alex.\n\nPlated Amuse:\nGreen Melon and Green Tomato Gazpacho\nSmoked Salt Blanched Soy Beans\nShelly Pea Hummus with Za’atar\n\nBread:\nFresh Grilled Pita and Zingerman’s Bakehouse Tomato Bread\n\nFeaturing:\nCornman Farms’ Heirloom Tomato Bar\nWith handmade mozzarella, really good olive oil, basil, salt and pepper\n\nDinner Buffet:\nGolden Bari Dates with Blueberries and Wheat Berries\nIsraeli Salad with Five Tomatoes\nKohlrabi and Carrot Slaw\nPickled Green Tomato with Halvah and French Feta\nRomanian Ratatouille (Gvetch) with Eggs\nLamb Kabobs with Tahini and Smokey Harissa\nMatboucha (Moroccan Tomato Sauce) with Fresh Red Peas\nGrape Leaf-Wrapped Sardines with Tomato and Roasted Lemon\nSpatchcock of Cornish Hen with Green Garlic Jus\nBeef and Rice stuffed Patty Pan Squash\n\nDessert:\nTahini Gelato Sundae Bar with Silan Syrup and Fresh Berries\nBlood Orange and Olive Oil Polenta Upside Down Cake\nPoppy Seed Hamantaschen", "name": "The Tomato Dinner featuring author Amelia Saltsman"}, {"source": "Facebook", "date": "2016-09-13T20:00:00-04:00", "url": "https://www.facebook.com/events/1002229809876123/", "description": "Tue. September 13 | 8pm | 18+ | $15 adv./ $18 day of\n\nBasement with: eskimeaux & Ovlov\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/735", "name": "Basement w/ Eskimeaux & Ovlov 9/13/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-09-14T09:00:00-04:00", "url": "https://www.facebook.com/events/622227574608143/", "description": "Wed. September 14 | 9pm | 18+ | $15 adv./ $18 day of\n\nChrome Sparks wsg: Roland Tings\n\nChrome Sparks is the solo project of Jeremy Malvin, a Brooklyn transplant from Pittsburgh by way of Ann Arbor. In 2014, after having self released a small handful of singles and two EPs on Bandcamp, Malvin signed to the taste making Sydney based label Future Classic. Under the new label, he rereleased Sparks EP and released the Goddess EP. His next EP, Parallelism is slated to be released with Future Classic on November 6.\n\nInspired by a background in classical percussion and an obsession with synthesizers, Malvin creates dazed, melodic beat-centric tunes that loosely hang between down-tempo head nodders and up-tempo club bangers. FADER has described his music as ‘form-shifting beats [that] seem to resonate with spaced-out chillers and hyperactive party kids alike’.\n\nIn 2012, while on Warped Tour as the drummer for Stepdad, Malvin released the slow burning, bass heavy single “Marijuana” on a Bandcamp compilation highlighting music from he and his friends in Ann Arbor. It quickly rocketed to #1 on Hype Machine and has since become an internet-stoner anthem. It has subsequently been rereleased by Future Classic and Kitsuné.", "name": "Chrome Sparks wsg Roland Tings 9/14/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-09-15T19:30:00-04:00", "url": "https://www.facebook.com/events/1813498772197691/", "description": "Have you ever pondered the idea that Dr. Seuss Green Eggs and Ham might be racially charged? Is it possible to skip and listen to hip hop at the same time? Do black people actually carry around race cards? Well, maybe its time to take a closer look. Mark Kendall uses a series of comedic sketches to examine the representation of black males in the media in his critically acclaimed one-man show.  From prison to white flight, and even Reading Rainbow  well explore some of the ways these images influence our views on race in everyday life. There will also be cookies.\n\nMark first got into comedy while studying film at Northwestern University. He had a chance to work at Comedy Central through the Chris Rock Summer School Program for up and coming comedy writers of color. During his time at Comedy Central, he got to pitch jokes to the writing staffs of \"The Daily Show\" and \"The Colbert Report.\" Mark performs comedy in Atlanta at Dad's Garage Theatre Company and Highwire Comedy. He also teaches improv and sketch writing. He is currently touring with his one man show \"The Magic Negro and Other Blackness\" a sketch show that examines the depiction of black men in the media. For his work with the show, he was recently awarded \"Best Professional Funny Man\" by Creative Loafing Atlanta.", "name": "The Magic Negro and Other Blackness"}, {"source": "Facebook", "date": "2016-09-15T21:00:00-04:00", "url": "https://www.facebook.com/events/1186311131413949/", "description": "Thursday, September 15 | 9pm | 18+ | $15 Cover\n\nGold Panda wsg: Open Mike Eagle\n\nThe story of Gold Panda’s journey from an acclaimed debut record to now, as he prepares to release his third full length album, is an entirely circular one. Hailing from Chelmsford Essex in the UK, in the six years since the release of his genre-defining debut album ‘Lucky Shiner’, the electronic artist most comfortable with the moniker Derwin Panda spent the subsequent years splitting the majority of his time between London, Berlin and countless excursions to Japan. As he created his third album ‘’Good Luck And Do Your Best’ he ultimately found himself back where he began, in the East of England.\n\nOrigin stories can be fundamentally boring by nature, packed with non-essential details and overly stressed homilies to roots and influences. But the core nature of an artist that has produced some of the most beloved and emotionally-infused electronic music of this decade is deeply rooted in the constant desire to return to where his musical world began.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/710", "name": "Gold Panda w/ Open Mike Eagle 9/15/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-09-16T20:00:00-04:00", "url": "https://www.facebook.com/events/1653085994944878/", "description": "At Woodstock, as a New York kid barely known outside the coffeehouse circuit in Greenwich Village, she sang her song, \"Beautiful People\" and inspired the first panorama of candles and cigarette lighters ever raised at a concert event. That, in turn, moved the young singer to write \"Lay Down (Candles in the Rain\"), which sold more than one million copies in 1970 and prompted Billboard, Cashbox, Melody Maker, Record World, and Bravo to anoint her as female vocalist of the year. Her single, \"Brand New Key,\" topped the charts in 1971.\nWith guitar in hand and a combination of amazing vocal talent, disarming humor, and a vibrant engagement with life, she was booked as the first solo pop/rock artist ever to appear at the Royal Albert Hall, Carnegie Hall, and the Metropolitan Opera House, and later opened the New Metropolitan Opera House in New York, the Sydney Opera House, and in the General Assembly of the United Nations, where she was invited to perform on many occasions as delegates greeted her performances with standing ovations.\nThe top television hosts of all time -- Ed Sullivan, Johnny Carson, and Dick Cavett -- battled to book her.\nUNICEF made her its spokesperson; Jimi Hendrix's father introduced her to the multitude assembled for the twentieth anniversary of Woodstock. Her records continued to sell -- more than eighty million to date. She's had her songs covered by singers as diverse as Cher, Dolly Parton, and Macy Gray. She's raised a family, won an Emmy, opened a restaurant, and written a musical about Wild Bill Hickok and Calamity Jane.\nThis is a rare opportunity to experience Melanie live and in person in an intimate venue. Don't miss it!\nwww.melaniesafka.com", "name": "Melanie at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-09-17T12:00:00-04:00", "url": "https://www.facebook.com/events/1146816402007835/", "description": "Always wanted to learn how to take a funny idea and mold it into a comedy sketch? Always enjoyed writing but wanted to give comedy a try? Well check out, INTRODUCTION TO SKETCH WRITING with Mark Kendall, an introduction to the basics of writing sketch comedy. Using in class writing exercises and video clips, students will come away with a basic understanding of sketch structure and brainstorming techniques. \nCost: $30\n\nABOUT MARK KENDALL\nMark first got into comedy while studying film at Northwestern University. He had a chance to work at Comedy Central through the Chris Rock Summer School Program for up and coming comedy writers of color. During his time at Comedy Central, he got to pitch jokes to the writing staffs of \"The Daily Show\" and \"The Colbert Report.\" Mark performs comedy in Atlanta at Dad's Garage Theatre Company and Highwire Comedy. He also teaches improv and sketch writing. He is currently touring with his one man show \"The Magic Negro and Other Blackness\" a sketch show that examines the depiction of black men in the media. For his work with the show, he was recently awarded \"Best Professional Funny Man\" by Creative Loafing Atlanta.", "name": "Intro to Sketch Writing Workshop"}, {"source": "Facebook", "date": "2016-09-18T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-09-20T21:00:00-04:00", "url": "https://www.facebook.com/events/1033650563369677/", "description": ">>TICKETS: http://samfeldtnectonightclub.eventbrite.com/?aff=FBE\n\nPrime Social Group presents...\n\nBAKERMAT x SAM FELDT\n=============================\nNECTO NIGHTCLUB\n=============================\nTuesday, September 20 // 9:00 PM doors // 18+\n=============================\n\n>>TICKETS ON SALE: http://samfeldtnectonightclub.eventbrite.com/?aff=FBE\n\n>>>MUSIC: \nhttps://soundcloud.com/bakermatmusic/\nhttps://soundcloud.com/samfeldt\n\nWho is Bakermat?\n\nIt all started in 2012 when 20 year old Lodewijk Fluttert took a semester off of hisstudy Psychology to discover different sides of himself. For two months he danced, filmed, made music, did standup comedy, wrote and much more, untill he found out what he loved doing most: making music. He uploaded a couple of tracks on Youtube and Soundcloud, and Bakermat was born. Since then he stepped in a rollercoaster ride he could have never imagined. First official single ‘Vandaag (One Day)’ became a huge hit all over Europe hitting top 10 spots in almost every country. The early succes got rewarded with platinum records in France, Germany, The Netherlands and Belgium. The succes was largely attributed to the fact that he came with an entirely different and new sound, combining minimal and deep house with jazz and soul. It laid a foundation for the genres we now know as ‘tropical house’ or ‘melodic house’, in which he is still seen as the founder and pioneer. He keeps trying to bring new and refreshing music out, always trying to be as unique and renewing as possible. A huge succes was his record released in 2015 “Teach Me” where he mixedSoul, Gospel and Disco to a record that set a new standard in the ‘melodic house’ genre. \n\nBakermat also became well know because of his innovative performances and stage hostings. He did shows in Paris, London and other big cities with an entire band called ‘The Bakermat Live Band’. In Paris he even played in the legendary L’Olympia with his band, a sold out show. He played at almost every big festival there is over the last 3 years like I Love Techno, Ultra Miami, Sensation White, Mainsquare, Montreux Jazz Festival, Tomorrowland, Mysteryland, South West Four and the list goes on and on. He is also the host of stages at the biggest festivals like the ‘Bakermat & Friends’ stage at Tomorrowland every year, or the “Bakermat’s Gospel Church’ at Kingsday Festival and a lot more. As one of the founders his goal is to bring new talent or fellow colleagues to the stage and that's exactly what he does when he's curating a stage. Artists like Klingande, Thomas Jack, The Avener, Robin Schulz and Oliver Heldens are often guests at one of his stages. Bakermat’s new album ‘Bon Voyage’ is his first studio album and will be released in 2015, it contains a lot of new material and new styles/ production techniques, because according to Bakermat this was an opportunity for him to “ really be free of restrictions and make exactly what I want”. With his album, remixes, releases and confirmed shows at the biggest festivals lined up, it seems 2016 will be a great year for Bakermat once again.\n\n\nWho is Sam Feldt?\n\nDeemed a \"Modern House superstar\" by Billboard, Sam Feldt broke onto the scene in 2013 with remixes including \"On Trees and Birds and Fire\" from I Am Oak. In 2015, he released a remake of \"Show Me Love\" from Robin S. which charted highly across the world. \n\nThe Dutch DJ, born August 1, 1993, is currently signed to Spinnin' Records and most recently released \"Summer On You\", a melodic and deep tropical track with Lucas & Steve featuring Wulf.\n\nwww.PrimeSocial.com\n===============================\nGET INVOLVED: Want to get involved with PSG? Join the team by visiting http://primesocial.com/get-involved/\n===============================", "name": "Bakermat x Sam Feldt ll Necto ll 9.20.16"}, {"source": "Facebook", "date": "2016-09-22T21:00:00-04:00", "url": "https://www.facebook.com/events/1743733792544393/", "description": "Thursday September 22nd\nreact presents\n\n:: Matoma ::\n\nWith Special Guests\n\nCheat Codes\n\nPlus\nSteve Void & Baynk\n\nDoors at 9:00pm\n18+ Welcome\n\nNecto\n516 E. Liberty\nAnn Arbor, MI\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet", "name": "Matoma at Necto: Thursday, Sept. 22nd"}, {"source": "Facebook", "date": "2016-09-24T21:00:00-04:00", "url": "https://www.facebook.com/events/992824104100196/", "description": "Sat. September 24 | 9pm | 18+ | $15 Cover\n\nThe Slackers are self styled masters of Reggae, Ska and Rock’n’Roll from New York City. The Slackers began in 1991 in NYC. After years of local gigs and rehearsing in a dingy basement in Manhattan’s lower east side, the band released its debut album, Better Late Than Never, in 1996. The band’s success resulted in the release of a second album, Red Light, on the Epitaph label in 1997. Since then the Slackers have released 11 more studio albums (The Question, Wasted Days, Slackers & Friends, Close My Eyes, Slackers in Dub, Peculiar, Boss Harmony Sessions, Self Medication, Lost and Found, The Great Rocksteady Swindle, and The Slackers [self-titled, 2016] ) 3 live albums (Live at Ernestos, Upsettin Ernestos, Slack in Japan), several EPs (International War Crimminal, My Bed is a Boat), and numerous singles and compilation tracks. Since 1997 the Slackers have played over 100 shows every year in a total of 46 american states, 7 Canadian provinces, 22 European countries, 5 Latin American countries, and 2 Asian countries. The band’s musical style is distinct from their contempories; a mix of early Jamaican music with classic 50’s and 60s American styles. There are influences from 50s and 60s Rock’n’Roll, Rythmn and Blues, Jazz and Latin music. Singer Vic Ruggiero has coined the term ‘Jamaican Rock’nRoll.’ to describe it. He says, “The band might play a classic Jamaican style but the vocals are distinctly American east coast, revealing the obvious connection of Jamaican music to the Doo-Wop of Harlem and the Bronx.” With the demise of record companies over the last 5 years, the Slackers have successfully used crowdfunding (www.bigtun.es/theslackers.) to release new music including the latest release, The Slackers [self-titled] in February 2016.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/671", "name": "The Slackers 9/24/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-09-25T21:00:00-04:00", "url": "https://www.facebook.com/events/832214916910877/", "description": "Sunday, September 29 | 9pm | 18+ | $17 adv./ $20 day of\nSongbook: A Night Of Stories & Songs with:\nBlitzen Trapper and special guest Kacy & Clayton\n\nOver the course of 15 years and seven full-length albums, Blitzen Trapper has crafted one of the more compelling and varied catalogs in contemporary rock and roll. Indeed, singer and guitarist Eric Earley, who is also the Portland, Oregon-based band's primary songwriter, is possessed of a musical and lyrical sensibility that is remarkably deep and wide; big ideas and universal emotions are wrung from the seemingly plainspoken details of small-screen and often highly personal stories, and set to music that reaches way, way back to old-timey folk and bluegrass, travels through everything from country, psychedelia and soul to prog, garage and metal, indulges gloriously in the classic rock of the 70s and 80s, and makes occasional side trips into hip-hop, skewed pop and noisey freakouts.", "name": "Songbook: A Night Of Stories & Songs with Blitezen Trapper 9/25/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-09-27T20:00:00-04:00", "url": "https://www.facebook.com/events/1190479254318296/", "description": "Tue. September 27 | 8pm | 18+ | $15 adv./ $17 day of\n\nann arbor's 107one presents: Anderson East\n\nAnderson East learned to sing and play guitar at 11 years old. He is the grandson of a southern Baptist preacher, while his mother played piano in the church. After spending much of his time touring and engineering records, he was discovered by Dave Cobb at Nashville's Bluebird Café.\n\nHis debut album on Low Country Sound / Elektra, entitled 'Delilah,' was released on July 10th, 2015. Before the release East started touring nationally in January 2015 as direct support for Sturgill Simpson. In addition to his own sold-out headline shows, he has toured with Brandi Carlile, The Lone Bellow, Jason Isbell, and John Butler Trio. \"Satisfy Me\" was the first single released off the record. It instantly went top 10 viral on Spotify and received regular radio airplay. NPR music called 'Delilah' an \"eclectic, fully formed debut album.\" Daytrotter wrote, \"It's one of those 10-song records that's damned near perfect, traveling through the old, smoky bars of older days and down the twisted back roads of love.\" On July 15th, 2015 East made his television debut on \"Late Night with Seth Meyers,\" and also appeared on \"CBS This Morning Saturday\" in support of his album.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/724", "name": "Anderson East - Devil in Me Tour 9/27/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-09-28T14:00:00-04:00", "url": "https://www.facebook.com/events/1731098520471774/", "description": "We're bringing the Painting With Dreams tour to Necto Nightclub in Ann Arbor!\n\nNew album, a brand new stage production, and most important, all of our Tritonians of Michigan under one roof!!!!\n\nMore info and tickets - http://paintingwithdreams.com/\n\nSee you this fall!", "name": "Tritonal: Painting With Dreams - Ann Arbor"}, {"source": "Facebook", "date": "2016-09-29T20:00:00-04:00", "url": "https://www.facebook.com/events/1732017927009808/", "description": "New music: \"Let's Hear It for the Dogs\"!", "name": "The Proclaimers w/sg Jenny O."}, {"source": "Facebook", "date": "2016-09-30T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-09-30T20:00:00-04:00", "url": "https://www.facebook.com/events/1059176397508510/", "description": "Two (nonconsecutive) nights—September 28 & 30", "name": "Marc Cohn"}, {"source": "Facebook", "date": "2016-09-30T20:00:00-04:00", "url": "https://www.facebook.com/events/517141991807074/", "description": "Jeremy Horn grew up in Memphis -- \"Home of the Blues\" and \"Birthplace of Rock and Roll\" -- but his music sounds more like the Beatles than B.B. King or Elvis.  He writes songs for the church and songs for the radio, yet his songs are more complex than either has traditionally allowed.  He lives in a city that is known as much for its racial unrest and inner-city violence as it is for being the place Elvis called home, yet he leads worship at one of the largest multicultural churches in the South, where half the congregation is African-American. When you meet Jeremy, he looks and sounds just like the \"guy next door\" -- if the guy next door has a traditional southern drawl.  Making music has preoccupied  Jeremy Horn ever since he received his first guitar at age fifteen. Growing up on the sounds of James Taylor and the Beatles, Jeremy spent most of his early years emulating the sounds and songwriting styles of the popular culture. \"I used to write songs about social injustices in the world,\" says Horn. After a few years and conversations with a wise, older friend, Jeremy realized he could also write songs that aspired to give people hope, and not just write what everybody else was writing. Says Horn, \"That progressed into writing songs for Jesus, and that was the process that unexpectedly led me to become a worship leader.\" That progression started Jeremy Horn on the path of continued discovery --listening to artists both Christian and not -- to figure out how to express feelings and concepts that came from within, rather than from the evening news.  Jeremy's music is a fixture on Michigan's 17 Smile-FM Contemporary Christian music stations; his \"I Will See Angels 'Round Your Throne\" and \"First Love\" are two of his popular hits. Jeremy's new CD is Sound of the Broken. This is a rare opportunity to see Jeremy Horn in a small venue setting. Bring a friend!\nwww.jeremyhornmusic.com", "name": "Jeremy Horn at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-09-30T21:00:00-04:00", "url": "https://www.facebook.com/events/1807171166184117/", "description": "Fri. September 30 | 9pm | 18+ | $10 adv./ $12 day of\n\nFuzz Fest Showcase feat: Goblin Cock, Super Thing & The Highborn\n\n\"SO STUPID!!!\" bemoans Lord Phallus as he gazes pensively from the curtain wall of his modest stronghold.\n\n\"They don't know what they have, nor understand what they can do for one another or how short a time they have to do it in.\"\n\nHead in hands, the lead singer, guitar-player, and sole songwriter of histories most beloved Comic-Book Metal band knows what must be done.\n\n\"I must make a gesture\", he says.\n\n\"A frivolous gesture, perhaps, but a dear one nonetheless\"\n\nUpon snapping his bony fingers, an immense stone murphy bed plummets from a nearby rock wall, immiting all manner of bats, cobwebs, and forgotten paraphernalia until, coughing and wheezing, the auxiliary members of Goblin Cock appear one by one, shaken and disturbed, yet hungry for battle.\n\n\"It's the Humans again!\" Phallus intones, \"they've made it so increasing hard to for themselves to breathe their own air, eat their own food, love the ones they truly love, or generally have a full life without destroying the lives of innocents!\"\n\n\"But why, oh Lord?\" speak his bandmates in chilling unison, \"Why must they all live in such obvious denial?\"\n\n\"Beats me!\", Phallus ponders hesitantly, \"but instead of risking you all falling back to sleep through boorish philosophizing, lets put out a new record and get back on the road where we belong before they finish turning this lovely blue sphere into a burned out garbage planet!\"\n\n\"Hooray for that!\" cheer his hyper-enthusiastic bandmates.\n\nSo, Phallus went to work on his most concise album to date, invoking the spirit of Pure Fun while appeasing his love of Doomed Art.\n\nIt is a crushingly brutal Dear John letter to society.\n\nIt is a rock falling from space that knocks you unconscious that you, in turn, shove in your pajama pocket for safe keeping upon awakening.\n\nThese are songs about True Love.\n\nThese are songs about Revolution.\n\nThese are songs about 70's Children's Television.\n\nGoblin Cock have delivered an auditory tome of such importance that it needs to be experienced before the Secret Bastards find a way to marginalize it out of existence forever.\n\nNECRONOMIDONKEYKONGIMICON.\n\nIt is their gift to us.\n\nDon't squander it.", "name": "Goblin Cock w/ Super Thing & The Highborn 9/30/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-10-01T20:00:00-04:00", "url": "https://www.facebook.com/events/1679614935644801/", "description": "New music from an OUT magazine OUT100 featured music honoree", "name": "Melissa Ferrick"}, {"source": "Facebook", "date": "2016-10-03T20:00:00-04:00", "url": "https://www.facebook.com/events/278911615804461/", "name": "An Acoustic Evening with John Hiatt—SOLD OUT"}, {"source": "Facebook", "date": "2016-10-07T20:00:00-04:00", "url": "https://www.facebook.com/events/964923176923370/", "description": "Lou and Peter Berryman were both raised in Appleton, WI, and began playing music together in high school during the sixties. During the following nomadic decade, Lou studied classical voice and music theory in college while Peter continued an unfocused fascination with surrealist art, beatnik poetry, and jug band music. Early influences of American and British musical comedy and folk music fed a growing repertoire of original songs. A brief marriage in the early seventies resolved into a lifelong friendship, and by the late seventies and early eighties the two were honing their skills playing regular weekly concerts in Madison, becoming full-time musicians and songwriters in 1979. During those early years they wrote new songs every week, many about the history, cheese, beer and strange politics of their home state. By the mid '80s they were traveling all across the country, still writing and singing, but now with a broader perspective, finding that the quirks of their home state were not so much Midwestern as human. In twenty-five years of performing together, Lou and Peter have released twenty albums and four songbooks worth of hilarious, quirky, yet oddly profound songs, rich with word play and interesting images. Pete Seeger, Tom Paxton and Tom Lehrer count themselves among their fans. Their work has appeared in numerous compilations such as the popular \"Rise Up Singing\" songbook, in periodicals like \"SING OUT! Magazine\", and in many audio compilations. Berryman songs are being sung around the world by a legion of professional musicians including Peter, Paul and Mary, Garrison Keillor and Peggy Seeger. They have appeared numerous times on such national programs as NPR's \"A Prairie Home Companion\" and \"Weekend Edition.\"\nwww.louandpeter.com", "name": "Lou and Peter Berryman at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-10-11T20:00:00-04:00", "url": "https://www.facebook.com/events/1217154154983075/", "description": "New music!", "name": "Liz Longley—\"Weightless Tour\""}, {"source": "Facebook", "date": "2016-10-11T20:00:00-04:00", "url": "https://www.facebook.com/events/603317689846712/", "description": "Tue. October 11 | 8pm | 18+ | $15 Cover\n\nann arbor's 107one presents: The Record Company\n\nL.A.-based buzz band The Record Company has signed with Concord Music Group, which released its debut album Give It Back to You on February 12, 2016.", "name": "The Record Company 10/11/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-10-12T20:00:00-04:00", "url": "https://www.facebook.com/events/1716825161907547/", "description": "A spicy roots cocktail from Venice, CA.", "name": "The Dustbowl Revival"}, {"source": "Facebook", "date": "2016-10-13T19:00:00-04:00", "url": "https://www.facebook.com/events/986732351446617/", "description": "Join us for the musical comedy based on the 1980 cult classic film of the same name. It tells the tale of a Greek Muse’s descent from Mt. Olympus to Venice Beach, California, to inspire a struggling artist to achieve the greatest artistic creation of all time – the world’s first roller disco. And yes, there will be roller skating in West Park! The show runs July 14, 15, 16, 21, 22, 23, 28, 29, and 30. Curtain at 7pm each night. Tickets are just $10 for adults, $7 for kids 12 and under. For tickets and more information please visit us at www.pennyseats.org", "name": "Xanadu"}, {"source": "Facebook", "date": "2016-10-13T20:00:00-04:00", "url": "https://www.facebook.com/events/2588083667997550/", "description": "Saline High School's nationally recognized fiddle ensemble", "name": "The Saline Fiddlers Philharmonic"}, {"source": "Facebook", "date": "2016-10-14T20:00:00-04:00", "url": "https://www.facebook.com/events/1746959058909209/", "description": "Freshmen no more!", "name": "The Verve Pipe"}, {"source": "Facebook", "date": "2016-10-14T20:00:00-04:00", "url": "https://www.facebook.com/events/197527007266742/", "description": "lauriemcclain.com", "name": "Laurie McLain at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-10-15T20:00:00-04:00", "url": "https://www.facebook.com/events/863150040487648/", "description": "w/sg Frances Luke Accord", "name": "Darlingside—Night 1"}, {"source": "Facebook", "date": "2016-10-16T11:00:00-04:00", "url": "https://www.facebook.com/events/896942743751358/", "description": "We're teaming up with a few of our friends again this fall for a casual ride on the border to border trail (or as we like to call it - the brewery to brewery trail!)\n\nSunday, October 16\n11am - depart Arbor Brewing Company Brewpub in Ann Arbor, 114 E. Washington\n\nThe ride will take most people somewhere between 45 and 75 minutes\n\n12ish - grab a bite to eat at Arbor Brewing Company Microbrewery in Ypsilanti. 720 Norris.\n\nAfter brunch we'll ride back to the Brewpub and relax with a pint of our B2B Trail Ale.\n\nThere is no charge or purchase required to participate but we do ask that all participants pre-register and sign a waiver. \n\nProceeds from the B2B Trail Ale benefit the Friends of the Border to Border Trail: A group of individuals working to see that the Border To Border Trail is completed, maintained, enhanced and most of all, used. \n\nRide notes:\n\n-        The ride is moderate as the total distance is 20 miles with some hills\n\n-        Solo Riders must be 12 years of age and trailers are aok\n\n-        What to bring: water, spare tire tube, helmet\n\n-        What not to bring: headphones\n\n-        Remember it is the law to obey all traffic rules\n\n-        Don’t forget to check your bike before the ride: breaks, gears, tires", "name": "Arbor Brewing Company B2B Ride"}, {"source": "Facebook", "date": "2016-10-16T19:30:00-04:00", "url": "https://www.facebook.com/events/528325550686673/", "description": "w/sg Frances Luke Accord", "name": "Darlingside—Night 2"}, {"source": "Facebook", "date": "2016-10-19T21:00:00-04:00", "url": "https://www.facebook.com/events/200433560358995/", "description": "Wednesday, Oct. 19 | 9pm | 18+ | $10 Cover\n\nSeamlessly blending Funk, Soul, and Rock n’ Roll, THE MAIN SQUEEZE promises to keep your body moving with their infectious feel-good musical gumbo.\n\nThe energetic five-piece found its roots in Bloomington Indiana’s surprisingly vibrant live music scene, and they have been leaving audiences “Freshly Squozen” since 2010.\n\nTheir ability to fluidly blend and bend genres is unparalleled, and creates for an unforgettable live experience. Every performance is different from the last, showcasing each member’s virtuosic talent with soulful vocals, intricate jams, tight grooves and powerful solos.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/765", "name": "The Main Squeeze 10/19/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-10-21T20:00:00-04:00", "url": "https://www.facebook.com/events/1668844700041158/", "description": "Two nights with Steppin' in It's fast-rising lead vocalist", "name": "Joshua Davis—Night 1"}, {"source": "Facebook", "date": "2016-10-22T20:00:00-04:00", "url": "https://www.facebook.com/events/215744518775574/", "name": "Joshua Davis—Night 2"}, {"source": "Facebook", "date": "2016-10-23T19:30:00-04:00", "url": "https://www.facebook.com/events/1696673723915750/", "description": "Michigan's bluegrass and Americana success story", "name": "Lindsay Lou & The Flatbellys"}, {"source": "Facebook", "date": "2016-10-25T21:00:00-04:00", "url": "https://www.facebook.com/events/1158475607517012/", "description": "Tue. October 25 | 9pm | 18+ | $15 adv./ $20 day of\n\nPresented by ann arbor's 107one\n\nFoy Vance knows how to write a song. It’s a naturally-born but dedicatedly-finessed skill that has led him to collaborate with artists as diverse as Plan B, Sheryl Crow and Rudimental, synced his music on multiple TV shows ranging from Grey’s Anatomy to the finale of Sons Of Anarchy, and caught the ears of some of the biggest players (in every sense) in music, from Elton John to Ed Sheeran. \n\nSo it is that in the run-up to the release of his new album, Vance travelled to Nashville. It’s a long way from home for the Irishman, both from the place of his birth (Bangor, Northern Ireland) and the place of his residence (Aberfeldy, Scotland). But for an inveterate songwriter, Music City is an irresistible draw, a place where Vance can work with the best of the best. Not, Vance clarifies, for himself or his own material. For one thing, he’s already completed his new album, and with songs of the calibre and single-minded brilliance of the dozen that comprise The Wild Swan, there’s no need for any outside assistance. \n\nWSG: Trevor Sensor\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/681", "name": "Foy Vance w/ Trevor Sensor 10/25/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-10-26T17:00:00-04:00", "url": "https://www.facebook.com/events/1606056323056977/", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia, and Blue Dog.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation for Art, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest page of our website: \nwww.kerrytownconcerthouse.com/edgefest", "name": "Edgefest 20: 20 Years At The Edge!"}, {"source": "Facebook", "date": "2016-10-27T17:00:00-04:00", "url": "https://www.facebook.com/events/1606056323056977/", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia, and Blue Dog.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation for Art, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest page of our website: \nwww.kerrytownconcerthouse.com/edgefest", "name": "Edgefest 20: 20 Years At The Edge!"}, {"source": "Facebook", "date": "2016-10-27T20:00:00-04:00", "url": "https://www.facebook.com/events/1735261526750729/", "description": "Thu. October 27 | 8pm | All Ages | $25 Cover\n\nann arbor's 107one Presents:\nBrett Dennen wsg: Lily & Madeleine\n\nAs common and simple as it is, \"por favor\" is such an evocative expression. From Spanish, it translates to \"please,\" a word that suggests a need for something, a desire to make a change. \"Por favor' was something I kept saying every day in the studio, and I got the other musicians saying it,\" says Brett Dennen. \"We were goofing around, and Dave Cobb, my producer, said it should be the title of my new record. I laughed it off at first, but then I really thought about it.\"\n\n\"When you say please, you're asking something to come into your life,\" Dennen adds. \"It might mean that you're weak and need something to make you strong. But you're admitting to some sort of weakness or some form of humility.\"\n\nThat notion is at the heart of Por Favor, Dennen's intimate and revealing new album that Elektra Records will release on May 20. Produced by Cobb, fresh from his Grammywinning work with Chris Stapleton and Jason Isbell, the record strips Dennen to his core as a songwriter with nothing to hide.\n\n\"All these songs came from a time of sadness for lots of different reasons. They came at a point when I wasn't feeling confident about myself,\" he says. \"When I'm not feeling confident, I'm not a nice person to be around. I don't take care of my health, my relationships, my stuff, and it all cycles into a miserable place. And I have a really hard time admitting that I'm in that place.\"\n\nA followup to 2013's Smoke and Mirrors, his sixth studio album dives deep into loneliness, loss, and love and all its side effects. It's the sound of an artist working through his insecurities in song, and thereby letting go of them. But it's by no means a sad affair, nor is it the \"rainyday record\" Dennen initially thought he was making.\n\nOften framed by uplifting choruses and bright acoustic arrangements, these songs brim with optimism, the palpable sense that the tide is turning. \"And I want to love you for the way you are/ Not the way I am/ So let's go now/ Back to the bonfire where we began,\" he sings over a chugging groove on \"Bonfire.\"\n\nOn \"Where We Left Off,\" the album's emotional powder keg, Dennen lays himself bare over the slack strum of guitar and one of his most unvarnished vocals ever recorded. The opening lines go straight for the jugular: \"Everyone knows I'm a happy man/ But I haven't been right.\"\n\n\"Vulnerable was another word that kept coming up when I was making this record,\" Dennen admits. \"Is there something I'm scared to say? Can I dig a little deeper, reveal a little bit more? How far can I go That was my direction, and once I got that in place, I started shooting down things that weren't in that zone.\"\n\n\"I kept telling myself that all I have to do is be authentic and make the songs about the lyrics and how they interact with my guitar,\" he continues. \"I don't have to worry about whether they'll be on the radio or if they're different from my previous stuff.\"\n\nHoled up at Cobb's Nashville studio, with musicians the producer assembled, Dennen and Cobb worked fast and kept the songs rough around the edges. Dennen appreciated Cobb's insistence on capturing them in just a few takes. \"We recorded it the way people made records in the '60s - really fast, all on analog gear, very few rehearsals,\" he says. \"We didn't do anything more than five times. We didn't secondguess ourselves - we just went with it. It's not sloppy, but it's in that right place between loose and tight and feelgood but not labored.\"\n\nCobb adds, \"I worked with Brett because of his beautiful balance of wit and melody. He's very timeless in his writing and you really can hear his personality in every note he sings. The record was made totally live and we recorded all the vocals live with the band. It really was produced as stopped down as possible - we tried to make every note matter.\"\n\nMore than a decade after his selftitled debut catapulted him to stardom, Dennen was once again attracted to how he made his earliest recordings. \"My whole approach was that I wanted to write and sing the songs from the same place that I wrote the first record, which was a place of trying to discover who I am,\" he says.\n\nThat marked a detour from his most recent releases. With those he felt like he was exercising his craftsmanship - \"being a songwriter for the sake of being a songwriter,\" as he puts it. \"I really wanted this new album to come across as a whole piece,\" Dennen says. \"I consider it to be a batch of songs that all live together and complement each other.\"\n\nWhich brings us back to the album title. Please.\n\n\"What was I asking for with this album\" Dennen says. \"I wanted to be a good person and feel good about myself again, but in a way that I knew it was OK to be sad. That's part of life, the ups and downs. But with these songs, I want to make people feel good about themselves and about life through the good and bad.\"\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/718", "name": "Brett Dennen w/ Lily and Madeleine 10/27/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-10-28T20:00:00-04:00", "url": "https://www.facebook.com/events/147078752335941/", "description": "There is no better storyteller than Chuck Brodsky.  Ranging from poignant to hilarious, his songs are about the little things in the lives of everyday people.  Chuck's soulful and compassionate voice brings his characters to life, and is the perfect instrument for infusing his lyrics with heartfelt humanity or biting wit. His spoken introductions to his songs can be as spellbinding as his colorful lyrics, which he brings to life with a well-travelled voice and a delivery that's natural and conversational. His groove-oriented strumming and fingerpicking draw on influences from the mountains of western North Carolina where he now lives, and from lots of different good old traditional folk stuff of all kinds. Chuck is widely known for his many wonderful songs about the heroes -- and zeroes -- of baseball. His latest CD is The Baseball Ballads 2.\nwww.chuckbrodsky.com", "name": "Chuck Brodsky at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-10-29T17:00:00-04:00", "url": "https://www.facebook.com/events/1606056323056977/", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia, and Blue Dog.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation for Art, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest page of our website: \nwww.kerrytownconcerthouse.com/edgefest", "name": "Edgefest 20: 20 Years At The Edge!"}, {"source": "Facebook", "date": "2016-10-30T19:30:00-04:00", "url": "https://www.facebook.com/events/566783526814522/", "description": "Premium tickets with dinner also available—please call (734) 761-1800 during business hours.", "name": "The Ark's Fall Fundraiser: An Evening w/The Milk Carton Kids"}, {"source": "Facebook", "date": "2016-10-31T21:00:00-04:00", "url": "https://www.facebook.com/events/315153365502594/", "description": "Mon. October 31 | 9pm | 18+ | $16 adv./ $18 day of\n\nmc chris wsg: MC Lars & Megaran\n\nmc chris (always spelled in all lower case letters) is rapper from the Libertyville, Illinois, a suburb of Chicago. He was one of the first rappers to focus solely on nerd life, rapping about Star Wars, Harry Potter, ninjas and unrequited love, instead of the usual hip hop fare. He’s just as likely to make an appearance at Comicon as he is at SXSW.\n\nmc got his start as an animator on many of the shows you see on Adult Swim. He was writer, actor, songwriter and animator for Sealab 2021, The Brak Show, Space Ghost Coast to Coast and Aqua Teen Hunger Force. He has voiced characters on several Adult Swim pilots such as Welcome to Eltingville, Cheyenne Cinnamon, Your Pretty Face is Going to Hell and Tight Bros. He was also a producer of on air content for over a year before leaving Williams Street to pursue a career in music.\n\nmc has since crossed America countless times touring as a headlining act, as well as opening for bands like Pinback and Reggie and the Full Effect. He's collaborated with Talib Kweli, Andrew WK, Cee-Lo and Childish Gambino. His music has been featured in Kevin Smith’s Zak and Miri Make a Porno, Jay and Silent Bob’s Super Groovy Cartoon Movie and he has composed several themes for Smith’s Smodcast podcast network. mc's song \"hoodie ninja\" was featured in both a Honda commercial and America's Funniest Home Videos. Other songs have been featured in Comedy Central’s Broad City and Fox's So You Think You Can Dance? mc most recently started in the pilot Bunny and Frog for Disney and a national commercial for Fiat.\n\nmc raises money to fight Cystic Fibrosis. Inspired by his nephew who has CF, mc chris and his fans have raised over $150,000 for the Cystic Fibrosis Foundation through eBay sales and donations collected at live shows.\n\nmc kickstarted “the mc chris cartoon” an animated extension of the skit universe featured on his records. Thanks to donations from his fans, he raised $60,000 and produced a six minute pilot presentation with the animation company Titmouse Inc. mc is currently shopping the project. \n\nmc chris lives in Los Angeles with his wife and son.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/719", "name": "MC chris w/ MC Lars & Megaran 10/31/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-11-01T17:00:00-04:00", "url": "https://www.facebook.com/events/1606056323056977/", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia, and Blue Dog.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation for Art, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest page of our website: \nwww.kerrytownconcerthouse.com/edgefest", "name": "Edgefest 20: 20 Years At The Edge!"}, {"source": "Facebook", "date": "2016-11-01T20:00:00-04:00", "url": "https://www.facebook.com/events/514055082125030/", "description": "\"The greatest acoustic guitar player I've ever heard\"—Joe Satriani", "name": "Adrian Legg"}, {"source": "Facebook", "date": "2016-11-04T09:00:00-04:00", "url": "https://www.facebook.com/events/261603764205728/", "description": "Fri. November 4 | 8pm | $25 Cover | 18+\n\nThe Randy & Mr Lahey LIVE show is a silly, sexist, drunken hour and a half of songs and skits, audience participation, profanity, Shakespeare, and general hilarity. Over the past eight years it has developed into the fastest moving two man show in the known universe.\n\nFrom Newfoundland to Vancouver Island several hundred thousand people have thrilled to Randy and Lahey's shennanigins. It's a constantly moving showcase of two television icons who pull no punches when battering the audience with \"Batman and Robin\" or \"The Shit Rap.\" The innocent honesty of an out- of-control drunken ex-cop Trailer Park Supervisor and his side-kick Randybobandy the cheeseburger eating ex male prostitute, weekend Trailer Park Supervisor is pants pissing humour at its warmest.\n\nThe show itself is roughly based on the T.V. series and movies, but being live, necessitates a different format and different is the operative word here. There is nothing like it anywhere. Shit talk and poetry; sodomy and sweet talk all thrown together with music and mayhem. What more could a room full of fun seekers want.", "name": "Randy & Mr. Lahey 11/4/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-11-04T20:00:00-04:00", "url": "https://www.facebook.com/events/1727260404190547/", "description": "An evening with an alternative folk legend", "name": "Suzanne Vega"}, {"source": "Facebook", "date": "2016-11-04T20:00:00-04:00", "url": "https://www.facebook.com/events/241375029564095/", "description": "Nashville-based artist and Wrensong Publishing writer Sally Barris has managed to be successful in the mainstream world of country music without giving up her folk and Celtic roots. Her unique style, influenced by artists such as Tony Rice, Dougie Maclean and Richard Thompson, is what makes her stand out in a city known for “cookie cutter” talent. Her songwriting highlights include, “Let The Wind Chase You” (Trisha Yearwood), “Reluctant Daughter” (Martina McBride), “Some Things I Know” (Lee Ann Womack), “I’m On My Way” (Kellie Pickler), “The Innocent Years” (Kathy Mattea) and “Honeysuckle Sweet” (Jessi Alexander), which was featured in the Miramax film, “An Unfinished Life.”  The Minnesota native is currently on tour with her fourth CD, Wilder Girl.\n“Sally Barris has a voice like sparkling crystal. You could have knocked me over with a feather the first time I heard her. Her writing is from a deep, yet innocent, place and her point of view is just a bit off center. I am excited for her; she is standing at the beginning of her journey in this town, with all of it ahead of her. It reminds me of the first time I heard Beth Nielson-Chapman or Nanci Griffith. It’s going to be fun to watch.” – Kathy Mattea    www.sallybarris.com", "name": "Sally Barris at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-11-06T19:00:00-05:00", "url": "https://www.facebook.com/events/1623892197925266/", "description": "Superstars of Latin-tinged country and Americana", "name": "At the Royal Oak Music Theatre: The Mavericks"}, {"source": "Facebook", "date": "2016-11-09T21:00:00-05:00", "url": "https://www.facebook.com/events/1254743334545390/", "description": "TICKETS ON SALE NOW: http://bit.ly/1XZq5zj\n\nNecto & React Detroit presents...\n\nLemaitre\nwww.lemaitremusic.com\n\nopening sets TBA\n\nwww.necto.com\nwww.reactpresents.com\n\nDoors at 9pm | 18 & over welcome with proper ID \n\nNecto located at 516 E Liberty Street, Ann Arbor, MI 48104\nFor VIP services contact info@necto.com", "name": "Lemaitre at Necto"}, {"source": "Facebook", "date": "2016-11-10T20:00:00-05:00", "url": "https://www.facebook.com/events/147425395682439/", "description": "\"Lyrical insights ... indelible hooks\"—Buffalo News", "name": "Willie Nile"}, {"source": "Facebook", "date": "2016-11-12T20:00:00-05:00", "url": "https://www.facebook.com/events/262655380758171/", "description": "A believer in stories", "name": "Joe Crookston"}, {"source": "Facebook", "date": "2016-11-13T19:30:00-05:00", "url": "https://www.facebook.com/events/140061109732194/", "description": "\"A master builder of songs\"—Boston Globe", "name": "Richard Shindell"}, {"source": "Facebook", "date": "2016-11-17T21:00:00-05:00", "url": "https://www.facebook.com/events/619658961515550/", "description": "Thursday, November 17 | 9pm | 18+ | $14 adv./ $16 day of\n\nEl Ten Eleven wsg: Bayonne\n\n\"It’s surprising this record even got made,” bass player and songwriter Kristian Dunn reflects. “[Drummer] Tim’s dad died just before the recording was to begin. Obviously he needed to go back to Pittsburgh to be with his family. He returned to California relatively quickly, ready to work, and then I was struck with serious food poisoning.”\n\nAs soon as one band member in the duo was ready to work, it seemed the other had something come up. Even their engineer, Chris Cheney, had to leave in the middle of recording to go DJ for the Arizona Diamondbacks baseball team. Deadlines were rapidly approaching and the record wasn’t finished. “It was stressful, but it seemed to all work out,” Tim Fogarty adds.\n\nAppropriately, the record is all about family and the connection between parent and child. Opening with “Point Breeze” (an area in Pittsburgh in which Tim’s dad used to hang out when young) and moving right into “Scott Township” (an area of Pittsburgh where Fogarty did the same), the record is alive with sounds both futuristic and anachronistic.\n\nThe album is full of parental nods. “’Fast Forward’ is a band name my dad would always suggest when I was starting new bands in high school. I thought it was stupid and would blow him off! Now I actually think it’s cool. It really represents something that is old, but also forward looking and inventive.” Dunn explains. “Peter and Jack” is a thank you to father and son team Peter Hook (of New Order and Joy Division) and Jack Bates who, after playing some shows with El Ten Eleven, suggested to Dunn that he employ one of the six string basses they were using.\n\n“Not to exaggerate, but the effect those two had on El Ten Eleven is sort of incalculable. I wouldn’t have even considered the Bass VI if it weren’t for them. And the direction of the band definitely changed because of it,” Dunn says.\n\nThe record was written at their homes and practice studio in Atwater Village, and recorded with Cheney at Costa Mesa Recording Studio in Costa Mesa, CA. Dunn and Fogarty are the only musicians that appear on Fast Forward; everything you hear was done by the two of them using two basses, electronic drums, acoustic drums, and myriad looping pedals and effects.\n\nWhile most artists use looping technology improvisationally, Dunn and Fogarty see the loopers themselves as another instrument. Over a decade plus together they’ve attained hard-won virtuosity with the devices, and can now concentrate on songwriting itself rather than logistics. “Nothing we do is improvised” explains Dunn. “When we first started playing shows we’d sometimes run into troubles with the loops and have to stop and retry songs!”\n\n“It’s almost like our rig itself is an instrument we’ve had to master,” he continues. “I’ll loop Tim’s electronic drums with one of my pedals while looping my own bassline, then switch to my six string bass midsong while he moves to playing acoustic drums, layering up the sonics and shaping the song as it all grows.” By refusing to use anything pre-recorded live they’ve pushed themselves into new territory, now able to deftly recreate their complex compositions nightly.", "name": "El Ten Eleven w/ Bayonne 11/17/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-11-18T20:00:00-05:00", "url": "https://www.facebook.com/events/962264457225114/", "description": "New music from a folk icon", "name": "Jonatha Brooke"}, {"source": "Facebook", "date": "2016-11-18T20:00:00-05:00", "url": "https://www.facebook.com/events/1513216465641630/", "description": "http://www.donhenry.com/", "name": "Don Henry at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-11-18T21:00:00-05:00", "url": "https://www.facebook.com/events/1752094781672292/", "description": "Fri. November 18 | 9pm | 18+ | $15 Cover + VIP Available\n\nHailing from Chicago, Louis The Child is an electronic music duo with the simple goal of creating music that makes people happy. Their single, “It's Strange”, has been played on BBC, Triple J, and KCRW, and racked up over 5 million plays on both Spotify and SoundCloud.  In 2016, SnapChat listed Louis The Child as one of 3 EDM Artists to Watch, and Mix Mag ranked LTC as the #1 Artist Taking Dance Music to the Next Level.  2015 involved numerous tours supporting Madeon, Kaskade and The Chainsmokers. Currently embarking on their first headlining tour, LTC is on the rise.", "name": "Louis The Child 11/18/16 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "date": "2016-11-20T19:30:00-05:00", "url": "https://www.facebook.com/events/1137237919653257/", "description": "\"A master of darkly comic songwriting\"—San Diego CityBeat", "name": "Steve Poltz"}, {"source": "Facebook", "date": "2016-12-01T20:00:00-05:00", "url": "https://www.facebook.com/events/851911334943175/", "description": "New music and a new band from a legendary Detroit songwriter", "name": "Jen Cass & The Lucky Nows"}, {"source": "Facebook", "date": "2016-12-02T20:00:00-05:00", "url": "https://www.facebook.com/events/271040036590005/", "description": "The haggis returns!", "name": "Enter the Haggis"}, {"source": "Facebook", "date": "2016-12-02T20:00:00-05:00", "url": "https://www.facebook.com/events/1694208660853014/", "name": "Don White & Christine Lavin at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-12-04T19:30:00-05:00", "url": "https://www.facebook.com/events/1702249903360615/", "description": "\"Music that challenges and heals\"—The Third Way", "name": "Carrie Newcomer"}, {"source": "Facebook", "date": "2016-12-09T20:00:00-05:00", "url": "https://www.facebook.com/events/277240782615400/", "description": "Chuck Mitchell started singing in Detroit folk clubs in the 1960s. In Toronto, on his first out of town gig, he met Canadian songwriter Joni Anderson. They married, and as a duo Chuck and Joni Mitchell played the coffeehouse circuit, and gin rummy, until they divorced in 1968. Mitchell's credits include A Prairie Home Companion and repertory theatre in Texas and in England. He has played Harold Hill in The Music Man and Woody Guthrie in Woody Guthrie's American Song. Most recently, he wrote and produced Mr. Foster & Mr. Twain, in which Stephen Foster joins Mark Twain for an evening of story and song. A Chuck Mitchell's show combines his seasoned skills as an actor, singer and guitarist with a selection of delightful material. He sings cabaret songs by Brecht and Weil -- \"Mack the Knife\" and \"The Bilbao Song\" -- and whimsical songs by Flanders & Swann -- \"The Gnu\" and \"Have Some Madeira, M'dear\". He roves the room singing \"Freeborn Man\" by Ewan McColl, or \"Necessity\" from Finian's Rainbow. He weaves poetry by Robert Frost and T.S. Eliot into his shows. He has been called a renaissance man, and thinks he is old enough to be one.\nwww.mitchellsong.com", "name": "Chuck Mitchell at Green Wood Coffee House"}, {"source": "Facebook", "date": "2016-12-16T20:00:00-05:00", "url": "https://www.facebook.com/events/253901491631138/", "description": "Katie Geddes sings traditional and contemporary folk, country-folk, and folk-pop tunes. A deft interpreter of beloved songs, her captivating voice and velvety-smooth delivery bring new life to the compositions of writers such as John Prine, Buffy Sainte-Marie, Michael Nesmith and Lennon and McCartney. Katie’s latest CD release, We Are Each Other’s Angels, features an inspired roster of guest artists including Michael Johnson, Mary McCaslin, Don Henry and Small Potatoes, and has received extensive airplay across the country and around the world.When not doing her own gigs, Katie has been known to “moonlight” singing harmony for folk- rock legend Melanie and local favorite Matt Watroba.\n\n\nVocal trio All About Eve (Katie Geddes, Deb Wood, David Vaughn) offers up a variety of close-harmony pop covers and traditional and contemporary folk and gospel songs, accompanied by Dan Reynolds on guitar.", "name": "Katie Geddes and Friends at Green Wood Coffee House"}, {"source": "Facebook", "date": "2017-01-20T20:00:00-05:00", "url": "https://www.facebook.com/events/1172029342847930/", "description": "For her newest music-theater work, Meredith Monk offers a poetic meditation on our intimate connection to the natural world and the fragility of its ecology.\n\nMore info: http://ums.org/performance/on-behalf-of-nature/", "name": "On Behalf of Nature: Meredith Monk & Vocal Ensemble"}, {"source": "Facebook", "date": "2017-01-21T20:00:00-05:00", "url": "https://www.facebook.com/events/600305573465226/", "description": "“They are not for you, but for a later age!”\n\nSo wrote Ludwig van Beethoven about his Op. 59 quartets, which will be performed in Ann Arbor as part of a complete Beethoven string quartet cycle by the Takács Quartet over six concerts (three weekends) in the 2016-17 season. Composed against the turbulent backdrop of the Napoleonic Wars and their aftermath, this radical music is as invigorating now as it was for its first performers and audiences.\n\nMore info: http://ums.org/performance/takacs-quartet/", "name": "Takács Quartet: Beethoven Quartet Cycle Concerts 3 & 4"}, {"source": "Facebook", "date": "2017-01-29T16:00:00-05:00", "url": "https://www.facebook.com/events/270514846618930/", "description": "Inon Barnatan, piano\nAnthony McGill, clarinet\nAlisa Weilerstein, cello\n\nThis powerhouse trio brings together some familiar faces.\n\nInon Barnatan was the featured piano soloist with the New York Philharmonic last fall, Anthony McGill is the New York Philharmonic’s principal clarinetist, and Alisa Weilersten has performed on both the Choral Union Series and the Chamber Arts Series in recent years. This concert of beloved clarinet trios includes a new work by Joseph Hallman, a prolific young composer based in Philadelphia, which was co-commissioned by UMS as part of the Music Accord commissioning consortium.\n\nMore info: http://ums.org/performance/inon-barnatan-piano-anthony-mcgill-clarinet-alisa-weilerstein-cello/", "name": "Inon Barnatan, Anthony McGill & Alisa Weilerstein"}, {"source": "Facebook", "date": "2017-02-02T19:30:00-05:00", "url": "https://www.facebook.com/events/523093904564649/", "description": "This unlikely mashup features an Austrian orchestra performing works by composers who wrote about the experience of Africans and African-Americans.\n\nThe program includes Alexander Zemlinsky’s Africa Sings, which was written in 1929 and features poetry by Langston Hughes and other prominent writers from the Harlem Renaissance. The program also features Phillip Glass’s recent collaboration with the Beninese singer Angélique Kidjo based on three poems of Ifé, one of the most important Yorùbán kingdoms.\n\nMore info: http://ums.org/performance/bruckner-orchester-linz/", "name": "Bruckner Orchester Linz"}, {"source": "Facebook", "date": "2017-02-03T20:00:00-05:00", "url": "https://www.facebook.com/events/102986336775427/", "description": "When the Estonian Philharmonic Chamber Choir landed in New York for its first North American tour in 1995 (including a stop in Ann Arbor for UMS’s very first concert at St. Francis), they were known only as the performers on the best-selling CD of fellow-Estonian Arvo Pärt’s austere Te Deum.\n\nThe concerts showed much more — a virtuosic ensemble that could dazzle in everything from Bach to folk songs. Now they return with newly-named artistic director Kaspars Putniņš with music by Pärt, Schnittke, Ligeti, Brahms, and Tormis. “So wondrously talented…the selections and performances were so fine that they left you feeling like an ingrate, greedily hungry for more.” (New York Times)\n\nMore info: http://ums.org/performance/estonian-philharmonic-chamber-choir/", "name": "Estonian Philharmonic Chamber Choir"}, {"source": "Facebook", "date": "2017-02-05T16:00:00-05:00", "url": "https://www.facebook.com/events/1713140125617477/", "description": "Winners of the grand prize at the inaugural M-Prize Chamber Music Competition at the University of Michigan in May, the Calidore String Quartet is “a miracle of unified thought,” (La Presse, Montreal).\n\nhttp://ums.org/performance/calidore-string-quartet/", "name": "Calidore String Quartet"}, {"source": "Facebook", "date": "2017-02-10T20:00:00-05:00", "url": "https://www.facebook.com/events/226856454345333/", "description": "Pianist Richard Goode joins the Budapest Festival Orchestra for this all-Beethoven program, which also features the UMS Choral Union in a performance of Beethoven’s Ninth Symphony.\n\nMore info: http://ums.org/performance/budapest-festival-orchestra/", "name": "Budapest Festival Orchestra"}, {"source": "Facebook", "date": "2017-02-18T20:00:00-05:00", "url": "https://www.facebook.com/events/1756234927931657/", "description": "Ping Chong + Company creates theater that crosses boundaries of identity, community, and form.\n\nHis projects have explored a wide variety of subject matter, from a hidden genocide in Africa to class struggles in America and modernization in China, but the common thread is a unifying commitment to artistic innovation and social responsibility.\n\nThis interview-based theater production, part of Chong’s 25-year series entitled Undesirable Elements, explores the diverse experiences of young Muslim New Yorkers. The five participants in Beyond Sacred share the common experience of coming of age in a post-9/11 New York City, at a time of increasing Islamophobia. Participants come from a range of cultural and ethnic backgrounds and include young men and women who reflect a range of Muslim identities, including those who converted to Islam, those who were raised Muslim but have since left the faith, those who identify as “secular” or “culturally” Muslim, and those who are observant on a daily basis.\n\nMore info: http://ums.org/performance/beyond-sacred-voices-of-muslim-identity/", "name": "Beyond Sacred: Voices of Muslim Identity: Ping Chong + Company"}, {"source": "Facebook", "date": "2017-02-19T16:00:00-05:00", "url": "https://www.facebook.com/events/1062809883742057/", "description": "Timeless classics are elevated by modern masters when gifted jazz pianist and arranger Aaron Diehl and 26-year-old vocalist extraordinaire Cécile McLorin Salvant join forces to revisit and revitalize the works of George Gershwin and Jelly Roll Morton.\n\nMore info: http://ums.org/performance/jelly-and-george-aaron-diehl-and-cecile-mclorin-salvant/", "name": "Jelly and George - Aaron Diehl and Cécile McLorin Salvant"}, {"source": "Facebook", "date": "2017-03-04T20:00:00-05:00", "url": "https://www.facebook.com/events/1204202942946225/", "description": "“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas)\n\nSince 1988, Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, it’s all sheer jazz perfection — and no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/jazz-at-lincoln-center-with-wynton-marsalis/", "name": "Jazz at Lincoln Center with Wynton Marsalis"}, {"source": "Facebook", "date": "2017-03-09T19:30:00-05:00", "url": "https://www.facebook.com/events/614995318650187/", "description": "Druid, which made its acclaimed UMS debut in 2011 with The Cripple of Inishmaan, returns with a new production of Martin McDonagh’s dark comedy The Beauty Queen of Leenane.\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.\n\nMore info: http://ums.org/performance/the-beauty-queen-of-leenane/", "name": "The Beauty Queen of Leenane: Druid"}, {"source": "Facebook", "date": "2017-03-10T19:30:00-05:00", "url": "https://www.facebook.com/events/614995318650187/", "description": "Druid, which made its acclaimed UMS debut in 2011 with The Cripple of Inishmaan, returns with a new production of Martin McDonagh’s dark comedy The Beauty Queen of Leenane.\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.\n\nMore info: http://ums.org/performance/the-beauty-queen-of-leenane/", "name": "The Beauty Queen of Leenane: Druid"}, {"source": "Facebook", "date": "2017-03-11T20:00:00-05:00", "url": "https://www.facebook.com/events/717745095032202/", "description": "Beethoven spent more time writing his massive Missa Solemnis than any other work he composed.\n\nMissa Solemnis has been performed only four times in all of UMS’s history: at three May Festivals (with the Chicago Symphony in 1927 and the Philadelphia Orchestra in 1947 and 1955), and most recently by the Detroit Symphony Orchestra in 1977. The UMS Choral Union and Ann Arbor Symphony Orchestra, under the direction of Scott Hanoian, bring this monumental work to UMS audiences for the first time in 40 years. Soloists to be announced.\n\nMore info: http://ums.org/performance/beethovens-missa-solemnis/", "name": "Beethoven’s Missa Solemnis"}, {"source": "Facebook", "date": "2017-03-12T20:30:00-04:00", "url": "https://www.facebook.com/events/614995318650187/", "description": "Druid, which made its acclaimed UMS debut in 2011 with The Cripple of Inishmaan, returns with a new production of Martin McDonagh’s dark comedy The Beauty Queen of Leenane.\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.\n\nMore info: http://ums.org/performance/the-beauty-queen-of-leenane/", "name": "The Beauty Queen of Leenane: Druid"}, {"source": "Facebook", "date": "2017-03-16T19:30:00-04:00", "url": "https://www.facebook.com/events/1742640832682915/", "description": "This once Texan, now New York-based quasi-collective has gone from a best-kept secret to one of the biggest bands on the international scene.\n\nAlthough still “underground” in many respects, the band followed up its first Grammy in 2014 (“Best R&B Performance”) with its second this past February for “Best Contemporary Instrumental Album.” They have earned high praise from critical stalwarts like the BBC, Village Voice, The Guardian, and the New York Times, as well as from the world’s most respected musicians, from Pat Metheny to Prince. Formed in 2004 at the acclaimed music school of the University of North Texas, the group was voted “Best Jazz Group” in Downbeat’s 2015 Reader’s Poll as well as “Best New Artist” in JazzTimes’s 2014 Reader’s Poll. Their music is a mixture of funk, jazz, gospel, rock, and R&B that strikes a perfect balance between pure musical virtuosity and raw soulful simplicity.\n\nMore info: http://ums.org/performance/snarky-puppy/", "name": "Snarky Puppy"}, {"source": "Facebook", "date": "2017-03-17T20:00:00-04:00", "url": "https://www.facebook.com/events/240524153002004/", "description": "Some questions are impossible to answer and some experiences too personal to express.\n\nCrystal Pite, the choreographer who brought The Tempest Replica to Ann Arbor four seasons ago, is back with her 2015 work for Kidd Pivot and Electric Company Theatre: Betroffenheit, which means a sort of shock, speechlessness, and bewilderment. This searing work has its roots in a deeply personal tragedy, the deaths of writer Jonathon Young’s teenage daughter and two cousins in a fire. With unflinching honesty, it achieves broad resonance as it touches on themes of loss, trauma, addiction, and recovery through a boundary-stretching hybrid of theater and dance. “A stunning testament to what can happen when life turns into art.” (The Globe and Mail)\n\nMore info: http://ums.org/performance/betroffenheit/", "name": "Betroffenheit: Kidd Pivot and Electric Company Theatre"}, {"source": "Facebook", "date": "2017-03-18T20:00:00-04:00", "url": "https://www.facebook.com/events/1701619326773112/", "description": "The Guardian in London asserts, “There’s just a handful of living composers who can legitimately claim to have altered the direction of musical history, and Steve Reich is one of them.”\n\nReich, who has been called “our greatest living composer” (New York Times), celebrates his 80th birthday in 2016, and the year also marks the 40th anniversary of the premiere of Music for 18 Musicians, considered by many to be his greatest composition. Two of Chicago’s world-class ensembles, eighth blackbird and Third Coast Percussion, team up to perform this seminal composition.\n\nMore info: http://ums.org/performance/steve-reich-80/", "name": "Steve Reich at 80: Music for 18 Musicians"}, {"source": "Facebook", "date": "2017-03-18T20:00:00-04:00", "url": "https://www.facebook.com/events/240524153002004/", "description": "Some questions are impossible to answer and some experiences too personal to express.\n\nCrystal Pite, the choreographer who brought The Tempest Replica to Ann Arbor four seasons ago, is back with her 2015 work for Kidd Pivot and Electric Company Theatre: Betroffenheit, which means a sort of shock, speechlessness, and bewilderment. This searing work has its roots in a deeply personal tragedy, the deaths of writer Jonathon Young’s teenage daughter and two cousins in a fire. With unflinching honesty, it achieves broad resonance as it touches on themes of loss, trauma, addiction, and recovery through a boundary-stretching hybrid of theater and dance. “A stunning testament to what can happen when life turns into art.” (The Globe and Mail)\n\nMore info: http://ums.org/performance/betroffenheit/", "name": "Betroffenheit: Kidd Pivot and Electric Company Theatre"}, {"source": "Facebook", "date": "2017-03-24T20:00:00-04:00", "url": "https://www.facebook.com/events/1061640283908926/", "description": "Renowned for her interpretations of Mozart and Schumann, the legendary pianist Mitsuko Uchida has also illuminated the music of new composers.\n\nShe will perform the US premiere of a new work by the German composer Jörg Widmann in her first UMS concert since her 1998 debut.\n\nMore info: http://ums.org/performance/mitsuko-uchida-piano/", "name": "Mitsuko Uchida, piano"}, {"source": "Facebook", "date": "2017-03-25T20:00:00-04:00", "url": "https://www.facebook.com/events/135653360170391/", "description": "“They are not for you, but for a later age!”\n\nSo wrote Ludwig van Beethoven about his Op. 59 quartets, which will be performed in Ann Arbor as part of a complete Beethoven string quartet cycle by the Takács Quartet over six concerts (three weekends) in the 2016-17 season. Composed against the turbulent backdrop of the Napoleonic Wars and their aftermath, this radical music is as invigorating now as it was for its first performers and audiences.\n\nMore info: http://ums.org/performance/takacs-quartet-3/", "name": "Takács Quartet: Beethoven Quartet Cycle Concerts 5 & 6"}, {"source": "Facebook", "date": "2017-03-29T19:30:00-04:00", "url": "https://www.facebook.com/events/1099676823415727/", "description": "Drones and beats, crimson beads, and towering black lambswool hats all serve as a striking backdrop for an unexpected, refreshingly novel vision of Eastern European roots music.\n\nThis hit Ukrainian folk-punk quartet stirs up a mesmerizing sound that melds traditional Ukrainian folk music, African grooves, Eastern colors, and a contemporary, trans-national sensibility that the band calls “ethno-chaos.” With one foot in the urban avant-garde and the other in Ukrainian village culture, DakhaBrakha made NPR music host Bob Boilen’s “Top 10 Events of 2015” — no small feat given the 506 concerts he attended that year. Rolling Stone’s report on their Bonnaroo appearance was equally enthusiastic: “Ukrainian folkdrone Björkpunk quartet DakhaBrakha ended up with one of the most receptive crowds of the weekend…turning the tent into a happy menagerie.”\n\nMore info: http://ums.org/performance/dakhabrakha/", "name": "DakhaBrakha"}, {"source": "Facebook", "date": "2017-03-30T19:30:00-04:00", "url": "https://www.facebook.com/events/1802665646634100/", "description": "In 1969, National Geographic photographer Loren McIntyre became hopelessly lost in a remote part of the Brazilian rainforest while searching for the Mayoruna people.\n\nHis encounter tested his perception of the world, bringing the limits of human consciousness into startling focus. Threading scenes of his own life with details of McIntyre’s journey, Complicité artistic director Simon McBurney incorporates objects and sound effects into this solo performance to evoke a rainforest landscape. Transmitted directly to the audience through provided headphones, the show’s groundbreaking technology and sound design plugs into the power of the imagination, questioning our perceptions of time, communication, and our own consciousness. McBurney transports us into the humid depths of the Amazon, its intense soundscape a new approach to site-specific theater.\n\nMore info: http://ums.org/performance/the-encounter/", "name": "The Encounter: Complicite / Simon McBurney"}, {"source": "Facebook", "date": "2017-03-31T19:30:00-04:00", "url": "https://www.facebook.com/events/1802665646634100/", "description": "In 1969, National Geographic photographer Loren McIntyre became hopelessly lost in a remote part of the Brazilian rainforest while searching for the Mayoruna people.\n\nHis encounter tested his perception of the world, bringing the limits of human consciousness into startling focus. Threading scenes of his own life with details of McIntyre’s journey, Complicité artistic director Simon McBurney incorporates objects and sound effects into this solo performance to evoke a rainforest landscape. Transmitted directly to the audience through provided headphones, the show’s groundbreaking technology and sound design plugs into the power of the imagination, questioning our perceptions of time, communication, and our own consciousness. McBurney transports us into the humid depths of the Amazon, its intense soundscape a new approach to site-specific theater.\n\nMore info: http://ums.org/performance/the-encounter/", "name": "The Encounter: Complicite / Simon McBurney"}, {"source": "Facebook", "date": "2017-04-01T20:00:00-04:00", "url": "https://www.facebook.com/events/1547896382170720/", "description": "A University of Michigan alumnus, Michael Fabiano received the 2014 Richard Tucker Award and the  2014 Beverly Sills Artist Award, the first-ever winner of both awards in the same year.\n\n“A marvel…Fabiano’s sound was so beautiful, and the transition from the bottom to the top of his range so seamless as to proclaim him ‘the’ tenor that we have all been waiting for.” (San Francisco Classical Voice)", "name": "Michael Fabiano, tenor & Martin Katz, piano"}, {"source": "Facebook", "date": "2017-04-02T19:30:00-04:00", "url": "https://www.facebook.com/events/1802665646634100/", "description": "In 1969, National Geographic photographer Loren McIntyre became hopelessly lost in a remote part of the Brazilian rainforest while searching for the Mayoruna people.\n\nHis encounter tested his perception of the world, bringing the limits of human consciousness into startling focus. Threading scenes of his own life with details of McIntyre’s journey, Complicité artistic director Simon McBurney incorporates objects and sound effects into this solo performance to evoke a rainforest landscape. Transmitted directly to the audience through provided headphones, the show’s groundbreaking technology and sound design plugs into the power of the imagination, questioning our perceptions of time, communication, and our own consciousness. McBurney transports us into the humid depths of the Amazon, its intense soundscape a new approach to site-specific theater.\n\nMore info: http://ums.org/performance/the-encounter/", "name": "The Encounter: Complicite / Simon McBurney"}, {"source": "Facebook", "date": "2017-04-12T19:30:00-04:00", "url": "https://www.facebook.com/events/256549731357007/", "description": "A Far Cry stands at the forefront of an exciting new generation in classical music.\n\nThe 17-member, self-conducted chamber music collective joins forces with virtuosic vocalists Roomful of Teeth to create a sonic patchwork that is ever-changing with its fleeting burst of colors, timbres, and visions. The program opens with the lush writing of Caroline Shaw (2013 Pulitzer Prize winner), with the second half devoted to two raw, energetic, and captivating works by Ted Hearne.\n\nMore info: http://ums.org/performance/a-far-cry-with-roomful-of-teeth/", "name": "A Far Cry with Roomful of Teeth"}, {"source": "Facebook", "date": "2017-04-15T20:00:00-04:00", "url": "https://www.facebook.com/events/1065809183457276/", "description": "With compelling interpretations that draw deeply from one of the world’s great music traditions, Sanam Marvi is Pakistan’s next inspiring diviner of South Asia’s Sufi texts.\n\nA vocal warrior for tolerance and peace, this contemporary daughter of the Sindh province is a brilliant interpreter of South Asia’s spiritual, folk, and classical poetry. Her performances balance immediacy and elegant ornamentation, lending new light to her well-loved repertoire of sufi, ghazal, qawwali, and folk songs. An in-demand performer too rarely heard outside émigré circles, she makes her first extended tour to the US.\n\nMore info: http://ums.org/performance/sanam-marvi/", "name": "Sanam Marvi"}, {"source": "Facebook", "date": "2017-04-21T20:00:00-04:00", "url": "https://www.facebook.com/events/996900117032146/", "description": "Since the evolution of jùjú music in Nigeria in the 1930s, no one has made a more lasting impact in the genre than King Sunny Adé.\n\nAs a singer, composer, and guitarist, this pioneer of modern world music has succeeded in taking Nigerian social music to international heights. Adé formed his first band in 1967 and has been in the limelight in Nigeria ever since. Singing in his native Yorùbá language, Adé went on to define the terms “Afropop” and “World Beat” and to open the door to the West for other African musicians. King Sunny Adé & His African Beats last toured North America in 2005. He will lay down his trademark mix of talking drum-driven grooves, multi-guitar weaves, lilting vocal harmonies, and pedal steel guitar accents, taking the audiences on an intoxicating journey.\n\nMore info: http://ums.org/performance/king-sunny-ade/", "name": "King Sunny Adé"}, {"source": "Facebook", "date": "2017-04-22T20:00:00-04:00", "url": "https://www.facebook.com/events/197458777307457/", "description": "This special concert at the end of UMS’s season brings together three artists who have been collaborating for the better part of a decade, most notably on the bestselling recording The Goat Rodeo Sessions.\n\nYo-Yo Ma’s multi-faceted career is a testament to his continual search for new ways to communicate with audiences and to his personal desire for artistic growth and renewal. Here, he is joined by mandolinist Chris Thile (Punch Brothers, Nickel Creek) and bass virtuoso Edgar Meyer for a special concert that brings together three string masters who come from wildly different backgrounds yet excel in virtually all genres. They pool their talents for a fresh, new perspective on brilliantly conceived music by Johann Sebastian Bach. The program includes transcriptions of excerpts from The Art of the Fugue and various keyboard works, as well as organ and viola da gamba trio sonatas.\n\nMore info: http://ums.org/performance/yo-yo-ma-edgar-meyer-chris-thile/", "name": "Yo-Yo Ma, Edgar Meyer & Chris Thile"}, {"source": "Facebook", "date": "2017-04-25T19:30:00-04:00", "url": "https://www.facebook.com/events/1003698069678193/", "description": "Contemporary opera composer Jake Heggie enthused in Gramophone magazine, “The staggering, joyful artistry of Joyce DiDonato reminds us that in any generation there are a few giants…Those who know her repertoire are in awe of her gifts, and those who know nothing of it are instantly engaged.”\n\nDiDonato enchants audiences across the globe with her 24-carat voice and performances that “leave one bereft of superlatives.” (The Telegraph) This concert opera with The English Concert and conductor Harry Bicket will be performed in only two places in the country: Hill Auditorium and Carnegie Hall.\n\nMore info: http://ums.org/performance/handels-ariodante/", "name": "Handel’s Ariodante"}]