[{"source": "Facebook", "url": "https://www.facebook.com/events/1676692335988216/", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "name": "Maker Space Operations Bootcamp", "date": "2016-10-06T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/178290599278647/", "description": "Thursday, October 6, 5:30–6:30 p.m.\r\nHelmut Stern Auditorium\n\nChina Miéville lives and works in London. He is a three-time winner of the prestigious Arthur C. Clarke Award (Perdido Street Station, Iron Council, and The City & the City) and has also won the British Fantasy Award twice (Perdido Street Station and The Scar). The City & The City, an existential thriller, was published in 2009 to dazzling critical acclaim and drew comparison with the works of Kafka and Orwell (The Times) and Phillip K. Dick (The Guardian). The City & The City recently won the British Science Fiction Award, the Arthur C. Clarke Award, and tied with Paolo Bacigalupi's The Windup Girl for the 2010 Hugo Award. It was also shortlisted for the Nebula.\rUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. \n\nThe Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please \rsee lsa.umich.edu/writers/readingsevents/zellvisitingwritersseries.com", "name": "Zell Visiting Writers Series: China Miéville in conversation", "date": "2016-10-06T17:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/664614673705320/", "description": "Thursday, October 6, 6–7:30 p.m. \nThe Silver Club\n\nIn this interactive, 90-minute program, University of Michigan Museum of Art docents and staff will demonstrate their use of art, music, storytelling and touch to create successful and rewarding experiences for visitors with memory loss, their families, and care-partners. The evening will also include tips and ideas from UMMA and Silver Club for using these modes to connect with loved ones at home or anywhere.\r￼The University of Michigan Museum of Art’s Meet Me Program has served people with\r \rmemory loss and their families and care partners for the last six years in partnership with Silver Club.\rThis program is free and light refreshments will be served.\rSilver Club will also provide a respite of alternative activities and refreshments for Silver Club members, or guests with memory loss during the program.\r\n\nRegistration: \rPlease register by emailing umma-program-registration@umich.edu so that we can accommodate all of your party, including people with memory loss who will join the Silver Club activity session.\r\n\nLocation\r: The Silver Club, 2401 Plymouth Road, Suice C Ann Arbor, Michigan 48105.\r\n\nQuestions:\r For more information about this program, please call Mary LaVenture at 734-647-0522 or The Silver Club Programs at 734-998-9349.\r\n\nMeet Me at UMMA is generously supported by the Monroe-Brown Foundation Discretionary Fund for Outreach to the State of Michigan and individual donors.", "name": "The Senses are Alive and Well: Art, Music, and Connecting", "date": "2016-10-06T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/588314098007062/", "description": "Nature Walk with Ann Arbor District Library\nThursday, October 6\n6 to 7:30 p.m. \nMary Beth Doyle Park\nMary Beth Doyle Park is an 81-acre park located a couple blocks east of the Malletts Creek branch of the AADL. It has both paved and unpaved trails that meander through woods and wetlands. A large pond near the center of the park is a wonderful area for wildlife viewing. During October, late fall wildflowers will be in bloom!\nThe nature walks are a collaboration between the AADL and Natural Area Preservation that take place once a month throughout the summer and fall. This is the final one of 2016! We'll be meeting in the parking area off Packard Road just east of Cobblestone Farm on the south side of the street. Wear comfortable clothes and bring water if desired. Some of the AADL Science Tools will be available for use during the walk, too!", "name": "Nature Walk with Ann Arbor District Library- Mary Beth Doyle Park", "date": "2016-10-06T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/338071319866890/", "description": "This event will take place on our main floor.\n\nLiterat is pleased to welcome Edward Dusinberre, author of Beethoven For a Later Age, in conversation with Steven Whiting, professor of musicology at the University of Michigan. This event is being held in conjunction with the UMS presentation of the Takács Quartet on October 8 and 9, at Rackham Auditorium. For more information or to purchase tickets, please visit ums.org.\n\n'They are not for you but for a later age!' -Ludwig van Beethoven, on the Opus 59 quartets\n\nBeethoven's sixteen string quartets are some of the most extraordinary and challenging pieces of music ever written. They have inspired artists of all kinds - not only musicians - and have been subject to endless reinterpretation. What does it feel like to be a musician taking on these iconic works? And how do the four string players who make up a quartet interact, both musically and personally?\n\nThe Takács is one of the world's pre-eminent string quartets. Performances of Beethoven have shaped their work together for over forty years. Using the history of both the Takács Quartet and the Beethoven quartets as the backbone to his story, Edward Dusinberre, first violinist of the Takács since 1993, recounts the exhilarating challenge of tackling these pieces. Beethoven for a Later Age takes the reader inside the daily life of a quartet, vividly showing the necessary creative tension between individual and group expression and how four people can enjoy making music together over a long period of time.\n\nThe key, the author argues, is in balancing continuity with change and experimentation - a theme that lies at the heart of Beethoven's remarkable compositions. No other composer has posed so many questions about the form and emotional content of a string quartet, and come up with so many different answers. In an accessible style, suitable for novices and chamber music enthusiasts alike, Dusinberre illuminates the variety and inherent contradictions of Beethoven's quartets, composed against the turbulent backdrop of the Napoleonic Wars and their aftermath, and shows that engaging with this radical music continues to be as invigorating now as it was for its first performers and audiences.\n\nEdward Dusinberre was born in 1968 in Leamington Spa, England, and has enjoyed playing the violin from a young age. His early experiences as concertmaster of the National Youth Orchestra of Great Britain encouraged him to choose music as a profession. He studied with the Ukrainian violinist Felix Andrievsky at the Royal College of Music in London and at the Juilliard School with Dorothy DeLay and Piotr Milewski. In 1990 he won the British Violin Recital Prize and gave his debut recital in London at the Purcell Room, South Bank Centre. Upon completion of his studies at Juilliard Dusinberre auditioned for the Takács Quartet, which he joined in 1993 as first violin.\n\nSteven Whiting, a native of Chicago, graduated from Macalester College in 1975 with a major in music (voice, piano) and a minor in German.He studied musicology at Christian-Albrechts-Universitaet in Kiel, Germany, on a Fulbright grant (1975–77) and sang for a season with the Chicago Symphony Chorus before pursuing graduate work at the University of Illinois. There he took an M.M. in Musicology with a thesis on “Erik Satie and Parisian Musical Entertainment,” and his Ph.D. with a dissertation on Beethoven’s early variations (“To the ‘New Manner’ Born”). Between degrees, he spent four years as a desk editor at A-R Editions of Madison, Wisconsin, sang with several early music groups, and performed in contemporary music ensembles. After teaching for two years at the University of Illinois, he came to the University of Michigan in 1991 as a visiting assistant professor.", "name": "Edward Dusinberre with Steven Whiting", "date": "2016-10-06T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1646167612272291/", "description": "Author: \n\nLaurie Halse Anderson is a New York Times bestselling author known for tackling tough subjects with humor and sensitivity. Her work has earned numerous ALA and state awards. Two of her books, Speak and Chains, were National Book Award finalists. Chains also received the 2009 Scott O’Dell Award for Historical Fiction, and Laurie was chosen for the 2009 Margaret A. Edwards Award. Mother of four and wife of one, Laurie lives in Northern New York, where she likes to watch the snow fall as she writes. You can follow her adventures on Twitter @HalseAnderson, or visit her at www.MadWomaninthForest.com\n\nBook: \n\nReturn to the American Revolution in this blistering conclusion to the trilogy that began with the bestselling National Book Award Finalist Chains and continued with Forge, which The New York Times called “a return not only to the colonial era but to historical accuracy.”\n\nAs the Revolutionary War rages on, Isabel and Curzon have narrowly escaped Valley Forge—but their relief is short-lived. Before long they are reported as runaways, and the awful Bellingham is determined to track them down. With purpose and faith, Isabel and Curzon march on, fiercely determined to find Isabel’s little sister Ruth, who is enslaved in a Southern state—where bounty hunters are thick as flies.\n\nHeroism and heartbreak pave their path, but Isabel and Curzon won’t stop until they reach Ruth, and then freedom, in this grand finale to the acclaimed Seeds of America trilogy from Laurie Halse Anderson.", "name": "Children's Author Laurie Halse Anderson Discussion & Signing", "date": "2016-10-06T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/317680438623928/", "description": "No better way to throw a proper party than with GOLF CLAP & Friends!\n\nCountry Club Disco presents... Golf Clap\nwith opening sets by the Ghita Sisters & Brahj\n\nDJs; producers; club headliners; after-party enthusiasts: Golf Clap are Hugh Cleal and Bryan Jones, a Detroit duo with an unmatched passion for house music and a seemingly endless supply of studio and club-focussed creativity. And with releases on some of the world’s most influential house labels already under their belts, along with a lauded Boiler Room session and beyond, they’re only just getting started.\n\nProduced by Necto & Southpaw Events\n\nDoors open at 10pm | 18 + welcome with proper ID\n21+ get in FREE | $10 for 18-20\n\nhttps://countryclubdisco.com\nhttps://www.facebook.com/golfclapdet/\nhttps://soundcloud.com/golfclapdet\nhttps://twitter.com/golfclapdet\nhttps://boilerroom.tv/recording/golf-clap/\n\nwww.necto.com", "name": "Golf Clap at Necto", "date": "2016-10-06T22:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/585713071616738/", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "name": "POP-X", "date": "2016-10-07T12:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1785779555021709/", "description": "Another fall season arrives not only with crisp air and beautiful weather, but also ABC's much anticipated festival, Oktoberfest! The celebration of beers, brats and Leiderhosen. \nWe're once again closing off the street and putting up the beer tents for our annual Oktoberfest street party! Join us at the corner of Main and Washington to enjoy a cool autumn evening under the stars with beer, brats, music, and dancing.\n(Parking available at the 4th and Washington parking structure) \n\n* 5-12 Friday \n* Live music provided by the Immigrant Sons. \nGet ready to Polka!! Friday night will feature the best Oom Pah Pa Band playing Traditional German Oktoberfest Music. The inception of Immigrant Sons is the culmination of all the musical history and heritage of the band members.  Immigrant Son plays a variety of music that makes people want to dance and tap their feet, creating the kind of fun that builds life long memories. \n\n* No cover. \n* Must be 21 with valid ID. Children welcome with parents. \n* Brats, veggie brats, chips, pretzels, beer, wine, and soda will be available for purchase. \n* Call Beth at 734-213-1393 for more information. \n\nLeiderhosen optional (but pants required).", "name": "Oktoberfest - Friday", "date": "2016-10-07T17:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1122525487797115/", "description": "Friday, October 7, 7–8 p.m.\r Helmut Stern Auditorium\r.\nFree and open to the public. Seating is first come, first serve.\n\nOne MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.\rThis week's reading features Sam Jensen (Introduced by Yasin Abdul-Muqit) & A.S. Gorsuch (Introduced by Sierra Brown).\rSamuel Jensen is a writer from Texas. His fiction has appeared in The Masters\rReview and has been honored in a handful of contests, including the Hopwood Awards.\rA.S. Gorsuch was born in Akron, Ohio, grew up outside of Grand Rapids, Michigan, and\r￼￼￼ \rhas attended both Michigan State University and University of Michigan. On all counts, she is undecided.", "name": "Mark Webster Reading Series", "date": "2016-10-07T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/512603802273198/", "description": "Literati is thrilled to welcome our friends at harlequin creature back to the store for the launch of their latest, greatest issues.\n\nAbout the journal: 2016 marks five years of harlequin creature, and to celebrate, we're launching a special double issue. please join us for the launch of issues 8/9 with an evening of readings. issue 8, \"not a metaphor,\" was curated by a group of guest editors from across the country, including JP Howard & Casey Rocheteau (poetry), Ginger Buswell (prose), & Alisha Wessler (art). it includes the poetry of Tara Betts, Destiny O. Birdsong, Amber Flame, Micaela Foley, Alexis Pauline Gumbs, Amanda Johnston, Stacey Knecht, and Pamela L. Laskin, prose by Emily Hunt and Meg Whiteford, and art by Matt Neff. cover design by Kayla Romberger. issue 9, \"sitting between chairs,\" is dedicated to translation and was shaped by guest editors Kristin Dickinson, Emily Goedde, and Anne Posten, and features translations from a wide range of languages, including serbian, welsh, portugese, ukrainian and hungarian.\n\nEvent date: \nFriday, October 7, 2016 - 7:00pm", "name": "Harlequin Creature", "date": "2016-10-07T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1580066205632601/", "description": "Join Kerrytown Concert House as we celebrate the lead-up to the 20th anniversary of our avant-garde jazz festival Edgefest (October 26-29) with a series of free concerts throughout Ann Arbor!\n\nSince his 2007 debut as a leader, 7th Heaven (Between the Lines), Samuel Blaser has grown at an almost incomprehensible rate, from straight-ahead hard bopper in his mid-twenties to innovative free player and ever-searching composer and bandleader in his early thirties, one whose improvisational strength has received praise from sources like Audiophile Audition, citing Blaser’s music as occupying “ambient/free jazz terrain that has a depth of vision and clarity revealing musical maturity beyond Blaser’s nearly three decades of life.”\n\nGerry Hemingway, now a resident of Luzern, Switzerland, is a recipient of a Guggenheim Fellowship. He has had a long and admirable career, as he has been composing and performing solo, ensemble, and orchestral music since 1974. As bandleader, Hemingway has led various quartets and quintets since the mid-1980′s. He has also performed with the great Anthony Braxton, Ray Anderson, and many others. For nuscope, Hemingway previously recorded the challenging Subsymbolism (CD 1010) with Georg Graewe and Ernst Reijseger.\n\nTogether, the two will perform an evening of innovative compositions and improvisations with a quiet intensity that beats its own path while paying homage to tradition.\n\nThis performance is made possible through the generous sponsorship of The Maxine and Stuart Frankel Foundation in honor of Maurice and Linda Binkow on the occasion of her 80th birthday and their 60th wedding anniversary. Additional support for this performance is provided by Encore Records. \n \nThis concert is a part of the Warming Up The Edge series leading up to Kerrytown Concert House's Edgefest festival of creative music in celebration of the festival's 20th anniversary.", "name": "Blaser & Hemingway at Encore | Warming Up the Edge Series", "date": "2016-10-07T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/964923176923370/", "description": "Lou and Peter Berryman were both raised in Appleton, WI, and began playing music together in high school during the sixties. During the following nomadic decade, Lou studied classical voice and music theory in college while Peter continued an unfocused fascination with surrealist art, beatnik poetry, and jug band music. Early influences of American and British musical comedy and folk music fed a growing repertoire of original songs. A brief marriage in the early seventies resolved into a lifelong friendship, and by the late seventies and early eighties the two were honing their skills playing regular weekly concerts in Madison, becoming full-time musicians and songwriters in 1979. During those early years they wrote new songs every week, many about the history, cheese, beer and strange politics of their home state. By the mid '80s they were traveling all across the country, still writing and singing, but now with a broader perspective, finding that the quirks of their home state were not so much Midwestern as human. In twenty-five years of performing together, Lou and Peter have released twenty albums and four songbooks worth of hilarious, quirky, yet oddly profound songs, rich with word play and interesting images. Pete Seeger, Tom Paxton and Tom Lehrer count themselves among their fans. Their work has appeared in numerous compilations such as the popular \"Rise Up Singing\" songbook, in periodicals like \"SING OUT! Magazine\", and in many audio compilations. Berryman songs are being sung around the world by a legion of professional musicians including Peter, Paul and Mary, Garrison Keillor and Peggy Seeger. They have appeared numerous times on such national programs as NPR's \"A Prairie Home Companion\" and \"Weekend Edition.\"\nwww.louandpeter.com", "name": "Lou and Peter Berryman at Green Wood Coffee House", "date": "2016-10-07T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/325333901135326/", "description": "Maize & Blue Velvet: a benefit concert for the David Lynch Foundation\nTicket proceeds to benefit the Chicago division of the David Lynch Foundation and the Ann Arbor Film Festival\n\nwith special guests\n\nWindy & Carl\n\nWolf Eyes\n\nAaron Dilloway\n\nDJ stylings by Dykehouse (Ghostly International)\n\nAbout the Foundation\nThe David Lynch Foundation’s core mission is to heal traumatic stress and raise performance in at risk populations, including veterans suffering from PTSD and mothers and their families who have lost loved ones to violence. Specifically through the implementation of Transcendental Meditation (TM) programs in order to improve their health, cognitive capabilities and performance in life.\nwww.davidlynchfoundation.org\n\nAbout the Ann Arbor Film Festival\nThe Ann Arbor Film Festival is the longest standing experimental film festival in the country and serves as an Academy Award®-qualifying festival in the United States for the Short Films category.\nhttp://www.aafilmfest.org/\n\n8pm doors | 21 and up event\n$20 advance  tickets | $25 at the door\n\nTickets available at: https://www.eventbrite.com/e/wolf-eyes-windy-carl-aaron-dilloway-benefit-for-david-lynch-foundation-tickets-27309124326\n\nTickets also available in store at Encore Records (Ann Arbor) and stormy records (Dearborn)\n\nClub Above\n215 North Main Street\nDowntown Ann Arbor\nabove the Heidelberg Restaurant\nwww.club-above.com", "name": "Wolf Eyes, Windy & Carl, Aaron Dilloway: benefit concert", "date": "2016-10-07T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1737852759803500/", "description": "Stewardship Workday\nSaturday, October 8\nMarshall Nature Area\n9 a.m. to noon\nThis large nature area, which extends into a county park and University of Michigan property, is a valuable piece of wildlife habitat in the northeast part of the city. Come out to help us improve the habitat by removing invasive buckthorn and honeysuckle. This amazing nature area is sure to provide an incredible outdoor experience. Meet in the parking lot off Dixboro Road, north of Plymouth Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Stewardship Workday-Marshall Nature Area", "date": "2016-10-08T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1579703035671405/", "description": "Sylvie Granatelli Workshop\nSaturday, October 8 – Sunday, October 9 \n9:30am-4:30pm\n\nIn this two day demonstration workshop Silvie will work with porcelain clay, throwing a variety of forms. The pieces will be altered and built upon to demonstrate how she makes pots and thinks about design and function. The workshop will also focus on surface design and embellishment using slip trailing, carving and line drawing. Silvie is deeply engaged in practice of making functional pots and the theater and atmosphere of the dining experience. Silvie states: “I am interested in discussing how we learn techniques, develop ideas and evolve as innovators rather than imitators. Ideas come easily, but meaning seems to come in layers over decades of time. It is meaning that gives strength to good ideas.” Silvie invites participants to bring images of their work for discussion and questions and themes that we might discuss and all benefit from. How we evolve as makers in our increasingly technological world is a favorite topic of mine.\n\nSilvie Granatelli received her BFA from Kansas City Art Institute and her MFA from Montana State University. Since 1982 she has maintained a home and studio in Floyd, Virginia. Granatelli exhibits her work throughout the United States. She is a seasoned workshop presenter and teacher having taught students in colleges and art centers throughout the US and abroad.\n\nPlease take a moment to watch this interview with Silvie that is available on her website:\nhttp://silviegranatelli.com/interview/\nView less", "name": "Ceramics Workshop: Sylvie Granatelli", "date": "2016-10-08T09:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/749295545208940/", "description": "Join us for Intuitives Interactive's 4th Annual FALL HOLISTIC & PSYCHIC EXPO! The largest event of its kind in Michigan! Once again, TWO DAYS LONG! Saturday-Sunday, October 8-9, 2016\n\nLOCATION: \nThe beautiful EMU Student Center\nEastern Michigan University in Ypsilanti (next-door to Ann Arbor)\n900 Oakwood Street, 2nd floor Ballroom and Auditorium \n(ground floor as you enter from the parking lot)\nYpsilanti, MI 48197\n~ TONS of FREE PARKING ~ \n(on Oakwood Street and N. Huron River Drive)\n\nSPONSORED BY: Body Mind Spirit Guide & Body Mind Spirit Radio, Crazy Wisdom Bookstore & Tea Room, and the Enlightened Soul Center\n\n- SATURDAY, OCTOBER 8, 2016 - 10:00 am - 6:00 pm\n      Doors open 9:30 am for registration on Saturday\n- 6 pm Saturday: STAY for the SPECIAL PRESENTATION:\n      International Psychic Medium LORI LIPTEN!!\n- SUNDAY, OCTOBER 9, 2016 - 11:00 am - 5:00 pm\n     Doors open 10:30 am for registration on Sunday\n\n**FIRST 50 PAID ATTENDEES EACH DAY**\nGET A GIFT BAG valued at $20 & CHANCE TO WIN A FULL-LENGTH HEALING or READING!\nEnergy Work/Medical Intuitive Session with Lori Irvin, ZSource\nConnection, OR a Channeled Psychic Reading with Amy Garber, Metafizzy LLC, Show Co-Director; Co-Founder, Intuitives Interactive\n\nThe READER ROOM IS FULL! See the readers who will be in our exclusive quiet, private room with concierge service:\nhttp://www.holisticpsychicexpo.com/readers-1\n\nTO APPLY FOR A BOOTH as a bodyworker, reader, or vendor in the Ballroom: http://www.holisticpsychicexpo.com/#!apply-1/dyc85\nAPPLICATION DEADLINE: September 9\nLate applications will be accepted until we are full, but may not be included in the promotions or handouts.\n\nADMISSION: \n$10 Daily Adult Ticket / $9 Online in advance by Oct. 6\n$15 Adult Weekend Pass / $13 Online in advance by Oct. 6\n$8 College students (daily pass)\n$5 Kids 12-17 yrs / Under 12 free \nPAID ADMISSION includes FREE presentations both days! \n\nADVANCE DISCOUNTED TICKETS ONLINE (thru Oct. 6):\nhttp://www.holisticpsychicexpo.com/#!purchase-tickets/p2a3m\n\n~ FEATURED PRESENTATION ~\nSaturday, October 8, 6:00 PM in the Auditorium:\nMEDIUMSHIP GALLERY READING with\n internationally acclaimed Psychic Medium LORI LIPTEN! \nREADINGS of DEPARTED LOVED ONES for the audience\nand sometimes CELEBRITIES COME THROUGH TOO!\n~ FREE with paid Expo Admission ~\n\nREADINGS: BOTH IN OUR PRIVATE READER ROOM (with Concierge Service and no interruptions) & AROUND THE VENDOR BALLROOM! \nThere will be Mediums, Psychics, Tarot & Angel Card Readers, and Intuitive & Channeled Readings...and more! \nSPECIALTY READINGS: Crystal Ball, Rare Hungarian Gypsy Cards, Runes, Numerology, Psychic Artist, Shamanic Stone Bowl...and more!\nhttp://www.holisticpsychicexpo.com/#!readers-1/xuu0n\nhttp://www.holisticpsychicexpo.com/vendors\n\nOTHER GREAT OFFERINGS INCLUDE: Aura Photography, Pyramids, Body & Energy Workers, Essential Oils, Vendors of Holistic & Metaphysical Products, Crystals & Stones, Jewelry, FREE Yoga Demos, and More!\nhttp://www.holisticpsychicexpo.com/#!vendors/tcvqd\n\nSCHEDULE of PRESENTATIONS free with Expo admisison at:\nhttp://www.holisticpsychicexpo.com/#!presentations/zngx1\n\nVOLUNTEERS NEEDED! Volunteers get special perks in exchange for their dedicated service. SIGN UP NOW at:\nhttp://www.holisticpsychicexpo.com/#!volunteer/glc6s\n\nMAILING LIST: Join our mailing list by filling out the form at:\nhttp://holisticpsychicexpo.com/\n\nThanks and we look forward to seeing YOU and your friends at this transformative event!!!", "name": "4th Fall Holistic & Psychic Expo, Oct. 8-9, 2016", "date": "2016-10-08T10:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1013140175465605/", "description": "Saturday, October 8, 11:15 a.m.–12 p.m. Meet by UMMA Store\r\n\nChildren ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. Meet in front of the UMMA Store.\rStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "name": "Storytime at the Museum", "date": "2016-10-08T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1745138492407150/", "description": "It's Massacre season! #2016Massacre releases in-house on Saturday, October 8th. Mug Club Members get priority four-pack purchasing power beginning at noon with general public sales opening up at 1 pm. Live music in the afternoon, extra heated seating on the patio, specially dosed casks of Massacre for your tasting pleasure, and giveaways during halftime of the night game v. Rutgers! Don't miss this party!", "name": "2016 Massacre Release Party", "date": "2016-10-08T12:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/257650911286915/", "description": "Stewardship Workday\nSaturday, October 8\nOakwoods Nature Area\n1 to 4 p.m.\nThis oak-hickory woodland includes a small pond and wetland, which are great spots for bird watching or listening for frog calls. We’ll be cutting and removing invasive shrubs such as buckthorn and honeysuckle to improve the habitat. Please meet at the park entrance off of Dunwoodie Road. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Stewardship Workday-Oakwoods Nature Area", "date": "2016-10-08T13:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/313004762411037/", "description": "LSNC is turning 30 this year, and you’re invited to our birthday party! Hike, play, make a birthday card for LSNC, and more with friends and family at this blow-out bash. Visit our raptors and enjoy live animal demonstrations, explore the Critter House, relax by the camp fire, or tie dye your own LSNC shirt. We encourage attendees to wear their LSNC gear and to bring photos or share memories of their favorite LSNC moment on our memory wall!\n\nDon’t worry about dinner plans, instead try out a food truck! Shimmy Shack will be providing vegan and vegetarian options while Hero or Villain will be cooking up awesome sandwiches. Be sure to arrive by 6, to sing “Happy Birthday” and enjoy cupcakes, don’t be late!\n\nWant to buy us a birthday present? Visit www.lesliesnc.org/celebrate30 for ideas and to register!", "name": "LSNC's 30th Birthday Party", "date": "2016-10-08T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1790543537848554/", "description": "Robert Lopez is the author of two novels, 'Part of the World' and 'Kamby Bolongo Mean River', and two story collections, 'Asunder' and 'Good People'. A new novel, All Back Full, will be published by Dzanc Books in February, 2017. He teaches at Pratt Institute, The New School, and Columbia University.\n\nSamuel Ligon is the author of two novels—'Among the Dead' and 'Dreaming and Safe in Heaven Dead'—and two collections of stories, 'Wonderland', illustrated by Stephen Knezovich, and 'Drift and Swerve'. He edits the journal Willow Springs, teaches at Eastern Washington University, and is Artistic Director of the Port Townsend Writers’ Conference.", "name": "Robert Lopez and Samuel Ligon Discussion & Signing", "date": "2016-10-08T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/524013431141295/", "description": "Another fall season arrives not only with crisp air and beautiful weather, but also ABC's much anticipated festival, Oktoberfest. A celebration of beers, brats and Leiderhosen. \nWe're once again closing off the street and putting up the beer tents for our annual Oktoberfest street party! Join us at the corner of Main and Washington to enjoy a cool autumn evening under the stars with beer, brats, music, and dancing.\n(Parking available at the 4th and Washington parking structure) \n\n* 5-12 Saturday\n* We're shaking things up for 2016 and are excited to announce that Saturday night's headlining band is our local favorite, Third Coast Kings!\n\nHailing from the Metro Detroit area in southeast Michigan, Third Coast Kings are a deep funk and heavy soul outfit that brings back the era of music one can only find on dusty old 45 records. Right from the beginning in 2007 the band delved into the old, funky catalog of vinyl records that DJ's and beat makers were using to get crowds moving. Over the years they have refined this sound into their own unique blend of the old and the new\n\n* No cover. \n* Must be 21 with valid ID. Children welcome with parents. \n* Brats, veggie brats, chips, pretzels, beer, wine, and soda will be available for purchase. \n* Call Beth at 734-213-1393 for more information.", "name": "Oktoberfest - Saturday", "date": "2016-10-08T17:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1676692335988216/", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "name": "Maker Space Operations Bootcamp", "date": "2016-10-09T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1737852759803500/", "description": "Stewardship Workday\nSaturday, October 8\nMarshall Nature Area\n9 a.m. to noon\nThis large nature area, which extends into a county park and University of Michigan property, is a valuable piece of wildlife habitat in the northeast part of the city. Come out to help us improve the habitat by removing invasive buckthorn and honeysuckle. This amazing nature area is sure to provide an incredible outdoor experience. Meet in the parking lot off Dixboro Road, north of Plymouth Road.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Stewardship Workday-Marshall Nature Area", "date": "2016-10-09T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1579703035671405/", "description": "Sylvie Granatelli Workshop\nSaturday, October 8 – Sunday, October 9 \n9:30am-4:30pm\n\nIn this two day demonstration workshop Silvie will work with porcelain clay, throwing a variety of forms. The pieces will be altered and built upon to demonstrate how she makes pots and thinks about design and function. The workshop will also focus on surface design and embellishment using slip trailing, carving and line drawing. Silvie is deeply engaged in practice of making functional pots and the theater and atmosphere of the dining experience. Silvie states: “I am interested in discussing how we learn techniques, develop ideas and evolve as innovators rather than imitators. Ideas come easily, but meaning seems to come in layers over decades of time. It is meaning that gives strength to good ideas.” Silvie invites participants to bring images of their work for discussion and questions and themes that we might discuss and all benefit from. How we evolve as makers in our increasingly technological world is a favorite topic of mine.\n\nSilvie Granatelli received her BFA from Kansas City Art Institute and her MFA from Montana State University. Since 1982 she has maintained a home and studio in Floyd, Virginia. Granatelli exhibits her work throughout the United States. She is a seasoned workshop presenter and teacher having taught students in colleges and art centers throughout the US and abroad.\n\nPlease take a moment to watch this interview with Silvie that is available on her website:\nhttp://silviegranatelli.com/interview/\nView less", "name": "Ceramics Workshop: Sylvie Granatelli", "date": "2016-10-09T09:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/867216546711499/", "description": "Sunday, October 9, 10 a.m.–12 p.m. Starting Location: UMMA Store\r\n\nOn Sunday, October 9, UMMA will open from 10 a.m.–12 p.m. exclusively for a FREE ASD friendly program allowing families to enjoy art in a fun and welcoming atmosphere. Families will have access to special hands-on activities in the galleries that will help encourage exploration and discovery. Sketching and or writing materials will be available for children who prefer to work independently.\r\n\nThe Museum will also offer sunglasses, noise reducing earmuffs, and a quiet area with tactile toys for families who need to step away from the activities for a bit.\rThis event is recommended for ages 5-18, however all are welcome to participate. Registration is required and opens one month before the event date.\r\n\nVisit myturn.eventbrite.com to register!\rFor more information, please go to www.myturncommunity.org or call 734-647-0522.\r\n\n\"My Turn\" programs are coordinated by the Ann Arbor Hands-On Museum and take place on second Sundays throughout the year.", "name": "My Turn Special ASD Access Hours", "date": "2016-10-09T10:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/749295545208940/", "description": "Join us for Intuitives Interactive's 4th Annual FALL HOLISTIC & PSYCHIC EXPO! The largest event of its kind in Michigan! Once again, TWO DAYS LONG! Saturday-Sunday, October 8-9, 2016\n\nLOCATION: \nThe beautiful EMU Student Center\nEastern Michigan University in Ypsilanti (next-door to Ann Arbor)\n900 Oakwood Street, 2nd floor Ballroom and Auditorium \n(ground floor as you enter from the parking lot)\nYpsilanti, MI 48197\n~ TONS of FREE PARKING ~ \n(on Oakwood Street and N. Huron River Drive)\n\nSPONSORED BY: Body Mind Spirit Guide & Body Mind Spirit Radio, Crazy Wisdom Bookstore & Tea Room, and the Enlightened Soul Center\n\n- SATURDAY, OCTOBER 8, 2016 - 10:00 am - 6:00 pm\n      Doors open 9:30 am for registration on Saturday\n- 6 pm Saturday: STAY for the SPECIAL PRESENTATION:\n      International Psychic Medium LORI LIPTEN!!\n- SUNDAY, OCTOBER 9, 2016 - 11:00 am - 5:00 pm\n     Doors open 10:30 am for registration on Sunday\n\n**FIRST 50 PAID ATTENDEES EACH DAY**\nGET A GIFT BAG valued at $20 & CHANCE TO WIN A FULL-LENGTH HEALING or READING!\nEnergy Work/Medical Intuitive Session with Lori Irvin, ZSource\nConnection, OR a Channeled Psychic Reading with Amy Garber, Metafizzy LLC, Show Co-Director; Co-Founder, Intuitives Interactive\n\nThe READER ROOM IS FULL! See the readers who will be in our exclusive quiet, private room with concierge service:\nhttp://www.holisticpsychicexpo.com/readers-1\n\nTO APPLY FOR A BOOTH as a bodyworker, reader, or vendor in the Ballroom: http://www.holisticpsychicexpo.com/#!apply-1/dyc85\nAPPLICATION DEADLINE: September 9\nLate applications will be accepted until we are full, but may not be included in the promotions or handouts.\n\nADMISSION: \n$10 Daily Adult Ticket / $9 Online in advance by Oct. 6\n$15 Adult Weekend Pass / $13 Online in advance by Oct. 6\n$8 College students (daily pass)\n$5 Kids 12-17 yrs / Under 12 free \nPAID ADMISSION includes FREE presentations both days! \n\nADVANCE DISCOUNTED TICKETS ONLINE (thru Oct. 6):\nhttp://www.holisticpsychicexpo.com/#!purchase-tickets/p2a3m\n\n~ FEATURED PRESENTATION ~\nSaturday, October 8, 6:00 PM in the Auditorium:\nMEDIUMSHIP GALLERY READING with\n internationally acclaimed Psychic Medium LORI LIPTEN! \nREADINGS of DEPARTED LOVED ONES for the audience\nand sometimes CELEBRITIES COME THROUGH TOO!\n~ FREE with paid Expo Admission ~\n\nREADINGS: BOTH IN OUR PRIVATE READER ROOM (with Concierge Service and no interruptions) & AROUND THE VENDOR BALLROOM! \nThere will be Mediums, Psychics, Tarot & Angel Card Readers, and Intuitive & Channeled Readings...and more! \nSPECIALTY READINGS: Crystal Ball, Rare Hungarian Gypsy Cards, Runes, Numerology, Psychic Artist, Shamanic Stone Bowl...and more!\nhttp://www.holisticpsychicexpo.com/#!readers-1/xuu0n\nhttp://www.holisticpsychicexpo.com/vendors\n\nOTHER GREAT OFFERINGS INCLUDE: Aura Photography, Pyramids, Body & Energy Workers, Essential Oils, Vendors of Holistic & Metaphysical Products, Crystals & Stones, Jewelry, FREE Yoga Demos, and More!\nhttp://www.holisticpsychicexpo.com/#!vendors/tcvqd\n\nSCHEDULE of PRESENTATIONS free with Expo admisison at:\nhttp://www.holisticpsychicexpo.com/#!presentations/zngx1\n\nVOLUNTEERS NEEDED! Volunteers get special perks in exchange for their dedicated service. SIGN UP NOW at:\nhttp://www.holisticpsychicexpo.com/#!volunteer/glc6s\n\nMAILING LIST: Join our mailing list by filling out the form at:\nhttp://holisticpsychicexpo.com/\n\nThanks and we look forward to seeing YOU and your friends at this transformative event!!!", "name": "4th Fall Holistic & Psychic Expo, Oct. 8-9, 2016", "date": "2016-10-09T10:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1013140175465605/", "description": "Saturday, October 8, 11:15 a.m.–12 p.m. Meet by UMMA Store\r\n\nChildren ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. Meet in front of the UMMA Store.\rStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "name": "Storytime at the Museum", "date": "2016-10-09T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1362411323773466/", "description": "Stewardship Workday\nSunday, October 9\nMary Beth Doyle Park\n1 to 4 p.m. \nThe 81 acres of Mary Beth Doyle Park include a nature area, disc golf course, playground and a storm water retention pond. Help us manage the nature area and improve wildlife habitat by gathering and dispersing seeds and removing invasive shrubs like honeysuckle and buckthorn. Please meet at the park entrance at the end of Verle Avenue. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Stewardship Workday- Mary Beth Doyle Park", "date": "2016-10-09T13:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1820337424868650/", "description": "http://bit.ly/2b6eyb1\n\nJonathan Rudinger, RN LMT has been instrumental in developing the field of canine massage for people at home and PetMassageTM at the professional level since the mid-1990’s. PetMassage workshops draw students from all over the worlds.  Jonathan has authored several books and DVD’s and taught over 300 professional level canine massage workshops. \n\nJonathan is often called upon for interviews in national media, invited to lecture about canine massage, and is recognized as a lobbyist supporting the rights for animal massage practitioners to practice legally. Recognized as an authority on massage for dogs, he has been featured in Whole Dog Journal, Dog Fancy Magazine, Natural Dog, Cosmopolitan, AARP, Glamour, Massage Magazine, Animal Wellness Magazine, Massage Today, Massage Therapy Journal, the New York Times and Wall Street Journal.  Jonathan has given live demonstrations at human massage, dog training, and veterinary conferences, at the Westminster Dog Show in New York and Crufts in the United Kingdom.\n\nJonathan's vision for the canine massage industry expands beyond this school. He is the founder and president of the International Association of Animal Massage and Bodywork. www.iaamb.org.", "name": "Art & Essence of Canine Massage Disccusion w/Demos", "date": "2016-10-09T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/531633113686471/", "description": "Reggae Workers of the World\nhttps://www.facebook.com/ReggaeWorkers/?fref=ts\n Vic Ruggiero ( The Slackers), Jesse Wagnerr ( The Aggrolites) and Nico Leonard ( Moon Invaders and The Caroloregians)\n\nDirty Notion\n https://www.facebook.com/DirtyNotion/?fref=ts\n$8\n \nmore tba", "name": "Reggae Workers of the World / Dirty Notion( Scarboni's B Day )", "date": "2016-10-09T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/211863422564969/", "description": "SIGN UP via Eventbrite: http://comeouttotheraces.eventbrite.com\n\nOut In Public (OIP), the Gerald R. Ford School of Public Policy’s LGBTQ+ student organization, presents “Come Out to the Races!” Ann Arbor’s first Drag Queen Race. Co-sponsored by the Jim Toy Community Center (JTCC), the race will be held on National Coming Out Day (NCOD), October 11, 2016 at the University of Michigan’s Diag from 6:00pm to 8:30pm. Founded in 1988, NCOD is an annual LGBTQ awareness day premised on the idea that the act of “coming out,” or the voluntary self-disclosure of one’s sexuality or gender identity is an act of both personal and political activism. The experience of disclosure contributes to eliminating homophobia by promoting openness and understanding over silence and ignorance. In other words, communities are more likely to support LGBTQ-empowering laws if they know someone who identifies as LGBTQ. \n\nThe NCOD event is inspired by the 17th Street High Heel Drag Race, an annual costumed race in Washington, DC that has attracted over 100,000 spectators for the last 26 years. Drag, as a form of expression wherein a person dresses and acts with exaggerated feminine features, is widely considered to be one of the most visible representations of queer culture. \n\nELIGIBILITY - The event is free and open to the public. Participation in the event as an individual dressed in drag is contingent on the completion of an application and a signed waiver form. Persons who dress in drag are not required to participate in the race. The race, however, will be open only to those who dress in drag. Everyone is welcome to join us as avid and supportive spectators!\n\n6:00pm - Pre-Race Events. Two hours prior to the race, those who dressed in drag have the opportunity to parade around in the Diag and showcase their outfits. In addition to the parade, campus and community groups will be tabling in the Diag, so that students and community members can be informed about the litany of organizations that support LGBTQ+ rights. \n\n7:30pm - Grand Marshal’s Remarks. Mr. Jim Toy, Founder of the JTCC will be our Grand Marshal. He will provide brief opening remarks in the Diag on why the act of coming out is important and still matters. Then, he will escort the racers to the starting line and will hand over the mic to the emcee prior to the start of the race. \n\n8:00pm – Drag Queen Race. The emcee will start the race by blowing a horn to signal the start. The top three winners will each receive a medal to commemorate their victory. \n\n8:30pm – Post-Race Social. While the venue is yet to be determined, there will be a social event after the race at a bar in Ann Arbor.\n\nFor inspiration on the drag queen race, check out these photos:\n\n2013 DC High Heel Race (http://brightestyoungthings.com/articles/photos-high-heel-race-2013)\n\n2014 DC High Heel Race (http://brightestyoungthings.com/articles/photos-high-heel-race-on-17th-street-2014)\n\n2015 DC High Heel Race (http://www.washingtonblade.com/2015/10/29/photos-high-heel-race/)", "name": "Come Out to the Races! A Drag Queen Race on NCOD.", "date": "2016-10-11T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1236019013104688/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nAndrew Langdon Brown, Guitar player and songwriter from Appleseed Collective was born the son of a Motown session musician. After a brief trip to New Orleans as a teenager he became obsessed with fusing an eclectic blend of pre-World-War II american roots music, bluegrass and jazz with modern and genre bending, and poetic songwriting. \n\nNew a cover\nAlways a good time", "name": "Acoustic Tuesdays: Andrew Langdon Brown", "date": "2016-10-11T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1796364493915407/", "description": "Literati is pleased to welcome Alexander Maksik in support of his most recent novel, Shelter in Place. Alexander will be joined in conversation by Natalie Bakopoulos, author of The Green Shore.\n\nSet in the Pacific Northwest in the jittery, jacked-up early 1990s, Shelter in Place, by one of America’s most thrillingly defiant contemporary authors, is a stylish literary novel about the hereditary nature of mental illness, the fleeting intensity of youth, the obligations of family, and the dramatic consequences of love.\n\nJoseph March, a twenty-one-year-old working class kid from Seattle, has just graduated from college and his future beckons, unencumbered, limitless, magnificent. Joe’s life implodes when he starts to suffer the symptoms of bipolar disorder, and, not long after, his mother, Anne-Marie March, beats a stranger to death with a hammer.\n\nJoe moves to White Pine, Washington, where Anne-Marie is serving time and his father has set up house. He is followed by Tess Wolff, a fiercely independent woman with whom he is in love. Meanwhile, Joe’s mother is gradually being transformed into a national heroine. Many see her crime as a furious, exasperated act of righteous rebellion. Tess, too, is under her spell. Spurred on by Anne-Marie’s example, she enlists Joe in a secret, violent plan that will forever change their lives.\n\nMaksik sings of modern America’s battered soul and of the lacerating emotions that make us human. Magnetic and masterfully told, Shelter in Place is about the things we are willing to die for, and those we’re willing to kill for.\n\n\"Alexander Maksik’s riveting and disturbing novel Shelter in Place is a totally original exploration of mental illness, sexual politics, family and violence.\" --The Guardian. \n\n\"Alexander Maksik covers fresh ground with each new work. In poetic bursts…he captures [his characters’] inner convulsions while exploring the passions that can drive, and destroy, us.\"--Vanity Fair\n\nAlexander Maksik is the author of three novels: You Deserve Nothing; A Marker to Measure Drift, which was named a New York Times Notable Book and a finalist for both the William Saroyan Prize and Le Prix du Meilleur Livre Étranger; and the forthcoming Shelter in Place, due out in September. A contributing editor at Condé Nast Traveler, his writing has appeared, or is forthcoming, in Best American Nonrequired Reading, Harper’s, Tin House, Harvard Review, The New York Times Book Review, The New York Times Magazine, The Atlantic, Salon and Narrative Magazine, among other publications. Maksik is the recipient of a 2015 Pushcart Prize, as well as fellowships from the Truman Capote Literary Trust and The Corporation of Yaddo. He is the co-artistic director of the Can Cab Literary Residence in Catalonia, Spain and his work has been translated into more than a dozen languages. \n\n \n\nEvent date: \nTuesday, October 11, 2016 - 7:00pm", "name": "Alexander Maksik, with Natalie Bakopoulos", "date": "2016-10-11T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/603317689846712/", "description": "Tue. October 11 | 8pm | 18+ | $15 Cover\n\nann arbor's 107one presents: The Record Company\nwith special guest: The Suitcase Junket\n\nL.A.-based buzz band The Record Company has signed with Concord Music Group, which released its debut album Give It Back to You on February 12, 2016.", "name": "The Record Company 10/11/16 at Blind Pig - Ann Arbor", "date": "2016-10-11T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1482591518434511/", "description": "Literati is thrilled to welcome Bonnie Jo Campbell, Jaimy Gordon, and Andy Mozina to read from their most recent work. \n\nBonnie Jo Campbell teaches in the low-residency MFA program at Pacific University and lives in Kalamazoo, Michigan. She is the author of Once Upon a River, American Salvage (a finalist for the National Book Award and National Book Critics Circle Award), Q Road, Women and Other Animals, and, most recently, Mothers, Tell Your Daughters.\n\nJaimy Gordon lives in Kalamazoo, Michigan. She is the author of Bogeywoman, She Drove Without Stopping, the novella Circumspections from an Equestrian Statue, and the fantasy classic novel Shamp of the City-Solo. Her fourth novel, Lord of Misrule, won the National Book Award. Gordon teaches at Western Michigan University in Kalamazoo and in the Prague Summer Program for Writers.\n\nAndy Mozina is a professor of English at Kalamazoo College and the author of the novel Contrary Motion, short story collections The Women Were Leaving the Men, which won the Great Lakes Colleges Association New Writers Award, and Quality Snacks, which was a finalist for the Flannery O’Connor Prize. His fiction has also appeared in numerous magazines, including Tin House and McSweeney’s. \n\nEvent date: \nWednesday, October 12, 2016 - 7:00pm", "name": "Bonnie Jo Campbell, Jaimy Gordon, Andy Mozina", "date": "2016-10-12T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1676692335988216/", "description": "Maker Works’ Makerspace Operations Bootcamp puts you in the middle of an established makerspace for a five-day inspiring deep-dive into the tools for running a sustainable makerspace. You have a space, you have some tools–now what? How do you keep members and tools safe? How do you instruct? What things need to happen every day to help you meet your vision? And by the way, what is that vision?\n\nOwners Tom Root and Dale Grover, along with Maker Works staff, will share the tools they use to run a makerspace. Topics include:\n\n- Documents that guide your business\n- Operational tools for efficiency and safety\n- Creating and sustaining your culture\n- Providing great service\n- Leadership and management\n- The four value propositions of your makerspace\n- Developing classes and other programming\n- How to instruct\n\nThe Operations Bootcamp includes a tour of Zingerman's Mail Order facilities, a reception on Monday night at Zingerman's Roadhouse restaurant, and a lunch at Zingerman's Delicatessen on Friday. \n\nAttendees will also leave with copies of Jack Stack's The Great Game of Business and Ari Weinzweig's Zingerman's Guide to Good Leading, Part 1: A Lapsed Anarchist's Approach to Building a Great Business.", "name": "Maker Space Operations Bootcamp", "date": "2016-10-13T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/585713071616738/", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "name": "POP-X", "date": "2016-10-13T12:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/682992351874453/", "description": "Free and open to the public. Seating is first come, first serve.\nC. Dale Young practices medicine full-time and teaches in the Warren Wilson College MFA Program for Writers. He is the author of The Day Underneath the Day (TriQuarterlyBooks, 2001), The Second Person (Four Way Books, 2007), Torn (Four Way Books, 2011) and The Halo (Four Way Books, 2016). He is a previous winner of the Grolier Prize, both the Stanley P. Young Fellowship, and Amanda Davis Fellowship from the Bread Loaf Writers' Conference, and has received fellowships from the National Endowment for the Arts, the John Simon Guggenheim Memorial Foundation, and the Rockefeller Foundation. He lives in San Francisco with the biologist and composer, Jacob Bertrand, his spouse.", "name": "Zell Visiting Writers Series: C. Dale Young Poetry Reading", "date": "2016-10-13T17:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/307711412942024/", "description": "Thursday, October 13, 5:30–6:30 p.m.\n\rHelmut Stern Auditorium\n\nC. Dale Young practices medicine full-time and teaches in the Warren Wilson College MFA Program for Writers. He is the author of The Day Underneath the Day (TriQuarterlyBooks, 2001), The Second Person (Four Way Books, 2007), Torn (Four Way Books, 2011)\rand The Halo(Four Way Books, 2016). He is a previous winner of the Grolier Prize, both the Stanley P. Young Fellowship, and Amanda Davis Fellowship from the Bread Loaf Writers' Conference, and has received fellowships from the National Endowment for the Arts, the John Simon Guggenheim Memorial Foundation, and the Rockefeller Foundation. He lives in San Francisco with the biologist and composer, Jacob Bertrand, his spouse.\rUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. \n\nThe Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please\rsee lsa.umich.edu/writers/readingsevents/zellvisitingwritersseries.", "name": "Zell Visiting Writers Series: C. Dale Young Poetry", "date": "2016-10-13T17:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/176492989455246/", "description": "It's time to have some fun! Join Americas Favorite Dragapella Beautyshop Quartet... The Kinsey Sicks! Performing their hilarious show... Electile Disfunction. It's just in time to throw some shade on this year's Presidential election. All door profits will go to Jim Toy Community Center & other local LGBTQ groups in Washtenaw County. \n\nCheck out the Kinsey Sicks as seen on CNN http://cnn.it/213rP90\n\nDoors at 7pm\nShow at 8pm\nAfter Party at 9:30pm\n\nTickets range from $10-$40 per ticket for the show. After Party $5\n\nhttp://www.kinseysicks.com\nhttps://www.necto.com\njim toy community center", "name": "The Kinsey Sicks : Electile Dysfunction Benefit", "date": "2016-10-13T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1669128173412136/", "description": "Public Meeting – Controlled Ecological Burn Program\nThursday, October 13\nNAP Office, 3875 East Huron River Drive \n7 to 8:30 p.m.\nFire is used as a restoration tool in many of Ann Arbor’s natural areas. This meeting provides information and an opportunity for discussion about NAP’s Controlled Ecological Burn Program. This is the perfect opportunity to ask questions, learn more about the ecological benefits of burning, and hear about the specifics of effectively and safely using fire as a restoration tool. Burns are conducted in city parks throughout the spring and fall.", "name": "Public Meeting-controlled Ecological Burn Program", "date": "2016-10-13T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/164162377361016/", "description": "Dawn Richberg was born in Philadelphia but as an Army brat lived all across the United States. Her favorite tours of duty were Ft. Wainwright, Alaska and Ft. Ord, California. Dawn loves the power of the written word in changing lives. She is in the midst of living out the portion of the Holstee Manifesto that says “This is your life. Do what you love and do it often\" and is currently working on a new chapbook of poems about teaching and transformation.\n\nThe event begins with an Open Mic session when area poets can read their own work or share a favorite poem by another author in a welcoming atmosphere. \n\nAfter Open Mic, we will hear from our featured poet Dawn Richberg followed by a signing. In partnership with Les Go Social MM&T.\n\nThis is a monthly poetry series held on the second Thursday of most months at 7pm.", "name": "Open Mic & Share Poetry Series feat Dawn Richberg", "date": "2016-10-13T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/977255609064551/", "description": "Join us on Friday, October 14th, from 6:00 to 9:00PM for the Opening Reception of our 94th Annual All Media Exhibition.\n\nThis event is FREE and open to the public.\n\nEstablished in 1922, the Annual All Media Exhibition at The Ann Arbor Art Center has a long and rich history. This show highlights artists from all over the country working in any media.\n\nAbout the Juror: \n\nPaul Kotula is currently an Associate Professor of Ceramics at Michigan State University and has also worked as a gallery director for Pewabic Pottery, Swidler Gallery, REVOLUTION (Detroit and New York) and Paul Kotula projects. Working with an international list of artists, he has formed over 200 solo and group exhibitions pertinent to the field of contemporary art and visual culture.\n\nImage Credit: Free Wet Hugz, by Analicia Honkanen (Berkley, MI)\n\nFor more information about our 94th Annual All Media Exhibition, go here: https://goo.gl/VVlfvi \n-----------\nThe 117 Gallery 2016/ 2017 season is generously supported by Vintage Financial Services LLC.", "name": "94th Annual All Media Opening Reception", "date": "2016-10-14T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/845428365593328/", "description": "Literati is pleased to welcome Jordan Zandi, reading from his collection Solarium. UM Zell Fellows in Poetry Amanda Rybin Koob and Hannah Webster will also read.\n\n\"Solarium is a completely original gem of a book. I have never met Jordan Zandi, but I would like to, for there is a sweet spirit haunting his guileless poems. His inner world is always interacting with the outer world, and as a result everything seems to be shining. 'Walking across the binary field, / what does the young man see?' Zandi asks, searching for signs with his subtle eyes. The answer seems to be the great opium of simply being content within oneself—with a heart that receives and watches (if a heart watches), while resisting the systems that hurt us—and remaining awake to experience.\"—Henri Cole, from the Foreword  \n\nJordan Zandi is the author of Solarium (Sarabande Books), which was chosen by Henri Cole as the winner of the Kathryn A. Morton Prize. The New Yorker named it one of the twelve best poetry-related books of 2015, calling it, \"A first book made eventful by the weirdness and clarity of Zandi's mind.\" He holds an M.F.A. in poetry from Boston University, where he was an Elizabeth Leonard Fellow and a Robert Pinsky Global Fellow to Bolivia, and his poems have appeared in The New Republic, Little Star, and Verse Daily, among others. He is founder and co-editor of Prodigal, an independent print and online journal of poetry and prose and currently lives in Indianapolis with his wife and their two rabbits.  \n\nEvent date: \nFriday, October 14, 2016 - 7:00pm", "name": "Poetry at Literati: Jordan Zandi", "date": "2016-10-14T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/541805179338204/", "description": "Ride the Poto, backwards, at night! The ride will be staging at the Silver Lake Parking lot. Arrive at 7:00pm and ride at 7:30pm. We will have a first group of faster riders doing the full loop, and a second group of \"normal\" riders doing part of the trail. After the ride, we will have a campfire and typically riders bring food to share. Come out and ride the Poto backwards with lights!\n\nWhat you should bring:\n 1. light\n 2. back-up light\n 3. cell phone\n 4. trail map, tools, survival gear (just kidding - no man left behind!)\n 5. food/beverages/change of clothes for post ride", "name": "Batman Ride", "date": "2016-10-14T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/545589118960465/", "description": "Join Kerrytown Concert House as we celebrate the lead-up to the 20th anniversary of our avant-garde jazz festival Edgefest (October 26-29) with a series of free concerts throughout Ann Arbor!\n\nGunwale matches veteran Chicago saxophonist Dave Rempis up with two of the up-and-coming stars from the next generation of Chicago improvisers. Ryan Packard is known mostly for his extensive work as a composer and percussionist within the thriving contemporary classical scene in Chicago, while Albert Wildeman has achieved fame for his meteoric rise from novice instrumentalist to one of the busiest players in town after relocating to Chicago from the Netherlands in 2011 to immerse himself in the city’s broad-shouldered music world. These two contribute noticeably fresh perspectives to this ongoing and ever-evolving local dialogue, a world of which Rempis has been a flagship member for almost two decades. As a trio, their voice carries a unique shape, combining a love for full-on blasts of energy with a sensitivity to the smallest details, resulting in music that can be a freight train one moment, and an insectoid microcosm the next. The band released their first recording, Polynya, on Aerophonic Records in the summer of 2016, and is on tour throughout North America this fall.\n\nThis performance is made possible through the generous sponsorship of The Maxine and Stuart Frankel Foundation in honor of Maurice and Linda Binkow on the occasion of her 80th birthday and their 60th wedding anniversary. Additional support for this performance is provided by Encore Records. \n \nThis concert is a part of the Warming Up The Edge series leading up to Kerrytown Concert House's Edgefest festival of creative music in celebration of the festival's 20th anniversary.", "name": "Dave Rempis's Gunwale at Encore | Warming Up the Edge Series", "date": "2016-10-14T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/197527007266742/", "description": "While Americana folk singer/songwriter Laurie McClain accompanies herself expressively on guitar, ukulele and harmonica, her honey voice soothes and her powerful lyrics heal bruised hearts. Reminiscent of 60s/70s folk, her music is predominantly folk/alternative country with a touch of the blues woven through. She brings passion and humor to the stage, performing original songs as well as unique covers of other excellent songwriters' gems. Her song, \"My Heaven\" is a favorite of listeners of folk radio programs around the world. In 2003 Laurie released The Trumpet Vine: A Tribute To Kate Wolf, a collection of her loving interpretations of the late songstress's works. Her latest CD is Ascend. www.lauriemcclain.com", "name": "Laurie McClain at Green Wood Coffee House", "date": "2016-10-14T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/524849711054672/", "description": "Fri. October 14 | 9pm | 18+ | $10 Cover\n\nBroccoli Samurai with Everyday Junior\n\nSince forming in the Rustbelt of Cleveland, OH in 2010, Broccoli Samurai has been taking the club and festival scene by storm. The band's synth-laden, drum and bass influenced, progressive electronica has been thrilling audiences throughout the Midwest, Mid-Atlantic, and Northeast markets, winning them a massive and fiercely loyal fanbase. Eager fans pack dance floors and late-night festival sets with smiles across their faces, waiting to get lost in the band's ambient soundscapes, anticipating every bass drop that will force them to move with reckless abandon. Broccoli Samurai's line-up includes founding members Ryan \"Bruce\" Hodson on keys and synth, and Chris Walker on drums and percussion. Accomplished bassist Zachary Wolfe Nagi-Schehl anchors the rhythm section, while guitarist Michael Vincent weaves in and out, exploring new sonic territory.\n\nThe band has played countless festivals such as The Werk Out, BIG What?!, Domefest, Paradise Music and Art Festival, Rootwire, The Mad Tea Party Jam, The Ville, SummerDance, Disc Jam, Night Lights Fall Music Festival, The Gathering At Chaffee's, Utica Music and Art Festival, and Hyperion Fest. Broccoli Samurai has directly supported and toured with many known bands including Dopapod, Papadosio, Lotus, Conspirator, The Werks, Ozric Tentacles, BoomBOX, Big Gigantic, Rusted Root, O.A.R., Pigeons Playing Ping Pong, Aqueous, and BIG Something. Broccoli Samurai's extensive tour schedule has them playing high profile venues and major cities regularly, and the band will be increasing the number of performances and expanding their reach into the West Coast and Southern markets in 2015. This band is making big moves and the time to take notice is now.", "name": "Broccoli Samurai w/ Everyday Junior 10/14/16 at Blind Pig - Ann Arbor", "date": "2016-10-14T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1817159135181775/", "description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNow with spooky campfire stories!\n\nNo two shows are the same!", "name": "A Pointless Display of Improvised Feats", "date": "2016-10-14T22:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/117231922047585/", "description": "Stewardship Workday\nSaturday, October 15\nScarlett Mitchell Nature Area\n9 a.m. to noon\nCome help preserve the mature oak hickory woodland in this diverse natural area. Scarlett Mitchell Nature Area gets used regularly by both neighbors and students at Mitchell Elementary and Scarlett Middle Schools. We will be cutting and removing invasive shrubs like honeysuckle and buckthorn to maintain this quality woodland. Meet at the park entrance near Scarlett Middle School. The school parking lot is off of Lorraine Street.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "name": "Stewardship Workday-Scarlett Mitchell Nature Area", "date": "2016-10-15T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1870999519787881/", "description": "October 15, 2016–January 29, 2017\n\nVisually stunning, thought-provoking, and wide-ranging, Europe on Paper: The Ernst Pulgram and Frances McSparran Collection features 47 works on paper—drawings, prints, and watercolors from the eighteenth to the twentieth century—that focus on the expressive capacities of line and its ability to articulate the seen and unseen. Showcased are some important twentieth-century Austrian and German expressionist artists, including Gustav Klimt, Egon Schiele, Ernst Kirchner, and Oskar Kokoschka, who paved the way for future generations of the avant-garde, and the Italian Giovanni Battista Piranesi, one of the most inventive draftsmen and printmakers of the eighteenth century. The works in this multi- faceted collection capture artistic compulsions and creative responses to the physical and spiritual world, from tangled, emotionally embroiled nudes to meticulous landscapes and architectural vistas. This exemplary gift from late U-M professor emeritus Ernst Pulgram and his wife, associate professor emerita and chief editor of the Middle English Compendium, Frances McSparran, offers a glimpse into the rich history of European graphic art.\n\n\rLead support for this exhibition is provided by the Richard and Rosann Noel Endowment Fund. Additional generous support is provided by the University of Michigan Department of English Language and Literature and Department of Romance Languages and Literatures.", "name": "Europe on Paper: The Ernst Pulgram and Frances McSparran Collect", "date": "2016-10-15T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/942422309235271/", "description": "October 15, 2016–January 29, 2017\n\nKabuki actors were superstars in eighteenth- and nineteenth-century Japan. They were admired by passionate fans with an insatiable appetite for images of them, fed by a publishing industry that mass-produced colorful woodblock prints of actors on stage that could be cheaply purchased as souvenirs of or substitutes for a theater experience. Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art presents a selection of these dramatic prints that connected fans to their idols, including off- or backstage portrayals that satisfied fans’ voyeuristic curiosity about their favorite actors’ lives, fantasy scenes of actors in unlikely groupings, and even death portraits of especially famous actors. \n\nThis introduction to the visual culture \rkabuki theater includes prints by major artists such as Utagawa Toyokuni (1769–1825), Utagawa Kunisada (1786–1865), Utagawa Kuniyoshi (1797–1861), and Toyohara Kunichika (1835–1900).\rLead support for this exhibition is provided by the University of Michigan Office of the Provost, the National Endowment for the Arts, the William T. and Dora G. Hunter Endowment, AISIN, the E. Rhodes and Leona B. Carpenter Foundation, and the University of Michigan Center for Japanese Studies. Additional generous support is provided by the Japan Foundation and the University of Michigan Institute for Research on Women and Gender.", "name": "Japanese Prints of Kabuki Theater from the Collection", "date": "2016-10-15T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1170840429655142/", "description": "The Potawatomi Mountain Biking Association is excited to welcome a new trail system into our chapter. Join us for a group ride and tour at Heritage Park on Saturday, October 15, 2016. \n\nHeritage Park is located at 322 N Adrian Hwy, in Adrian. \n\nMeet Saturday morning at the main trail head in the back of the park at 11:00 am for a meet and greet, info session, and tour/ride. \n\nLunch/Dinner will follow at Fiesta Ranchera – 1675 E. US Highway 223, Adrian.\n\nAfter dinner beers at Cotton Brewing (optional) – 625 Oak St, Adrian.\n\nStay the weekend and camp with us! Camping will be at W.J. Hayes State Park (24 min from Heritage Park) - 1220 Wamplers Lake Rd, Onsted.", "name": "Heritage Park Group Ride and Tour", "date": "2016-10-15T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/312694725769282/", "description": "In this kid friendly workshop you will build a birdhouse suitable for chickadees, nuthatches, downy woodpeckers and other small birds. Interactive instruction regarding wood, tools, and safety will be followed by guided use of a hand saw, rasp, power drill and hammer to assemble your birdhouse. We will end the workshop with finishing options that provide healthy homes for birds.\n\nCost is $45. This includes materials, tools, and instruction for one Birdhouse. No prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.\n\nCall Maker Works at 734-222-4911 or sign up here: http://www.supersaas.com/schedule/makerworks/CheckOut", "name": "Birdhouse Make & Take", "date": "2016-10-15T13:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1778697935746098/", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2", "date": "2016-10-15T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/491276390996892/", "description": "State Street District & Matthew Altruda of Tree Town Sound are please to announce a 90's Street Festival Dance Party. \n10-15-16 Saturday on Maynard Street in Ann Arbor.  \n-Please come dressed to impressed in your favorite 90's apparel! . \nDJ Ross Federman of Tally Hall will be showcasing some his legendary 90's mash ups!  \nBeer Tent - 21+ \nFREE ALL AGES\n\nSponsors-\nAll the amazing business in State Street District\nbank of ann arbor & Tree Town Sound", "name": "Saved By The District / 10/15 SAT / 90's Dance Party Street Festival", "date": "2016-10-15T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/580041185532451/", "description": "Saturday, October 15 | 9:30pm | 18+ | Free Before 10pm / $5 After\n\nPleeease, come pay homage to the great one!\nFeaturing: Dante LaSalle, DJ Cataclysmic & DJ Jonah", "name": "Drake Night II - 10/15/16 at Blind Pig - Ann Arbor", "date": "2016-10-15T21:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/896942743751358/", "description": "We're teaming up with a few of our friends again this fall for a casual ride on the border to border trail (or as we like to call it - the brewery to brewery trail!)\n\nSunday, October 16\n11am - depart Arbor Brewing Company Brewpub in Ann Arbor, 114 E. Washington\n\nThe ride will take most people somewhere between 45 and 75 minutes\n\n12ish - grab a bite to eat at Arbor Brewing Company Microbrewery in Ypsilanti. 720 Norris.\n\nAfter brunch we'll ride back to the Brewpub and relax with a pint of our B2B Trail Ale.\n\nThere is no charge or purchase required to participate but we do ask that all participants pre-register and sign a waiver. \n\nProceeds from the B2B Trail Ale benefit the Friends of the Border to Border Trail: A group of individuals working to see that the Border To Border Trail is completed, maintained, enhanced and most of all, used. \n\nRide notes:\n\n-        The ride is moderate as the total distance is 20 miles with some hills\n\n-        Solo Riders must be 12 years of age and trailers are aok\n\n-        What to bring: water, spare tire tube, helmet\n\n-        What not to bring: headphones\n\n-        Remember it is the law to obey all traffic rules\n\n-        Don’t forget to check your bike before the ride: breaks, gears, tires", "name": "Arbor Brewing Company B2B Ride", "date": "2016-10-16T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/942422309235271/", "description": "October 15, 2016–January 29, 2017\n\nKabuki actors were superstars in eighteenth- and nineteenth-century Japan. They were admired by passionate fans with an insatiable appetite for images of them, fed by a publishing industry that mass-produced colorful woodblock prints of actors on stage that could be cheaply purchased as souvenirs of or substitutes for a theater experience. Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art presents a selection of these dramatic prints that connected fans to their idols, including off- or backstage portrayals that satisfied fans’ voyeuristic curiosity about their favorite actors’ lives, fantasy scenes of actors in unlikely groupings, and even death portraits of especially famous actors. \n\nThis introduction to the visual culture \rkabuki theater includes prints by major artists such as Utagawa Toyokuni (1769–1825), Utagawa Kunisada (1786–1865), Utagawa Kuniyoshi (1797–1861), and Toyohara Kunichika (1835–1900).\rLead support for this exhibition is provided by the University of Michigan Office of the Provost, the National Endowment for the Arts, the William T. and Dora G. Hunter Endowment, AISIN, the E. Rhodes and Leona B. Carpenter Foundation, and the University of Michigan Center for Japanese Studies. Additional generous support is provided by the Japan Foundation and the University of Michigan Institute for Research on Women and Gender.", "name": "Japanese Prints of Kabuki Theater from the Collection", "date": "2016-10-16T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/876248455852023/", "description": "Use laser-cut felt bodies and vinyl cut parts along with a heat press to learn hand stitching and machine sewing to create your own terrific tiny creature! \n\nAt the end of this workshop, you’ll walk away with an awesome monster as well as basic stitching and machine sewing skills to carry your interests further. \n\nThis workshop is taught by innovative fiber artist and milliner Je’Tone Alexander.\n\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut to sign up. Cost is $75, which includes materials, tools, and instruction. No prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.", "name": "Sew a Felt Plush Monster Make and Take", "date": "2016-10-16T12:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1040562206025801/", "description": "Stewardship Workday\nSunday, October 16\nOnder Nature Area\n1 to 4 p.m.\nOnder Nature Area is a small neighborhood park and home to many black cherry and box elder trees with a few large oak trees. By connecting with other natural areas and features, it serves as a landscape corridor and provides convenient habitat and migration for birds, mammals, reptiles and insects. Help is needed to restore Onder’s oak savanna by removing invasive shrubs such as buckthorn. Meet at the park entrance on Brookside Drive. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "name": "Stewardship Workday-Onder Nature Area", "date": "2016-10-16T13:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/692215930926869/", "description": "A Museum Arts Experience for Persons with Mild Memory Loss and Their Care Partners. Sunday, October 16, 3–4 p.m.\n\nTo register for this program, email amcdearmon@alz.org or call the local Alzheimer’s Association 800.272.3900 at any time. For more information, please contact UMMA at 734.647.0522 during normal business hours.\n\n\rMeet Me at UMMA invites people with mild memory loss to enjoy a guided gallery experience along with family members or care partners. This program is designed for people who live at home and their companions.\rIf you or someone you care about is experiencing mild memory loss, research has shown that the visual and expressive arts can be good for your mind. In addition, great enjoyment is to be found in seeking out the sights, sounds, textures, and good feelings that come with looking at, learning, and sharing feelings about paintings, music, and other creative arts.\r\n\nUMMA's trained docents will accompany small groups for a guided tour and provide the opportunity for everyone to experience different kinds of art and share their responses.\rMeet Me at UMMA is generously supported by the Monroe-Brown Foundation Discretionary Fund for Outreach to the State of Michigan and individual donors.", "name": "Meet Me at UMMA", "date": "2016-10-16T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/319178665102823/", "description": "To register for this program, email amcdearmon@alz.org or call the local Alzheimer’s Association 800.272.3900 at any time. For more information, please contact UMMA at 734.647.0522 during normal business hours.\nMeet Me at UMMA invites people with mild memory loss to enjoy a guided gallery experience along with family members or care partners. This program is designed for people who live at home and their companions.\n\nIf you or someone you care about is experiencing mild memory loss, research has shown that the visual and expressive arts can be good for your mind. In addition, great enjoyment is to be found in seeking out the sights, sounds, textures, and good feelings that come with looking at, learning, and sharing feelings about paintings, music, and other creative arts.\n\nUMMA's trained docents will accompany small groups for a guided tour and provide the opportunity for everyone to experience different kinds of art and share their responses.\n\nMeet Me at UMMA is generously supported by the Monroe-Brown Foundation Discretionary Fund for Outreach to the State of Michigan and individual donors.", "name": "Meet Me at UMMA: A Museum Arts Experience for Persons with Mild", "date": "2016-10-16T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/170692690037313/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games", "date": "2016-10-16T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1357192890965241/", "description": "The Celtic Room at Conor O'Neill's Pub\n318 South Main St, Ann Arbor, MI 48104\nShow starts at 5:30pm - Doors at 5:00pm\nGeneral: $15 | Students: $12 | Kids under 10 free\n\nMARLA FIBISH and BRUCE VICTOR are NOCTAMBULE.  They play original and traditional music in a variety of forms – original musical settings of a broad array of poetry, original instrumental pieces, and traditional Irish tunes and songs. This unique collaboration brings out qualities in both of these seasoned musicians that you may not have heard from them before.  Their music is rendered with lush beauty, sensitivity and humor on an unusual array of strings  -- various guitars in varied tunings, mandola, mandolin, bouzouki, cittern, tenor guitar -- and their blended voices.\n\n They take the name Noctambule, French for 'night-owl,’ from a Robert Service poem about a nocturnal ramble through the back alleys of Paris, which they have set to music and included on their acclaimed CD Travel in the Shadows.  Their first CD together, it explores many forms of the ‘night journey’ in song, offering the traveler the opportunity to see and experience things differently once the usual sources of light have been extinguished.  They have selected a broad variety of ‘noctambulatory’ verse from Tennyson, Neruda, Roethke, St. Vincent Millay, and Robert Service. In addition, they include two original instrumental pieces – a reel and a waltz – as well as one traditional Irish song. \n\n BRUCE VICTOR is an eclectic and accomplished guitarist and composer, who plays several different guitars in several different tunings. Seemingly resisting any single musical genre, he has been labeled a 'poly-stylist’ by one of the editors of Acoustic Guitar magazine. He has played with The Sirens of San Francisco, The Triplicates, and as a solo performer.  He was the founder of The Acoustic Vortex, a non-profit musical organization that produced house concerts, mentored youth performers, and performed benefit concerts for other non-profit organizations.  He is also a practicing psychiatrist and was a Clinical Professor of Psychiatry in the School of Medicine at the University of California, San Francisco.\n\n MARLA FIBISH is well known in the Irish music world, bringing a musicality and excitement to the tradition that is seldom heard on the mandolin.  She is also known for her compositions, musical settings of poetry and instrumental pieces that have been featured in her work with Out of the Rain, and Three Mile Stone, and on her acclaimed instrumental recording with Jimmy Crowley, The Morning Star. In addition to the mandolin, Marla brings mandola, tenor guitar, bouzouki, accordion, and her alto voice to the Noctambule sound.\n\nPack something warm, and come prepared for adventure ....\n\nVisit Noctambule on the web at http://www.noctambulemusic.com/", "name": "Noctambule - In Concert", "date": "2016-10-16T17:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1754471844769507/", "description": "Our annual awards event, the Civvies, is coming up! Our event this year will be held at Live in downtown Ann Arbor, Sunday, October 16, from 6-9 PM. \nVoting for the Civvies is now open at: http://www.a2ct.org/events/the-2015-2016-season-civvie-awards   You must be a member to vote.\nStay tuned for further event details!", "name": "The 2015-2016 Season Civvie Awards", "date": "2016-10-16T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1262141223819345/", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "name": "The Arcade - A Pointless Improv Jam", "date": "2016-10-16T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1294572053921403/", "description": "Literati is thrilled to welcome Brit Bennett back to Ann Arbor in support of her debut novel, The Mothers, a staff pick and our Literati Cultura selection for October. Brit will be joined in conversation by Chris McCormick, the author of Desert Boys.\n\nSet within a contemporary black community in Southern California, Brit Bennett’s mesmerizing first novel is an emotionally perceptive story about community, love, and ambition. It begins with a secret. “All good secrets have a taste before you tell them, and if we’d taken a moment to swish this one around our mouths, we might have noticed the sourness of an unripe secret, plucked too soon, stolen and passed around before its season.”\n\nIt is the last season of high school life for Nadia Turner, a rebellious, grief-stricken, seventeen-year-old beauty. Mourning her own mother’s recent suicide, she takes up with the local pastor’s son. Luke Sheppard is twenty-one, a former football star whose injury has reduced him to waiting tables at a diner. They are young; it’s not serious. But the pregnancy that results from this teen romance—and the subsequent cover-up—will have an impact that goes far beyond their youth. As Nadia hides her secret from everyone, including Aubrey, her God-fearing best friend, the years move quickly. Soon, Nadia, Luke, and Aubrey are full-fledged adults and still living in debt to the choices they made that one seaside summer, caught in a love triangle they must carefully maneuver, and dogged by the constant, nagging question: What if they had chosen differently? The possibilities of the road not taken are a relentless haunt.\n\nIn entrancing, lyrical prose, The Mothers asks whether a “what if” can be more powerful than an experience itself. If, as time passes, we must always live in servitude to the decisions of our younger selves, to the communities that have parented us, and to the decisions we make that shape our lives forever.\n\n“Brit Bennett’s masterful debut is brimming with unforgettable scenes and the sort of keenly-observed, precise language that makes you look at your own relationships anew. Told with the wisdom of a seasoned, compassionate storyteller, The Mothers is a novel about community, friendship, grief and growth. The two women at the center of this novel are characters you will find yourself thinking about long after you’ve turned the last page– they pull you in close and never let you go. Bennett is a brilliant and much-needed new voice in literature.” –Angela Flournoy, author of National Book Award-finalist The Turner House\n\n“Brit Bennett’s The Mothers is an engaging and assured debut novel of depth, and introspective power. It succeeds as a brilliant study of a modern black woman, and as a lyrical and majestic portrait of her place in society.” —Chigozie Obioma, author of The Fishermen\n\n“Wonderful – warm and tender and necessary.” –Yaa Gyasi, author of Homegoing \n\nBorn and raised in Southern California, Brit Bennett graduated from Stanford University and later earned her MFA in fiction at the University of Michigan, where she won a Hopwood Award in Graduate Short Fiction as well as the 2014 Hurston/Wright Award for College Writers. Her work is featured in The New Yorker, The New York Times Magazine, The Paris Review, and Jezebel.", "name": "Brit Bennett, with Chris McCormick", "date": "2016-10-17T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/278610785853131/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nDickie D. - Richard Delcamp, Singer-songwriter-guitar-banjo artist from Dragon Wagon, one of Michigan's premier bluegrass outfits,  playing a little bit of everything, Acoustic rock/Americana/traditional roots/bluegrass/folk/blues/original songwriting!\n\nNew a cover\nAlways a good time", "name": "Acoustic Tuesdays: Rich Delcamp", "date": "2016-10-18T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1769515709996649/", "description": "Two nights of dark delights!\n\nWednesday October 19, and Wednesday, October 26!\n\nThis annual event will be one of your favorite events this fall!  Please call 734.222.9841 for reservations.  Seats are very limited.", "name": "Black Wine Night", "date": "2016-10-19T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/200433560358995/", "description": "Wednesday, Oct. 19 | 9pm | 18+ | $10 Cover\n\nSeamlessly blending Funk, Soul, and Rock n’ Roll, THE MAIN SQUEEZE promises to keep your body moving with their infectious feel-good musical gumbo.\n\nThe energetic five-piece found its roots in Bloomington Indiana’s surprisingly vibrant live music scene, and they have been leaving audiences “Freshly Squozen” since 2010.\n\nTheir ability to fluidly blend and bend genres is unparalleled, and creates for an unforgettable live experience. Every performance is different from the last, showcasing each member’s virtuosic talent with soulful vocals, intricate jams, tight grooves and powerful solos.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/765", "name": "The Main Squeeze 10/19/16 at Blind Pig - Ann Arbor", "date": "2016-10-19T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/585713071616738/", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "name": "POP-X", "date": "2016-10-20T12:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1775309142707137/", "description": "Come help us celebrate the difference you've made this year! Friends and family welcome. There will be a potluck dinner accompanied by fun games, presentations by NAP staff, and social time! This year's theme is Roaring 20's; costumes are encouraged! Let us thank you for all you've done for Ann Arbor's natural areas this year.  Please email us at NAP@a2gov.org or call 734.794.6627 to RSVP.", "name": "Volunteer Appreciation Potluck", "date": "2016-10-20T18:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/856469357818387/", "description": "Volunteer Appreciation Potluck\nThursday, October 20\nCobblestone Farm, 2781 Packard Road\n6:30 to 9:30 p.m.\nAll volunteers, past, present, and future, are invited to our annual appreciation event! Let’s celebrate our collective accomplishments while sharing food and community. Games, door prizes, and fun activities for all. Please bring a dish to pass and friends or family. Costumes are encouraged. RSVPs appreciated. Call us at 734.794.6627 or email us at NAP@a2gov.org by October 18.", "name": "Volunteer Appreciation Potluck", "date": "2016-10-20T18:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/952843674822265/", "description": "Want to learn more about what's going on at Maker Works?\n\nJoin us for our Monthly Member Meeting, led by Maker Works co-founders Tom Root and Dale Grover. In it, they'll cover:\n\n- Maker Works Business Scoreboard and Profit & Loss\n- Membership Options\n- Announcements & Upcoming Changes\n\nIf you are or have ever been a member, we would love to see you there! Stop by the shop to stay up to date on Maker Works news.", "name": "October Member Meeting", "date": "2016-10-20T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/612348712258851/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe", "date": "2016-10-21T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1779109862332329/", "description": "Bring your well-worn items that could use a tune up, and we'll take a look at them! \n\nOr, make someone else's day by volunteering at Fix-It Friday and repairing their items.\n\nFix-It Friday:\nThink of this as the last chance before you get rid of something; Free, but no Guarantee.\n\nWe will:\n- try to diagnose what is wrong\n- tell you if we think we may be able to fix it today\n- tell you if you'll need a part, and where you might be able to get it\n- try to fix it to the best of our ability, but in the limited time we have\n\nHowever, we may not be able to fix it. Many products are not designed to be fixed, and just opening them up may damage them. Furthermore, we may not have someone on hand with the expertise to do a proper repair. Also, it may require a special part, tools, information, or materials to repair, or it may just require more time than we have.\n\nWe may end up damaging your item even more. Please let the repairer know how comfortable you are at each stage of diagnosis and repair.\n\nItems that are often easier to repair: lamps, types of toys, broken wires, things that need epoxy/wood glue\n\nItems that are often very difficult to repair: consumer electronics such as CD/Cassette boom boxes, TVs, radios, CD players, VCRs, and DVD players", "name": "October Fix-It Friday", "date": "2016-10-21T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1112511325491127/", "description": "Fall, beer, Eastern Market! What more do you need? Beer list to be released soon. Tickets: http://www.mibeer.com/detroit-fall-festival", "name": "Detroit Fall Beer Festival", "date": "2016-10-21T17:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1872846529611464/", "description": "Friday, October 21, 7–8 p.m.\nHelmut Stern Auditorium.\n \rFree and open to the public. Seating is first come, first serve.\n\n\rOne MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.\rThis week's reading features Clarisse Baleja Saïdi (Introduced by Kristen Roupenian) & Courtney Faye Taylor (Introduced by Young Eun Yook)\rClarisse Baleja Saïdi is from Rwanda and the Democratic Republic of Congo. She was born and raised in Côte d’Ivoire and writes of home(s) and faithfulness, of the personal and the political.\rCourtney Faye Taylor was a finalist in the 2015 Agnes Scott College Writers’ Festival\r￼ \rContest and the recipient of an Academy of American Poets Prize. Her work appears in Witness. She lives in North Carolina.", "name": "Mark Webster Reading Series", "date": "2016-10-21T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/295094260857468/", "description": "Public sale of Tickets available beginning 10:00 am on Friday, August 26th at Nicola's Books, Ticketmaster.com, and all Ticketmaster outlets. Charge by phone 800-745-3000.\n\nTicket/book packages are $39.50 and $49.50 with limited Gold Circle seating available.  All tickets purchased come with a copy of the book Good Clean Fun. Copies purchased with tickets can then be picked up from the Nicola's Books designated table the night of event.  Additional books will also be on sale on the night of the show at the Michigan Theater. \n\nNick Offerman is a man of many talents: actor on stage and screen, humorist, author of two New York Times bestsellers: Paddle Your Own Canoe and Gumption, and a woodworker. This fall, he is releasing the humorous how-to guide GOOD CLEAN FUN: Misadventures in Sawdust at Offerman Woodshop (scheduled for release on October 18), featuring how-to, mirth, fashion tips, recipes, odes to wood, and assorted tomfoolery. He will be stopping by the Michigan Theater as part of an exclusive 12-stop tour in honor of the book's release.\n\nLovers of all things crafty are invited to join him for a good ol' fashioned discussion & book signing, where you will get to know more about the craftsman side of Offerman as well as the entire Offerman Woodshop team. In the words of Offermanhimself, \"you will find that making things with your hands brings you solace (when you're not cussing out a visible glue seam) and better hand-eye coordination.\"\n\nPresented in partnership with Nicola's Books.", "name": "Nick Offerman Presented by Nicola's Books at the Michigan Theater", "date": "2016-10-21T19:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/528950367310297/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Listen, Stupid \nGroup 2: $13 Special\nGroup 3: The League of Pointless Improvisers", "name": "Pointless Improv with Listen, Stupid and $13 Special", "date": "2016-10-21T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/746969122072900/", "description": "Fri., October 21 | 9pm | $15 Cover | 18+\n\nJoe Hertler & The Rainbow Seekers wsg: FlightWave\n\nJoe Hertler & The Rainbow Seekers will make a sprightly young groove doctor out of anyone. With spectacular energy pulsating from every member of the band, the Rainbow Seekers could illuminate the very chambers of Heaven. Lead singer Joe Hertler splashes through lyrical puddles of golden rain, leaving his audience wearing flowery crowns and bubbling smiles. A ride on the Rainbow will take you across the mountains of Motown, through the fjords of folk, over the archipelagos of Americana, and-at last-into a funky firth, where only the fiercest of friendships can be found.\n\nThe Rainbow Seekers began their quest beneath the fingertips of songwriter Joe Hertler. Bassist and producer Kevin Pritchard, recently thawed from an extremely rare prehistoric groove glacier, discovered the forlorn Hertler in a twinkling, mysteriously fortuitous place called The Quilted Attic. Alongside legendary glacier-hunter Rick Hale-who would later spend decades forging a drum set from pure, white-hot, ancient stardust to mark the occasion-Pritchard changed the world: He wrangled Hertler into musical collaboration. And the lonely little songsmith, it turned out, was not quite as alone as he seemed: With him came the irresistibly sexy blues guitar prodigy who is now known to the world as Ryan Hoger.", "name": "Joe Hertler & The Rainbow Seekers 10/21/16 at Blind Pig - Ann Arbor", "date": "2016-10-21T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/834720333226858/", "description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNow with spooky campfire stories!\n\nNo two shows are the same!", "name": "A Pointless Display of Improvised Feats", "date": "2016-10-21T22:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1222423001144037/", "description": "October 22, 2016–January 22, 2017\n\nThe exhibition Traces focuses on one artwork from the Museum's African holdings: a Chokwe mask that was collected in 1905 near the Angolan city of Dundo by the German explorer Leo Frobenius. Its presence at UMMA today—almost 7,500 miles away from the context in which it was originally created, used, and valued—is the result of a long and tumultuous journey, spanning a hundred years, three continents, and numerous people whose lives are forever connected to the artifact that passed through their hands.\n\n\rTraces tells the stories of some of these individuals as it reconstructs the “biography” of the mask. Drawing on the Museum’s African art collection and complemented with national loans, the exhibition is informed by research that exposes the mask’s many layers and restores some of its historical complexity. Visitors will be able to look closely, and in great detail, at this intriguing artwork and its fascinating story.\r\n\nLead support for this exhibition is provided by the James and Vivian Curtis Endowment. Additional generous support is provided by the University of Michigan Center for the Education of Women's Frances and Sydney Lewis Visiting Leaders Fund and African Studies Center.", "name": "Traces: Reconstructing the History of a Chokwe Mask", "date": "2016-10-22T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1783301281892174/", "description": "Every improv education starts somewhere - yours starts here. Learn the fundamentals of improvisation, basic games, scene work and skills. Get used to being on stage and working with others in safe, supportive environment. For ages 18 and up.\n​\nSaturdays @ 12:00 - 3:00 pm\nOctober 22 – December 17, 2016 (no class Nov 5)\nTeacher: Jason Tomalia\n \nCost: $225\n\nVisit www.pointlessbrew.com/adult-improv-classes for more info.", "name": "Intro 1: Welcome to Improv (Saturdays)", "date": "2016-10-22T12:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1738348603083037/", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2", "date": "2016-10-22T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1112511325491127/", "description": "Fall, beer, Eastern Market! What more do you need? Beer list to be released soon. Tickets: http://www.mibeer.com/detroit-fall-festival", "name": "Detroit Fall Beer Festival", "date": "2016-10-22T17:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/179594482479953/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: As Foretold \nGroup 2: Luxury Possum\nGroup 3: The League of Pointless Improvisers", "name": "Pointless Improv with As Foretold and Luxury Possum", "date": "2016-10-22T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1768681776753933/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Luxury Possum\nGroup 2: As Foretold \nGroup 3: The League of Pointless Improvisers", "name": "Pointless Improv with Luxury Possum and As Foretold", "date": "2016-10-22T22:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1786185968280606/", "description": "Stewardship Workday\nSunday, October 23\nBlack Pond Woods Nature Area\n1 to 4 p.m.\nCome on out to experience a woods filled with oak, hickory, maple and dogwood. Volunteers will work on removing invasive shrubs, which have a negative impact on wildlife habitat. This is a great park to bring families out to enjoy a day outdoors. Please meet at the Tibbits Court entrance to the park. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "name": "Stewardship Workday- Black Pond Woods Nature Area", "date": "2016-10-23T13:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1789833264629408/", "description": "Sunday, October 23, 3–4:30 p.m.\r\nHelmut Stern Auditorium\r\nThis program is free and open to the public. Seating is first come, first served.\n\nDetroit-based architect and artist, Catie Newell, and newly arrived UMMA Assistant Curator of Photography, Jennifer Friess, will discuss the themes of the exhibition, including Newell’s impulse to create new architectural space out of the unseen and her interest in the sensory qualities (light, darkness, texture, density, malleability) of our built environments.\r\n\nCatie Newell, Assistant Professor of Architecture at the University of Michigan Taubman College of Architecture and Urban Planning, is a recent recipient of the Rome Prize in architecture. Her Overnight exhibition will run at UMMA in the Irving Stenn, Jr., Family Gallery from June 11 to November 6.\rJennifer Friess is UMMA’s Assistant Curator of Photography. She is a PhD candidate in History of Art at the University of Kansas, Lawrence. She has broad knowledge of the history of photography and art-making practices. She previously worked at the George Eastman House, International Museum of Photography, the Museum of Contemporary Art, Cleveland and most recently at the Spencer Museum at the University of Kansas.\n\n\rLead support for the exhibition Catie Newell: Overnight is provided by the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Taubman College of Architecture and Urban Planning", "name": "Overnight Illuminated", "date": "2016-10-23T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1622847681345958/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games", "date": "2016-10-23T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1673061236344789/", "description": "Sunday, October 23, 7–8:30 p.m.\nMuseum Apse\n\nThis program is free and open to the public. Seating is first come, first served.\nIn conjunction with UMMA's exhibition Catie Newell: Overnight, Professor Jerry Blackstone and the U-M Chamber Choir return to UMMA to present music of and inspired by night, including excerpts from Sergei Rachmaninoff’s stunning All-Night Vigil. The exhibition will be open for browsing during the intermission. \nThe SMTD@UMMA performance series is generously supported by the Katherine Tuck Enrichment Fund and the Greg Hodes and Heidi Hertel Hodes—Partners in the Arts Endowment Fund.\nLead support for the exhibition Catie Newell: Overnight is provided by the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Taubman College of Architecture and Urban Planning", "name": "SMTD at UMMA: Through Darkest Night", "date": "2016-10-23T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/712881928868922/", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "name": "Open Stage", "date": "2016-10-23T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/234725403596039/", "description": "Every improv education starts somewhere - yours starts here. Learn the fundamentals of improvisation, basic games, scene work and skills. Get used to being on stage and working with others in safe, supportive environment. For ages 18 and up.\n​\nMondays @ 7:00 - 10:00 pm\nOctober 24 – December 12, 2016\nTeacher: Jason Valentini\n \nCost: $225\n\nVisit www.pointlessbrew.com/adult-improv-classes for more info.", "name": "Intro 1: Welcome to Improv", "date": "2016-10-24T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1158475607517012/", "description": "Tue. October 25 | 9pm | 18+ | $15 adv./ $20 day of\n\nPresented by ann arbor's 107one\n\nFoy Vance knows how to write a song. It’s a naturally-born but dedicatedly-finessed skill that has led him to collaborate with artists as diverse as Plan B, Sheryl Crow and Rudimental, synced his music on multiple TV shows ranging from Grey’s Anatomy to the finale of Sons Of Anarchy, and caught the ears of some of the biggest players (in every sense) in music, from Elton John to Ed Sheeran. \n\nSo it is that in the run-up to the release of his new album, Vance travelled to Nashville. It’s a long way from home for the Irishman, both from the place of his birth (Bangor, Northern Ireland) and the place of his residence (Aberfeldy, Scotland). But for an inveterate songwriter, Music City is an irresistible draw, a place where Vance can work with the best of the best. Not, Vance clarifies, for himself or his own material. For one thing, he’s already completed his new album, and with songs of the calibre and single-minded brilliance of the dozen that comprise The Wild Swan, there’s no need for any outside assistance. \n\nWSG: Trevor Sensor\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/681", "name": "Foy Vance w/ Trevor Sensor 10/25/16 at Blind Pig - Ann Arbor", "date": "2016-10-25T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1606056323056977/", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Will McEvoy's Third Coast Quartet, Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation: A Tribute to Connie Crothers, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, MoTreetown Collective, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest website: \nwww.edgefestannarbor.com", "name": "Edgefest 20: 20 Years At The Edge!", "date": "2016-10-26T17:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1704824616506710/", "description": "Never a Bystander tells the story of Holocaust survivor Irene Butter’s extraordinary work with school children. Ms. Butter has spent nearly 30 years inspiring countless children to find the courage to take compassionate action and transcend obstacles. The film depicts Ms. Butter’s poignant connection to Anne Frank, her own childhood experiences in two concentration camps, and her choice to adopt an empowered view of her history, leading to a life of openheartedness, joy, and activism.\rThe screening will be followed by a talk back with film director, Evelyn Neuhaus, and Irene Butter.\r\n\nIrene Butter was born in Berlin, Germany and grew up Jewish in Nazi-occupied Europe. A survivor of two concentration camps, she came to the U.S. in 1945. After graduating from Queens College in New York, she earned a PhD in economics from Duke University and taught at the University of Michigan for over 35 years. Since 1987, she has been visiting schools to teach students about the Holocaust and the lessons she learned during those traumatic years. She co-founded the Wallenberg lecture series honoring global change- makers and the Arab-Jewish women’s dialog group, Zeitouna. Butter resides with her husband in Ann Arbor.\n\n\rEvelyn Neuhaus is a first-time filmmaker. She knew Irene Butter, the subject of Never a Bystander, for decades before learning that Butter was a Holocaust survivor and hearing her story. In 2007, Neuhaus was an assistant producer for Refusing to Be Enemies: The Zeitouna Story, about an Arab-Jewish women’s dialogue group Butter co-founded. She holds an MPH and an MBA from the University of Michigan and resides in Ann Arbor, Michigan. She is currently exploring topics for her next film.\n\n\rFor more information about Never a Bystander and this extraordinary story of compassion,\r \rforgiveness, and empowered action, visit www.neverabystander.com\rThis program is co-sponsored by the Michigan Community Scholars Program and the\rUniversity of Michigan Museum of Art", "name": "Film Screening: Never a Bystander", "date": "2016-10-26T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/284974851895383/", "description": "Two nights of dark delights!\n\nWednesday October 19, and Wednesday, October 26!\n\nThis annual event will be one of your favorite events this fall!  Please call 734.222.9841 for reservations.  Seats are very limited.", "name": "Black Wine Night", "date": "2016-10-26T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/168320503594873/", "description": "react presents\n\n:: Elephante ::\n\n& Ben Phipps\n\nDoors at 9:00pm\n18+ Welcome\n\nNecto\n516 E. Liberty\nAnn Arbor, MI\n\nConnect with us for more info and contests\nwww.reactpresents.com\nwww.facebook.com/reactdetroit\nwww.twitter.com/reactdetroit\nwww.instagram.com/reactdetroit\nwww.youtube.com/reactdet", "name": "Elephante at Necto: October 26th", "date": "2016-10-26T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1606056323056977/", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Will McEvoy's Third Coast Quartet, Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation: A Tribute to Connie Crothers, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, MoTreetown Collective, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest website: \nwww.edgefestannarbor.com", "name": "Edgefest 20: 20 Years At The Edge!", "date": "2016-10-27T17:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1781501162113597/", "description": "Please bring dry dog or cat food to this event to donate to the HSHV’s Bountiful Bowls Program to help families in financial difficulties be able to keep their pets instead of having to surrender them to the shelter.  If you cannot come to the event you can still donate food at the store through the month of October.  \n\nCartoonist Dave Coverly - \n\nThe BarkBox doodles are everywhere- on the box, in our newsletter, and on our Facebook page. And while we affectionately call these pup drawings “doodles,” the artist behind them is a full-blown cartoonist.\n\nThey’re by Dave Coverly, one of the top cartoonists in the country. (Seriously.) His “Speed Bump” comic strip is syndicated in more than 400 newspapers and websites, including the Washington Post, Torontopr Globe & Mail, Detroit Free Press, Chicago Tribune, and the Indianapolis Star. In 2009 he was given the prestigious Reuben Award for Outstanding Cartoonist of the Year—the highest honor awarded by the National Cartoonists Society.\n\nDave lives with his wife and two daughters in Ann Arbor, Michigan, and he took a few moments to chat with us about dogs, cartoons, dogs, BarkBox, and more dogs. (courtesy of BarkPost)\n\nClick on the link to read BarkPost’s interview of Dave Coverly http://bit.ly/2bzZ6Es\n\nHumane Society of Huron Valley Bountiful Bowls Program -\nFor decades, \"Meals on Wheels\" programs have provided millions of elderly, disabled and at-risk people with meals, so that they can remain healthier in their homes.\n\nAnd for nearly a decade, HSHV's \"Bountiful Bowls\" program has provided families who've fallen on hard times with pet food, so that they can keep their pets in their homes.\n\nLast year, HSHV distributed nearly 40,000 pounds of pet food through the Bountiful Bowls safety net program. This year, we've already distributed over 16,000 pounds-- and that's just through May! The donated food is given to pre-approved families both through a weekly program at the shelter and with community partnerships, like YMOW.", "name": "BarkBox Cartoonist Dave Coverly & HSHV Fundraiser", "date": "2016-10-27T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/519887981542739/", "description": "Test Batch features the newest crop of improv groups in our community. Come and watch these troupes test their chops on the Pointless stage. When they are all inevitably famous, you can say \"I saw them way back when....\"\n​\nHey improvisers - here's the link to sign up. 6 groups will get a 15-20 minute peformance slot.\nhttps://goo.gl/forms/jAePm3GzZGg7bOO52", "name": "Test Batch - October", "date": "2016-10-27T19:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1735261526750729/", "description": "Thu. October 27 | 8pm | All Ages | $25 Cover\n\nann arbor's 107one Presents:\nBrett Dennen wsg: Lily & Madeleine\n\nAs common and simple as it is, \"por favor\" is such an evocative expression. From Spanish, it translates to \"please,\" a word that suggests a need for something, a desire to make a change. \"Por favor' was something I kept saying every day in the studio, and I got the other musicians saying it,\" says Brett Dennen. \"We were goofing around, and Dave Cobb, my producer, said it should be the title of my new record. I laughed it off at first, but then I really thought about it.\"\n\n\"When you say please, you're asking something to come into your life,\" Dennen adds. \"It might mean that you're weak and need something to make you strong. But you're admitting to some sort of weakness or some form of humility.\"\n\nThat notion is at the heart of Por Favor, Dennen's intimate and revealing new album that Elektra Records will release on May 20. Produced by Cobb, fresh from his Grammywinning work with Chris Stapleton and Jason Isbell, the record strips Dennen to his core as a songwriter with nothing to hide.\n\n\"All these songs came from a time of sadness for lots of different reasons. They came at a point when I wasn't feeling confident about myself,\" he says. \"When I'm not feeling confident, I'm not a nice person to be around. I don't take care of my health, my relationships, my stuff, and it all cycles into a miserable place. And I have a really hard time admitting that I'm in that place.\"\n\nA followup to 2013's Smoke and Mirrors, his sixth studio album dives deep into loneliness, loss, and love and all its side effects. It's the sound of an artist working through his insecurities in song, and thereby letting go of them. But it's by no means a sad affair, nor is it the \"rainyday record\" Dennen initially thought he was making.\n\nOften framed by uplifting choruses and bright acoustic arrangements, these songs brim with optimism, the palpable sense that the tide is turning. \"And I want to love you for the way you are/ Not the way I am/ So let's go now/ Back to the bonfire where we began,\" he sings over a chugging groove on \"Bonfire.\"\n\nOn \"Where We Left Off,\" the album's emotional powder keg, Dennen lays himself bare over the slack strum of guitar and one of his most unvarnished vocals ever recorded. The opening lines go straight for the jugular: \"Everyone knows I'm a happy man/ But I haven't been right.\"\n\n\"Vulnerable was another word that kept coming up when I was making this record,\" Dennen admits. \"Is there something I'm scared to say? Can I dig a little deeper, reveal a little bit more? How far can I go That was my direction, and once I got that in place, I started shooting down things that weren't in that zone.\"\n\n\"I kept telling myself that all I have to do is be authentic and make the songs about the lyrics and how they interact with my guitar,\" he continues. \"I don't have to worry about whether they'll be on the radio or if they're different from my previous stuff.\"\n\nHoled up at Cobb's Nashville studio, with musicians the producer assembled, Dennen and Cobb worked fast and kept the songs rough around the edges. Dennen appreciated Cobb's insistence on capturing them in just a few takes. \"We recorded it the way people made records in the '60s - really fast, all on analog gear, very few rehearsals,\" he says. \"We didn't do anything more than five times. We didn't secondguess ourselves - we just went with it. It's not sloppy, but it's in that right place between loose and tight and feelgood but not labored.\"\n\nCobb adds, \"I worked with Brett because of his beautiful balance of wit and melody. He's very timeless in his writing and you really can hear his personality in every note he sings. The record was made totally live and we recorded all the vocals live with the band. It really was produced as stopped down as possible - we tried to make every note matter.\"\n\nMore than a decade after his selftitled debut catapulted him to stardom, Dennen was once again attracted to how he made his earliest recordings. \"My whole approach was that I wanted to write and sing the songs from the same place that I wrote the first record, which was a place of trying to discover who I am,\" he says.\n\nThat marked a detour from his most recent releases. With those he felt like he was exercising his craftsmanship - \"being a songwriter for the sake of being a songwriter,\" as he puts it. \"I really wanted this new album to come across as a whole piece,\" Dennen says. \"I consider it to be a batch of songs that all live together and complement each other.\"\n\nWhich brings us back to the album title. Please.\n\n\"What was I asking for with this album\" Dennen says. \"I wanted to be a good person and feel good about myself again, but in a way that I knew it was OK to be sad. That's part of life, the ups and downs. But with these songs, I want to make people feel good about themselves and about life through the good and bad.\"\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/718", "name": "Brett Dennen w/ Lily and Madeleine 10/27/16 at Blind Pig - Ann Arbor", "date": "2016-10-27T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1768483113364835/", "description": "Come One... Come All! Join us at the Fun House for an Amazing Halloween Party! Don't be afraid! The Ring Master will show you the way to Fantastic Thrills & Chills! COSTUME CONTEST AT MIDNIGHT! CASH PRIZE $500.00\n\nFeaturing...\nAcro\nAerialists\nBurlesque\nContortionists\nFire\nHula Hoopers\nIllusionsists\nLyra\nMusic\n\nStarring in alphabetical order...\nAni Briated\nAnnie Thinge\nAyinde Audio\nCinna Moan\nDaisy Dupree\nEmily LeMieux\nFitch\nGala Delridge Delicious\nJadein Black\nJadey Bug\nKitt Y. Bourree\nLilly Rascal\nLis Chere Thomas\nTaylor Aquino\nThe Amazing K\nThrustin' Bieber Black\nViolet Defiant\nZiva Lynn\n\nDoors at 9pm • 18 & over welcome • Early Bird Tickets $10 & will increase to $15. Get your tickets at the Necto's box office (cash & no fees) or at www.eventbrite.com • \n\nwww.idkynotevents.com\nwww.necto.com", "name": "Fun House : Halloween Thrills & Chills", "date": "2016-10-27T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/585713071616738/", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "name": "POP-X", "date": "2016-10-28T12:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1740679672848004/", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe", "date": "2016-10-28T15:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/714950595323665/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Green Gables \nGroup 2: Doom & Doomer\nGroup 3: The League of Pointless Improvisers", "name": "Pointless Improv with Green Gables and Doom & Doomer", "date": "2016-10-28T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/147078752335941/", "description": "There is no better storyteller than Chuck Brodsky.  Ranging from poignant to hilarious, his songs are about the little things in the lives of everyday people.  Chuck's soulful and compassionate voice brings his characters to life, and is the perfect instrument for infusing his lyrics with heartfelt humanity or biting wit. His spoken introductions to his songs can be as spellbinding as his colorful lyrics, which he brings to life with a well-travelled voice and a delivery that's natural and conversational. His groove-oriented strumming and fingerpicking draw on influences from the mountains of western North Carolina where he now lives, and from lots of different good old traditional folk stuff of all kinds. Chuck is widely known for his many wonderful songs about the heroes -- and zeroes -- of baseball. His latest CD is The Tell Tale Heart.\nwww.chuckbrodsky.com", "name": "Chuck Brodsky at Green Wood Coffee House", "date": "2016-10-28T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/301128386924288/", "description": "The 8th Annual Halloween Band Masquerade at the Blind Pig features 4 bands dressing up, learning a whole set and being another band for Halloween. This year's bill features:\n\nVolcano Worshippers Hour as Stone Temple Pilots\n\nCobra Youth as Danzig\n\nVladimir Poutine as Dinosaur Jr.\n\nSharashka as Discharge\n\nDoors at 9:30, $8 cover. Costumes are heavily encouraged!", "name": "8th Annual Halloween Band Masquerade", "date": "2016-10-28T21:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1142717315804288/", "description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNow with spooky campfire stories!\n\nNo two shows are the same!", "name": "A Pointless Display of Improvised Feats", "date": "2016-10-28T22:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1830106263879476/", "description": "October 29, 2016–March 12, 2017.\nPhotography Gallery\n\nPictorialism was the first truly international photography movement, and its practitioners, among them Alfred Stieglitz, Edward Steichen and Gertrude Käsebier, sought to position photography as a legitimate aesthetic art form. They favored soft-focus images that drew upon the conventions of important artists and movements of the late nineteenth and early twentieth centuries—the influence of the Pre-Raphaelites, James McNeill Whistler,\r Japonisme, and Art Nouveau are readily seen in the images on view in this exhibition.\rIn 1902 Alfred Stieglitz and other Pictorialist photographers founded the Photo-Secession in New York, with Camera Work as the flagship periodical that published images by the group. Their poetic compositions drawn from contemporary life, combined with the use of expensive and labor-intensive printing materials such as platinum and gum bichromate, established these photographs as complex and nuanced works of high artistic quality. The exhibition features work by the principal Pictorialists, including Stieglitz, Steichen, Käsebier, Clarence White, Paul Strand, and Alvin Langdon Coburn.\r\n\nLead support for this exhibition is provided by the Herbert W. and Susan L. Johe Endowment.", "name": "The Aesthetic Movement: Artists of the Photo-Secession", "date": "2016-10-29T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1758243964429609/", "description": "Saturday, October 29, 11 a.m.–1 p.m. & 2–4 p.m. \nMultipurpose Room.\n\nFree. Registration is required: email umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11:00 a.m. session or the 2:00 p.m. session and how many adults and children are in your group.\n\n\nCreate your own art project inspired by the nighttime photographs in Catie Newell: Overnight. UMMA docents will lead families on an exploration of the exhibition followed by a hands-on workshop led by local artist Adrian Deva. Designed for families with children ages six and up to experience art together. Parents must accompany children.\n\n\nFamily Art Studio is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.\nLead support for the exhibition Catie Newell: Overnight is provided by the Herbert W. and Susan L. Johe Endowment. Additional generous support is provided by the University of Michigan Taubman College of Architecture and Urban Planning", "name": "Family Art Studio: Night Prints", "date": "2016-10-29T11:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1068615186579290/", "description": "The PSSWC is an unsupported group ride around the Potawatomi Trail. This is not a race.", "name": "Poto Singlespeed World Championship", "date": "2016-10-29T12:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1765379903710058/", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2", "date": "2016-10-29T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1606056323056977/", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Will McEvoy's Third Coast Quartet, Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation: A Tribute to Connie Crothers, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, MoTreetown Collective, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest website: \nwww.edgefestannarbor.com", "name": "Edgefest 20: 20 Years At The Edge!", "date": "2016-10-29T17:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1145687525505590/", "description": "LSNC’s beloved autumnal celebration returns! Celebrate Halloween with LSNC's non-scary Animal Haunts. Take a guided hike through Black Pond Woods, where costumed interpreters bring plants and animals to life by sharing natural history facts and stories. We'll have festive fun with harvest crafts,a hay jump, and more. Don't forget to come in costume! \n\nRegistration is required by October 26th. Register online at http://bit.ly/2ctiV5w or call (734) 997-1553", "name": "Animal Haunts", "date": "2016-10-29T18:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/535197023352314/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Longhaul Carnies \nGroup 2: Quicksand\nGroup 3: The League of Pointless Improvisers", "name": "Pointless Improv with Longhaul Carnies and Quicksand", "date": "2016-10-29T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/194207361000676/", "description": "Want the biggest & best Halloween party in Michigan? You've found it. \n\n• DRINK SPECIALS. Happy Hour is from 9pm - 11pm with\n50% off all drinks, shots & bottled beers & $2 Long Islands. \n\n• MUSIC. DJ Hardy spins the best Top 40, Dance & House with host MC Yoda.\n\n• PLEASE NOTE. No metal or hard plastic, toys, or faux weapons are permitted. \n\n• FREE PICTURES with your friends by a professional photographer.\n\n• COVER. $5 for 21+ & $10 for 18 to 20.\n\nGet here early to avoid the line & to hit up the 1/2 off happy hour!", "name": "Halloween Saturday 2016", "date": "2016-10-29T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1095027037253600/", "description": "Round 2 of NTE\"s Halloween Throwdown; \nthis time we're back to the club to tear it up! \n\nBEST COSTUME CONTEST: \nScareiest costume: $50\nSexiest costume: $50 \n\n18+ \n$5 dollar admission with costume\n$10 without costume\n\n::::::LINE-UP::::::::\n9:00      Gyp$y\n10:00    Fellie the Mage\n10:15    Roman G. Martinez\n11:00    Juan Michael OG\n11:15    DJ Nitro\n12:00    Lunicy\n12:15    Barz\n1:00      Scarcetti - King Milo\n1:15      Hans Play\n\n;;;;DRINK SPECIALS;;;;\n$2.50 Coors Light Draft\n$3 Sicilian Kiss Shot\n$4 Electric Lemonade\n$5 Soft Parade", "name": "NTE Presents: Last Club on the Left", "date": "2016-10-29T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1051847748265585/", "description": "BACK FROM THE DEAD.\nTHE BANG! IS BACK.  \n\nOUR 15 YEAR ANNIVERSARY \nBANG TILL YOU'RE DEAD.\n\nON OCTOBER 29th.\nTHE CRYPT OF TERROR OPENS UP \nTHE NIGHT YOU'VE BEEN SCREAMING FOR\nTHE TERROR! THE GORE! THE BLOODY DISCOBALL OF DEATH!\nELECTRIC HORROR ON THE DANCEFLOOR!\nTHE HALLOWEEN BANG!\n\nEXPERIENCE THE ULTIMATE EXPERIENCE IN MEGASEXY DANCEFLOOR EVIL! \n\nCOSTUME REQUIRED!\n\nSATURDAY OCTOBER 29\nDOORS AT 9:30\n21 & over =$8\nif you are under 21 = $11\nno one under 18 will be admitted.\n\nGET READY\nGET SPOOKY\nTHE HALLOWEEN BANG!\nbe there.", "name": "Halloween BANG!", "date": "2016-10-29T21:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1113266065422667/", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Quicksand\nGroup 2: Longhaul Carnies \nGroup 3: The League of Pointless Improvisers", "name": "Pointless Improv with Quicksand and Longhaul Carnies", "date": "2016-10-29T22:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1581997335438040/", "description": "Sunday, October 30, 2–3:30 p.m.\n\rA. Alfred Taubman Gallery. \rSpace is limited and registration is required. Please email umma-program- registration@umich.edu\n\n\rExhibition co-curators Natsu Oyobe and Mariko Okada will lead an in-depth exploration of Kabuki prints in conjunction with the UMMA exhibition Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art. This workshop is designed for a general audience. Participants will become familiar with Kabuki prints and theater, as well as the popular culture and society of the late Edo period.\rKabuki prints are filled with information on the popular culture and human experience of \rthe late Edo Period. Kabuki attracted enormous attention and developed a huge following in the late Edo Period—a phenomenon comparable to contemporary movie and television stars. The prints’ enormous popularity contributed to advances in print technology, facilitating an unprecedented speed of production and a sophisticated system of distribution and circulation.\r\n\nThis workshop is for generalists. Another workshop requiring a reading fluency of Japanese and a basic knowledge of Kabuki theater will be offered on Friday, November 4, 10:00 a.m.-12:00 p.m. Registration is required for both workshops. Email umma-program-registration@umich.edu.\n\n\rLead support for the exhibition Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art is provided by the University of Michigan Office of the Provost, the National Endowment for the Arts, the William T. and Dora G. Hunter Endowment, AISIN, and the E. Rhodes and Leona B. Carpenter Foundation. Additional generous support is provided by the Japan Foundation and the University of Michigan Center for Japanese Studies.", "name": "An Intimate Look: Images of Kabuki Theaters and Actors", "date": "2016-10-30T14:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/200733183682795/", "description": "Sunday, October 30, 2–3 p.m.\n\nThe exhibition Traces focuses on one artwork from UMMA’s African holdings: a Chokwe mask that was collected in 1905 near the Angolan city of Dundo by the German explorer Leo Frobenius. Its presence at UMMA today—almost 7,500 miles away from the context in which it was originally created, used, and valued—is the result of a long and tumultuous journey, spanning a hundred years, three continents, and numerous people whose lives are forever connected to the artifact that passed through their hands. Drawing on the Museum’s African collection and national loans, Traces tells the stories of some of these individuals as it reconstructs the “biography” of the mask. Explore some of the historical complexity of this mask with UMMA docents.", "name": "Guided Tour: Reconstructing the History of a Chokwe Mask", "date": "2016-10-30T14:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/184994211932797/", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games", "date": "2016-10-30T16:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/666386243516759/", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "name": "The Arcade - A Pointless Improv Jam", "date": "2016-10-30T19:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/315153365502594/", "description": "Mon. October 31 | 9pm | 18+ | $16 adv./ $18 day of\n\nmc chris wsg: MC Lars & Megaran\n\nmc chris (always spelled in all lower case letters) is rapper from the Libertyville, Illinois, a suburb of Chicago. He was one of the first rappers to focus solely on nerd life, rapping about Star Wars, Harry Potter, ninjas and unrequited love, instead of the usual hip hop fare. He’s just as likely to make an appearance at Comicon as he is at SXSW.\n\nmc got his start as an animator on many of the shows you see on Adult Swim. He was writer, actor, songwriter and animator for Sealab 2021, The Brak Show, Space Ghost Coast to Coast and Aqua Teen Hunger Force. He has voiced characters on several Adult Swim pilots such as Welcome to Eltingville, Cheyenne Cinnamon, Your Pretty Face is Going to Hell and Tight Bros. He was also a producer of on air content for over a year before leaving Williams Street to pursue a career in music.\n\nmc has since crossed America countless times touring as a headlining act, as well as opening for bands like Pinback and Reggie and the Full Effect. He's collaborated with Talib Kweli, Andrew WK, Cee-Lo and Childish Gambino. His music has been featured in Kevin Smith’s Zak and Miri Make a Porno, Jay and Silent Bob’s Super Groovy Cartoon Movie and he has composed several themes for Smith’s Smodcast podcast network. mc's song \"hoodie ninja\" was featured in both a Honda commercial and America's Funniest Home Videos. Other songs have been featured in Comedy Central’s Broad City and Fox's So You Think You Can Dance? mc most recently started in the pilot Bunny and Frog for Disney and a national commercial for Fiat.\n\nmc raises money to fight Cystic Fibrosis. Inspired by his nephew who has CF, mc chris and his fans have raised over $150,000 for the Cystic Fibrosis Foundation through eBay sales and donations collected at live shows.\n\nmc kickstarted “the mc chris cartoon” an animated extension of the skit universe featured on his records. Thanks to donations from his fans, he raised $60,000 and produced a six minute pilot presentation with the animation company Titmouse Inc. mc is currently shopping the project. \n\nmc chris lives in Los Angeles with his wife and son.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/719", "name": "MC chris w/ MC Lars & Megaran 10/31/16 at Blind Pig - Ann Arbor", "date": "2016-10-31T21:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1606056323056977/", "description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Will McEvoy's Third Coast Quartet, Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation: A Tribute to Connie Crothers, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, MoTreetown Collective, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest website: \nwww.edgefestannarbor.com", "name": "Edgefest 20: 20 Years At The Edge!", "date": "2016-11-01T17:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1804342093174211/", "description": "Free and open to the public. Seating is first come, first served.\nDonovan Hohn is the recipient of the Whiting Writers’ Award, A National Endowment for the Arts Creative Writing Fellowship, and a Knight-Wallace Fellowship. His work has appeared in Harper’s Magazine, The New York Times Magazine, and Outside, among other publications. His book, Moby-Duck, was a finalist for the Helen Bernstein Prize for Excellence in Journalism, and runner-up for both the PEN/E. O. Wilson Literary Science Writing Award and the PEN/John Kenneth Galbraith Award for Nonfiction. A former features editor of GQ and contributing editor of Harper’s, Hohn now teaches creative writing at Wayne State University and lives with his family in Ann Arbor, where he is working on his second book.\n \nRachel Richardson is the author of two books of poetry, Copperhead (2011) and Hundred-Year Wave (2016), both selections in the Carnegie Mellon Poetry Series. She has received fellowships from the National Endowment for the Arts, the Sewanee Writers’ Conference, and the Wallace Stegner Program at Stanford University. Her poetry and prose have appeared in The New York Times, Guernica, New England Review, Kenyon Review Online, the Poetry Foundation website, The Rumpus, and elsewhere. Richardson is a contributing editor at Memorious and directs poetry programming for the Bay Area Book Festival. She lives with the writer David Roderick and their two children in Berkeley, California.", "name": "Zell Visiting Writers Series: Donovan Hohn and Rachel Richardson", "date": "2016-11-03T17:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/261603764205728/", "description": "Fri. November 4 | 8pm | $25 Cover | 18+\n\nThe Randy & Mr Lahey LIVE show is a silly, sexist, drunken hour and a half of songs and skits, audience participation, profanity, Shakespeare, and general hilarity. Over the past eight years it has developed into the fastest moving two man show in the known universe.\n\nFrom Newfoundland to Vancouver Island several hundred thousand people have thrilled to Randy and Lahey's shennanigins. It's a constantly moving showcase of two television icons who pull no punches when battering the audience with \"Batman and Robin\" or \"The Shit Rap.\" The innocent honesty of an out- of-control drunken ex-cop Trailer Park Supervisor and his side-kick Randybobandy the cheeseburger eating ex male prostitute, weekend Trailer Park Supervisor is pants pissing humour at its warmest.\n\nThe show itself is roughly based on the T.V. series and movies, but being live, necessitates a different format and different is the operative word here. There is nothing like it anywhere. Shit talk and poetry; sodomy and sweet talk all thrown together with music and mayhem. What more could a room full of fun seekers want.", "name": "Randy & Mr. Lahey 11/4/16 at Blind Pig - Ann Arbor", "date": "2016-11-04T09:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/241375029564095/", "description": "Nashville-based artist and Wrensong Publishing writer Sally Barris has managed to be successful in the mainstream world of country music without giving up her folk and Celtic roots. Her unique style, influenced by artists such as Tony Rice, Dougie Maclean and Richard Thompson, is what makes her stand out in a city known for “cookie cutter” talent. Her songwriting highlights include, “Let The Wind Chase You” (Trisha Yearwood), “Reluctant Daughter” (Martina McBride), “Some Things I Know” (Lee Ann Womack), “I’m On My Way” (Kellie Pickler), “The Innocent Years” (Kathy Mattea) and “Honeysuckle Sweet” (Jessi Alexander), which was featured in the Miramax film, “An Unfinished Life.”  The Minnesota native is currently on tour with her latest CD, \"The Road In Me.\"\n“Sally Barris has a voice like sparkling crystal. You could have knocked me over with a feather the first time I heard her. Her writing is from a deep, yet innocent, place and her point of view is just a bit off center. I am excited for her; she is standing at the beginning of her journey in this town, with all of it ahead of her. It reminds me of the first time I heard Beth Nielson-Chapman or Nanci Griffith. It’s going to be fun to watch.” – Kathy Mattea    www.sallybarris.com", "name": "Sally Barris at Green Wood Coffee House", "date": "2016-11-04T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1659341947728206/", "description": "Pointless Brewery & Theatre is holding auditions for our resident improv company, The League of Pointless Improvisers. We are also casting for our new incubator group, The Shadow League. \n\nWHO: We are looking for experienced improvisers who want to join a fun, creative group who like to make people laugh. Members of The League of Pointless Improvisers perform shows Fridays and Saturdays at 8 pm and 10 pm. To be considered for The League, you must have completed an improv training program at a recognized theatre (ie Go Comedy, Planet Ant, iO Theater, Second City, Pointless, etc), OR have at least one year experience performing longform improv beyond training. Must have availability on most weekends.\n\nThe Shadow League is the Pointless incubator team. The group will meet with a coach weekly, and perform on most Friday nights at 8pm. If you are only auditioning for the Shadow League, you do not need to have completed a training program, but must have taken several improv classes and have some performance experience. Each Shadow League member will be responsible for paying their coach $10 per coaching session.\n\nWHEN: Auditions are on Saturday, November 5. Please select your audition time block below. Callbacks are on Sunday, November 6 at 7:00 pm.\n\nWHERE: Pointless Brewery & Theatre, 3014 Packard in Ann Arbor (near the Packard/Platt intersection)\n\nSign up for an audition spot here:\nhttps://goo.gl/forms/qFcLFFPCOtQu0gOq1", "name": "Auditions for The League and Shadow League", "date": "2016-11-05T12:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/614874502021092/", "description": "Sat. November 5 | 9:30pm | $15 adv./ $17 day of | 18+ \n\nTheo Katzman\nSinger/songwriter and multi-instrumentalist Theo Katzman has enjoyed success as the singing drummer/guitarist for the funk rhythm section Vulfpeck, as a solo artist at the prestigious Ann Arbor Folk Festival, and as the musical director and opening act for Darren Criss (of Fox's GLEE). In addition to playing festivals like Bonaroo and Outside Lands with Vulfpeck, trading guitar solos with Blake Mills, and singing duets with Børns and Allen Stone, the year 2016 finds him finishing his second solo album, “Heartbreak Hits,\" due for release in early 2017. In his own words, Katzman says about his music, \"I write songs to soothe your post-Y2K pop culture hangover.\" He also wrote this bio. \n\nJoey Dosik\nJoey Dosik is a singer / songwriter / multi-instrumentalist / producer with a voice that you may not expect to come out of that body. Born and raised in Los Angeles, Joey continues to be a part of the recent musical renaissance in the City of Angels — recently collaborating with Vulfpeck, Mocky, and Miguel Atwood Ferguson among others. His Game Winner EP drops June 24, 2016.", "name": "Theo Katzman & Joey Dosik 11/5/16 at Blind Pig - Ann Arbor", "date": "2016-11-05T21:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/585713071616738/", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "name": "POP-X", "date": "2016-11-06T11:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1254743334545390/", "description": "TICKETS ON SALE NOW: http://bit.ly/1XZq5zj\n\nNecto & React Detroit presents...\n\nLemaitre\nwww.lemaitremusic.com\n\nopening sets TBA\n\nwww.necto.com\nwww.reactpresents.com\n\nDoors at 9pm | 18 & over welcome with proper ID \n\nNecto located at 516 E Liberty Street, Ann Arbor, MI 48104\nFor VIP services contact info@necto.com", "name": "Lemaitre at Necto", "date": "2016-11-09T21:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/970521929720288/", "description": "Free and open to the public. Seating is first come, first served.\nCeleste Ng is the author of the novel Everything I Never Told You, which was a New York Times bestseller, a New York Times Notable Book of 2014, Amazon’s #1 Best Book of 2014, and named a best book of the year by over a dozen publications. Everything I Never Told You was also the winner of the Massachusetts Book Award, the Asian/Pacific American Award for Literature, the ALA’s Alex Award, and the Medici Book Club Prize. Her fiction and essays have appeared in One Story, TriQuarterly, Bellevue Literary Review, the Kenyon Review Online, and elsewhere, and she is a recipient of the Pushcart Prize. \n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64).", "name": "Zell Visiting Writers Series: Celeste Ng", "date": "2016-11-10T17:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/309962236060767/", "description": "Thu. November 10 | 18+ | $15 Cover\n\nTucker Beathard  wsg: Aubrie Sellers\n\nTucker Beathard - Growing up in a family that excelled at both music and sports — his father is a hit songwriter; his brothers, star quarterbacks — Big Machine Label Group recording artist Tucker Beathard has an unrelenting competitive spirit: He wakes up every day trying to write the perfect song. For Tucker, a self-taught guitarist and drummer, there's no such thing as \"good enough.\"   \"I love anything with great melodies and I'm drawn to the little things,\" Tucker says, rattling off his influences with an artist's attention to detail. \"When I listen to Led Zeppelin, I focus on John Bonham's drums. Or Joe Walsh's guitar licks in the Eagles. And Hank Williams Jr.'s 'Family Tradition' is as country songwriting as it gets.\"  Tucker certainly knows something about family tradition, taking cues from dad Casey Beathard, who wrote Kenny Chesney's \"Don't Blink\" and Eric Church's \"Homeboy.\" The latter, in fact, was inspired by Tucker, who admits to going through his own rebellious phase.  Giving up a college baseball scholarship to dive headlong into songwriting, Tucker came out better for his diverse experiences and documented those wild times in the wise-beyond-its-years \"Momma and Jesus.\" The track is one of many in contention for his debut album, being overseen by producer Angelo Petraglia (Kings Of Leon).   With a rhythmic way of playing guitar, influenced by his innate drumming ability, Tucker has created some of contemporary country music's most progressive songs. \"Rock On,\" a song about regretting the girl that got away, is taut in its delivery, with clever turns of phrase. Likewise, \"20-10 Tennessee,\" a standout, uses a football game as metaphor for a relationship and “Better Than Me” puts a unique spin on an arena-ready breakup anthem, ultimately wishing the best for someone after parting ways.   \"I've always been a huge fan of deep songs, and I've always liked poems,\" he says. \"I'm an introvert, but writing songs that go beneath the surface allows me the chance to open up a piece of myself.\"   As does his engaging live show.  Having played with artists like Dierks Bentley, Keith Urban and Miranda Lambert, Tucker regularly bares his soul in front of a crowd. Despite his reserved demeanor, the stage is where he is most free — it's his canvas to paint an honest picture of who he is, as both a songwriter and an artist.   \"Expressing yourself onstage and putting your emotion into each song is a feeling that is tough to match. It's your way of letting the world know who you are,\" says Tucker, who has one main goal when performing. \"Whether it's 'My heart is broken' or 'Let's party tonight,' I want people to feel this is a real dude who knows who he is — and who says it like it is.\"", "name": "Tucker Beathard 11/10/16 at Blind Pig - Ann Arbor", "date": "2016-11-10T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/243866962676949/", "description": "Fri. November 11 | 9pm | 18+ | $10 Adv. / $12 Day of\n\nThe Timbre of Cedar is an alternative indie rock outfit based in the mitten of Michigan. With a variety of sounds ranging from a driving full band, to hushed vocals and subtle piano tones, the group displays a versatility that keeps you guessing what's next. Front woman, Marrissa Parham, has strong vocals that stand out beautifully over the clean-cut, refined sound of her band, and her words reveal a transparency of the soul and yearning for grace. WSG: Rival Summers & Watching for Foxes", "name": "The Timbre of Cedar 11/10/16 at Blind Pig - Ann Arbor", "date": "2016-11-11T21:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1157056917702191/", "description": "Spinning Dot Theatre Presents: Ruff\nRuff is Spinning Dot Theatre’s new play for the very young – aimed at 0-5 year olds but fun for the whole family!\n​\nA dog and a stranded sailor’s magical adventure with shadow puppets, music and lights! Ruff is a one woman show conceived by and performed by Kelly Joyce Fielder, Spinning Dot Theatre’s Associate Artistic Director. The performance is 15 minutes long with interactive activities for audience members before and after the performance.\n​\nTickets: $10 for adults, $5 for children\n​\nAbout Spinning Dot Theatre:\nSpinning Dot Theatre creates innovative and exciting international plays for kids and their families. For everyone, really.\n​\nGlobal stories make the world feel bigger and smaller at the same time. And our world needs that right now – especially young people. Spinning Dot Theatre launched in August 2014 with the goal to make great global theatre to inspire and connect our audiences with the rest of the world.", "name": "Ruff: A Play for the Very Young", "date": "2016-11-12T10:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/990524291045821/", "description": "Sat. November 12 | 8pm | 18+ | $12 adv./ $15 day of\n\nSANDY Alex G with: LVL UP & Brandon Can't Dance\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/766", "name": "Alex G 11/12/16 at Blind Pig - Ann Arbor", "date": "2016-11-12T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/676020209212879/", "description": "Her songs? They’re about as idiosyncratic as anything in the wide world of “popular music.” They’re painfully personal, yet they somehow infiltrate the souls of her listeners, no matter how different the paths they’ve followed through their lives.\n\nSongs aren’t so much written as harvested by Gauthier. Though she lives not far from the hit-making mills of Music Row, she admits to knowing nothing about how to write on command.  She says, “I have to be called to write. The call comes from somewhere I don’t understand, but I know it when I hear it.”\n\nThat call first came to her a long time ago. Her life to that point had led her to extremes, plenty of negatives and a few brilliant bright spots. An adopted child who became a teenage runaway, she found her first shelter among addicts and drag queens. Eventually she achieved renown as a chef even while balancing her restaurant responsibilities with the demands of addiction to heroin.\n\nTwo more successful restaurants, an escalating addiction, and a subsequent arrest led her into sobriety. It was rehearsal for what was to follow, when she wrote her first song in her mid-thirties. From that point, Gauthier channeled a long line of eloquent works, including the achingly beautiful, \"Mercy Now.\" She says of her new CD, Trouble and Love, “I started the process in a lot of grief. I’d lost a lot. So the first batch of songs was just too sad. It was like walking too close to the fire. I had to back off from it. The truth is that when you’re in the amount of grief I was in, it’s an altered state. Life is not that. You go through that. We human beings have this built-in healing mechanism that’s always pushing us toward life. I didn’t want to write just darkness, because that’s not the truth. I had to write through the darkness to get to the truth. Writing helped me back onto my feet again. This record is about getting to a new normal. It’s a transformation record.” We are so pleased to welcome Mary Gauthier into our Series. www.marygauthier.com", "name": "Mary Gauthier at Green Wood Coffee House", "date": "2016-11-12T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/952333384898221/", "description": "Free and open to the public. Seating is first come, first served.\nColm Tóibín is an Irish novelist, short story writer, essayist, playwright, journalist, critic, and poet. His seventh novel, Brooklyn, was recently adapted into a major motion picture, and his most recent novel, Nora Webster, received the Hawthornden Prize in 2015. Tóibín has been shortlisted for the Booker Prize on three different occasions, and been awarded the Los Angeles Times Novel of the Year, the Lamda Literary Award, the Costa Novel Award, and the Irish PEN Award, among many others. A celebrated essayist as well, Tóibín’s latest nonfiction book, On Elizabeth Bishop, offers a deeply personal introduction to the work and life of the American poet, who was one of his most important literary influences.", "name": "Zell Visiting Writers Series: Colm Tóibín", "date": "2016-11-17T17:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/619658961515550/", "description": "Thursday, November 17 | 9pm | 18+ | $14 adv./ $16 day of\n\nEl Ten Eleven wsg: Bayonne\n\n\"It’s surprising this record even got made,” bass player and songwriter Kristian Dunn reflects. “[Drummer] Tim’s dad died just before the recording was to begin. Obviously he needed to go back to Pittsburgh to be with his family. He returned to California relatively quickly, ready to work, and then I was struck with serious food poisoning.”\n\nAs soon as one band member in the duo was ready to work, it seemed the other had something come up. Even their engineer, Chris Cheney, had to leave in the middle of recording to go DJ for the Arizona Diamondbacks baseball team. Deadlines were rapidly approaching and the record wasn’t finished. “It was stressful, but it seemed to all work out,” Tim Fogarty adds.\n\nAppropriately, the record is all about family and the connection between parent and child. Opening with “Point Breeze” (an area in Pittsburgh in which Tim’s dad used to hang out when young) and moving right into “Scott Township” (an area of Pittsburgh where Fogarty did the same), the record is alive with sounds both futuristic and anachronistic.\n\nThe album is full of parental nods. “’Fast Forward’ is a band name my dad would always suggest when I was starting new bands in high school. I thought it was stupid and would blow him off! Now I actually think it’s cool. It really represents something that is old, but also forward looking and inventive.” Dunn explains. “Peter and Jack” is a thank you to father and son team Peter Hook (of New Order and Joy Division) and Jack Bates who, after playing some shows with El Ten Eleven, suggested to Dunn that he employ one of the six string basses they were using.\n\n“Not to exaggerate, but the effect those two had on El Ten Eleven is sort of incalculable. I wouldn’t have even considered the Bass VI if it weren’t for them. And the direction of the band definitely changed because of it,” Dunn says.\n\nThe record was written at their homes and practice studio in Atwater Village, and recorded with Cheney at Costa Mesa Recording Studio in Costa Mesa, CA. Dunn and Fogarty are the only musicians that appear on Fast Forward; everything you hear was done by the two of them using two basses, electronic drums, acoustic drums, and myriad looping pedals and effects.\n\nWhile most artists use looping technology improvisationally, Dunn and Fogarty see the loopers themselves as another instrument. Over a decade plus together they’ve attained hard-won virtuosity with the devices, and can now concentrate on songwriting itself rather than logistics. “Nothing we do is improvised” explains Dunn. “When we first started playing shows we’d sometimes run into troubles with the loops and have to stop and retry songs!”\n\n“It’s almost like our rig itself is an instrument we’ve had to master,” he continues. “I’ll loop Tim’s electronic drums with one of my pedals while looping my own bassline, then switch to my six string bass midsong while he moves to playing acoustic drums, layering up the sonics and shaping the song as it all grows.” By refusing to use anything pre-recorded live they’ve pushed themselves into new territory, now able to deftly recreate their complex compositions nightly.", "name": "El Ten Eleven w/ Bayonne 11/17/16 at Blind Pig - Ann Arbor", "date": "2016-11-17T21:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1513216465641630/", "description": "Grammy Award winner Don Henry's songs have been recorded by legends such as Ray Charles, Patti Page and Conway Twitty; by country crooners including Gene Watson, John Conlee and B.J. Thomas; and by today's hitmakers such as Blake Shelton, Miranda Lambert, and Kathy Mattea. But his songs shine most when performed by the very artist who wrote them. Don Henry is a 37 year veteran in the music business. Wit and wisdom grace Don's songs, from campfire favorites, to the poignant tribute to Martin Luther King, \"Beautiful Fool;\" or, of course, the Grammy award-winning country classic, \"Where've You Been.\" In addition to the Grammy, Kathy Mattea's version of \"Where've You Been\" took Song of the Year honors from the Academy of Country Music, The Country Music Association and Nashville Songwriter's Association International - the first song ever to be awarded all four honors in the same year.  Expect an exceptional evening of music and humor. www.donhenry.com", "name": "Don Henry at Green Wood Coffee House", "date": "2016-11-18T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1752094781672292/", "description": "Fri. November 18 | 9pm | 18+ | $15 Cover + VIP Available\n\nLouis The Child wsg: Quinn XCII & Pham\n\nHailing from Chicago, Louis The Child is an electronic music duo with the simple goal of creating music that makes people happy. Their single, “It's Strange”, has been played on BBC, Triple J, and KCRW, and racked up over 5 million plays on both Spotify and SoundCloud.  In 2016, SnapChat listed Louis The Child as one of 3 EDM Artists to Watch, and Mix Mag ranked LTC as the #1 Artist Taking Dance Music to the Next Level.  2015 involved numerous tours supporting Madeon, Kaskade and The Chainsmokers. Currently embarking on their first headlining tour, LTC is on the rise.", "name": "Louis The Child 11/18/16 at Blind Pig - Ann Arbor", "date": "2016-11-18T21:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1197643866959330/", "description": "Come out to the 8th Annual Black Friday MTB Ride at Rolling Hills and Hewens Creek Parks in Ypsilanti Township on Friday 11/25 at 10 AM.  This will be a no-drop group ride and is a great chance for novice MTBer's to get exposure to single track riding and be a fun way to burn off that Thanksgiving feast and get a jump start on getting fit for 2017.  The ride will be about 14 miles long covering ~5.5 miles at Hewens Creek and ~6.5 miles at Rolling Hills along with a few miles of dirt road connecting the two parks.  For those who haven't ridden or rarely ride at either trail, Hewens Creek is a flat, winding ride through meadows and new growth forest which is great for beginning riders.  The RHP trail on the other hand twists and turns through 4+ miles of forest and rolling hills that provide a great opportunity to improve your bike handling skills and 2.5+ miles of open meadows.  The 1.2-mile West Meadows loop on the west side of RHP includes beautiful open meadows and some fun pump-track like riding on the Munger Mounds.   \n\nMeet at the Rolling Hills Lodge at 9:45 AM and then we will head out by 10-10:15 AM.  After the ride, we will have some pizza and refreshments at the lodge at about 12:30 PM.  Please register in advance at Event Brite to attend so a good estimate of riders can be made for the pizza and beverages.  Rain date will be Saturday 11/26 at 10 AM.  Look for changes in schedule on the Rolling Hills or Hewens Creek forums on the MMBA website, the Poto Yahoo! Group Email list, the Poto MBA Facebook page or Poto MBA Twitter account.\n\nPlease park in the MTB trail head parking lot:  enter the park, go straight through the traffic circle and park in the first lot on your right next to a big pavilion ~1/4 mile west of the circle.  The Lodge will be about 200 yards away on your left.  \n\nThere will be a gate charge to enter RHP.  It is a Washtenaw County Park so if you already have WCP sticker you are good to go.  Otherwise, park entry will cost $5 for everyone as a discount for non-Washtenaw residents was arranged.\n\nLast but definitely not least, we have to thank DeWight and crew at Wheels in Motion for supporting the MTB community by sponsoring this event and paying for the food and refreshments since its inaugural event in 2009.", "name": "8th Annual Poto MBA Black Friday MTB Ride", "date": "2016-11-25T10:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1188310411191815/", "description": "Free and open to the public. Seating is first come, first served.\nEileen Myles is an award-winning American poet and writer who has produced more than twenty volumes of poetry, fiction, nonfiction, libretti, plays, and performance pieces over the last three decades. Novelist Dennis Cooper has described Myles as “one of the savviest and most restless intellects in contemporary literature.” In 2012, she received a Guggenheim Fellowship to complete Afterglow (a memoir), which gives both a real and fantastic account of a dog’s life.\n \nLisa Kron is an actress and playwright, best known for writing the lyrics and book to the musical Fun Home, for which she won both the Tony Award for Best Original Score and the Tony Award for Best Book of a Musical. Born in Ann Arbor, Kron teaches playwriting part-time at Yale University and New York University. \n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please see lsa.umich.edu/writers/readingsevents/zellvisitingwritersseries.", "name": "Zell Visiting Writers Series: Eileen Myles and Lisa Kron in Conv", "date": "2016-11-29T18:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1315113695196028/", "description": "We're excited for our 2016 annual KindleFest! We're rearranging the market to make more room to mingle and visit all of your favorite artisans. Check our Facebook page for updates between now and December 2nd.", "name": "2016 Kerrytown KindleFest - A ChristKindlmart", "date": "2016-12-02T18:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1615390588758098/", "description": "Friday, December 2nd from 6:30pm until 7:30pm. Purchase lanterns in the Farmers Market for $10 per lantern (proceeds go to support this event), or bring your own! Lantern sales start as early as 5:45pm in the market. Meet at 6:30pm near the big tent, parade starts at 7pm (look for Lanterns and St. Nicholas!)", "name": "Children's Lantern Parade!", "date": "2016-12-02T18:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1694208660853014/", "description": "Back by popular demand! Don White combines heartfelt, serious lyrics with side-splitting laughs to provide an evening not to be forgotten. This Massachusetts comedian/singer/songwriter/author is best-known in these parts for his radio gems, \"Rascal,\" \"Psycho Mom and Dad\" and \"I Know What Love Is.\"  A Don White show promises to delight new audiences and devoted \"repeat offender\" fans, alike.\ndonwhite.net/don-christine/", "name": "Don White & Christine Lavin at Green Wood Coffee House", "date": "2016-12-02T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1759418600997980/", "description": "Saturday, Dec. 2 | 9pm | 18+ | $12 adv./ $15 day of\n\nThe Philippines and suburban Maryland aren’t exactly R&B or dance music hot beds, but they didn’t need to be for Antonio Cuna aka Sweater Beats to ingest both genres and spit out an exciting hybrid, melding the sensuality of contemporary R&B with the immediacy of dance music. Born in the Philippines, Cuna moved to Maryland, adapting to his new environment by engaging with music and skate culture. But it wasn’t long before R&B entered the picture, first as an obsession and later, while Cuna was at university in New York, as a creative outlet. Growing up in the 2000s, it’s no surprise that Cuna’s heroes include R&B producer mavens like Pharrell and Timbaland, as well as French dance music behemoths Daft Punk, but it’s how he’s filtered those influences into the ingenious sonic aesthetic, a sound equally fitting both the festival stage and bedroom play, that makes Sweater Beats such an unavoidably intriguing project.\n\nSince bubbling up in the dance world with the premiere of his debut single “Mlln Dllr” on Annie Mac’s Radio1 show, Sweater Beats has constantly pushed the limits of his own sound. With support from the likes of Diplo, Omarion, and JoJo, plus tours with artists like Chance the Rapper, Flume and Chet Faker, the producer has clearly caught the eye some of a wide variety of tastemakers. Featured by the likes of Billboard, Entertainment Weekly, Boiler Room and The FADER, Cuna has also received admiration from music journalists the world over, drawing almost universal praise from disparate outlets. With countless collaborations, mixes, and remixes, on top of a constant touring schedule, Cuna has garnered a reputation for his incessant work rate and willingness to push his sound into new and uncharted territory. And that’s part of the reason why Cuna connects with his fan base on such a visceral level, eschewing traditional industry methods for his own unique, intimate manner of going about business.\n\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/768", "name": "Sweater Beats12/2/16 at Blind Pig - Ann Arbor", "date": "2016-12-02T21:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1702249903360615/", "description": "\"Music that challenges and heals\"—The Third Way", "name": "Carrie Newcomer", "date": "2016-12-04T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/309711509384304/", "description": "Free and open to the public. Seating is first come, first serve.\nLaura Kasischke is the Allan Seager Collegiate Professor of English Language and Literature and a member of the Helen Zell Writers’s Program MFA faculty at the University of Michigan. She has published eight collections of poetry and eight novels. Her novels include Suspicious River (1996), White Bird in a Blizzard (1999), and The Life Before Her Eyes (2002). They have been translated widely, and adapted for film. Kasischke has been the recipient of the National Book Critics Circle Award for poetry, a Guggenheim Fellowship, and two creative writing fellowships from the National Endowment for the Arts, among many other honors. In this conversation, moderated by fellow HZWP faculty member Douglas Trevor, she will be discussing aspects of process and craft.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64).", "name": "Zell Faculty Spotlight: Laura Kasischke", "date": "2016-12-08T17:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/322370078117998/", "description": "Featuring Dave Boutette, Jenny Jones, Erik & Toko Santos (October Babies), Yorg Kerasiotis (Bump), Brennan Andes & Jesse Clayton (The Macpodz), Diana Ladio, Shelly Smith, Jim Roll, Eric Engblade (The Northern Skies), Tyler Duncan (My Dear Disco), Laith Al-Saadi, Dick Siegel, Jim Roll, Dave Boutette, Yorg Kerasiotis, Annie & Rod Capps, MIke Boyd, Dan Piccolo, and more!", "name": "The Ebird & Friends Holiday Show—Night 1", "date": "2016-12-08T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1109700689077907/", "description": "Featuring Dave Boutette, Jenny Jones, Erik & Toko Santos (October Babies), Yorg Kerasiotis (Bump), Brennan Andes & Jesse Clayton (The Macpodz), Diana Ladio, Shelly Smith, Jim Roll, Eric Engblade (The Northern Skies), Tyler Duncan (My Dear Disco), Laith Al-Saadi, Dick Siegel, Jim Roll, Dave Boutette, Yorg Kerasiotis, Annie & Rod Capps, MIke Boyd, Dan Piccolo, and more!", "name": "The Ebird & Friends Holiday Show—Night 2", "date": "2016-12-09T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/277240782615400/", "description": "Chuck Mitchell started singing in Detroit folk clubs in the 1960s. In Toronto, on his first out of town gig, he met Canadian songwriter Joni Anderson. They married, and as a duo Chuck and Joni Mitchell played the coffeehouse circuit, and gin rummy, until they divorced in 1968. Mitchell's credits include A Prairie Home Companion and repertory theatre in Texas and in England. He has played Harold Hill in The Music Man and Woody Guthrie in Woody Guthrie's American Song. Most recently, he wrote and produced Mr. Foster & Mr. Twain, in which Stephen Foster joins Mark Twain for an evening of story and song. A Chuck Mitchell's show combines his seasoned skills as an actor, singer and guitarist with a selection of delightful material. He sings cabaret songs by Brecht and Weil -- \"Mack the Knife\" and \"The Bilbao Song\" -- and whimsical songs by Flanders & Swann -- \"The Gnu\" and \"Have Some Madeira, M'dear\". He roves the room singing \"Freeborn Man\" by Ewan McColl, or \"Necessity\" from Finian's Rainbow. He weaves poetry by Robert Frost and T.S. Eliot into his shows. He has been called a renaissance man, and thinks he is old enough to be one.\nwww.mitchellsong.com", "name": "Chuck Mitchell at Green Wood Coffee House", "date": "2016-12-09T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/192534547845946/", "description": "Featuring Dave Boutette, Jenny Jones, Erik & Toko Santos (October Babies), Yorg Kerasiotis (Bump), Brennan Andes & Jesse Clayton (The Macpodz), Diana Ladio, Shelly Smith, Jim Roll, Eric Engblade (The Northern Skies), Tyler Duncan (My Dear Disco), Laith Al-Saadi, Dick Siegel, Jim Roll, Dave Boutette, Yorg Kerasiotis, Annie & Rod Capps, MIke Boyd, Dan Piccolo, and more!", "name": "The Ebird & Friends Holiday Show—Night 3", "date": "2016-12-10T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/614261878737257/", "description": "King of the Texas honky-tonk blues. Americana singer-songwriter Brian Dunne opens.", "name": "Delbert McClinton w/Brian Dunne", "date": "2016-12-11T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1574155032886638/", "description": "Wed. Dec. 14 | 9pm | 18+ | $15 adv./ $18 Day of\n\nLive For Live Music Presents\nDopapod & Pigeons Playing Ping Pong\nat Blind Pig\nAnn Arbor, MI\n\nTickets: http://tktwb.tw/2asPQDi\n\nWant to earn a FREE ticket to the show? Sign up for the street team by clicking here: http://bit.ly/2b3tDvt\n\nDOPAPOD: \n\nThe Boston born, now generally Northeast based, but ever on-the-go Dopapod has come a long way from their college basement, DIY party roots. While maintaining to be as grassroots as their humble beginnings, the group has earned praise from taste making critics like Rolling Stone, Huffington Post, Jambase, Relix, and The Boston Herald, all the while tending to their ever expanding community of devoted listeners. The past 4 years have individually held the weight of about 150 shows, which have included numerous festival appearances like Bonnaroo, Wakarusa, Summer Camp, Electric Forest, Camp Bisco, Peach Fest, & Gathering Of the Vibes. All of this time on stage with each other has given the band the opportunity to explore the wide variety of influences that has impacted them to be the players they are today. But, don’t be quick to think that the no holds barred experimentation is unguided. While the brush in their hand uses every color, it’s the stroke on the canvas that gives Dopapod a distinct voice in the way of crafty songwriting.\n\nThat calculated, compositional mindset and restless nature to never sit too still is what has allowed Dopapod to fully realize their fourth studio release, Never Odd Or Even. Guitarist/vocalist Rob Compa giddily tells, “We really felt that the material this time around represented a big leap forward, not just in the way we’ve been interacting as a band, but in the way our focus has become sharper in paying attention to things like melody, theme, lyrical imagery, and structure – all the elements that make a great song.”\n\nDetermined to have that maturity translate in the studio, the band enlisted friend and producer Jason “Jocko” Randall to both engineer and produce the record. Keys/vocalist Eli Winderman couldn’t be happier about how things went. “We lived at his studio for about a month for these sessions and it just clicked right away. Jocko immediately became another member of band in many ways. With his attitude and approach to the recording process, we were able to really dial in the sounds we wanted, get those perfect takes we were aiming for, and have a blast the whole way through.” Released in November of 2014, Never Odd Or Even serves as the spark that the band has ignited to launch them into and exciting 2015.", "name": "Dopapod & Pigeons Playing Ping Pong at Blind Pig - Ann Arbor", "date": "2016-12-14T21:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/253901491631138/", "description": "Katie Geddes sings traditional and contemporary folk, country-folk, and folk-pop tunes. A deft interpreter of beloved songs, her captivating voice and velvety-smooth delivery bring new life to the compositions of writers such as John Prine, Buffy Sainte-Marie, Michael Nesmith and Lennon and McCartney. Katie’s latest CD release, We Are Each Other’s Angels, features an inspired roster of guest artists including Michael Johnson, Mary McCaslin, Don Henry and Small Potatoes, and has received extensive airplay across the country and around the world.When not doing her own gigs, Katie has been known to “moonlight” singing harmony for folk- rock legend Melanie and local favorite Matt Watroba.\n\n\nVocal trio All About Eve (Katie Geddes, Deb Wood, David Vaughn) offers up a variety of close-harmony pop covers and traditional and contemporary folk and gospel songs, accompanied by Dan Reynolds on guitar.", "name": "Katie Geddes and Friends at Green Wood Coffee House", "date": "2016-12-16T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1059455814109206/", "description": "A musical ramble across Ireland", "name": "Blackthorn", "date": "2016-12-17T11:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/312755719088811/", "description": "New music to bring down the curtain on the old year. Co-sponsored by The Ark.", "name": "Greensky Bluegrass—Night One", "date": "2016-12-30T19:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/184047752004510/", "description": "New music to ring in the new year. Co-sponsored by The Ark.", "name": "Greensky Bluegrass—NIght Two", "date": "2016-12-31T19:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/252782221788218/", "description": "A Michigan songwriting collective", "name": "The Yellow Room Gang", "date": "2017-01-07T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/319278098432431/", "description": "Songs of both sides of the coin", "name": "Nathan Bell", "date": "2017-01-08T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/999093406875272/", "description": "May Erlewine, Rachael Davis, and Lindsay Lou Rilko", "name": "The Sweet Water Warblers", "date": "2017-01-12T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/153875298395918/", "description": "A Michigan Celtic prodigy", "name": "Kiana June Weber", "date": "2017-01-13T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1762991087285346/", "description": "The new wave in Western swing", "name": "The Hot Club of Cowtown", "date": "2017-01-15T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/283749408648270/", "description": "New music from West Michigan's old-time innovators", "name": "Red Tail Ring", "date": "2017-01-19T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1172029342847930/", "description": "For her newest music-theater work, Meredith Monk offers a poetic meditation on our intimate connection to the natural world and the fragility of its ecology.\n\nMore info: http://ums.org/performance/on-behalf-of-nature/", "name": "On Behalf of Nature: Meredith Monk & Vocal Ensemble", "date": "2017-01-20T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1282408285111634/", "description": "Wonderful bluegrass ensemble work from some real pros", "name": "Sideline", "date": "2017-01-21T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/600305573465226/", "description": "“They are not for you, but for a later age!”\n\nSo wrote Ludwig van Beethoven about his Op. 59 quartets, which will be performed in Ann Arbor as part of a complete Beethoven string quartet cycle by the Takács Quartet over six concerts (three weekends) in the 2016-17 season. Composed against the turbulent backdrop of the Napoleonic Wars and their aftermath, this radical music is as invigorating now as it was for its first performers and audiences.\n\nMore info: http://ums.org/performance/takacs-quartet/", "name": "Takács Quartet: Beethoven Quartet Cycle Concerts 3 & 4", "date": "2017-01-21T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/270514846618930/", "description": "Inon Barnatan, piano\nAnthony McGill, clarinet\nAlisa Weilerstein, cello\n\nThis powerhouse trio brings together some familiar faces.\n\nInon Barnatan was the featured piano soloist with the New York Philharmonic last fall, Anthony McGill is the New York Philharmonic’s principal clarinetist, and Alisa Weilersten has performed on both the Choral Union Series and the Chamber Arts Series in recent years. This concert of beloved clarinet trios includes a new work by Joseph Hallman, a prolific young composer based in Philadelphia, which was co-commissioned by UMS as part of the Music Accord commissioning consortium.\n\nMore info: http://ums.org/performance/inon-barnatan-piano-anthony-mcgill-clarinet-alisa-weilerstein-cello/", "name": "Inon Barnatan, Anthony McGill & Alisa Weilerstein", "date": "2017-01-29T16:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/523093904564649/", "description": "This unlikely mashup features an Austrian orchestra performing works by composers who wrote about the experience of Africans and African-Americans.\n\nThe program includes Alexander Zemlinsky’s Africa Sings, which was written in 1929 and features poetry by Langston Hughes and other prominent writers from the Harlem Renaissance. The program also features Phillip Glass’s recent collaboration with the Beninese singer Angélique Kidjo based on three poems of Ifé, one of the most important Yorùbán kingdoms.\n\nMore info: http://ums.org/performance/bruckner-orchester-linz/", "name": "Bruckner Orchester Linz", "date": "2017-02-02T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/102986336775427/", "description": "When the Estonian Philharmonic Chamber Choir landed in New York for its first North American tour in 1995 (including a stop in Ann Arbor for UMS’s very first concert at St. Francis), they were known only as the performers on the best-selling CD of fellow-Estonian Arvo Pärt’s austere Te Deum.\n\nThe concerts showed much more — a virtuosic ensemble that could dazzle in everything from Bach to folk songs. Now they return with newly-named artistic director Kaspars Putniņš with music by Pärt, Schnittke, Ligeti, Brahms, and Tormis. “So wondrously talented…the selections and performances were so fine that they left you feeling like an ingrate, greedily hungry for more.” (New York Times)\n\nMore info: http://ums.org/performance/estonian-philharmonic-chamber-choir/", "name": "Estonian Philharmonic Chamber Choir", "date": "2017-02-03T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1713140125617477/", "description": "Winners of the grand prize at the inaugural M-Prize Chamber Music Competition at the University of Michigan in May, the Calidore String Quartet is “a miracle of unified thought,” (La Presse, Montreal).\n\nhttp://ums.org/performance/calidore-string-quartet/", "name": "Calidore String Quartet", "date": "2017-02-05T16:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/226856454345333/", "description": "Pianist Richard Goode joins the Budapest Festival Orchestra for this all-Beethoven program, which also features the UMS Choral Union in a performance of Beethoven’s Ninth Symphony.\n\nMore info: http://ums.org/performance/budapest-festival-orchestra/", "name": "Budapest Festival Orchestra", "date": "2017-02-10T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1104427819604403/", "description": "Bluegrass and beyond", "name": "Mountain Heart", "date": "2017-02-11T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/115514385575886/", "description": "Iowa's master songwriter returns", "name": "Greg Brown", "date": "2017-02-17T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1784599778489237/", "description": "Featuring The Flutter and Wow, The Whiskey Charmers, and Plain Jane Glory, plus special guest Lisa Tucker-Gray. Note special start time.", "name": "The Love Hangover: A Benefit for the Breakfast at St. Andrew's", "date": "2017-02-18T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1756234927931657/", "description": "Ping Chong + Company creates theater that crosses boundaries of identity, community, and form.\n\nHis projects have explored a wide variety of subject matter, from a hidden genocide in Africa to class struggles in America and modernization in China, but the common thread is a unifying commitment to artistic innovation and social responsibility.\n\nThis interview-based theater production, part of Chong’s 25-year series entitled Undesirable Elements, explores the diverse experiences of young Muslim New Yorkers. The five participants in Beyond Sacred share the common experience of coming of age in a post-9/11 New York City, at a time of increasing Islamophobia. Participants come from a range of cultural and ethnic backgrounds and include young men and women who reflect a range of Muslim identities, including those who converted to Islam, those who were raised Muslim but have since left the faith, those who identify as “secular” or “culturally” Muslim, and those who are observant on a daily basis.\n\nMore info: http://ums.org/performance/beyond-sacred-voices-of-muslim-identity/", "name": "Beyond Sacred: Voices of Muslim Identity: Ping Chong + Company", "date": "2017-02-18T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1062809883742057/", "description": "Timeless classics are elevated by modern masters when gifted jazz pianist and arranger Aaron Diehl and 26-year-old vocalist extraordinaire Cécile McLorin Salvant join forces to revisit and revitalize the works of George Gershwin and Jelly Roll Morton.\n\nMore info: http://ums.org/performance/jelly-and-george-aaron-diehl-and-cecile-mclorin-salvant/", "name": "Jelly and George - Aaron Diehl and Cécile McLorin Salvant", "date": "2017-02-19T16:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1771705793073037/", "description": "South Africa's legendary vocal harmonizers", "name": "Ladysmith Black Mambazo", "date": "2017-02-19T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/276397689425576/", "description": "Music to cure what ails you", "name": "Mustard's Retreat", "date": "2017-02-24T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/700288556789176/", "description": "Featuring Bill Harley, Don White, and Bil Lepp. Note special start time.", "name": "The Ark's 30th Annual Storytelling Festival", "date": "2017-02-25T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/182166895522577/", "description": "This year's festival storytellers—Bill Harley, Don White, and Bil Lepp—return with tales for the family.", "name": "Storytelling for Kids", "date": "2017-02-26T13:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/723729897779224/", "description": "Vibrant francophone roots music from Prince Edward Island", "name": "Vishtèn", "date": "2017-03-02T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1204202942946225/", "description": "“The Jazz at Lincoln Center Orchestra with Wynton Marsalis is so far from the usual big-band cliché that it’s mind-blowing.” (Dallas)\n\nSince 1988, Marsalis has led the 15-piece Jazz at Lincoln Center Orchestra, which simultaneously honors the rich heritage of Duke Ellington and Louis Armstrong while presenting a stunning variety of new works from illustrious names, many of whom perform regularly with the ensemble. From swinging to supple, it’s all sheer jazz perfection — and no wonder these annual appearances have become a favorite of UMS audiences. “You know it’s a good gig when you can’t tell if the band or the audience is having more fun.” (Milwaukee Journal-Sentinel)\n\nMore info: http://ums.org/performance/jazz-at-lincoln-center-with-wynton-marsalis/", "name": "Jazz at Lincoln Center with Wynton Marsalis", "date": "2017-03-04T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/614995318650187/", "description": "Druid, which made its acclaimed UMS debut in 2011 with The Cripple of Inishmaan, returns with a new production of Martin McDonagh’s dark comedy The Beauty Queen of Leenane.\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.\n\nMore info: http://ums.org/performance/the-beauty-queen-of-leenane/", "name": "The Beauty Queen of Leenane: Druid", "date": "2017-03-09T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1197449437008190/", "description": "Ann Arbor's first family of folk music", "name": "San, Emily & Jacob", "date": "2017-03-09T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/614995318650187/", "description": "Druid, which made its acclaimed UMS debut in 2011 with The Cripple of Inishmaan, returns with a new production of Martin McDonagh’s dark comedy The Beauty Queen of Leenane.\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.\n\nMore info: http://ums.org/performance/the-beauty-queen-of-leenane/", "name": "The Beauty Queen of Leenane: Druid", "date": "2017-03-10T19:30:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/717745095032202/", "description": "Beethoven spent more time writing his massive Missa Solemnis than any other work he composed.\n\nMissa Solemnis has been performed only four times in all of UMS’s history: at three May Festivals (with the Chicago Symphony in 1927 and the Philadelphia Orchestra in 1947 and 1955), and most recently by the Detroit Symphony Orchestra in 1977. The UMS Choral Union and Ann Arbor Symphony Orchestra, under the direction of Scott Hanoian, bring this monumental work to UMS audiences for the first time in 40 years. Soloists to be announced.\n\nMore info: http://ums.org/performance/beethovens-missa-solemnis/", "name": "Beethoven’s Missa Solemnis", "date": "2017-03-11T20:00:00-05:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/614995318650187/", "description": "Druid, which made its acclaimed UMS debut in 2011 with The Cripple of Inishmaan, returns with a new production of Martin McDonagh’s dark comedy The Beauty Queen of Leenane.\n\nAs tragically funny as it is horrific, this brilliantly subversive play takes place in an economically depressed Irish village in the early 1990s, with a vicious and relentless war of wills between a manipulative, aging mother, Mag, and her plain and lonely 40-year-old daughter, Maureen. After years of caring for her ungrateful mother, Maureen has little hope of happiness or escape, especially after Mag ruins her first, and perhaps only, chance of a loving relationship. This is confrontational theater at its most potent, with characters locked in mortal combat and mutual loathing.\n\nMore info: http://ums.org/performance/the-beauty-queen-of-leenane/", "name": "The Beauty Queen of Leenane: Druid", "date": "2017-03-12T20:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1742640832682915/", "description": "This once Texan, now New York-based quasi-collective has gone from a best-kept secret to one of the biggest bands on the international scene.\n\nAlthough still “underground” in many respects, the band followed up its first Grammy in 2014 (“Best R&B Performance”) with its second this past February for “Best Contemporary Instrumental Album.” They have earned high praise from critical stalwarts like the BBC, Village Voice, The Guardian, and the New York Times, as well as from the world’s most respected musicians, from Pat Metheny to Prince. Formed in 2004 at the acclaimed music school of the University of North Texas, the group was voted “Best Jazz Group” in Downbeat’s 2015 Reader’s Poll as well as “Best New Artist” in JazzTimes’s 2014 Reader’s Poll. Their music is a mixture of funk, jazz, gospel, rock, and R&B that strikes a perfect balance between pure musical virtuosity and raw soulful simplicity.\n\nMore info: http://ums.org/performance/snarky-puppy/", "name": "Snarky Puppy", "date": "2017-03-16T19:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1137136773037700/", "description": "A new take on Scots traditions", "name": "Alasdair Fraser & Natalie Haas", "date": "2017-03-16T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/240524153002004/", "description": "Some questions are impossible to answer and some experiences too personal to express.\n\nCrystal Pite, the choreographer who brought The Tempest Replica to Ann Arbor four seasons ago, is back with her 2015 work for Kidd Pivot and Electric Company Theatre: Betroffenheit, which means a sort of shock, speechlessness, and bewilderment. This searing work has its roots in a deeply personal tragedy, the deaths of writer Jonathon Young’s teenage daughter and two cousins in a fire. With unflinching honesty, it achieves broad resonance as it touches on themes of loss, trauma, addiction, and recovery through a boundary-stretching hybrid of theater and dance. “A stunning testament to what can happen when life turns into art.” (The Globe and Mail)\n\nMore info: http://ums.org/performance/betroffenheit/", "name": "Betroffenheit: Kidd Pivot and Electric Company Theatre", "date": "2017-03-17T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1701619326773112/", "description": "The Guardian in London asserts, “There’s just a handful of living composers who can legitimately claim to have altered the direction of musical history, and Steve Reich is one of them.”\n\nReich, who has been called “our greatest living composer” (New York Times), celebrates his 80th birthday in 2016, and the year also marks the 40th anniversary of the premiere of Music for 18 Musicians, considered by many to be his greatest composition. Two of Chicago’s world-class ensembles, Eighth Blackbird and Third Coast Percussion, team up to perform this seminal composition.\n\nMore info: http://ums.org/performance/steve-reich-80/", "name": "Steve Reich at 80", "date": "2017-03-18T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/240524153002004/", "description": "Some questions are impossible to answer and some experiences too personal to express.\n\nCrystal Pite, the choreographer who brought The Tempest Replica to Ann Arbor four seasons ago, is back with her 2015 work for Kidd Pivot and Electric Company Theatre: Betroffenheit, which means a sort of shock, speechlessness, and bewilderment. This searing work has its roots in a deeply personal tragedy, the deaths of writer Jonathon Young’s teenage daughter and two cousins in a fire. With unflinching honesty, it achieves broad resonance as it touches on themes of loss, trauma, addiction, and recovery through a boundary-stretching hybrid of theater and dance. “A stunning testament to what can happen when life turns into art.” (The Globe and Mail)\n\nMore info: http://ums.org/performance/betroffenheit/", "name": "Betroffenheit: Kidd Pivot and Electric Company Theatre", "date": "2017-03-18T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1061640283908926/", "description": "Renowned for her interpretations of Mozart and Schumann, the legendary pianist Mitsuko Uchida has also illuminated the music of new composers.\n\nShe will perform the US premiere of a new work by the German composer Jörg Widmann in her first UMS concert since her 1998 debut.\n\nMore info: http://ums.org/performance/mitsuko-uchida-piano/", "name": "Mitsuko Uchida, piano", "date": "2017-03-24T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/135653360170391/", "description": "“They are not for you, but for a later age!”\n\nSo wrote Ludwig van Beethoven about his Op. 59 quartets, which will be performed in Ann Arbor as part of a complete Beethoven string quartet cycle by the Takács Quartet over six concerts (three weekends) in the 2016-17 season. Composed against the turbulent backdrop of the Napoleonic Wars and their aftermath, this radical music is as invigorating now as it was for its first performers and audiences.\n\nMore info: http://ums.org/performance/takacs-quartet-3/", "name": "Takács Quartet: Beethoven Quartet Cycle Concerts 5 & 6", "date": "2017-03-25T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1099676823415727/", "description": "Drones and beats, crimson beads, and towering black lambswool hats all serve as a striking backdrop for an unexpected, refreshingly novel vision of Eastern European roots music.\n\nThis hit Ukrainian folk-punk quartet stirs up a mesmerizing sound that melds traditional Ukrainian folk music, African grooves, Eastern colors, and a contemporary, trans-national sensibility that the band calls “ethno-chaos.” With one foot in the urban avant-garde and the other in Ukrainian village culture, DakhaBrakha made NPR music host Bob Boilen’s “Top 10 Events of 2015” — no small feat given the 506 concerts he attended that year. Rolling Stone’s report on their Bonnaroo appearance was equally enthusiastic: “Ukrainian folkdrone Björkpunk quartet DakhaBrakha ended up with one of the most receptive crowds of the weekend…turning the tent into a happy menagerie.”\n\nMore info: http://ums.org/performance/dakhabrakha/", "name": "DakhaBrakha", "date": "2017-03-29T19:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1802665646634100/", "description": "In 1969, National Geographic photographer Loren McIntyre became hopelessly lost in a remote part of the Brazilian rainforest while searching for the Mayoruna people.\n\nHis encounter tested his perception of the world, bringing the limits of human consciousness into startling focus. Threading scenes of his own life with details of McIntyre’s journey, Complicité artistic director Simon McBurney incorporates objects and sound effects into this solo performance to evoke a rainforest landscape. Transmitted directly to the audience through provided headphones, the show’s groundbreaking technology and sound design plugs into the power of the imagination, questioning our perceptions of time, communication, and our own consciousness. McBurney transports us into the humid depths of the Amazon, its intense soundscape a new approach to site-specific theater.\n\nMore info: http://ums.org/performance/the-encounter/", "name": "The Encounter: Complicite / Simon McBurney", "date": "2017-03-30T19:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1802665646634100/", "description": "In 1969, National Geographic photographer Loren McIntyre became hopelessly lost in a remote part of the Brazilian rainforest while searching for the Mayoruna people.\n\nHis encounter tested his perception of the world, bringing the limits of human consciousness into startling focus. Threading scenes of his own life with details of McIntyre’s journey, Complicité artistic director Simon McBurney incorporates objects and sound effects into this solo performance to evoke a rainforest landscape. Transmitted directly to the audience through provided headphones, the show’s groundbreaking technology and sound design plugs into the power of the imagination, questioning our perceptions of time, communication, and our own consciousness. McBurney transports us into the humid depths of the Amazon, its intense soundscape a new approach to site-specific theater.\n\nMore info: http://ums.org/performance/the-encounter/", "name": "The Encounter: Complicite / Simon McBurney", "date": "2017-03-31T19:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1547896382170720/", "description": "A University of Michigan alumnus, Michael Fabiano received the 2014 Richard Tucker Award and the  2014 Beverly Sills Artist Award, the first-ever winner of both awards in the same year.\n\n“A marvel…Fabiano’s sound was so beautiful, and the transition from the bottom to the top of his range so seamless as to proclaim him ‘the’ tenor that we have all been waiting for.” (San Francisco Classical Voice)", "name": "Michael Fabiano, tenor & Martin Katz, piano", "date": "2017-04-01T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1802665646634100/", "description": "In 1969, National Geographic photographer Loren McIntyre became hopelessly lost in a remote part of the Brazilian rainforest while searching for the Mayoruna people.\n\nHis encounter tested his perception of the world, bringing the limits of human consciousness into startling focus. Threading scenes of his own life with details of McIntyre’s journey, Complicité artistic director Simon McBurney incorporates objects and sound effects into this solo performance to evoke a rainforest landscape. Transmitted directly to the audience through provided headphones, the show’s groundbreaking technology and sound design plugs into the power of the imagination, questioning our perceptions of time, communication, and our own consciousness. McBurney transports us into the humid depths of the Amazon, its intense soundscape a new approach to site-specific theater.\n\nMore info: http://ums.org/performance/the-encounter/", "name": "The Encounter: Complicite / Simon McBurney", "date": "2017-04-02T19:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/256549731357007/", "description": "A Far Cry stands at the forefront of an exciting new generation in classical music.\n\nThe 17-member, self-conducted chamber music collective joins forces with virtuosic vocalists Roomful of Teeth to create a sonic patchwork that is ever-changing with its fleeting burst of colors, timbres, and visions. The program opens with the lush writing of Caroline Shaw (2013 Pulitzer Prize winner), with the second half devoted to two raw, energetic, and captivating works by Ted Hearne.\n\nMore info: http://ums.org/performance/a-far-cry-with-roomful-of-teeth/", "name": "A Far Cry with Roomful of Teeth", "date": "2017-04-12T19:30:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1065809183457276/", "description": "With compelling interpretations that draw deeply from one of the world’s great music traditions, Sanam Marvi is Pakistan’s next inspiring diviner of South Asia’s Sufi texts.\n\nA vocal warrior for tolerance and peace, this contemporary daughter of the Sindh province is a brilliant interpreter of South Asia’s spiritual, folk, and classical poetry. Her performances balance immediacy and elegant ornamentation, lending new light to her well-loved repertoire of sufi, ghazal, qawwali, and folk songs. An in-demand performer too rarely heard outside émigré circles, she makes her first extended tour to the US.\n\nMore info: http://ums.org/performance/sanam-marvi/", "name": "Sanam Marvi", "date": "2017-04-15T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/996900117032146/", "description": "Since the evolution of jùjú music in Nigeria in the 1930s, no one has made a more lasting impact in the genre than King Sunny Adé.\n\nAs a singer, composer, and guitarist, this pioneer of modern world music has succeeded in taking Nigerian social music to international heights. Adé formed his first band in 1967 and has been in the limelight in Nigeria ever since. Singing in his native Yorùbá language, Adé went on to define the terms “Afropop” and “World Beat” and to open the door to the West for other African musicians. King Sunny Adé & His African Beats last toured North America in 2005. He will lay down his trademark mix of talking drum-driven grooves, multi-guitar weaves, lilting vocal harmonies, and pedal steel guitar accents, taking the audiences on an intoxicating journey.\n\nMore info: http://ums.org/performance/king-sunny-ade/", "name": "King Sunny Adé", "date": "2017-04-21T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/197458777307457/", "description": "This special concert at the end of UMS’s season brings together three artists who have been collaborating for the better part of a decade, most notably on the bestselling recording The Goat Rodeo Sessions.\n\nYo-Yo Ma’s multi-faceted career is a testament to his continual search for new ways to communicate with audiences and to his personal desire for artistic growth and renewal. Here, he is joined by mandolinist Chris Thile (Punch Brothers, Nickel Creek) and bass virtuoso Edgar Meyer for a special concert that brings together three string masters who come from wildly different backgrounds yet excel in virtually all genres. They pool their talents for a fresh, new perspective on brilliantly conceived music by Johann Sebastian Bach. The program includes transcriptions of excerpts from The Art of the Fugue and various keyboard works, as well as organ and viola da gamba trio sonatas.\n\nMore info: http://ums.org/performance/yo-yo-ma-edgar-meyer-chris-thile/", "name": "Yo-Yo Ma, Edgar Meyer & Chris Thile", "date": "2017-04-22T20:00:00-04:00"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1003698069678193/", "description": "Contemporary opera composer Jake Heggie enthused in Gramophone magazine, “The staggering, joyful artistry of Joyce DiDonato reminds us that in any generation there are a few giants…Those who know her repertoire are in awe of her gifts, and those who know nothing of it are instantly engaged.”\n\nDiDonato enchants audiences across the globe with her 24-carat voice and performances that “leave one bereft of superlatives.” (The Telegraph) This concert opera with The English Concert and conductor Harry Bicket will be performed in only two places in the country: Hill Auditorium and Carnegie Hall.\n\nMore info: http://ums.org/performance/handels-ariodante/", "name": "Handel’s Ariodante", "date": "2017-04-25T19:30:00-04:00"}]