[{"source": "Facebook", "date": "2017-03-11T09:00:00-05:00", "description": "“Assembled Works” Multi-Media Workshop\nAlice Vander Vennen\nIn this workshop participants will work with a variety of textiles, including remnants of their own stitched, embroidered and/or embellished work, quilts, knitting, beads, unfinished projects, antique handwork, new fabrics, and found pieces of textiles – anything that “catches the eye”—and combine them with natural materials. Allowing the rich textures, brilliant colors and nuanced lines of stitched textiles to interact with the mysterious beauty of the imprinted stone, a gentle branch or a fragile leaf, students will create a framed (20” x 20”) stitched, three-dimensional textile assemblage. Instruction will be given for the steps used to create a fiber work composition, the techniques used to incorporate natural materials, and for finishing, mounting and framing the finished art work. Website: http://www.alicevandervennen.ca/   To register go to the Ann Arbor Fiberarts Guild website: www.annarborfiberarts.org", "url": "https://www.facebook.com/events/1860126057346312/", "name": "“Assembled Works” Workshop"}, {"source": "Facebook", "date": "2017-03-11T09:30:00-05:00", "description": "It’s time for the wee faeries to visit Matthaei again! Every year, faeries find their places in the conservatory and lend their beauty to the Gardens. Join us for a morning of creative fun and make a faerie door to welcome faeries and sprites to your home. Plant and decorate a container faerie garden too. Afterwards, stroll through the conservatory to find all the beautiful faerie gardens and houses tucked away in secret places. \n\nThere will be two time slots for this event:\n9:30 AM-11:00 AM\n12:00 PM - 1:30 PM\nRegister for one of two time slots. Your child will not be guaranteed a spot if you do not register for the event. Follow the link below to register. See you there!", "url": "https://www.facebook.com/events/374768882902649/", "name": "Faerie Garden Workshop at Matthaei Botanical Gardens"}, {"source": "Facebook", "date": "2017-03-11T10:00:00-05:00", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "url": "https://www.facebook.com/events/1839182856327434/", "name": "Women's History Month and Planned Parenthood"}, {"source": "Facebook", "date": "2017-03-11T11:00:00-05:00", "description": "March 11–August 20, 2017\nPhotography Gallery\n\nIn 2013, artist Ernestine Ruben (BSDEs ’53) photographed the once-famed industrial complex Willow Run in Washtenaw County, Michigan. Designed by her grandfather, Detroit architect Albert Kahn, for the Ford Motor Company, Willow Run was an exemplar of American defense manufacturing because of its efficient mass-production of B-24 Liberators during World War II.\nFor this exhibition, Ruben overlaid interior views of the now-dormant factory with imagined glimpses into her body’s interior landscape. The resulting compositions seem to breathe energy and light into the stagnant and cavernous spaces of Willow Run and suggest a longing for a productive existence undeterred by mortality for both Willow Run and the artist. Her grandfather’s role in the history of the site underscores Ruben’s personal connection.\nThe exhibition presents Ruben’s photographs of Willow Run in UMMA’s Photography Gallery and an original film—co-created by Ruben and video artist Seth Bernstein and featuring an original score by award-winning composer Stephen Hartke—in the Museum’s Forum.\n\nLead support for Ernestine Ruben at Willow Run: Mobilizing Memory is provided by the University of Michigan Office of the Provost and the Herbert W. and Susan L. Johe Endowment.", "url": "https://www.facebook.com/events/1008319905968712/", "name": "Ernestine Ruben at Willow Run: Mobilizing Memory"}, {"source": "Facebook", "date": "2017-03-11T11:00:00-05:00", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni in the global art world. This two-part exhibition (Part I: Figuration followed by Part II: Abstraction on view July 1– October 29) presents works collected by a diverse group of alumni that represent the breadth of the University and over seventy years of graduating classes. The works themselves are equally diverse, ranging from ancient sculptures to contemporary multimedia works. Part I: Figuration features works by Henri Matisse, Elizabeth Louise Vigée Le Brun, Mark Tansey, and Mickalene Thomas, among others, and allows visitors to explore the variety of artistic responses and purposes encompassed by the term “figuration”. It also offers an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not all together. For visitors, and especially for future Michigan alumni, Victors for Art illuminates the shared passion for art fostered by the Michigan experience.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "url": "https://www.facebook.com/events/1724899501156129/", "name": "Victors for Art: Michigan's Alumni Collectors–Part I: Figuration"}, {"source": "Facebook", "date": "2017-03-11T12:00:00-05:00", "description": "Did you know we have at least five species of salamanders in Ann Arbor? If you have a willingness to get muddy, you’re invited to help monitor populations and the health of their habitats. Surveying is done three to six times in early spring at multiple sites, and each round is a few hours long. Please register by March 9. For more information or to register call NAP 734.794.6627, or send us an email at NAP@a2gov.org.", "url": "https://www.facebook.com/events/1842969969278128/", "name": "Salamander Survey Kick-off & Training"}, {"source": "Facebook", "date": "2017-03-11T14:30:00-05:00", "description": "Everyone is invited to join us to help monitor frog populations in Ann Arbor! It’s fun learning to identify the frogs of Michigan by ear and eye. No previous experience required. Family-friendly! Surveying is done three to six times from early spring through June, and each round lasts a few hours. Please register by March 9. For more information or to register call NAP 734.794.6627, or send us an email at NAP@a2gov.org.\nPhoto by Susan B. Miller", "url": "https://www.facebook.com/events/1857789207796826/", "name": "Frog and Toad Survey Kick-off & Training"}, {"source": "Facebook", "date": "2017-03-11T17:00:00-05:00", "description": "It's a night out for grown-ups while the kids enjoy an exciting evening at LSNC. Practice the scientific method, sing silly songs, and make stuff explode during a fun-filled night. Parents’ Night Out includes pizza and carrots for dinner as well as a late-night popcorn snack. Activities will be outside as much as possible, so please come dressed for the weather!", "url": "https://www.facebook.com/events/1196093310489576/", "name": "Parents' Night Out: Pop, Fizz, BANG!"}, {"source": "Facebook", "date": "2017-03-11T20:00:00-05:00", "description": "Beethoven spent more time writing his massive Missa Solemnis than any other work he composed.\n\nMissa Solemnis has been performed only four times in all of UMS’s history: at three May Festivals (with the Chicago Symphony in 1927 and the Philadelphia Orchestra in 1947 and 1955), and most recently by the Detroit Symphony Orchestra in 1977. The UMS Choral Union and Ann Arbor Symphony Orchestra, under the direction of Scott Hanoian, bring this monumental work to UMS audiences for the first time in 40 years. Featuring: \nErin Wall, soprano\nKelley O'Connor, mezzo-soprano\nMatthew Plenk, tenor\nNathan Stark, bass\n\nMore info: http://ums.org/performance/beethovens-missa-solemnis/", "url": "https://www.facebook.com/events/717745095032202/", "name": "Beethoven’s Missa Solemnis"}, {"source": "Facebook", "date": "2017-03-12T12:00:00-04:00", "description": "March 11–August 20, 2017\nPhotography Gallery\n\nIn 2013, artist Ernestine Ruben (BSDEs ’53) photographed the once-famed industrial complex Willow Run in Washtenaw County, Michigan. Designed by her grandfather, Detroit architect Albert Kahn, for the Ford Motor Company, Willow Run was an exemplar of American defense manufacturing because of its efficient mass-production of B-24 Liberators during World War II.\nFor this exhibition, Ruben overlaid interior views of the now-dormant factory with imagined glimpses into her body’s interior landscape. The resulting compositions seem to breathe energy and light into the stagnant and cavernous spaces of Willow Run and suggest a longing for a productive existence undeterred by mortality for both Willow Run and the artist. Her grandfather’s role in the history of the site underscores Ruben’s personal connection.\nThe exhibition presents Ruben’s photographs of Willow Run in UMMA’s Photography Gallery and an original film—co-created by Ruben and video artist Seth Bernstein and featuring an original score by award-winning composer Stephen Hartke—in the Museum’s Forum.\n\nLead support for Ernestine Ruben at Willow Run: Mobilizing Memory is provided by the University of Michigan Office of the Provost and the Herbert W. and Susan L. Johe Endowment.", "url": "https://www.facebook.com/events/1008319905968712/", "name": "Ernestine Ruben at Willow Run: Mobilizing Memory"}]