[{"description": "Before joining the faculty of the Southern California Institute of Architecture in Los Angeles, Mira Henry spent several years as a project architect, immersed in the everyday, banal details of how buildings get built: construction drawings, material specs, and building codes. She became an expert in seeing the world the way an architect sees it. But as a progressive architectural thinker, Henry’s inspiration has been to deconstruct that vision, to “unsee” the very forms and representations that constitute an architect’s basic language.\n\nThrough speculative experiments and conceptual drawings Henry discovers in static architectural details an unsettling range of figurative expression, including, for example, the way the profiles of roof eaves resemble human heads. Wallpaper, with its ability to mask, transform, or animate a space, is also a prominent element in her work. Her projects explore how these features animate our subjective experience—what she calls our “shifting fantasies”—of architectural space.\n\nLead support for this exhibition is provided by the Herbert W. and Susan L. Johe Endowment.", "date": "2016-07-09T11:00:00-04:00", "name": "Mira Henry: The View Inside", "source": "Facebook", "url": "https://www.facebook.com/events/402661156571041/"}, {"description": "Multipurpose Room\n\nFree. Registration is required: email umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11 a.m. session or the 2 p.m. session and how many adults and children are in your group.\n\nUMMA's exhibition of Catherine Opie: 700 Nimes Road presents photographs of Hollywood legend Elizabeth Taylor's residence in Bel Air, California. Catherine Opie, a renowned contemporary photographer, captures the essence of Taylor's larger-than-life persona through her personal objects and mementos. July's Family Art Studio takes its inspiration from these captivating and often intimate images. Local artist and long-time UMMA docent Susan Clinthorne will lead families on an exploration of the gallery followed by a hands-on workshop. Designed for families with children ages six and up to experience and create art together. Parents must accompany children.", "date": "2016-07-09T14:00:00-04:00", "name": "Family Art Studio: Personal Treasures", "source": "Facebook", "url": "https://www.facebook.com/events/294501814230595/"}, {"description": "Join Ann Arbor Roller Derby at Buhr Park on July 9 for a Derby Double Header! Two great roller derby mash ups for one low price!\n\n6:00- Arbor Bruising Co. vs. Border City Brawlers All Stars \n\n7:30- Ypsilanti Vigilantes vs. Border City Brawlers Canadian Clubbers\n\nBouts include kid-friendly activities, half-time entertainment, sponsored concessions, and giveaways! \n\nDoors open at 5:00, first whistle at 6:00.\n\nEnjoy a cold Pabst Blue Ribbon, Founder's Pale Ale, or Angry Orchard Cider while you watch the games!\n\nAfter party location: * Aubree's Pizzeria and Grill* 39 E. Cross Street, Ypsilanti, MI 48198 * http://aubrees.com/", "date": "2016-07-09T17:00:00-04:00", "name": "Ann Arbor Roller Derby Double Header", "source": "Facebook", "url": "https://www.facebook.com/events/859375300833524/"}, {"description": "Join DJ Hardy & MC Yoda as we heat up the summer & celebrate with a beach party!\n\n• WEAR BEACH ATTIRE & PAY NO COVER! \n\n• HAPPY HOUR! From 9-11pm, 50% off all drinks, shots & bottled beers.\n\n• Beach decorations inside, and summer evening on our patio outside. We promise we'll play Summertime by Will Smith only once.\n\nFree before 10pm. Ladies free before 11pm. Otherwise, cover is $5 for 21+ and $8 for 18-20.", "date": "2016-07-09T21:00:00-04:00", "name": "Beach Party: Frequency Saturday", "source": "Facebook", "url": "https://www.facebook.com/events/587229844772065/"}, {"description": "Restoration work here has brought back a grassland in this bend of the river, but it is being invaded by exotic weed species. Volunteers will help protect the park’s diversity by removing them. Meet at the Barton Dam parking lot on Huron River Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "date": "2016-07-10T09:00:00-04:00", "name": "Barton Park Stewardship Workday", "source": "Facebook", "url": "https://www.facebook.com/events/1627795417544876/"}, {"description": "We're grilling burgers to order, with toppings galore, just $5. Summer, we love you!", "date": "2016-07-10T11:00:00-04:00", "name": "Burger Bar $5", "source": "Facebook", "url": "https://www.facebook.com/events/1062516293785042/"}, {"description": "Aura Cacia Aromatherapy essential oils are 50% off through Thursday! Used for everything from making you smell good to massages, from soothing ailments to creating a soothing environment, essential oils have benefits big and small.", "date": "2016-07-10T11:00:00-04:00", "name": "Aura Cacia Essential Oils 50% Off", "source": "Facebook", "url": "https://www.facebook.com/events/635642046590268/"}, {"description": "This event is at the Ann Arbor District Library Main Branch - for more information go to bit.ly/1W24PIo  \n\nNicola's Books is the official bookseller for this event\n\nKate DiCamillo is the acclaimed author of many books for young readers, including The Tale of Despereaux, winner of the Newbery Medal; Because of Winn-Dixie, a Newbery Honor Book; and The Tiger Rising, a National Book Award finalist. She lives in Minneapolis, Minnesota.\n\n'Raymie Nightingale'\nRaymie Clarke has come to realize that everything, absolutely everything, depends on her. And she has a plan. If Raymie can win the Little Miss Central Florida Tire competition, then her father, who left town two days ago with a dental hygienist, will see Raymie's picture in the paper and (maybe) come home. To win, not only does Raymie have to do good deeds and learn how to twirl a baton; she also has to contend with the wispy, frequently fainting Louisiana Elefante, who has a show-business background, and the fiery, stubborn Beverly Tapinski, who's determined to sabotage the contest. But as the competition approaches, loneliness, loss, and unanswerable questions draw the three girls into an unlikely friendship and challenge each of them to come to the rescue in unexpected ways.", "date": "2016-07-10T14:00:00-04:00", "name": "Meet Newbery Award Winning Author Kate DiCamillo at the AADL Main Library for Discussion of New YA Novel, 'Raymie Nightingale'", "source": "Facebook", "url": "https://www.facebook.com/events/108096409603561/"}, {"description": "Are you interested in learning more about how to care for our natural areas? Then join the Stewardship Network's Huron Arbor cluster for an informal discussion on a monthly topic with volunteer and professional land stewards, plus others interested in nature. Free! This month’s topic: Establishing A Rain Garden – Clean up the River, One Garden at a Time: Rain gardens are shallow gardens that collect rain water before it enters the municipal stormwater pipe system. Rain gardens alleviate flooding, recharge the ground water supply, filter water before it enters local rivers, provide habitat for wildlife, and enhance the beauty of yards and communities. Join us to discuss how you can incorporate rain gardens into your own landscapes.", "date": "2016-07-12T07:30:00-04:00", "name": "Stewards' Circle- Establishing A Rain Garden", "source": "Facebook", "url": "https://www.facebook.com/events/986817678034563/"}, {"description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nRyan Racine\nhttp://ryan-racine.squarespace.com/\nIt's been a twenty-plus year journey for Ryan Racine to get to where his music finds itself. Recording for the first time as a solo artist and writing without what he refers to as \"the shackles of genre\", the direction is really a culmination of the variety in his past projects. The sound is still very much grounded in American Roots music but is unbound by the narrow concepts he has applied to previous outings. \n\nRyan Racine first made a name for himself as the front man of Ann Arbor’s rockabilly outfit Lucky Haskins. Formed when he was only 15, the band burst onto the metro Detroit rockabilly scene and quickly garnered attention and a loyal fan base. Besides introducing the genre to a whole new generation in the area, they earned spots opening for legends like Carl Perkins, Johnny Cash, and Lee Rocker as well as a slot in the 1995 Detroit Music Awards.\n\nNever a cover\nAlways a good time", "date": "2016-07-12T19:00:00-04:00", "name": "Acoustic Tuesdays: Ryan Racine", "source": "Facebook", "url": "https://www.facebook.com/events/1556397304662788/"}]