[{"description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "date": "2017-02-11T10:00:00-05:00", "name": "Intro to Stagecraft Workshops", "source": "Facebook", "url": "https://www.facebook.com/events/1716505231999811/"}, {"description": "Free. Registration is required: email umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11:00 a.m. session or the 2:00 p.m. session and how many adults and children are in your group.\n\nCreate your own art project inspired by the animals and creatures in UMMA's collections. Designed for families with children ages 6 and up to experience art together. UMMA docents will lead a tour of the galleries to look at different creatures both mythical and real followed by a hands-on workshop led by local artist Lilik Aprilianto. Designed for families with children ages six and up to experience art together. Parents must accompany children.\n\nFamily Art Studio is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "date": "2017-02-11T11:00:00-05:00", "name": "Family Art Studio: Creatures in the Collections", "source": "Facebook", "url": "https://www.facebook.com/events/378782775824427/"}, {"description": "Roses are $9.98 a dozen this Saturday and Sunday, and we'll even wrap them for you for free!", "date": "2017-02-11T11:00:00-05:00", "name": "Free Flower Wrapping", "source": "Facebook", "url": "https://www.facebook.com/events/379718932411224/"}, {"description": "Join JTCC's Know Your Rights Project, the Outlaws of the University of Michigan Law School and University of Michigan School of Social Work Outreach for a day dedicated to addressing the challenges of name changes for transgender and gender nonconforming people.\n\nThis clinic will include providing information sessions on changing your name and gender in the state of Michigan. We will have legal volunteers on-site to help you fill out and understand forms as well as assist with other legal and community resources you may need. The event will be occurring at the Washtenaw County Clerk's office. \n\nOur volunteers can assist with Name Changes in Washtenaw County, with the potential to help those living outside of Washtenaw County (if so, please indicate this on the RSVP). The clinic can also support you with changing your Social Security, Passport, Driver’s License, and Birth Certificate. We will be providing all necessary forms and instructions. \n\nPlease RSVP to this event so we can be sure accommodate all those who would like to attend at the following link: https://goo.gl/forms/w4W2jCYAoFgF11dF3\n\n**Update 02/03/2017**\n\n- Due to the exciting amount of interest we've received, we're holding two separate orientation presentations. They will be occurring at 11:30-12:30pm and 2-3pm. Please let us know which presentation you're able to attend so that we can prepare for you! \n\n- The location of the event will be the Washtenaw County Clerk building at 200 N Main St in Ann Arbor, MI. This building is two blocks away from the Jim Toy Community Center (319 Braun Court, Ann Arbor, MI 48104). The County Clerk building is ADA accessible. Follow the signs down to the basement conference room if you'd like to meet us there!\n\n- Food will be provided! Coffee, bagels, and other breakfast pastries will be available for the morning session. Pizza and sodas will be available for the lunch and afternoon session. \n\n- Parking information and parking options near the County Clerk's Building and the Jim Toy Community Center can be found here: http://kerrytown.com/visitorinfo/. \n\n- If you have any questions, please e-mail outlawslegal@gmail.com for more information.\n\nWe would like to thank the below organizations for supporting this project!\n- Domino's Pizza\n- The Michigan Advocacy Program\n- University of Michigan Spectrum Center\n- Washtenaw County Bar Association’s LGBT Rights Section\n- Washtenaw County Commissioners\n- Zingerman’s Delicatessen", "date": "2017-02-11T11:00:00-05:00", "name": "Hello, My Name Is: Name Change Clinic", "source": "Facebook", "url": "https://www.facebook.com/events/939401029526594/"}, {"description": "Come one come all to tast delicious pies from Crust - a baking company! They will be sampling their Strawberry Rhubarb and Apple pies. \n\nWe will be selling these special seasonal items:\n1. Cutie Pies--6x6 inch pies. Big enough for two! ❤️\n2. Heart Cookies--to warm your heart & your stomach!", "date": "2017-02-11T11:00:00-05:00", "name": "Cutie Pie Demo featuring Crust!", "source": "Facebook", "url": "https://www.facebook.com/events/564630923741071/"}, {"description": "Free. Registration is required: email umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11:00 a.m. session or the 2:00 p.m. session and how many adults and children are in your group.\n\nCreate your own art project inspired by the animals and creatures in UMMA's collections. Designed for families with children ages 6 and up to experience art together. UMMA docents will lead a tour of the galleries to look at different creatures both mythical and real followed by a hands-on workshop led by local artist Lilik Aprilianto. Designed for families with children ages six and up to experience art together. Parents must accompany children.\n\nFamily Art Studio is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "date": "2017-02-11T14:00:00-05:00", "name": "Family Art Studio: Creatures in the Collections", "source": "Facebook", "url": "https://www.facebook.com/events/711776282336878/"}, {"description": "Let’s celebrate Valentine’s Day All Week Long!\nSaturday, February 11 – Tuesday, February 14, 2017\nDinner Available Each Day 4pm – Close\n\n3- COURSE DINNER MENU FOR TWO\n\nFIRST COURSE\nPlease select one of the following:\nSoup, Bleu Cheese Cole Slaw, House Salad or Caesar Salad\n\nSECOND COURSE\nLobster Stuffed Filet Mignon\nTopped with hollandaise sauce then served with grilled asparagus and Duchess potatoes\n\nTHIRD COURSE\nDessert to share\nChocolate Molten Cake\nwith a warm creamy center and a scoop of vanilla ice cream\n\nReservations Recommended\n(888) 456-3463 (DINE)\nCall to reserve your spot!\n$69.95 for two, tax/gratuity not included.\nLimited time offer. \nhttp://carsonsamericanbistro.com/valentines-dinner-for-two/\n___________________________________\n\nDRINK SPECIALS \n(Not included in price of the Dinner for Two)\n\n“Amore Martini” \nMalibu, Peach Schnapps, Citrus Vodka, Cranberry Juice $10.95\n\n“Kir Royale”\nLaMarca Prosecco, Crème de Cassis $11.95\n\n____________________________________", "date": "2017-02-11T16:00:00-05:00", "name": "Valentine’s Dinner for Two, 2/11 – 2/14", "source": "Facebook", "url": "https://www.facebook.com/events/1832607166998206/"}, {"description": "Joins us for our special Valentine's Day creations all weekend long all they way through Valentine's Day. \n\nWe'll be featuring some great Food & Beverage Specials. To make your reservations visit SavasRestaurant.com/reservations or call us at 734-623-2233\n\nDRINK SPECIALS\n__________________\n\nA FRENCH ROSE\ncreme yvette, cocchi americano rosa, parigot rosé\n\nQUEEN OF HEARTS\nhendrick's gin, st. germain, lavender syrup, lemon juice, cranberry juice, apple-cranberry cider\n\nKING OF HEARTS\njohnnie walker red, averna, carpano antica, chocolate bitters\n\nDINNER SPECIALS\n__________________\n\nFILET & PRAWNS\nchoice grade 6 oz. filet with 2 jumbo prawns and beurre maître d’hotel. With pommes fondant and veal glazed carrots\n\nMOULES  CHAMPAGNE \nbay harbor mussels steamed in an herbed champagne cream broth, served with baguette\n\nOYSTERS\noysters, black pepper-balsamic sorbet, minced shallot, micro radish, cucumber brunoise\n\nHALF-ROAST CHICKEN\nbrined half-chicken, roasted fingerling potatoes, warm spinach salad with apple, sarvecchio and creamy bacon vinaigrette\n\nRISOTTO STUFFED SQUASH\nbutternut squash risotto, wild mushroom blend, braised leeks, roast acorn squash, curried romesco, roasted asparagus", "date": "2017-02-11T17:00:00-05:00", "name": "Sava's Valentine's Day Featured Food & Beverage Specials", "source": "Facebook", "url": "https://www.facebook.com/events/1197760063612471/"}, {"description": "Celebrating 15 years of the annual gala tradition - wine included!\n\nThis year Kerrytown Concert House is pulling out all the stops (and wine bottle corks!) for WWS XV! Enjoyed annually by sold-out audiences comprised of both women AND men, Wine, Women and Song features the musical talents of local female celebrity artists from the classical, jazz and cabaret genres.\n\nWendy Bloom, founder and director\nTyler Driskill, piano & music director\n\nPerformers include: Linda Beaupre, Sue Booth, Carolyn Burnstein, Roxy Diederich, Shelley MacMillan, Deanna Relyea, Monica Swartout-Bebow, and Kathy Waugh.\n\nPerformances:\nFriday, January 27th at 8 PM\nSaturday, January 28h at 8 PM\nSunday. January 29st at 4 PM\nFriday, February 3rd at 8 PM\nSaturday, February 4th at 8 PM\n\n\nWWS XV performances made possible in part by an award from the Michigan Council for Arts and Cultural Affairs.", "date": "2017-02-11T20:00:00-05:00", "name": "Wine, Women, and Song XV", "source": "Facebook", "url": "https://www.facebook.com/events/195810100885174/"}, {"description": "SATURDAY FEBRUARY 11\nTHE LOVE BANG! \n\nYOUR #1 MIXTAPE DANCE PARTY RETURNS TO\nDROP THE LOVE BOMB ON THE DISCOBALL.\nA NIGHT OF RAW LOVE\nA NIGHT OF DANCE MADNESS. \n\nFIND LOVE ON THE DANCEFLOOR.\nTHINK MEGA SEXY \nTHINK MEGA RED\nMAKE OUTS, DANCE OUTS & YOU!\nLOVE BANG!\n\nDOORS AT 9:30\n18 & UP\n$8 to get in.\nif you are under 21 = $11\n\nTHE LOVE BANG!\nFEBRUARY 11\nTHE BANG! LOVES YOU. \nbe there.", "date": "2017-02-11T21:30:00-05:00", "name": "Love Bang!", "source": "Facebook", "url": "https://www.facebook.com/events/368336643526756/"}]