[{"source": "Facebook", "description": "Walk with pride at the Ann Arbor Jaycees annual 4th of July Parade! \n\nLine up begind at 9am, step off at 10am.\nLine up location: Maynard Street, between William and Liberty", "url": "https://www.facebook.com/events/1773553836192661/", "name": "Walk with Jim Toy Community Center - Ann Arbor 4th of July Parade", "date": "2016-07-04T09:00:00-04:00"}, {"source": "Facebook", "description": "Perfectly timed for an election year, America’s foremost political satirists, The Capitol Steps, make their annual Fourth of July appearance at the festival! These former Congressional staffers “mock the vote,” poking fun at both sides of the aisle with up-to-the-minute song parodies like “Deleter of the Facts” and “All About the Base.” If you are sick of hearing about the candidates, Bill Cosby, and Brian Williams, you’ve come to the wrong place.\n\nThis program is generously underwritten by Anne and Howard Cooper.\nMedia Partner: WEMU 89.1\n\nWatch video: https://youtu.be/jtT41UzBhuM", "url": "https://www.facebook.com/events/775412122559752/", "name": "The Capitol Steps", "date": "2016-07-04T16:00:00-04:00"}, {"source": "Facebook", "description": "Perfectly timed for an election year, America’s foremost political satirists, The Capitol Steps, make their annual Fourth of July appearance at the festival! These former Congressional staffers “mock the vote,” poking fun at both sides of the aisle with up-to-the-minute song parodies like “Deleter of the Facts” and “All About the Base.” If you are sick of hearing about the candidates, Bill Cosby, and Brian Williams, you’ve come to the wrong place.\n\nThis program is generously underwritten by Anne and Howard Cooper.\nMedia Partner: Michigan Radio 91.7\n\nWatch video: https://youtu.be/jtT41UzBhuM", "url": "https://www.facebook.com/events/539821406190592/", "name": "The Capitol Steps", "date": "2016-07-04T19:00:00-04:00"}, {"source": "Facebook", "description": "This week is National Pollinator Week which is celebrated all across the country to raise awareness for pollinators and their importance to the ecosystem. NAP is participating in National Pollinator Week by hosting a workday in the Native Garden at Furstenberg Nature Area. Join us on Saturday, June 25th from 9:00am-Noon at Furstenberg Nature Area to help the local pollinators by removing invasive plants from within the Native Garden. For more information on the workday with NAP please visit www.a2gov.org/napevents and for more information on National Pollinator Week visit www.pollinator.org/pollinatorweek .", "url": "https://www.facebook.com/events/1771333209777255/", "name": "National Pollinator Week", "date": "2016-07-05T09:00:00-04:00"}, {"source": "Facebook", "description": "Arbor Brewing Company ACOUSTIC TUESDAYS\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity\n\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/1544819142492792/", "name": "Acoustic Tuesdays - Nick Zomparelli", "date": "2016-07-05T19:00:00-04:00"}, {"source": "Facebook", "description": "Celebrate the Fifth of July by catching Ensoleil Live and LiveStreamed!\n\nHailing from the Western Highlands of Connecticut, the east coast of Scotland, the Appalachians and Los Angeles, and meeting in the middle, Ann Arbor-born Ensoleil forms a truly diverse quartet. Combining our traditional and contemporary Irish, Scottish, Québecois, and New England influences with original tunes and songs, Ensoleil brings excitement to dances, festivals, and farmer’s markets abound.\n\nWe are Nadine Dyskant-Miller (flute and feet),Christine Hedden (fiddles), Tanner Porter (cello and voice) and Annika Socolofsky (fiddle, mandolins, and voice). We are all composers and graduates of the music composition department at the University of Michigan’s School of Music, Theatre and Dance. As artists working and writing in the new music scene, we share an affinity for exploring sounds beyond traditional music’s normal aesthetic. While firmly grounded in tradition and cultural context, we also believe that traditions evolve and shape themselves to the present. And while our collaboration as Ensoleil is suffused with this creative energy, it is also driven by our love of the sounds and stories of traditional music, and the multiple lenses our diverse roots offer in approaching tradition.\n\nensoleilband.com", "url": "https://www.facebook.com/events/1016127498434442/", "name": "Ensoleil // Kerrytown Concert House & LiveStream", "date": "2016-07-05T20:00:00-04:00"}, {"source": "Facebook", "description": "What better way to close out the 4th of July holiday than with a Food Truck Rally?! We're back again with your favortie, local food trucks serving up a great time! Take a break from all that grilling this weekend and have dinner with us!\n\nDon't forget to tag us in your photos with #a2rally we're on Twitter and Instagram too!\n\nUpcoming Rallies:\nJuly 6th\nAugust 3rd\nSeptember 7th\nOctober 5th\n\nDelectabowl Food Truck & Catering\nBigalora Wood Fired Food Truck\nMatt & Mo's\nTHE PITA POST\nShimmy Shack\nMI Pops\nHello! Ice Cream & Gelato\nHero Or Villain Van\nCheese Street\nPetey's Donuts", "url": "https://www.facebook.com/events/1597397783915820/", "name": "First Wednesday Food Truck Rally", "date": "2016-07-06T17:00:00-04:00"}, {"source": "Facebook", "description": "Literati is pleased to welcome Lauren Gucik to Literati in support of Women Street Artists of Latin America: Art without Fear. \n\nIn this groundbreaking, in-depth look at a rarely explored perspective of street art, more than twenty female artists from seven nations in Latin America discuss themes of social justice, artist process, community, visibility, feminism, and more. A bilingual edition packed with full-color photographs and interviews, this revealing exploration of contemporary street art includes work from Colombia, Peru, Panama, El Salvador, Nicaragua, Guatemala, and Mexico. Viva!\n\nLauren Gucik is an artist and community organizer living in Oakland, CA. She graduated with a degree in Theatre Arts from Indiana University. She has worked with the SF Mime Troupe, Brava Theatre, and Precita Eyes Mural Project as a children's art teacher. She is currently the Secretary of the Community Advisory Panel at KQED, the Bay Area's public media station and she organizes the Dia de Los Muertos Festival of Altars with the Marigold Project. \n\nEvent date: \nWednesday, July 6, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1024696030948987/", "name": "Lauren Gucik", "date": "2016-07-06T19:00:00-04:00"}, {"source": "Facebook", "description": "The Outer Vibe is a musical vacation where everyone enjoys a slice of paradise delivered by the band’s feel-good nostalgic and energetic concert experience. “Clint Eastwood drinking a pina colada at a Dick Dale concert” is how the band describes the sounds and styles of their 2015 full-length release “Full Circle,” a collection of songs they often describe as cinematic surf disco.\n“Full Circle” was created in collaboration with producer Brad Dollar (Grateful Dead, Keb-Mo, The National) and mastering engineer Joe LaPorta (The Foo Fighters, Imagine Dragons, Vampire Weekend). Upon its release in May 2015, “Full Circle” was supported by a national tour, along with radio airplay in 11,000 retail stores, commercial radio airplay in 5 midwest states, and airplay on 200+ college radio stations.\nDollar says, “When I listen to the latest batch of The Outer Vibe productions, I feel like I'm on a vacation I don't want to leave. The guitars feel like a Cheshire smile on a sunny beach, the drums beat like perfect waves on the shore. Everything stays glued together with sticky-sweet vocals, trumpets sounding from the west, and bass sounds that walked down from another planet. All at the same moment providing reflection and rejoice.”\n“Full Circle” is a follow-up to their 2012 album “Hoka Hey”, which independently achieved much success, achieving top 5 request at radio in Michigan, Wisconsin, and the Dakotas and licensing from ABC News’s “Good Morning, America” and West Michigan’s Baker College in 2013.\nhttps://theoutervibe.com\n\n2016 Bank of Ann Arbor's Sonic Lunch\n----------------------\n6/02 - Wild Belle\n6/09 - Laith Al-Saadi\n6/14 - frontier ruckus\n6/23 - JR JR w/s/g Joe Hawley of Tally Hall\n6/30 - Ben Daniels Band\n7/07 - The Outer Vibe\n7/14 - The Suffers\n7/28 - Brett Dennen w/s/g The Accidentals\n8/04 - Joshua Davis\n8/11 - The Ragbirds\n8/18 - Joe Hertler & The Rainbow Seekers\n8/25 - Serena Ryder\nall headliners start at 12PM and shows with openers will start at 11:30AM\n\nStarted in 2008, Bank of Ann Arbor’s Sonic Lunch is a free summer outdoor concert series happening at the corner of Liberty and Division in downtown Ann Arbor. Every Thursday from Noon to 1:30pm June 2 to August 25, Sonic Lunch features a live band from an impressive array of talent in the region, as well as national and international acts. Each week a different area restaurant is on-site selling a Sonic Lunch for concert-goers to purchase. Other restaurants offer special discounts for concert-goers to pick up to take to the park.\n\nSonic Lunch concerts are free and suitable for all ages. Seating is available but lawn chairs are welcome. Come join the crowds for an energizing mid-day break or just relax and enjoy the sounds.\n\nSonic Lunch is the result of a collaborative effort spearheaded by Bank of Ann Arbor. Ann Arbor Radio (107.1fm) and their popular morning host, Martin Bandyke provide promotion support and host each concert. Perich Advertising & Design, a local advertising agency, contributes the annual design of Sonic Lunch posters, banners, t-shirts and stickers. As a result, Bank of Ann Arbor’s Sonic Lunch has become one of the coolest summer events in Ann Arbor.\n\nUpdates on show and weather\nSonic Lunch on Facebook\nhttp://www.facebook.com/soniclunch\nSonic Lunch on Twitter\nhttp://www.twitter.com/soniclunch \n\n\"LIKE\"\nBank of Ann Arbor on Facebook\nhttp://www.facebook.com/bankofannarbor", "url": "https://www.facebook.com/events/1564710407160434/", "name": "The Outer Vibe / July 7th / Bank of Ann Arbor's Sonic Lunch / 12PM FREE", "date": "2016-07-07T12:00:00-04:00"}, {"source": "Facebook", "description": "This FIGHT CLUB 2 appearance is a signing ONLY\n\nChuck will not be performing or reading at this event\n\nThis is a ticketed event & each ticket will include a copy of the FIGHT CLUB 2 hardcover ($29.95 plus tax)\n\nTickets must be purchased in order to join the signing line\n\nIn addition to FIGHT CLUB 2, Chuck will sign TWO other items (memorabilia or book) ONLY FIGHT CLUB 2 WILL BE PERSONALIZED, All Other Items WILL BE SIGNATURE ONLY\n\nChuck will happily pose for photos with fans\n\nLine formation will begin at 3:00 pm, signing starts at 4:00 pm\n\nYou may reserve your ticket in-person or by calling the store at 734-662-0600 and purchasing via credit card over the phone.", "url": "https://www.facebook.com/events/223050211404675/", "name": "Chuck Palahniuk - Signing Only Ticketed Event for 'Fight Club 2' Graphic Novel - Only Michigan Event", "date": "2016-07-07T16:00:00-04:00"}]