[{"description": "Stewardship Workday\nSaturday, November 5\nRedbud Nature Area\n9 a.m. to noon \nRedbud Nature Area is a favorite place for many neighbors to enjoy a walk through the woods or a short hike with their dog. It is also home to many native plants that are competing with invasive species like buckthorn and honeysuckle. Help us remove these species so more natives can thrive and provide food and habitat for wildlife.  Meet at the park entrance at the intersection of Parkwood Avenue and Jeanne Street. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "date": "2016-11-05T09:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/613870108775975/", "name": "Stewardship Workday-Redbud Nature Area"}, {"description": "This class will introduce you to MIG and TIG welding. You will learn the basic operations with an emphasis on safety. Maker Works has welding jackets and face shields for you to borrow. If you have a welding jacket, please bring it. With successful completion of this class, you will be certified to use the TIG and MIG welder.\n\nPlease arrive 10 minutes early if visiting Maker Works for the first time. $70\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut/16271966 to sign up.", "date": "2016-11-05T12:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/632221066959350/", "name": "MIG / TIG Welding"}, {"description": "Sat. November 5 | 8pm | $15 adv./ $17 day of | 18+ \n\nTheo Katzman\nSinger/songwriter and multi-instrumentalist Theo Katzman has enjoyed success as the singing drummer/guitarist for the funk rhythm section Vulfpeck, as a solo artist at the prestigious Ann Arbor Folk Festival, and as the musical director and opening act for Darren Criss (of Fox's GLEE). In addition to playing festivals like Bonaroo and Outside Lands with Vulfpeck, trading guitar solos with Blake Mills, and singing duets with Børns and Allen Stone, the year 2016 finds him finishing his second solo album, “Heartbreak Hits,\" due for release in early 2017. In his own words, Katzman says about his music, \"I write songs to soothe your post-Y2K pop culture hangover.\" He also wrote this bio. \n\nJoey Dosik\nJoey Dosik is a singer / songwriter / multi-instrumentalist / producer with a voice that you may not expect to come out of that body. Born and raised in Los Angeles, Joey continues to be a part of the recent musical renaissance in the City of Angels — recently collaborating with Vulfpeck, Mocky, and Miguel Atwood Ferguson among others. His Game Winner EP drops June 24, 2016.\n\nWSG: Jacob Cristobal Sigman", "date": "2016-11-05T20:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/614874502021092/", "name": "Theo Katzman & Joey Dosik 11/5/16 at Blind Pig - Ann Arbor"}, {"description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "date": "2016-11-06T11:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/585713071616738/", "name": "POP-X"}, {"description": "Learn how to use our Oliver Model 159 wood lathe. This class will cover how to go about safely using the lathe, to turn both spindles and small bowls. We will also touch on choosing the best wood for your project.\n\nNo prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.\n\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut/15640138 to register!", "date": "2016-11-06T11:15:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/651329021697149/", "name": "Learn the wood lathe - $50 - 2 Hrs"}, {"description": "Stewardship Workday\nSunday, November 6\nBird Hills Nature Area\n1 to 4 p.m.\nBird Hills is our largest nature area and is home to a wide array of plant and animal species. Some of these species are invasive and serve little benefit to the other species that call \nBird Hills home. Come out and help us remove invasives like buckthorn and honeysuckle to help provide more natural habitat for all of the park’s great wildlife. Join us at park entrance on Bird Road, west of Huron River Drive. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "date": "2016-11-06T13:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1774006422815125/", "name": "Stewardship Workday-Bird Hills Nature Area"}, {"description": "Kabuki actors were superstars in eighteenth- and nineteenth-century Japan. They were admired by passionate fans with an insatiable appetite for images of them, fed by a publishing industry that mass-produced colorful woodblock prints of actors on stage which could act as substitutes for a theater experience. Join a tour with UMMA docents of Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art and discover these dramatic prints by major artists that include off- or backstage portrayals, fantasy scenes of actors in unlikely groupings, and even death portraits of especially famous actors.", "date": "2016-11-06T14:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1662606197383091/", "name": "Guided Tour: Japanese Prints of Kabuki Theater"}, {"description": "During World War II, just before the events of August 23, 1944, a German soldier is found murdered in a Romanian village. The dead soldier's superior threatens the villagers to hand over the perpetrator by morning or face reprisals.\n\nThis film screening is part of the American Romanian Festival. Additional film screenings and programs at UMMA include:\nThe Miracle of Tekir (Miracolul din Tekir, 2015, Ruxandra Zenide, Drama, English Subtitles, 90 min) on November 6 at 5:30 p.m. Film Screening and Talk Back with Director Tudor Giurgiu on November 13 at 3:30 p.m.\n\nWhy me? (De ce eu?, 2015; Tudor Giurgiu, Drama, English Subtitles, 125 min) on November 13 at 5:30 p.m.\nThe Festival will also present concerts and educational activities with composer Cornel Ţăranu. For more information about The American Romanian Festival and these events, please visit americanromanianfestival.org.\n\nThe American Romanian Film Festival is co-sponsored by the U-M Department of Germanic Languages and Literatures, The Romanian Film Centre in Bucharest, Romania, and UMMA.", "date": "2016-11-06T15:30:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/536828336519844/", "name": "Film Screening: Then I Sentenced Them All to Death"}, {"date": "2016-11-06T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1120707284680761/", "name": "Open Mic and Feature: Adrienne & Drgnflyy"}, {"description": "Literati is pleased to welcome Randa Jarrar in support of her recent story collection Him, Me, Muhammad Ali. Randa will be joined by Donia Jarrar and Kamelya Youssef.\n\nAward-winning novelist Randa Jarrar's new story collection moves seamlessly between realism and fable, history and the present, capturing the lives of Muslim women and men across myriad geographies and circumstances. With acerbic wit, deep tenderness, and boundless imagination, Jarrar brings to life a memorable cast of characters, many of them \"accidental transients\"—a term for migratory birds who have gone astray—seeking their circuitous routes back home. Fierce and feeling, Him, Me, Muhammad Ali is a testament to survival in the face of love, loss, and displacement.\n\nRanda Jarrar is an award-winning novelist, short story writer, essayist, and translator. She grew up in Kuwait and Egypt, and moved to the U.S. after the first Gulf War. Her novel A Map of Home, was published in six languages and won a Hopwood Award, an Arab-American Book Award, and was named one of the best novels of 2008 by the Barnes & Noble Review. Her work has appeared in The New York Times Magazine, The Utne Reader, Salon.com, Guernica, The Rumpus, The Oxford American, Ploughshares, Five Chapters, and other venues. She’s received fellowships and residencies from the Lannan Foundation at Marfa, the Civitella Ranieri Foundation, Hedgebrook, Caravansarai, and Eastern Frontier. In 2010, the Hay Festival and Beirut UNESCO’s world capital of the book named Jarrar one of the most gifted writers of Arab origin under the age of 40.\n\nDonia Jarrar is a Palestinian-American composer, pianist and multimedia artist whose work spans the genres of classical, electronic, experimental and pop music. She is currently a DMA Candidate in Music Composition at the University of Michigan. Her dissertation project, \"Seamstress\" was recently awarded the Rackham Predoctoral Fellowship and premiered as a feature short documentary at the 6th DC Palestinian Film and Arts Festival. \n\nKamelya Youssef is a poet, teacher, and organizer. A graduate of the University of Michigan, she is currently an M.A. candidate in English at Wayne State University in Detroit.", "date": "2016-11-07T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1660945627528853/", "name": "Randa Jarrar"}]