[{"date": "2016-04-17T19:00:00-04:00", "description": "Join us to play short-form and long-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/945932722192066/", "source": "Facebook", "name": "The Arcade - A Pointless Improv Jam"}, {"date": "2016-04-17T21:00:00-04:00", "description": "$14 adv./ $16 day of | 18+\n\nFuturistic & Devvon Terrell\nwith Munch & Mocha\n\nGrowing up around music from his Father & two older brothers, it was inevitable that Futuristic would be a natural. He wrote his first raps at the age of six and hasn't looked back since. Born in Illinois but moved to Arizona in high school, Futuristic's flow seems to be just as hot as his surroundings. His album \"The Rise\" released on May 12th 2015 debuted at #2 on itunes and #9 on Hip-Hop Billboard charts. He has been touring virtually non-stop over the last 2 years headlining his own tours and supporting bigger acts such as Somo & Machine Gun Kelly. His fast witty lyrics mixed with substance and relatable subject matter has gained him a die hard fan base called WTFGang which stands for \"We're The Future\". As an independent artist Futuristic takes pride in his creativity and versatility using his words to inspire his fans and let them know that anything is truly possible but also gives them music to BANG with the top down in the summer. Moving forward he expects to be exactly what he named his lead single from his album.... \"The Greatest\". Futuristic recently was featured on A Great Big World single \"Hold Each Other\" which has led him to National television performances on The Tonight Show Starring Jimmy Fallon, VH1 Streamy Awards, Performing for the Vice President Joe Biden & CEO of Apple Time Cook, for the HRC National Dinner in Washington D.C.\n\nGood music arguably comes from a place that is insightful, meaningful and modern.This is where the living weirdo known as Devvon Terrell lives and sleeps. Hailing from Brooklyn, New York the singer has his own urban style and sound that is a testament to his generation.\n\nDevvon Terrell took the internet by storm, showcasing his talent on various remixes and cover videos on youtube that have gained him as much as 200,000 views on a single video.\n\n \n\nDevvon Terrell wears a variety of hats to translate his music to his audience. From shooting and editing videos to engineering, mixing and mastering all of his music. This jack of all trades mentality has earned him placements with And One Live, C2C Dj Khaled's Halftime Report, a number one Mixtape on Datpiff.com and countless other mediums. Devvon Terrell recently released his first album titled \"Weird Sexy Cool\" and earned a the spot of top 16 albums on the itunes RNB charts. With all his endeavors on the rise Devvon Terrell will surely make the transformation from local talent, to mainstream superstar.", "url": "https://www.facebook.com/events/1042945595776720/", "source": "Facebook", "name": "Futuristic and Devvon Terrel 4/17/16 at Blind Pig - Ann Arbor"}, {"date": "2016-04-18T12:00:00-04:00", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "url": "https://www.facebook.com/events/1573275812982685/", "source": "Facebook", "name": "Fresh + Fit!"}, {"date": "2016-04-18T19:00:00-04:00", "description": "Literati is thrilled to welcome Amy Gustine in support of her acclaimed debut collection, You Should Pity Us Instead.\n\nYou Should Pity Us Instead explores some of our toughest dilemmas: the cost of Middle East strife at its most intimate level, the likelihood of God considered in day-to-day terms, the moral stakes of family obligations, and the inescapable fact of mortality. Amy Gustine exhibits an extraordinary generosity toward her characters, instilling them with a thriving, vivid presence.\n\n\"Gustine excels at dramatizing the cunning of the human animal—a creature renowned for its skill at self-sabotage—as well as celebrating the freakish grace that can sometimes strike an ordinary life. You Should Pity Us Instead is a devastating, funny, and astonishingly frank collection.\"    –Karen Russell\n\nAmy Gustine’s fiction has appeared in several journals, including The Kenyon Review, The Alaska Quarterly Review, The Cimarron Review, and the Chicago Tribune’s Printers Row Journal. Her work has also received Pushcart Prize Special Mention.", "url": "https://www.facebook.com/events/1160668480634425/", "source": "Facebook", "name": "Fiction at Literati: Amy Gustine"}, {"date": "2016-04-18T20:00:00-04:00", "description": "Monday, April 18 | 8pm | 18+ | $15 adv./ $17 day of\n\nPolica with MOTHXR \n\nUnited Crushers (out March 4, 2016) is POLIÇA’s third full-length release and most remarkable album to date. The band, which includes Channy Leaneagh, dual drummers, Drew Christopherson and Ben Ivascu and Chris Beirden on bass with producer Ryan Olson at the helm, collectively wrote the album in Minneapolis in the winter of 2015 during their first true break from two straight years of touring. The new album builds on POLIÇA’s signature synthesizer and percussion-heavy sounds with more complex arrangements and a bigger, crisper hi-fi punch due to the new approach they took to writing and recording: together, all in the same room. There's a tighter groove to these songs and a more vulnerable quality to them, especially in Leaneagh's singing. Her incredible vocal range is consistently on display throughout, beautifully raw and less electronically effected than on previous recordings. United Crushers is the follow up to 2013’s Shulamith which EW called \"propulsive enough for dance floors, and dreamy enough for headphones\" andMOJO said \"proves that intelligent pop music still has the ability to seduce and enthral.\" Their debut, 2012's Give You The Ghost, also garnered international acclaim, with Rolling Stone hailing it as \"the sound of heartbreak and celebration happening simultaneously\" and Q praising it as \"a bewitching, urgent, magical debut.\" The band has conquered massive festivals around the world from Coachella to Glastonbury in addition to performing on Late Night With Jimmy Fallon, Later With Jools Holland and more.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/564", "url": "https://www.facebook.com/events/769930223136488/", "source": "Facebook", "name": "Polica w/ Mothxr 4/18/16 @ Blind Pig - Ann Arbor"}, {"date": "2016-04-19T09:00:00-04:00", "description": "Oats & Woes & Babo, Oh My!\n\nBabo presents Oats & Woes Ann Arbor a local oatmeal pop-up! Launching The \"babo Study Buddy\" & \"The Nutty Professor\" for the first time EVER (See ingredients below)! \n\nEach bowl is packed with oats and topped with sweet and healthy breakfast options so you can fuel up for the day.\n\nWe will be selling each bowl individually and giving away our exclusive recipe so you can create your own oatmeal bowl at home!\n\nNo tickets are required for this event. \n\nbabo Study Buddy\n-Bob's Red Mill Oats\n-Strawberry compote\n-Fresh Strawberries\n-Fresh Avocados\n-Michigan Honey \n-babo Seedtrus Granola\n\nThe Nutty Professor \n-Bob's Red Mill Oats\n-Banana Compote\n-Justin's Peanut Butter\n-Coconut Oil\n-Bananas \n-Justin's Peanut Butter cup's\n-babo roasted peanuts", "url": "https://www.facebook.com/events/1725654407681535/", "source": "Facebook", "name": "Oats & Woes Oatmeal Pop-up!"}, {"date": "2016-04-19T13:10:00-04:00", "description": "This event is geared toward Ypsilanti employees. \n\nDrop in to this casual informational workshop to find out how these bus service improvements could impact your bus commute. \n\nAlso welcome are any employees who may be interested in taking to bus but are unsure what to do.\n\nFree snacks and giveaways provided!\nRSVP: https://www.messageblocks.com/commute-by-bus-ypsi", "url": "https://www.facebook.com/events/617117388436683/", "source": "Facebook", "name": "Commute by Bus in Ypsi? Read this!"}, {"date": "2016-04-19T19:00:00-04:00", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-          April 19 - Eric Moore\nEric Moore is a familiar face on the Ann Arbor/Ypsi scene. A Pittsburgh native, Moore has been a human jukebox in dive bars, a songsmith on festival stages, and a hootenanny revivalist. Eric’s stellar fingerstyle work bumps down the jagged, thorny backroads of the Mississippi delta and skips over the seas to the British Isles. \n\nWhile he was working as a river guide in Grand Teton Nat’l Park, he frequented the  legendary Hootenanny at Dornans in Jackson Hole, WY. The Hoot’s mandate on traditional music was a scourge to many a songwriter, but not so for Moore. He began a spirited inquiry into acoustic guitar styles and the pre-war songbook. Taking cues from players like Bert Jansch, John Martyn, Archie Fisher and the Delta Blues great Tommy Johnson, Moore brings fresh arrangements and decades of performing experience to his spirited originals and traditional music from both sides of the Atlantic.\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/1699294757015373/", "source": "Facebook", "name": "Acoustic Tuesdays: Eric Moore"}, {"date": "2016-04-19T19:00:00-04:00", "description": "Can you feel it? Spring? It's there hiding behind the snow -- come celebrate it with us! Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Reader\n\nThis month's feature: SUSAN HUTTON!\n\nSusan Hutton graduated from Kalamazoo College, and got an MFA from the University of Michigan. She held a Wallace Stegner fellowship in poetry at Stanford University. Her poems have appeared in magazines such as Poetry, Ploughshares, and FIELD. Her book, On the Vanishing of Large Creatures (Carnegie Mellon, 2007), won the John C. Zacharis First Book Award. She works at University of Michigan and is chair of the City of Ann Arbor Environmental Commission and a member of the Ann Arbor Climate Partnership.\n\n\nNext month's feature: STEVIE EDWARDS!", "url": "https://www.facebook.com/events/1536622576641711/", "source": "Facebook", "name": "Skazat! Poetry Series featuring Susan Hutton"}, {"date": "2016-04-20T16:00:00-04:00", "description": "Audtions WED & THU APRIL 20-21 4-7 PM\nCallbacks SAT APRIL 23 4-7 PM, East Quad Rom 1405\n \nNo monologue needed; Be prepared to work with scenes from the play.  Many roles are double cast.  Performances in June.", "url": "https://www.facebook.com/events/557979811041512/", "source": "Facebook", "name": "SITA 2016 Auditions"}]