[{"source": "Facebook", "description": "Park in our lot and one of our made in-house brats*, just $25! We'll be tailgating all day, too- $2 pints, burgers on the grill, and good times. Go Blue!\n\n*Please note that it is just one brat per car for $25.", "url": "https://www.facebook.com/events/1054342014672793/", "name": "Spot and a Brat", "date": "2016-09-24T09:00:00-04:00"}, {"source": "Facebook", "description": "Every game day Saturday, we'll be selling $2 pints outside during our tailgating party. This week, we'll have Arbor Brewing Company serving up their Sacred Cow IPA- join us!", "url": "https://www.facebook.com/events/209376246146287/", "name": "Pints on the Porch", "date": "2016-09-24T09:00:00-04:00"}, {"source": "Facebook", "description": "September 24 is National Public Lands Day! Join us to celebrate your city's public lands, and enjoy a day by the river in this 22-acre park. Learn how to identify and cut invasive species such as buckthorn and honeysuckle. Doing so will allow native species to thrive and provide natural habitat for wildlife.  Meet in the parking lot north of the Argo Canoe Livery, off Longshore Drive. Please wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free. #NPLD", "url": "https://www.facebook.com/events/908820275930383/", "name": "Stewardship Workday- Argo Nature Area", "date": "2016-09-24T09:00:00-04:00"}, {"source": "Facebook", "description": "Sat. September 24 | 8pm | 18+ | $15 Cover\n\nThe Slackers wsg: Duppies\n\nThe Slackers are self styled masters of Reggae, Ska and Rock’n’Roll from New York City. The Slackers began in 1991 in NYC. After years of local gigs and rehearsing in a dingy basement in Manhattan’s lower east side, the band released its debut album, Better Late Than Never, in 1996. The band’s success resulted in the release of a second album, Red Light, on the Epitaph label in 1997. Since then the Slackers have released 11 more studio albums (The Question, Wasted Days, Slackers & Friends, Close My Eyes, Slackers in Dub, Peculiar, Boss Harmony Sessions, Self Medication, Lost and Found, The Great Rocksteady Swindle, and The Slackers [self-titled, 2016] ) 3 live albums (Live at Ernestos, Upsettin Ernestos, Slack in Japan), several EPs (International War Crimminal, My Bed is a Boat), and numerous singles and compilation tracks. Since 1997 the Slackers have played over 100 shows every year in a total of 46 american states, 7 Canadian provinces, 22 European countries, 5 Latin American countries, and 2 Asian countries. The band’s musical style is distinct from their contempories; a mix of early Jamaican music with classic 50’s and 60s American styles. There are influences from 50s and 60s Rock’n’Roll, Rythmn and Blues, Jazz and Latin music. Singer Vic Ruggiero has coined the term ‘Jamaican Rock’nRoll.’ to describe it. He says, “The band might play a classic Jamaican style but the vocals are distinctly American east coast, revealing the obvious connection of Jamaican music to the Doo-Wop of Harlem and the Bronx.” With the demise of record companies over the last 5 years, the Slackers have successfully used crowdfunding (www.bigtun.es/theslackers.) to release new music including the latest release, The Slackers [self-titled] in February 2016.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/671", "url": "https://www.facebook.com/events/992824104100196/", "name": "The Slackers 9/24/16 at Blind Pig - Ann Arbor", "date": "2016-09-24T20:00:00-04:00"}, {"source": "Facebook", "description": "Come catch these 3 local groove machines at Club Above in Ann Arbor and share in a night of pure jollification. \n\n18+\n$5, $7 under 21\n\nDoors @ 9\nLiquid Monk  9:30-10:15\nMa Baker 10:30-11:45\nChirp 12-end \n\nChirp is a four-piece band that does it's fair share of genre-hopping, but often plays in the styles of progressive rock/funk, and jazz-fusion. Chirp mixes originals and covers into their live sets and aims to put together grabbing, dynamic shows. \nhttps://soundcloud.com/chirplive\n\nLiquid Monk\nIntense fusion of funk, soul, jam, electronic and jazz from Metro Detroit.\nhttp://www.liquidmonk.com\n\nMa Baker\nhttps://soundcloud.com/mabakerofficial", "url": "https://www.facebook.com/events/1143080695735014/", "name": "Chirp w/ Liquid Monk and Ma Baker at Club Above", "date": "2016-09-24T21:00:00-04:00"}, {"source": "Facebook", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/", "name": "POP-X", "date": "2016-09-25T12:00:00-04:00"}, {"source": "Facebook", "description": "UMMA docents will guide visitors through the galleries on tours as diverse as their interests and areas of expertise. Each docent plans a theme and includes a variety of styles and media to illuminate his or her ideas. Themes may be repeated but each docent's approach and choice of objects is unique.\nEngaging with Art tours are generously supported by the Berkowitz Family Endowed Fund.", "url": "https://www.facebook.com/events/243563482709889/", "name": "Guided Tour: Engaging with Art", "date": "2016-09-25T13:00:00-04:00"}, {"source": "Facebook", "description": "The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink celebrates gifts to the museum from two accomplished scholars with eclectic interests, a keen appreciation of form, and a love of learning from objects. Nesta Spink, curator at UMMA from 1967 to 1979, is regarded as the preeminent authority on the lithographs of J a.m.es McNeill Whistler. U-M professor emeritus Walter Spink is a world-renowned specialist on early Buddhist art and architecture in India. UMMA docents will discuss the exquisite Whistler prints, a rich representation of South Asian folk art, and other highlights from their gifts", "url": "https://www.facebook.com/events/166502213757646/", "name": "Guided Tour The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink", "date": "2016-09-25T14:00:00-04:00"}, {"source": "Facebook", "description": "Shutta Crum is an author, lecturer, teacher, and retired librarian, all in the field of children s books. Among her most popular titles are Thunder-Boomer (Clarion), which received four starred reviews, was nominated for a Cybil Award, and was an SLJ Best Book, a Smithsonian Magazine Notable Book, and an ALA Notable Book, and Mine (Knopf), which also received four starred reviews. She lives in Michigan. Learn more at www.shutta.com.\n\nKristin Bartley Lenz is a writer and social worker whose career has taken her through rural Appalachia, the California Bay Area, and inner-city Detroit. She graduated from the University of Michigan and Wayne State University, and co-edits the Michigan Chapter blog for the Society of Children’s Book Writers and Illustrators. Her debut young adult novel,The Art of Holding On and Letting Go, is a Junior Library Guild Fall 2016 Selection. Learn more at www.kristinbartleylenz.com.\n\n\nhttp://bit.ly/2bQGKoc", "url": "https://www.facebook.com/events/1005664552885633/", "name": "Launch Party for Shutta Crum & Kristin Bartley Lenz", "date": "2016-09-25T15:00:00-04:00"}, {"source": "Facebook", "description": "The Celtic Room at Conor O'Neill's Pub\n318 South Main St, Ann Arbor, MI 48104\nShow starts at 5:30pm - Doors at 5:00pm\nGeneral: $15 | Students: $12 | Kids under 10 free\n_________________________________________\nAislinn Gagliardi is an Irish harpist and composer based in Chicago, and is well sought after as a performer, teacher and recording artist. Drawing from her background in Irish dance, and influenced by a diverse musical range from classical to Cape Breton, Aislinn’s distinct style shines through her music in an open and honest way. Known for her syncopated and rhythmic accompaniment, her compositions and arrangements offer a fresh perspective to the Irish music tradition.\n\nRaised immersed in the Irish culture (the shared heritage on both sides of her family) Aislinn learned about Irish customs through dance, music and language lessons. She was drawn to the harp from an early age, and studied with various Irish and Celtic harpers including Janet Harbison and Michael Rooney. Aislinn also spent a semester abroad at the University of Limerick where she worked closely with Irish harper Fionnuala Rooney.\n\nAislinn’s recently released debut solo harp album The Thin Place has been called “stunning, a monumental piece of work from a very talented and driven harper” and “for a first CD it’s a winner” (Jack Baker of Irish American News). The album blends popular traditional Irish tunes with those less commonly played, and features four of her own compositions including one with the album’s namesake. Joining Aislinn on select tracks are some of Chicago’s finest Irish musicians: Liz Carroll (fiddle), Teresa Shine (fiddle) and John Williams (concertina). Aislinn’s tune The Thin Place and accompanying track is also featured on the Irish Traditional Music Archive’s Newly Composed Tunes and Songs in the Irish Tradition playlist. Listen to a sample here.\n\nFrom performing annually at Irish festivals including the Milwaukee Irish Fest, to private events and traditional Irish music sessions, Aislinn is in high-demand as a performer and keeps a busy schedule. She is a featured musician for the annual iBAM! (Irish Books Arts & Music) Gala Dinner, and played for celebrations honoring the opening of the Ireland: Crossroads of Art & Design, 1690-1840 exhibit at the Art Institute of Chicago.\n\nAislinn holds a B.F.A. in Inter-Arts (music and dance), an interdisciplinary major in Ethnic Studies and a certificate in Celtic Studies. She has taught workshops at the Milwaukee Irish Fest School of Music (MIFSM), the Milwaukee Irish Fest Summer School, the Great Lakes Harpers (GLH) Regional Conference, and the Madison Folk Harp Society. Currently Aislinn teaches from her private studio in Chicago and via Skype, is on faculty at the MIFSM, and teaches workshops at the Old Town School of Folk Music.\n\nVisit Aislinn on the web at www.aislinnmusic.com\n\nThis project is partially supported by an Individual Artist Program Grant from the City of Chicago Department of Cultural Affairs & Special Events, as well as a grant from the Illinois Arts Council, a state agency through federal funds provided by the National Endowment for the Arts.", "url": "https://www.facebook.com/events/1160032467389616/", "name": "Aislinn Gagliardi- Irish Harp Concert", "date": "2016-09-25T17:30:00-04:00"}]