[{"date": "2017-03-19T10:00:00-04:00", "name": "Women's History Month and Planned Parenthood", "source": "Facebook", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "url": "https://www.facebook.com/events/189417071550325/"}, {"date": "2017-03-19T10:15:00-04:00", "name": "Planer/Joiner /Drum Sander!", "source": "Facebook", "description": "This class will introduce you to the Wood studio's 20\" planer, 8\" jointer and 24\" drum sander. These 3 tools are great to know if doing any type of woodworking project. You will learn basic operation with an emphasis on safety. With the successful completion of this class you will be certified to use the planer and jointer and drum sander on your own.", "url": "https://www.facebook.com/events/428044140874064/"}, {"date": "2017-03-19T16:00:00-04:00", "name": "Eliot Heaton & Pauline Martin", "source": "Facebook", "description": "Eliot Heaton, violin\nPauline Martin, piano\n\n\nEliot and Pauline present a recital featuring pieces of American influence, including a world premier of by David DiChiera.\nProgram\nSonatina, Opus 100 - Antonin Dvořák \nFantasy for Violin and Piano (World Premier) - David DiChiera\nSonata for Violin and Piano - Maurice Ravel\nTzigane - Maurice Ravel\nSonata No. 3, Op. 45 in C Minor - Edvard Grieg\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student", "url": "https://www.facebook.com/events/965754946893895/"}, {"date": "2017-03-19T17:00:00-04:00", "name": "Collaborative Concert with Paul Keller At Sundown Quintet", "source": "Facebook", "description": "This concert will feature the renowned Paul Keller AT SUNDOWN Quintet performing a variety of jazz standards. In addition, the quintet will also perform both Jimmy McHugh's \"Exactly Like You\" and Andy Razaf's \"Memories of You\" alongside the CMSa2 Youth Orchestras, the arrangements for which were done by Paul Keller himself! The concert will also include the results of a blues and improvisation workshop that Paul Keller will be doing with the Youth Orchestras the week before. It will truly be a concert unlike any other that CMSa2 has done before!\n\nFree admission\n$10 suggested donation", "url": "https://www.facebook.com/events/192527691243482/"}, {"date": "2017-03-19T18:30:00-04:00", "name": "Fireside Fun", "source": "Facebook", "description": "There's nothing quite as relaxing as sitting around a campfire, roasting marshmallows and swapping stories. One Sunday a month, we'll be stoking the fires here at LSNC. Bring your family, friends, camp chairs, outdoor games, and s'mores fixings. We'll provide a blazing outdoor campfire and plenty of marshmallows. This event is rain or shine (except for thunder and lightening), so come dressed for the weather.\n\nAges: All ages\nFree", "url": "https://www.facebook.com/events/1910256985874096/"}, {"date": "2017-03-19T19:00:00-04:00", "name": "Open Mic and Feature: Fiona Chamness", "source": "Facebook", "description": "Fiona Chamness is a poet, musician, and songwriter from Ann Arbor, MI. She is coauthor, with Aimée Lê, of Feral Citizens, published in 2011 by Red Beard Press.  Her poems have appeared in PANK, Muzzle, Radius, Blood Lotus, Beloit Poetry Journal, and other places, and her crown of sonnets, \"Choreography for Ensemble\", was awarded the 2014 Beloit Poetry Journal Prize. She has performed poetry and music in Ann Arbor, Chicago, Oberlin, Hanover, Boston, St. Louis, Berkeley, and Sevilla, Spain, and was featured in the 2010 HBO documentary Brave New Voices. She is the Short Story Advisor at the Neutral Zone.", "url": "https://www.facebook.com/events/1688664764767139/"}, {"date": "2017-03-19T19:30:00-04:00", "name": "Michigan Women // Girly Show", "source": "Facebook", "description": "Michigan Women\nA Charity Concert for Alternatives for Girls\n\n$20 General Admission\n$10 Student\n\nThis evening of music will feature the Junior and Senior women of the University of Michigan Musical Theatre department. The concert will celebrate women's achievements in the field of music as the singers present songs by female composers and lyricists.\nProceeds from this concert will go to Alternatives for Girls, a charity organization based in Detroit serving homeless and high-risk girls and young women.  \n\nSince 1987, AFG has provided critical services to the girls and young women we serve, including safe shelter, street outreach and educational support, vocational guidance, mentoring, prevention activities, and counseling. The goal is to empower the girls and young women we serve to make positive choices. For more information, visit alternativesforgirls.org.", "url": "https://www.facebook.com/events/1373243996066280/"}, {"date": "2017-03-19T20:30:00-04:00", "name": "Sing Happy!", "source": "Facebook", "description": "Join us for a rousing evening of Kander & Ebb's best songs, in new, inventive arrangements and mashups, at Conor O'Neill's Irish Pub in Ann Arbor! Grab a dinner-and-a-show combo ticket for just $30, or choose to join us for the show only, for $15.00. Dinner seatings begin at 6:00pm; curtain is at 7:30pm. Performances are February 2, 3, 7, 8, 9, 14, 15, and 16.", "url": "https://www.facebook.com/events/254338798323472/"}, {"date": "2017-03-20T01:00:00-04:00", "name": "Babo Juice Cleanses", "source": "Facebook", "description": "COLD-PRESSED JUICE CLEANSES ARE BACK!\n\n... and just in time for the New Year! For the month of January only– get 10% off your juice cleanse and a free yoga class with Bikram Yoga West!\n\nBook your Cleanse now with promo code JUICECLEANSEJANUARY at Store.BaboAnnArbor.com!", "url": "https://www.facebook.com/events/388503011499248/"}, {"date": "2017-03-20T09:00:00-04:00", "name": "2017 Local Food Summit", "source": "Facebook", "description": "Register at localfoodsummit.org!\n\nOnline registration ends at 8 pm Sunday March 19th. \nDay of the event registration will begin at 7:30 am at the EMU Student Center.\n\nThe Local Food Summit brings together individuals and organizations that share a common vision for the localized food system of Washtenaw County. The 2017 event utilizes a summit style format, featuring facilitated group discussions that include learning, dialogue, and collective visioning. The summit hopes to engage new audiences as well as long-time participants, including purchasers, chefs, producers, distributors, consumers, educators, business owners, politicians, and local food activists. Attendees will participate in one of six tracks, allowing them to think deeply about a particular aspect of our local food system, and to consider the impacts of racism and policy in Washtenaw County. \n\nTRACKS\n•\tRacism and Access to Land and Capital \n•\tFarm to Institution\n•\tMarket Development\n•\tFarm Worker and Labor Justice\n•\tCurrent Environmental Issues\n•\tFood Justice\n\nCost of Attendance (includes breakfast and lunch)\nEarly registration (before 3/13) - $40\nRegistration at the door - $50\nScholarships are available upon request.", "url": "https://www.facebook.com/events/303111296758253/"}]