[{"date": "2016-10-16T11:00:00-04:00", "description": "October 15, 2016–January 29, 2017\n\nKabuki actors were superstars in eighteenth- and nineteenth-century Japan. They were admired by passionate fans with an insatiable appetite for images of them, fed by a publishing industry that mass-produced colorful woodblock prints of actors on stage that could be cheaply purchased as souvenirs of or substitutes for a theater experience. Japanese Prints of Kabuki Theater from the Collection of the University of Michigan Museum of Art presents a selection of these dramatic prints that connected fans to their idols, including off- or backstage portrayals that satisfied fans’ voyeuristic curiosity about their favorite actors’ lives, fantasy scenes of actors in unlikely groupings, and even death portraits of especially famous actors. \n\nThis introduction to the visual culture \rkabuki theater includes prints by major artists such as Utagawa Toyokuni (1769–1825), Utagawa Kunisada (1786–1865), Utagawa Kuniyoshi (1797–1861), and Toyohara Kunichika (1835–1900).\rLead support for this exhibition is provided by the University of Michigan Office of the Provost, the National Endowment for the Arts, the William T. and Dora G. Hunter Endowment, AISIN, the E. Rhodes and Leona B. Carpenter Foundation, and the University of Michigan Center for Japanese Studies. Additional generous support is provided by the Japan Foundation and the University of Michigan Institute for Research on Women and Gender.", "name": "Japanese Prints of Kabuki Theater from the Collection", "url": "https://www.facebook.com/events/942422309235271/", "source": "Facebook"}, {"date": "2016-10-16T12:30:00-04:00", "description": "Use laser-cut felt bodies and vinyl cut parts along with a heat press to learn hand stitching and machine sewing to create your own terrific tiny creature! \n\nAt the end of this workshop, you’ll walk away with an awesome monster as well as basic stitching and machine sewing skills to carry your interests further. \n\nThis workshop is taught by innovative fiber artist and milliner Je’Tone Alexander.\n\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=16&month=10&year=2016&view=day to sign up. Cost is $75, which includes materials, tools, and instruction. No prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.", "name": "Sew a Felt Plush Monster Make and Take", "url": "https://www.facebook.com/events/876248455852023/", "source": "Facebook"}, {"date": "2016-10-16T13:00:00-04:00", "description": "Stewardship Workday\nSunday, October 16\nOnder Nature Area\n1 to 4 p.m.\nOnder Nature Area is a small neighborhood park and home to many black cherry and box elder trees with a few large oak trees. By connecting with other natural areas and features, it serves as a landscape corridor and provides convenient habitat and migration for birds, mammals, reptiles and insects. Help is needed to restore Onder’s oak savanna by removing invasive shrubs such as buckthorn. Meet at the park entrance on Brookside Drive. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks, and know-how provided. Free.", "name": "Stewardship Workday-Onder Nature Area", "url": "https://www.facebook.com/events/1040562206025801/", "source": "Facebook"}, {"date": "2016-10-16T15:00:00-04:00", "description": "A Museum Arts Experience for Persons with Mild Memory Loss and Their Care Partners. Sunday, October 16, 3–4 p.m.\n\nTo register for this program, email amcdearmon@alz.org or call the local Alzheimer’s Association 800.272.3900 at any time. For more information, please contact UMMA at 734.647.0522 during normal business hours.\n\n\rMeet Me at UMMA invites people with mild memory loss to enjoy a guided gallery experience along with family members or care partners. This program is designed for people who live at home and their companions.\rIf you or someone you care about is experiencing mild memory loss, research has shown that the visual and expressive arts can be good for your mind. In addition, great enjoyment is to be found in seeking out the sights, sounds, textures, and good feelings that come with looking at, learning, and sharing feelings about paintings, music, and other creative arts.\r\n\nUMMA's trained docents will accompany small groups for a guided tour and provide the opportunity for everyone to experience different kinds of art and share their responses.\rMeet Me at UMMA is generously supported by the Monroe-Brown Foundation Discretionary Fund for Outreach to the State of Michigan and individual donors.", "name": "Meet Me at UMMA", "url": "https://www.facebook.com/events/692215930926869/", "source": "Facebook"}, {"date": "2016-10-16T15:00:00-04:00", "description": "To register for this program, email amcdearmon@alz.org or call the local Alzheimer’s Association 800.272.3900 at any time. For more information, please contact UMMA at 734.647.0522 during normal business hours.\nMeet Me at UMMA invites people with mild memory loss to enjoy a guided gallery experience along with family members or care partners. This program is designed for people who live at home and their companions.\n\nIf you or someone you care about is experiencing mild memory loss, research has shown that the visual and expressive arts can be good for your mind. In addition, great enjoyment is to be found in seeking out the sights, sounds, textures, and good feelings that come with looking at, learning, and sharing feelings about paintings, music, and other creative arts.\n\nUMMA's trained docents will accompany small groups for a guided tour and provide the opportunity for everyone to experience different kinds of art and share their responses.\n\nMeet Me at UMMA is generously supported by the Monroe-Brown Foundation Discretionary Fund for Outreach to the State of Michigan and individual donors.", "name": "Meet Me at UMMA: A Museum Arts Experience for Persons with Mild", "url": "https://www.facebook.com/events/319178665102823/", "source": "Facebook"}, {"date": "2016-10-16T16:00:00-04:00", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games", "url": "https://www.facebook.com/events/170692690037313/", "source": "Facebook"}, {"date": "2016-10-16T17:30:00-04:00", "description": "The Celtic Room at Conor O'Neill's Pub\n318 South Main St, Ann Arbor, MI 48104\nShow starts at 5:30pm - Doors at 5:00pm\nGeneral: $15 | Students: $12 | Kids under 10 free\n\nMARLA FIBISH and BRUCE VICTOR are NOCTAMBULE.  They play original and traditional music in a variety of forms – original musical settings of a broad array of poetry, original instrumental pieces, and traditional Irish tunes and songs. This unique collaboration brings out qualities in both of these seasoned musicians that you may not have heard from them before.  Their music is rendered with lush beauty, sensitivity and humor on an unusual array of strings  -- various guitars in varied tunings, mandola, mandolin, bouzouki, cittern, tenor guitar -- and their blended voices.\n\n They take the name Noctambule, French for 'night-owl,’ from a Robert Service poem about a nocturnal ramble through the back alleys of Paris, which they have set to music and included on their acclaimed CD Travel in the Shadows.  Their first CD together, it explores many forms of the ‘night journey’ in song, offering the traveler the opportunity to see and experience things differently once the usual sources of light have been extinguished.  They have selected a broad variety of ‘noctambulatory’ verse from Tennyson, Neruda, Roethke, St. Vincent Millay, and Robert Service. In addition, they include two original instrumental pieces – a reel and a waltz – as well as one traditional Irish song. \n\n BRUCE VICTOR is an eclectic and accomplished guitarist and composer, who plays several different guitars in several different tunings. Seemingly resisting any single musical genre, he has been labeled a 'poly-stylist’ by one of the editors of Acoustic Guitar magazine. He has played with The Sirens of San Francisco, The Triplicates, and as a solo performer.  He was the founder of The Acoustic Vortex, a non-profit musical organization that produced house concerts, mentored youth performers, and performed benefit concerts for other non-profit organizations.  He is also a practicing psychiatrist and was a Clinical Professor of Psychiatry in the School of Medicine at the University of California, San Francisco.\n\n MARLA FIBISH is well known in the Irish music world, bringing a musicality and excitement to the tradition that is seldom heard on the mandolin.  She is also known for her compositions, musical settings of poetry and instrumental pieces that have been featured in her work with Out of the Rain, and Three Mile Stone, and on her acclaimed instrumental recording with Jimmy Crowley, The Morning Star. In addition to the mandolin, Marla brings mandola, tenor guitar, bouzouki, accordion, and her alto voice to the Noctambule sound.\n\nPack something warm, and come prepared for adventure ....\n\nVisit Noctambule on the web at http://www.noctambulemusic.com/", "name": "Noctambule - In Concert", "url": "https://www.facebook.com/events/1357192890965241/", "source": "Facebook"}, {"date": "2016-10-16T18:00:00-04:00", "description": "Our annual awards event, the Civvies, is coming up! Our event this year will be held at Live in downtown Ann Arbor, Sunday, October 16, from 6-9 PM. \nDoors open at 6, show starts at 7.\nWe'll have food provided by our generous sponsors and donors, and each attendee receives one complimentary beverage (beer, wine, or soft drink).  There will also be a cash bar.\nCocktail or red carpet attire is encouraged, but not required. \nWe hope to see you there!", "name": "The 2015-2016 Season Civvie Awards", "url": "https://www.facebook.com/events/1754471844769507/", "source": "Facebook"}, {"date": "2016-10-16T19:00:00-04:00", "description": "Sign-ups open at 6:30pm. Poets go live at 7:00pm.", "name": "Open Mic and Maybe Slam", "url": "https://www.facebook.com/events/183990555376089/", "source": "Facebook"}, {"date": "2016-10-16T19:00:00-04:00", "description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "name": "The Arcade - A Pointless Improv Jam", "url": "https://www.facebook.com/events/1262141223819345/", "source": "Facebook"}]