[{"source": "Facebook", "date": "2017-02-13T17:00:00-05:00", "description": "Joins us for our special Valentine's Day creations all weekend long all they way through Valentine's Day. \n\nWe'll be featuring some great Food & Beverage Specials. To make your reservations visit SavasRestaurant.com/reservations or call us at 734-623-2233\n\nDRINK SPECIALS\n__________________\n\nA FRENCH ROSE\ncreme yvette, cocchi americano rosa, parigot rosé\n\nQUEEN OF HEARTS\nhendrick's gin, st. germain, lavender syrup, lemon juice, cranberry juice, apple-cranberry cider\n\nKING OF HEARTS\njohnnie walker red, averna, carpano antica, chocolate bitters\n\nDINNER SPECIALS\n__________________\n\nFILET & PRAWNS\nchoice grade 6 oz. filet with 2 jumbo prawns and beurre maître d’hotel. With pommes fondant and veal glazed carrots\n\nMOULES  CHAMPAGNE \nbay harbor mussels steamed in an herbed champagne cream broth, served with baguette\n\nOYSTERS\noysters, black pepper-balsamic sorbet, minced shallot, micro radish, cucumber brunoise\n\nHALF-ROAST CHICKEN\nbrined half-chicken, roasted fingerling potatoes, warm spinach salad with apple, sarvecchio and creamy bacon vinaigrette\n\nRISOTTO STUFFED SQUASH\nbutternut squash risotto, wild mushroom blend, braised leeks, roast acorn squash, curried romesco, roasted asparagus", "url": "https://www.facebook.com/events/1197760063612471/", "name": "Sava's Valentine's Day Featured Food & Beverage Specials"}, {"source": "Facebook", "date": "2017-02-13T17:30:00-05:00", "description": "CMSa2 welcomes instrumentalists of all ages to come join our Classical and Jazz ensembles during a week of open house rehearsals! Experience the joy of playing in an orchestra, jazz combo or chamber ensemble, meet our conductors and teachers, learn more about our programs, make new friends and play music from Beethoven to Chick Corea to John Williams!\n\nThe schedule for the rehearsals is listed below:\n\nMONDAY:\nConcert Orchestra - 5:30PM-7:15PM @ Scarlett Middle School\nSymphony Orchestra - 6:30PM-8:30PM @ Scarlett Middle School\nWind Ensemble - 6:30PM-8:30PM @ CMSa2\nBrass Ensemble - 6:30PM-8:30PM @ CMSa2\n\nTUESDAY\nYouth Jazz Combo - 6:00PM-7:30PM @ CMSa2\nAdult Jazz Combo - 8:00PM-9:30PM @ CMSa2\n\nWEDNESDAY\nNew Horizons Senior String Orchestra - 1:00PM-3:00PM @ CMSa2\nAdult Jazz Combo - 8:00PM-9:30PM @ CMSa2\n\nTHURSDAY\nPercussion Ensemble - 6:30PM-8:30PM @ Clague Middle School\n\nWe look forward to seeing everyone there!", "url": "https://www.facebook.com/events/397979943874993/", "name": "CMSa2 OPEN HOUSE"}, {"source": "Facebook", "date": "2017-02-13T19:00:00-05:00", "description": "Literati is pleased to welcome Katie Kitamura in support of her most recent novel, A Separation, a staff favorite and a Literati Cultura selection. Katie will be joined in conversation by Natalie Bakopoulos, author of The Green Shore.\n\nA young woman has agreed with her faithless husband: it’s time for them to separate. For the moment it’s a private matter, a secret between the two of them. As she begins her new life, she gets word that Christopher has gone missing in a remote region in the rugged south of Greece; she reluctantly agrees to go look for him, still keeping their split to herself. In her heart, she’s not even sure if she wants to find him. As her search comes to a shocking breaking point, she discovers she understands less than she thought she did about her relationship and the man she used to love. \n\nA searing, suspenseful story of intimacy and infidelity, A Separation lays bare the gult that divides us from the inner lives of others. With exquisitely cool precision, Katie Kitamura propels us into the experience of a woman on edge, with a fiercely mesmerizing story to tell.\n\n“A slow burn of a novel that gathers its great force and intensity through careful observation and a refusal to accept old, shopworn narratives of love and loss.” —Jenny Offill, author of Dept. of Speculation\n\n“A novel so seamless, that follows its path with such consequence, that even minor deviations seem loaded with meaning. Wonderful.” —Karl Ove Knausgaard, author of My Struggle\n\n“The burnt landscape, the disappearance of a man, the brilliantly cold, precise, and yet threatening, churning tone of the narrator—make A Separation an absolutely mesmerizing work of art.” —Rachel Kushner, author of The Flamethrowers\n\n“Profound and gripping. I had that rare sense of feeling like I was in a creation specifically made out of words, that couldn’t have been made out of any other substance. Kitamura combines the calm complexity of Joseph Conrad with the pacing and reveal of Patricia Highsmith. This novel is a wonder and a pleasure.” —Rivka Galchen, author of Atmospheric Disturbances and Little Labors\n\n“A Separation opens up fissures of ambiguity in emotional experiences too often misunderstood as monolithic—grief, desire, estrangement—and plumbs these crevices for all their complexities. It has both urgency and afterglow: I read it quickly, but didn’t stop thinking about it for a long time once I was done.” —Leslie Jamison, author of The Empathy Exams\n\nKatie Kitamura is a critic and novelist living in New York City. She is the author of Gone to the Forest and The Longshot, both of which were finalists for the New York Public Library’s Young Lions Fiction Award. A recipient of a Lannan Residency Fellowship, Kitamura has written for The New York Times, The Guardian, Granta, BOMB, Triple Canopy, and is a regular contributor to Frieze.\n\nEvent date: \nMonday, February 13, 2017 - 7:00pm\nEvent address: \nLiterati Bookstore\n124 E. Washington St.\nAnn Arbor, MI 48104", "url": "https://www.facebook.com/events/1276276879126240/", "name": "Katie Kitamura, w/ Natalie Bakopoulos"}, {"source": "Facebook", "date": "2017-02-14T06:30:00-05:00", "description": "Take your date to Sweetwaters on Washington Street and get a FREE single brewed coffee with the purchase of a slice of pie! A delicious deal for the two of you. ❤️", "url": "https://www.facebook.com/events/139485063225277/", "name": "Celebrate Valentine's Day at SW"}, {"source": "Facebook", "date": "2017-02-14T16:00:00-05:00", "description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nRSVP on FB: http://bit.ly/29dSJv0\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule\n\n______________________________________________\n\n\nPreviously this season:\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nRSVP on FB: http://bit.ly/29dSikp\nBUY JUNE 11 TICKETS: http://bpt.me/2538000", "url": "https://www.facebook.com/events/192972824428594/", "name": "Ann Arbor Derby Dimes 2016 season"}, {"source": "Facebook", "date": "2017-02-14T16:00:00-05:00", "description": "Let’s celebrate Valentine’s Day All Week Long!\nSaturday, February 11 – Tuesday, February 14, 2017\nDinner Available Each Day 4pm – Close\n\n3- COURSE DINNER MENU FOR TWO\n\nFIRST COURSE\nPlease select one of the following:\nSoup, Bleu Cheese Cole Slaw, House Salad or Caesar Salad\n\nSECOND COURSE\nLobster Stuffed Filet Mignon\nTopped with hollandaise sauce then served with grilled asparagus and Duchess potatoes\n\nTHIRD COURSE\nDessert to share\nChocolate Molten Cake\nwith a warm creamy center and a scoop of vanilla ice cream\n\nReservations Recommended\n(888) 456-3463 (DINE)\nCall to reserve your spot!\n$69.95 for two, tax/gratuity not included.\nLimited time offer. \nhttp://carsonsamericanbistro.com/valentines-dinner-for-two/\n___________________________________\n\nDRINK SPECIALS \n(Not included in price of the Dinner for Two)\n\n“Amore Martini” \nMalibu, Peach Schnapps, Citrus Vodka, Cranberry Juice $10.95\n\n“Kir Royale”\nLaMarca Prosecco, Crème de Cassis $11.95\n\n____________________________________", "url": "https://www.facebook.com/events/1832607166998206/", "name": "Valentine’s Dinner for Two, 2/11 – 2/14"}, {"source": "Facebook", "date": "2017-02-14T16:00:00-05:00", "description": "The most romantic month of the year is almost here, and we know how to help you celebrate!\n\nTreat your sweetheart to the BEST Valentine's Day at Vinology Wine Bar and Restaurant! Featuring a special Valentines menu, and complimentary amuse with entree.\n\n(734) 222-9841 for reservations.", "url": "https://www.facebook.com/events/174718053016063/", "name": "Valentine's Day"}, {"source": "Facebook", "date": "2017-02-14T17:00:00-05:00", "description": "Join us every Tuesday for beer and veggies! We're hosting Sunseed Farm's fresh vegetable CSA pickup on Tuesday nights from 5-7 pm. CSA members are eligible for $2 and $3 flagship and Beer of the Month pints. Interested in joining Sunseed's CSA? Visit farmsunseed.com", "url": "https://www.facebook.com/events/731926473638010/", "name": "Sunseed Farm CSA Pickup"}, {"source": "Facebook", "date": "2017-02-14T17:00:00-05:00", "description": "Join us at Aventura for an exclusive Valentine's Day tasting menu created especially for you and your special someone in mind. From the ambiance to our service, all the way to the very last course, let us guide you through an experience you are sure to never forget! \n\n$85 Ticket Includes:\n\nSpecially crafted 4-Course Tasting Menu \nVegetarian Options Available\nCava Toast (Spanish bubbles)\nAperitivo \nTax and 18% Gratuity\nTicket pricing is per person. \n\nBe sure to book your evening with us right away, you won't want to miss this!\n\nVALENTINE'S DAY MENU\nTuesday, February 14\n \n4 COURSES – $85\n \nAPERITIVO\n______________________________________________________________________\n\nCOJONUDO \nground spanish chorizo, sweet onion, brava sauce, fried quail egg, on grilled brioche \n \n1st course\n______________________________________________________________________\n\nSALMOREJO CORDOBES Y CAVIAR\ntomato soup from andalusia with tuna, ibérian ham croutons, quail eggs, salmon caviar\n\n\n2nd Course\n______________________________________________________________________\n\nTARTAR DE ATUN DE ALMADRABA\nalmadraba tuna loin, soya, pickles, avocado, wasabi fly fish roes\n\n3rd Course\n______________________________________________________________________\nChoose One\n\nPRESA IBERICA CON FOIE GRAS\nsteak from black-footed ibérian pigs with foie gras\n\nPARRILLADA DE MARISCOS\ngrilled fish and seafood festival, sea bass, octopus, lobster, scallops, prawns, green sauce\n \n4th Course\n______________________________________________________________________\n\nBUÑUELOS DE CHOCOLATE, CHURROS Y HELADO DE TURRÓN\nchocolate beignets, churros and spanish nougat ice cream\n\n\nVALENTINE'S DAY VEGETARIAN MENU\n \n4 COURSES – $85\n\nAPERITIVO\n______________________________________________________________________\n\nTRUFA, PATATA Y BERENJENA | TRUFFLE, POTATO, AND EGGPLANT \npotato and truffle mash, roasted eggplant, honey, thyme, on grilled brioche \n\n1st Course\n______________________________________________________________________\n\nENSALADA CITRICA DE REMOLACHA\nmixed beetroot salad, citrus fruits, sour cream \n\n2nd Course\n______________________________________________________________________\n\nVEGETARIAN\nTARTAR VEGETARIANO\ntomato, roasted bell pepper, pickles, red onion, mustard, tahini, avocado\n\n3rd Course\n______________________________________________________________________\n\nARROZ BOMBA CON SETAS Y TRUFA\nspanish rice with mushrooms, truffles, saffron, garlic, fresh chili, sofrito\n \n4th Course\n______________________________________________________________________\n\nBUÑUELOS DE CHOCOLATE, CHURROS Y HELADO DE TURRÓN\nchocolate beignets, churros, and spanish nougat ice cream", "url": "https://www.facebook.com/events/747907762039624/", "name": "Valentine's Day at Aventura"}, {"source": "Facebook", "date": "2017-02-14T17:30:00-05:00", "description": "CMSa2 welcomes instrumentalists of all ages to come join our Classical and Jazz ensembles during a week of open house rehearsals! Experience the joy of playing in an orchestra, jazz combo or chamber ensemble, meet our conductors and teachers, learn more about our programs, make new friends and play music from Beethoven to Chick Corea to John Williams!\n\nThe schedule for the rehearsals is listed below:\n\nMONDAY:\nConcert Orchestra - 5:30PM-7:15PM @ Scarlett Middle School\nSymphony Orchestra - 6:30PM-8:30PM @ Scarlett Middle School\nWind Ensemble - 6:30PM-8:30PM @ CMSa2\nBrass Ensemble - 6:30PM-8:30PM @ CMSa2\n\nTUESDAY\nYouth Jazz Combo - 6:00PM-7:30PM @ CMSa2\nAdult Jazz Combo - 8:00PM-9:30PM @ CMSa2\n\nWEDNESDAY\nNew Horizons Senior String Orchestra - 1:00PM-3:00PM @ CMSa2\nAdult Jazz Combo - 8:00PM-9:30PM @ CMSa2\n\nTHURSDAY\nPercussion Ensemble - 6:30PM-8:30PM @ Clague Middle School\n\nWe look forward to seeing everyone there!", "url": "https://www.facebook.com/events/397979943874993/", "name": "CMSa2 OPEN HOUSE"}]