[{"name": "Fresh + Fit!", "date": "2016-04-04T12:00:00-04:00", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint  want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 8 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 8, at one of our in-store demos (see demo schedule below) or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse= 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nIn Store Demo Schedule:\n\nTuesday 12 PM -2 PM\nbabo: Real Food Fast\n12 Nickels Arcade\n\nWednesday 11 AM- 1 PM\nbabo: Farm Fresh Meals to go\n2825 Boardwalk Dr.\n\nFriday 12 PM-2 PM\nbabo: A Market by Sava\n403 E. Washington St.\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "source": "Facebook", "url": "https://www.facebook.com/events/857480274361121/"}, {"name": "TheRide’s ServiceFest", "date": "2016-04-04T17:30:00-04:00", "description": "Get ready for the largest expansion of bus service since 1979!\n\nOrganizations are welcome to send front-line staff to learn how to assist clients with bus service information.\n\nThe May, 2016 service expansion will be the biggest in TheRide's history...creating more ways to connect with jobs, school, appointments, shopping and family and friends. \n\n\"Get Ready!\" for:\n*More routes to serve more places\n*More frequent service\n*More direct routes in Ann Arbor and Ypsilanti\n*New route names and numbers\n*New service to Scio Township\n*New service in Pittsfield Township\n\nVisit http://TheRideYourWay.org/ for more information on the improvements coming on May 1st!", "source": "Facebook", "url": "https://www.facebook.com/events/1032406803469486/"}, {"name": "Desiree Cooper", "date": "2016-04-04T19:00:00-04:00", "description": "Literati is delighted to welcome Desiree Cooper in support of her debut, Know the Mother.\n\nWhile a mother can be defined as a creator, a nurturer, a protector—at the center of each mother is an individual who is attempting to manage her own fears, desires, and responsibilities in different and sometimes unexpected ways. In Know the Mother, author Desiree Cooper explores the complex archetype of the mother in all of her incarnations. In a collage of meditative stories, women—both black and white—find themselves wedged between their own yearnings and their roles as daughters, sisters, grandmothers, and wives.\n\nIn this heart-wrenching collection, Cooper reveals that gender and race are often unanticipated interlopers in family life. An anxious mother reflects on her prenatal fantasies of suicide while waiting for her daughter to come home late one night. A lawyer miscarries during a conference call and must proceed as though nothing has happened. On a rare night out with her husband, a new mother tries convincing herself that everything is still the same. A politician’s wife’s thoughts turn to slavery as she contemplates her own escape: \"Even Harriet Tubman had realized that freedom wasn’t worth the price of abandoning her family, so she’d come back home. She’d risked it all for love.\" With her lyrical and carefully crafted prose, Cooper’s stories provide truths without sermon and invite empathy without sentimentality.\n\nKnow the Mother explores the intersection of race and gender in vignettes that pull you in and then are gone in an instant. Readers of short fiction will appreciate this deeply felt collection.\n\nA 2015 Kresge Artist Fellow, Desiree Cooper is a former attorney, Pulitzer Prize-nominated journalist and Detroit community activist whose fiction dives unflinchingly into the intersection of racism and sexism. Using the compressed medium of flash fiction, she explores intimate spaces to reveal what it means to be human. Her fiction and poetry have appeared in Callaloo, Detroit Noir, Best African American Fiction 2010, and Tidal Basin Review, among other online and print publications. Cooper was a founding board member of Cave Canem, a national residency for emerging black poets. She is currently a Kimbilio fellow, a national residency for African American fiction writers.", "source": "Facebook", "url": "https://www.facebook.com/events/910013872430895/"}, {"name": "Chairlift 4/4/16 at Blind Pig - Ann Arbor", "date": "2016-04-04T21:00:00-04:00", "description": "Monday, April 4 | 9pm | 18+ | $13 adv./ $15 day of\n\nChairlift wsg Starchild & The New Romantic\n\nCritically acclaimed pop duo Chairlift has released new music in the form of the infinitely danceable “Ch-Ching.” The R&B laced, vibrating drum infused pop track serves as the first musical offering from their forthcoming album Moth, which will be released in January 2016 via Columbia Records. Although the single is the first work to be released from Chairlift in three years, the duo – comprised of writer/producers and multi-instrumentalists Caroline Polachek and Patrick Wimberly – has hardly been quiet. They collaborated with Beyoncé on her groundbreaking self-titled album via the track “No Angel,” which was written and produced by Caroline and co-produced by Patrick. Caroline released and toured Arcadia, a self-produced solo album under the alias Ramona Lisa and collaborated with SBTRKT, Blood Orange and others, while Patrick produced and collaborated with artists such as Solange Knowles, Wet, Kelela, and Tei Shi.\n\nAn evolution from their last album, 2012’s Something, Moth proves to be an emotionally uninhibited and markedly stronger, more pop inspired body of work. A very New York City inspired album, listeners can expect to be led through an aural mix of big, rich pop inspired hooks, vibrating bass, lively brass and sensuous R&B inspired vocals, all anchored in the duo’s meticulously crafted instrumentation.", "source": "Facebook", "url": "https://www.facebook.com/events/162598590780251/"}, {"name": "Acoustic Tuesdays: Bob Skon", "date": "2016-04-05T19:00:00-04:00", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nAPRIL\n\n-          April 5 - Bob Skon \nhttp://bobskon.com/\n\"Bob is a musician best described in the singer / songwriter style, blended with a healthy dose of folk-rock, and a touch of jazz.... He has a wonderful ability to use intelligent wordplay for capturing those moments in life we can all identify with. In this Bob could be a peer of the legendary Ray Davies.\" - The Bodhisattva Beat\n\n-          April 12 - NEW DATE– Nick Zomparelli \nhttps://www.facebook.com/pingpongtheband\nhttps://www.facebook.com/daughtersofeternity/\nMulti-instrumentalist Nick Zomparelli (Ping Pong, Daughters of Eternity) performs an eclectic blend of originals and covers with a vibe so nice.\n\n-          April 19 - TBA\n\n-         April 26 - Heather Schwartz\nhttp://www.heatherschwartzmusic.com/\nHeather Schwartz has become known for creating a unique concert experience, with a vintage charm and passionate vocals she truely connects with her audience.  Inspired and influenced by Jazz, Blues, Classical, R&B, Soul and Hip-Hop, Heather's style is developed and versatile.  Walking into one of her productions is like time-traveling into the 1920’s -- She creates an old-school, speakeasy type of atmosphere in obscure, unique or underground venues all across Ann Arbor and beyond. \n\nNew a cover\nAlways a good time", "source": "Facebook", "url": "https://www.facebook.com/events/1658487314415325/"}, {"name": "Breeding Bird Survey Kickoff", "date": "2016-04-05T19:00:00-04:00", "description": "Calling all bird-watchers! We need your help to identify the bird species breeding in city parks. This is the night to sign up for your favorite park and pick up materials for our annual survey. *Some experience in bird identification is necessary*! City Ornithologist Julet Berger will also report on last year's survey. Please register by April 4.", "source": "Facebook", "url": "https://www.facebook.com/events/514345188768401/"}, {"name": "Meet Debut Novelist Lisa Beazley for a Discussion & Signing for 'Keep Me Posted'", "date": "2016-04-05T19:00:00-04:00", "description": "Sisters Cassie and Sid Sunday have not done a bang-up job of keeping in touch. In their defense, it hasn’t been easy: life veered in sharply different directions for the once-close sisters. Today, beautiful and big-hearted Sid lives an expat’s life of leisure in far-off Singapore, while harried, iPhone-clutching Cassie can’t seem to make it work as a wife and a mom to twin toddlers in Manhattan. \n \nIt doesn’t help that Sid spurns all social media while Cassie is addicted to Facebook. So when Sid issues a challenge to reconnect the old-fashioned way—through real, handwritten letters—Cassie figures, why not? \n \nThe experiment exceeds both of their expectations, and the letters become a kind of mutual confessional that have real and soul-satisfying effects. And they just might have the power to help Cassie save her marriage, and give Sid the strength to get her life back on track.\n \nBut first, one of Cassie’s infamous lapses in judgment comes back to bite her, and all of the letters wind up the one place you’d never, ever want to see them: the Internet…\n\nLisa Beazley has worked in journalism and public relations for more than fifteen years.", "source": "Facebook", "url": "https://www.facebook.com/events/1528777447422865/"}, {"name": "Intro 1: Welcome to Improv", "date": "2016-04-05T19:00:00-04:00", "description": "Learn the fundamentals of improvisation, basic games, scene work and skills. Get used to being on stage and working with others in safe, supportive environment. For ages 18 and up. Every Tuesday for 8 weeks. \n\nDeadline to enroll is April 1.", "source": "Facebook", "url": "https://www.facebook.com/events/205371939823376/"}, {"name": "Run River North w/ The Lighthouse & The Whaler 4/5/16 @ Blind Pig - Ann Arbor", "date": "2016-04-05T20:00:00-04:00", "description": "Tuesday, April 5 | 8pm | 18+ | $12 Cover\n\n“During the writing of Drinking From A Salt Pond, the band admits to flaring tempers and tense operations as they worked to redefine their sound, goals, and relationships…”\n\nRun River North will be the first to tell you: it has largely been an uphill climb for the indie rock sextet from Los Angeles, a hero’s journey full of odds-defying opportunities seized amidst rocky naysayers and the snagging brambles of band life. And now, with their second full-length album Drinking From A Salt Pond, Run River North are poised to push forward and create their own wake as a major voice in today’s music landscape.\n\nSince the band’s beginnings just over four years ago, their rise has been steadily spectacular, marked by appearances on national television, sold-out shows at historic venues, tours with rock and roll royalty and heaps of praise from fans and critics alike. As they blossomed, they embraced their initially folk-driven sound, which found its harmonic home alongside rootsy, foot stomping, sing-along-leading peers like Mumford & Sons, The Head and the Heart, and Of Monsters and Men. Powered by the acoustic-guitar-and-vocals songwriting of frontman Alex Hwang, their 2014 self-titled debut record, produced by Phil Ek (Fleet Foxes, Modest Mouse, Band of Horses), was released with their lineup rounded out by the strings duo of Daniel Chae and Jennifer Rim, Joe Chun on bass, Sally Kang on keys, and John Chong on drums.\n\nAs time and tours passed, the six lives spent in close-quarters began to grind the gears a little differently; their whole dynamic began to change. “When we became a band, we mostly played Alex’s songs in band form,” says Chae. “Since then we’ve all put our musical input into it, so the music has changed a lot.”\n\n“We were tired of me on acoustic guitar and everybody singing harmonies,” says Hwang. “We were hitting a ceiling, and it wasn’t fun. We had always agreed this band was six-ways, for better or worse. So at the end of last year, after being in the van constantly, we said, ‘no more touring, let’s write new songs.’”\n\n“We had to grow up pretty fast as a band,” says Chong. “So this past year, there were times when different perspectives and priorities have butted heads.”\n\nDuring the writing of Drinking From A Salt Pond, the band admits to flaring tempers and tense operations as they worked to redefine their sound, goals and relationships. “We’ve had a lot of hating each other, almost kicking people out of the band,” says Hwang. “We’re being honest and that openness is one of the main thrusts for the album. Embracing the bitter with the sweet, not trying to hide the crappy parts…the crappy parts helped make the good.” Being open about its faults, the band recognizes how the turmoil has helped Run River North create something beautiful.\n\n“The record we just made, it’s all the difficult stuff we went through so there’s a darker tone to the music. It works,” says Chae.\n\nOne of the first steps in leaving behind their folk roots was to work with new collaborators. Instead of the reverb-heavy, northwest sound of Ek, they recorded in Los Angeles with Lars Stalfors (Cold War Kids, HEALTH, Deap Vally, Matt and Kim) at the production helm. Stalfors opened their eyes to the upbeat energy and electric tone of indie bands like The Walkmen. Throughout Salt Pond the indie rock influence can be heard, with the band nodding inspiration to everyone from Cage the Elephant and Kings of Leon to The National, Death Cab for Cutie, and Cold War Kids, whose studio in San Pedro, CA the band borrowed to make the album. Also, in a move encouraged by their record label, Nettwerk, Hwang and Chae were sent to Nashville for a week in April 2015 to work on a few new tracks with two different co-writers, Lincoln Parish (formerly of Cage the Elephant) and the Kings of Leon collaborator Nick Brown.\n\n“It was weird but at the same time it was really encouraging,” says Hwang of the co-writing. “It was like bringing our demos to a blind date.”\n\nThe first song from the Nashville sessions was “Run Or Hide,” co-written with Parish, and from first listen it’s clear that Run River North are exploring bombastic new territory. Hwang, Chae, and Parish came up with an organic way of working that was based on jamming and vibing together, and once the song’s melody was nailed down, the rest came easily. It was immediately hard-hitting than any previous song from the band, with a discernible strut serving as a sonic contrast. When the demo was sent home to LA, the rest of the band was shocked.\n\n“Almost everyone else was really scared,” says Hwang, “‘this is not your voice, this is not who we are.’ I was confident it was a really good song and that we were gonna keep it. There’s nothing more aggressive on the record, and that groove on the verses is bigger than the band. The band can’t contain the song.”\n\n“I loved it!” says Chong emphatically. “Alex has a very wide range of emotion when he sings—soft, whispery things; really bombastic; rough—this song showcases all of that. I got really excited. When we recorded it, it really showcases more groove. Joe, our bass player, is solid, and the way the melody is created in the verses really adds to that. There’s a really cool contrast happening, but the choruses hit hard.”\n\nThe other song written in Tennessee was the Nick Brown co-penned “Can’t Come Down,” a track with pop qualities that the band does not shy away from recognizing. For that they leaned on Brown heavily, who served almost as a mentor to Hwang and Chae during the sessions, teaching them about pop hooks, authenticity, and Southern tradition. Deciding to go all in on a pop song, the trio rallied behind Brown’s catchy melodies and licks, and what they ended up with is a happy medium that “still sounds as Run River North as possible,” according to Chong, while simultaneously reaching for the rafters.\n\n“We really gelled with Nick Brown,” says Hwang. “We had the same idea: ‘We have enough songs that exemplify us, so let’s try our hand at writing a pop hook.’ With that mentality we came up with ‘Can’t Come Down.’ Nick wrote the hook, Daniel and Nick wrote the music, and a heavy collaboration on lyrics from everyone. It’s the first song I ever sang the word ‘baby’ in.”\n\nWith those songs firmly planting the band’s flag in new ground, it is Hwang’s “29” that may be the best indicator of the band Run River North are becoming. A piano and drum fueled anthem examining the ups and downs of transition, it finds the singer posing multiple existential questions at once. “Everyone’s always talking about how if you will something, it’s gonna happen. But, sometimes it doesn’t!” says Hwang. “That was a realization I wanted to play with: ‘Your words are cold like the wind…’ It’s kind of like saying, ‘I don’t care what you think,’ but it’s also a reflection about my words. What I do can be just as insignificant as anyone else. So what are you gonna do about it? You’re 29. ‘I know it’s home, I know it hurts/I know I’ll end up at the bottom/What if I leave?’ What if we go on this tour and we don’t end up anywhere? The brutal question is, who cares, and why does it matter? Not answering that in the song really helps. The music is still upbeat, it still has the ‘oh’s’ going on, it’s an anthemic thing. I’m still energetic, I’m not some old dude at 29.”\n\n“29” was written on electric guitar, a tool Hwang has been using more frequently since the end of the debut album’s touring cycle. Originally intended for a more somber feel, at the suggestion of their producer Stalfors, the tempo rose to meet Hwang’s intonations. “It became this song with so much energy,” says Chong, “it’s probably the fastest song we’ve ever done as a band. It’s new territory for us; it’s very fun. It’s a good transition, with lulled verses and really upbeat instrumentals and choruses. This is a good appetizer for our old fans, as this is who we’ve become.”\n\nEmbracing their natural growth and learning to ride the waves of their personal and musical evolutions with open hearts and nimble hands, Run River North have created a sophomore album that will propel them to the forefront of today’s landscape. Although at times the rushing water of their rise will pool into depths tough to swallow, they have learned to lean on each other and to trust themselves along the way in order to make something lasting and truly beautiful.\n\n“From the start, we always said we wanted to play on the biggest stages possible,” says Hwang. “That’s still the same. But it isn’t some self-indulgent dream of becoming rock stars; we still want to support our families with this, we still have the parents that sacrificed for us and we want to honor them. For us as a band, at times it’s felt like we’ve been drinking from a salt pond—and yet, we still created something pretty fresh that we like and are proud of.”\n\nWSG: The Lighthouse and the Whaler\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/634", "source": "Facebook", "url": "https://www.facebook.com/events/629378653882823/"}, {"name": "Women's Hebrew Poetry on American Shores", "date": "2016-04-06T19:00:00-04:00", "description": "Literati is pleased to present a roundtable discussion, in conjunction with the Jean & Samuel Frankel Center for Judaic Studies, to mark the publication of Women's Hebrew Poetry on American Shores: Poems by Anne Kleiman and Annabelle Farmelant.\n\nAlthough Anne (Chana) Kleiman—who died in 2011 at the age of 101—was the first American-born Jewish woman to publish poems in Hebrew, and Annabelle (Chana) Farmelant—who is still living and occasionally publishing—wrote a substantial body of Hebrew verse from the 1940s to the 1960s, their work is virtually unknown today, even to those familiar with Hebrew literature in America. The roundtable will discuss the singular voices of these women, introduce their captivating and wide--ranging poetry and place it in its historical, literary, and cultural contexts. The rountable will feature editor Shachar Pinsker, the translator Adriana Jacobs, Adina Kleiman (the daughter of the poet Anne Kleiman), and faculty from the Frankel Center who are experts on American Jewish Literature.", "source": "Facebook", "url": "https://www.facebook.com/events/598128680341803/"}]