[{"description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nDickie D. - Richard Delcamp, Singer-songwriter-guitar-banjo artist from Dragon Wagon, one of Michigan's premier bluegrass outfits,  playing a little bit of everything, Acoustic rock/Americana/traditional roots/bluegrass/folk/blues/original songwriting!\n\nNew a cover\nAlways a good time", "date": "2016-08-30T19:00:00-04:00", "url": "https://www.facebook.com/events/1777527079192278/", "source": "Facebook", "name": "Acoustic Tuesdays: Rich Delcamp"}, {"description": "Literati is pleased to welcome Fabienne Josaphat in support of her debut novel, Dancing in the Baron's Shadow.\n\nHaiti, 1965. Francois Duvalier, often called Papa Doc or Baron Samedi, is a brutal dictator using extreme violence to control the impoverished island nation. Unrelenting curfews are imposed on the people of Port-au-Prince and the ever-present bogeymen, Tonton Macoutes militia, have scared away even the bravest of tourists. For taxi driver Raymond L'Eveillé, life under these conditions is becoming increasingly untenable. Unable to properly feed his wife and young children, or pay the rent on time, Raymond's family is on the brink of destitution. By contrast, Raymond's brother Nicolas is a wealthy professor at the local university. A believer in law and justice, Nicolas is secretly writing a socialist manifesto, in an attempt to rally support for those that oppose Papa Doc's harsh dictatorship. When Nicolas' home is searched as a result of his liberal lectures, the violent and unfeeling Tonton Macoutes quickly arrest him and send him to Fort Dimanche, an over-filled, disease-ridden prison that few survive. Meanwhile, Raymond comes home to find his wife has left with their children, hoping to build a better life for her starving family abroad. With his family gone, and as Nicolas' colleagues continue to disappear, Raymond plunges into a daring scheme to save his brother. In order to gain access to the dreaded Fort Dimanche, the cab driver does something few Haitians would ever dream of doing: he gets himself arrested. Once inside, and with the help of a small gang of resistance fighters and a sympathetic prison guard, the two men will attempt a death-defying prison break. But first, they will both have to survive life in Fort Dimanche. The harrowing experience shared by the two brothers is brutal, heartbreaking and ultimately triumphant. \n\nJosaphat's electric prose brings to life a horrifying and not so distant time in Haiti's past while exploring the best and worst of humanity. The novel examines power's tendency to corrupt, the impulse of nationalistic pride, and above all, the human desire to survive, while describing in rigorous detail the shocking realities of life in the Baron's shadow.\n\n\"Dancing in the Baron's Shadow takes us to hell and back, inside one of the most brutal prisons run by one of the world’s most ruthless dictators. Fabienne Josaphat impressively brings to life a horrible period as well as the men and women who fought against it. Filled with life, suspense, and humor, this powerful first novel is an irresistible read about the nature of good and evil, terror and injustice, and ultimately triumph and love.\"—Edwidge Danticat, author of Claire of the Sea Light\n\nFabienne Josaphat received her M.F.A. in creative writing from Florida International University. Dancing in the Baron’s Shadow is her first novel. She lives in Miami.\n\nEvent date: \nWednesday, August 31, 2016 - 7:00pm", "date": "2016-08-31T19:00:00-04:00", "url": "https://www.facebook.com/events/614305965415106/", "source": "Facebook", "name": "Fabienne Josaphat"}, {"description": "Lunches and snacks and dinners, oh, my! Back to school means a lot of meals to get ready with less time, but no worries- we're here to help! Join us for our Back to School Vendor Fair, where we'll be joined by some of our favorite vendors to provide inspiration for school days eats.", "date": "2016-09-01T16:00:00-04:00", "url": "https://www.facebook.com/events/1755447901393272/", "source": "Facebook", "name": "Back to School Vendor Fair"}, {"description": "Our in-house Oktoberfest release is one of our favorite days of the year! Come say \"o'zapft is\" with us -- we'll have German food specials running all weekend and 11x17 prints of our Oktoberfest poster wil be available for purchase. Prost!", "date": "2016-09-01T16:00:00-04:00", "url": "https://www.facebook.com/events/660184664155555/", "source": "Facebook", "name": "Oktoberfest Release"}, {"description": "Our in-house Oktoberfest release is one of our favorite days of the year! Come say \"o'zapft is\" with us -- we'll have German food specials running all weekend and 11x17 prints of our Oktoberfest poster wil be available for purchase. Prost!", "date": "2016-09-02T16:00:00-04:00", "url": "https://www.facebook.com/events/660184664155555/", "source": "Facebook", "name": "Oktoberfest Release"}, {"description": "UMMA and Arts at Michigan celebrate Welcome Week by introducing new University of Michigan students to the wide array of possibilities for arts participation on campus. This evening event will feature live music and performances, WCBN DJs, dance, poetry, film, games, prizes, and a variety of art-making activities.\nArtscapade! is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement, and co- sponsored by Arts at Michigan.", "date": "2016-09-02T19:00:00-04:00", "url": "https://www.facebook.com/events/315486072133698/", "source": "Facebook", "name": "Artscapade!"}, {"description": "Far House is very excited to present a full night of inspiring Hip Hop featuring touring & local artists\n\nUncommon NASA (NY)\nhttp://www.uncommonnasa.com/home\n\nCarl Kavorkian (PA)\nhttps://carlkavorkian.bandcamp.com/\n\nEon Zero (A2)\nhttps://soundcloud.com/eonzero\n\nTru Klassick (A2)\nhttps://www.reverbnation.com/truklassick\n\nDoors open @ 8pm\nPlease remember to give respect the artists, the venue & eachother.\nSuggested $5- donation for our ever traveling artists!!", "date": "2016-09-02T21:00:00-04:00", "url": "https://www.facebook.com/events/278131005878261/", "source": "Facebook", "name": "♛ Uncommon NASA ♛ Carl Kavorkian ♛ Eon Zero ♛ Tru Klassick ♛"}, {"description": "Doors @ 9 pm\n$5 Cover\n$8 for 18+\n\nSET LIST:\n\nILLINGSWORTH\nhttps://soundcloud.com/illingsworth\n\nJONAH BASEBALL\nhttps://soundcloud.com/jonah-baseball\n\nDJ FLP\nhttps://soundcloud.com/djflp\n\nLIL SKINNY\nhttps://soundcloud.com/lil-skvnny\n\n+ Special Guests\n\nHouse DJ's\nMEGABLOWN \nDJ GRAND LOVELY\n\nHosted by FALF", "date": "2016-09-02T21:00:00-04:00", "url": "https://www.facebook.com/events/1004824282970256/", "source": "Facebook", "name": "SAFE HOUSE 2 at Club Above 9/2/16"}, {"description": "We're having a huge UV Paint Party to kick off the season! We'll have paint cannons splashing you with water-based, kid-safe, and washable paint + black lights all over to make the colors stand out. Wear white to really make it pop! \n\nDon't want to? No problem. Watch from the mezzanine and party in the other paint-free places.\n\n• DRINK SPECIALS. Happy Hour is from 9pm - 11pm with\n50% off all drinks, shots & bottled beers. $2 Miller Lite bottles & $2 Vodka Drinks all night.\n\n• MUSIC. DJ Hardy spins the best Top 40, Dance & House with host MC Yoda.\n\n• FREE PICTURES with your friends by a professional photographer.\n\n• COVER. $5 for 21+ & $10 for 18 to 20.\n\nCome play in the paint.", "date": "2016-09-03T21:00:00-04:00", "url": "https://www.facebook.com/events/817917348344519/", "source": "Facebook", "name": "Ultraviolet: Paint Party at Necto"}, {"description": "Our in-house Oktoberfest release is one of our favorite days of the year! Come say \"o'zapft is\" with us -- we'll have German food specials running all weekend and 11x17 prints of our Oktoberfest poster wil be available for purchase. Prost!", "date": "2016-09-04T16:00:00-04:00", "url": "https://www.facebook.com/events/660184664155555/", "source": "Facebook", "name": "Oktoberfest Release"}]