[{"date": "2016-09-07T09:00:00-04:00", "name": "Sweetwaters Westgate Grand Opening!", "source": "Facebook", "description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "url": "https://www.facebook.com/events/1090878344334512/"}, {"date": "2016-09-07T16:00:00-04:00", "name": "Oktoberfest Release", "source": "Facebook", "description": "Our in-house Oktoberfest release is one of our favorite days of the year! Come say \"o'zapft is\" with us -- we'll have German food specials running all weekend and 11x17 prints of our Oktoberfest poster wil be available for purchase. Prost!", "url": "https://www.facebook.com/events/660184664155555/"}, {"date": "2016-09-07T17:00:00-04:00", "name": "First Wednesday Food Truck Rally", "source": "Facebook", "description": "Summer vacation might be over, but we're not quite ready to stop the fun! Join us for our second to last food truck rally of the season! As always, your favorite local food trucks will be serving up a deliciously good time! Face painting, live music and more for a great kick off to the school year! \n\nDon't forget to tag us in your photos with #a2rally We're on Twitter and Instagram too!\n\nUpcoming Rallies:\nSeptember 7\nOctober 5", "url": "https://www.facebook.com/events/891980987615391/"}, {"date": "2016-09-07T18:30:00-04:00", "name": "Ann Arbor Roller Derby Fresh Meat Boot Camp", "source": "Facebook", "description": "Roller derby is a sport played on quad skates and a flat track. It is physically challenging, but increbily empowering and rewarding. Sound like something you would be interested in? Then consider joining Ann Arbor Roller Derby's Fresh Meat Boot Camp!!\n\n The Boot Camp is a 18 week long program that teaches everything from basic skating skills to the strategies and game play of roller derby. No skating experience is necessary -- most of our members started boot camp with zero skating ability.\n\nBoot camp will occur on Sundays from 10 am to 12 pm and Wednesdays from 6:30 to 8:30 pm at \"The Mint\" (444 James L Hart Parkway, Ypsilanti, MI). \n\nSo what all do you need to join boot camp?\n1. $200 boot camp fee (basically $50 a month for the 4 months of dedicated training you receive, this then drops to $40 a month as the regular league member dues)\n2. WFTDA insurance\n3. Gear (quad roller skates, knee pads, elbow pads, wrist guards, helmet, and mouthguard)\n4. New Skater Packet - https://docs.google.com/forms/d/e/1FAIpQLSfx6cqQ2LF3Xu0-CSd3AUQzRicLEXaT6s0n3fwGjhcYp25xJA/viewform", "url": "https://www.facebook.com/events/1341857332508937/"}, {"date": "2016-09-07T18:30:00-04:00", "name": "Scio Church Road Improvement Project Neighborhood Meeting", "source": "Facebook", "description": "The City of Ann Arbor will be preparing plans for the resurfacing of Scio Church Road between 7th Street and Main Street. You may see survey crews in the project area in the near future gathering information.\n\nWe will be hosting a public meeting to discuss the project and to gather input on design that might be incorporated into the design. Please join us to hear more about the details; we look forward to seeing you there!\nWednesday, Sept. 7, 2016, 6:30–8 p.m.\nProgram Room, Ann Arbor District Library Pittsfield Branch, 2359 Oak Valley Drive\n\nFor additional information/questions, please contact Jennifer Nelson, City of Ann Arbor Project Management Services Unit:\n734.794.6410 x 43672; jnelson@a2gov.org\n\nPersons with disabilities are encouraged to participate in public meetings. Accommodations, including sign language interpreters, may be arranged by contacting the City Clerk's office at 734.794.6140; via email to: cityclerk@a2gov.org;\nor by written request addressed and mailed or delivered to: \n\nCity Clerk's Office, 301 E. Huron St.\nAnn Arbor, MI 48104\n\nRequests made with less than two business days notice may not be able to be accommodated.\n\nhttp://www.a2gov.org/departments/engineering/Pages/Scio-Church-Road-Improvements-Project-.aspx", "url": "https://www.facebook.com/events/1242964722422772/"}, {"date": "2016-09-07T19:00:00-04:00", "name": "Ken Foster", "source": "Facebook", "description": "Literati is pleased to welcome Ken Foster in support of the his New York Times-bestselling memoir, The Dogs Who Found Me.\n\nIn concert with Ken's visit, we'll be holding a fundraiser for the Humane Society of Huron Valley's wonderful Bountiful Bowls program, which helps people keep pets instead of surrendering them to a shelter. HSHV accepts and distributes 40,000 pounds of pet food each year, and we're grateful for the work they do as well as their participation in this event. Food donations, as well as donations by cash or check, will be accepted at the event, or you can donate online. \n\nNow regarded as a classic in dog literature, Ken Foster's memoir chronicles his journey from first-time dog owner to rescuer—and all the lessons and mistakes he made along the way. Bookended by the tragedies of 9/11 and Katrina, Foster finds that dogs open his eyes to the benefits of compassion, selflessness, and the chaotic beauty of living each day in the moment. \n\nBut more than Foster's own story, readers remember the dogs. Among them are Duque, a Costa Rican stray; Brando, Foster's first adopted dog and a supposed pit bull mix who outgrew his Manhattan studio apartment; Rocco, a clownish red pit bull whose owner mistakenly gives him away to the wrong person; Zephyr, a cheerful Rottweiler mix who awakens Foster by sitting on his chest when his heart stops working; and Sula, the tiny lost pit bull who showed up at Foster's door one day and stayed. \n\nWhether bearing witness to national tragedy, grieving the death of a friend, or dealing with his own mortality, Foster finds strength in his dogs, and in the reciprocal nature of rescue. \n\n\"Generosity and gratitude power this compelling account of the reciprocal nature of rescue. Ken Foster illuminates a profound lesson about saving a life: Doing it makes you able to do it.\"–Amy Hempel, author of The Dog of the Marriage and Reasons to Live\n\nKen Foster is the editor of two anthologies, including Dog Culture, and the author of Dogs I Have Met and I’m a Good Dog. His collection of short stories, The Kind I'm Likely to Get, was a New York Times Notable Book. His work has appeared in The New York Times Book Review, The San Francisco Chronicle, McSweeney's, and The Believer. He has taught at The New School, Florida State University, and the University of Southern Mississippi. In 2008, he founded The Sula Foundation, which promotes responsible dog ownership among the pit bull population and sponsors education and outreach in the New Orleans area. He lives in New Orleans, with at least three dogs.", "url": "https://www.facebook.com/events/516806575181956/"}, {"date": "2016-09-08T17:00:00-04:00", "name": "Allergy-Friendly Tasting", "source": "Facebook", "description": "We know how tough it can be when a food you love doesn't love you back, so we're bringing out some of our favorite gluten, dairy, soy, and peanut alternatives. Life after gluten? We promise!", "url": "https://www.facebook.com/events/162980124110886/"}, {"date": "2016-09-08T18:30:00-04:00", "name": "Nature Walk with Ann Arbor District Library-Stapp Nature Area", "source": "Facebook", "description": "Nature Walk with Ann Arbor District Library\nThursday, September 8\n6:30 to 8 p.m.\nStapp Nature Area\nStapp Nature Area is a small park adjacent to the Traverwood Branch of the AADL. It contains mature oak-hickory forest and a vernal pond that is home to plentiful frogs, toads, turtles and salamanders! The nature area was named after William Stapp, who was a Professor of Environmental Education at the School of Natural Resources of the University of Michigan. Professor Stapp was internationally known for founding environmental education programs in 135 countries.\nThis nature walk is a collaboration between the AADL and Natural Area Preservation, and is part of a series that takes place each month throughout the summer and fall. For this one, parking will be available at the Traverwood Branch of the AADL, and we will meet just down the road at the entrance to the park. Wear comfortable shoes and bring water and bug spray if desired. Some of the AADL Science Tools will be available for use during the walk, too!", "url": "https://www.facebook.com/events/615888508589460/"}, {"date": "2016-09-08T19:00:00-04:00", "name": "Peter Ho Davies for 'The Fortunes'", "source": "Facebook", "description": "Peter Ho Davies is the author of two novels, The Fortunes and The Welsh Girl (long-listed for the Man Booker Prize), and two short story collections, The Ugliest House in the World(winner of the John Llewelyn Rhys Prize) and Equal Love (A New York Times Notable Book).\n\nHis work has appeared in Harpers, The Atlantic, The Paris Review, The Guardian and Washington Post among others, and has been widely anthologized, including selections for Prize Stories: The O. Henry Awards and Best American Short Stories. In 2003 Granta magazine named him among its Best of Young British Novelists.\n\nThe Book: \nSly, funny, intelligent, and artfully structured, The Fortunes recasts American history through the lives of Chinese Americans and reimagines the multigenerational novel through the fractures of immigrant family experience.Inhabiting four lives—a railroad baron’s valet who unwittingly ignites an explosion in Chinese labor, Hollywood’s first Chinese movie star, a hate-crime victim whose death mobilizes Asian Americans, and a biracial writer visiting China for an adoption—this novel captures and capsizes over a century of our history, showing that even as family bonds are denied and broken, a community can survive—as much through love as blood.Building fact into fiction, spinning fiction around fact, Davies uses each of these stories—three inspired by real historical characters—to examine the process of becoming not only Chinese American, but American.", "url": "https://www.facebook.com/events/945414925587833/"}, {"date": "2016-09-08T19:00:00-04:00", "name": "RHINO 40 Readings 40 Cities - Ann Arbor Edition", "source": "Facebook", "description": "We're kicking off our fall Open Mic series by celebrating RHINO's 40th birthday as part of their #RHINO40Readings40Cities project.\n\nWe begin with a brief open mic session followed by poets who have appeared in the RHINO poetry journal including Matthew Landrum and Simon Mermelstein, along with Monica Rico, Jennifer Metsker, Julie Babcock, John Buckley, and Ashwini Bhasi.", "url": "https://www.facebook.com/events/1253843057967373/"}]