[{"url": "https://www.facebook.com/events/278610785853131/", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nDickie D. - Richard Delcamp, Singer-songwriter-guitar-banjo artist from Dragon Wagon, one of Michigan's premier bluegrass outfits,  playing a little bit of everything, Acoustic rock/Americana/traditional roots/bluegrass/folk/blues/original songwriting!\n\nNew a cover\nAlways a good time", "name": "Acoustic Tuesdays: Rich Delcamp", "source": "Facebook", "date": "2016-10-18T19:00:00-04:00"}, {"url": "https://www.facebook.com/events/1050170571748316/", "description": "The weather is turning crisp and cool, so warm up with poetry and coffee at Sweetwaters Coffee & Tea. Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Readers\n\nThis month's feature: CITYWIDE POETS!\n\nThree representatives of Citywide Poets will feature this month: SAKILA ISLAM is a two time iO Slam Team member and current U of M Student. MARRIM AL-AKASHI is a Detroit Citywide poet alumna. Her poetry centers around her identity as a Muslim American poet of Iraqi descent. JUSTIN ROGERS is a Detroit poet educator and host. He was a BNV participant with Detroit's Youth Team Citywide Poets in '09 and 2011. CITYWIDE POETS (CWP) is Inside Out's award-winning after school performance poetry troupe for teens offers the mentorship of adult poets who possess strong publication and performance credentials. Youth perform at numerous venues, see their work published in an anthology, take awards for their poetry, and compete to attend the Brave New Voices National Youth Poetry Slam, held annually in various cities across the country.\n\n\nNext month: MATT HART!", "name": "Skazat! Poetry Series featuring Citywide Poets", "source": "Facebook", "date": "2016-10-18T19:00:00-04:00"}, {"url": "https://www.facebook.com/events/1760094844245246/", "description": "This class will introduce you to MIG and TIG welding. You will learn the basic operations with an emphasis on safety. Maker Works has welding jackets and face shields for you to borrow. If you have a welding jacket, please bring it. With successful completion of this class, you will be certified to use the TIG and MIG welder.\n\nPlease arrive 10 minutes early if visiting Maker Works for the first time. $70\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=19&month=10&year=2016&view=day to sign up.", "name": "MIG / TIG Welding", "source": "Facebook", "date": "2016-10-19T18:00:00-04:00"}, {"url": "https://www.facebook.com/events/333437037006239/", "description": "You've come to your local theatre/brewery to see the premiere of \"Happy Hour,\" a brand new play, only to find that you've stepped right into a space-time anomaly. The actors are all missing and the oblivious bartender doesn't know he's caught in a time loop - but he'll still serve you drinks! You and your team have one hour to find clues and solve puzzles in order to repair the timeline and, more importantly, escape the room. \n\nAdventure Lab is a new business specializing in escape rooms and other live-action puzzle games. If you enjoy puzzles, fun, adventures, games, or improving your small group communication skills, then you won't want to miss this unique event at Pointless!\n\nSelect the time and date you would like to attend. Each time slot is limited to 3-6 people.\n\nAdventures are:​\nWednesday, October 19 @ 6 pm\nWednesday, October 19 @ 8 pm\nWednesday, October 19 @ 10 pm", "name": "Trappy Hour - an escape room adventure with a Halloween twist", "source": "Facebook", "date": "2016-10-19T18:00:00-04:00"}, {"url": "https://www.facebook.com/events/1284592874904358/", "description": "Literati is pleased to welcome Christine Sneed and Grace Tiffany, reading from their latest work. \n\nChristine Sneed is the author, most recently, of The Virginity of Famous Men. Her story collection Portraits of a Few of the People I've Made Cry won the Grace Paley Prize, Ploughshares’ John C. Zacharis Prize, and was a Los Angeles Times Book Prize finalist. Her debut novel Little Known Facts won the Society of Midland Authors award for best adult fiction and was named a top ten debut novel of 2013 by Booklist. Her latest novel is Paris, He Said. Sneed teaches at Northwestern University and DePaul University and lives in Evanston, Illinois.\n\nGrace Tiffany is the author of six historical novels set in the Renaissance or Middle Ages, including Will (Berkley 2004), My Father Had a Daughter (Berkley 2003), Ariel (HarperCollins 2005), The Turquoise Ring (Berkley 2005), Paint (Bagwyn Books 2013), and Gunpowder Percy (ACMRS 2016). A Shakespeare scholar and editor, a professor of English at Western Michigan University, and the author of two nonfiction works on Renaissance literature and culture, Grace Tiffany uses fiction as an additional medium for exploring the early modern world", "name": "Christine Sneed & Grace Tiffany", "source": "Facebook", "date": "2016-10-19T19:00:00-04:00"}, {"url": "https://www.facebook.com/events/1769515709996649/", "description": "Two nights of dark delights!\n\nWednesday October 19, and Wednesday, October 26!\n\nThis annual event will be one of your favorite events this fall!  Please call 734.222.9841 for reservations.  Seats are very limited.", "name": "Black Wine Night", "source": "Facebook", "date": "2016-10-19T19:00:00-04:00"}, {"url": "https://www.facebook.com/events/200433560358995/", "description": "Wednesday, Oct. 19 | 9pm | 18+ | $10 Cover\n\nSeamlessly blending Funk, Soul, and Rock n’ Roll, THE MAIN SQUEEZE promises to keep your body moving with their infectious feel-good musical gumbo.\n\nThe energetic five-piece found its roots in Bloomington Indiana’s surprisingly vibrant live music scene, and they have been leaving audiences “Freshly Squozen” since 2010.\n\nTheir ability to fluidly blend and bend genres is unparalleled, and creates for an unforgettable live experience. Every performance is different from the last, showcasing each member’s virtuosic talent with soulful vocals, intricate jams, tight grooves and powerful solos.\n\nhttp://www.blindpigmusic.com/calendar.html#!/events/765", "name": "The Main Squeeze 10/19/16 at Blind Pig - Ann Arbor", "source": "Facebook", "date": "2016-10-19T21:00:00-04:00"}, {"url": "https://www.facebook.com/events/585713071616738/", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "name": "POP-X", "source": "Facebook", "date": "2016-10-20T12:00:00-04:00"}, {"url": "https://www.facebook.com/events/1775309142707137/", "description": "Come help us celebrate the difference you've made this year! Friends and family welcome. There will be a potluck dinner accompanied by fun games, presentations by NAP staff, and social time! This year's theme is Roaring 20's; costumes are encouraged! Let us thank you for all you've done for Ann Arbor's natural areas this year.  Please email us at NAP@a2gov.org or call 734.794.6627 to RSVP.", "name": "Volunteer Appreciation Potluck", "source": "Facebook", "date": "2016-10-20T18:30:00-04:00"}, {"url": "https://www.facebook.com/events/856469357818387/", "description": "Volunteer Appreciation Potluck\nThursday, October 20\nCobblestone Farm, 2781 Packard Road\n6:30 to 9:30 p.m.\nCome help us celebrate the difference you've made this year! Friends and family welcome. There will be a potluck dinner accompanied by fun games, presentations by NAP staff, and social time! This year's theme is Roaring 20's; costumes are encouraged! Let us thank you for all you've done for Ann Arbor's natural areas this year. Please email us at NAP@a2gov.org or call 734.794.6627 to RSVP.", "name": "Volunteer Appreciation Potluck", "source": "Facebook", "date": "2016-10-20T18:30:00-04:00"}]