[{"description": "A patch of dry prairie lines the Border-To-Border Trail in this park along the river, with many plants that are uncommon in our area. Help maintain this patch of special habitat by hand-pulling exotic weeds. Please meet at the south end of the park, in the parking lot off Lake Shore Drive (via Main Street).\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "source": "Facebook", "url": "https://www.facebook.com/events/1082355035168457/", "name": "Bandemer Park Stewardship Workday", "date": "2016-07-31T09:00:00-04:00"}, {"description": "Tipple My Dipple\n8.5 abv\n90 IBUs\n\nTipple:\nVerb\n1. Drink alcohol, especially habitually.\n\nDipple:\nNoun\n1. Double India Pale Lager, D.I.P.L.\n\nDME would like to introduce you to the first of a series of tippling beers. We really like the Double India style beer but feel that they always end up too sweet. We set out to make one as a lager that was extra drinkable. We accomplished this by drying out and lightening up the body by adding honey to our mash bill. Hopbursting at the end of the boil with fruity and juicy hops like Cascade, Falconer's, and Galaxy gave us the intense hop flavor and aroma while still kicking the IBUs up close to triple digits! Then for the first time we decided to double dry hop. This adds two more additional layers of hop flavor and aroma. In the end we have a hop crazy, Double India style lager that will be the first of its kind. We hope you enjoy drinking this as much as we enjoyed crafting it!\n\nCheers from DME", "source": "Facebook", "url": "https://www.facebook.com/events/175744482838588/", "name": "DME Pilot Beer Release: Tipple My Dipple", "date": "2016-07-31T12:00:00-04:00"}, {"description": "The Connoisseurs’ Legacy: The Collection of Nesta and Walter Spink celebrates gifts to the Museum from two accomplished scholars with eclectic interests, a keen appreciation of form, and a love of learning from objects. Nesta Spink, curator at UMMA from 1967 to 1979, is regarded as the preeminent authority on the lithographs of James McNeill Whistler. U-M professor emeritus Walter Spink is a world-renowned specialist on early Buddhist art and architecture in India. UMMA docents will discuss the exquisite Whistler prints, a rich representation of South Asian folk art, and other highlights from their gifts.", "source": "Facebook", "url": "https://www.facebook.com/events/552448484956885/", "name": "Guided Tour - Connoisseurs’ Legacy: Collection of Nesta and Walter Spink", "date": "2016-07-31T14:00:00-04:00"}, {"description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "source": "Facebook", "url": "https://www.facebook.com/events/1727899334148540/", "name": "Beer and Board Games", "date": "2016-07-31T16:00:00-04:00"}, {"description": "The top four poets from this year’s Finals Slam (in April) have been writing, editing, and rehearsing for three solid months in preparation for the NATIONAL POETRY SLAM. Do you want to hear the poems they have polished? Want to share space with them before they fly to Atlanta, GA Monday? \nCome to Espresso Royale this Sunday night! Bring yourself, bring poems for the open mic, and bring a generous tip for the team—they each still need $290. They've worked for this! Revel in the reward.", "source": "Facebook", "url": "https://www.facebook.com/events/1850858851808650/", "name": "2016 Team Showcase & Nationals Sendoff", "date": "2016-07-31T18:30:00-04:00"}, {"description": "Join us to play short-form improv games! All experience levels welcome. Come to watch or to play. It's free for participants, pay-what-you-can for spectators.", "source": "Facebook", "url": "https://www.facebook.com/events/254156904947652/", "name": "The Arcade - A Pointless Improv Jam", "date": "2016-07-31T19:00:00-04:00"}, {"description": "Literati is pleased to welcome Monica A. Coleman in support of her memoir, Bipolar Faith: A Black Woman's Journey Through Depression and Faith.\n\nIn a new memoir, Coleman reflects on the legacies of slavery, poverty, war, and alcoholism, and how these conditions can mask a history of mental illness. At once spiritual autobiography and memoir of madness, Bipolar Faith is the book Dr. Coleman was hoping to find when she was diagnosed with bipolar II, a mental illness. She could not find a single memoir written about living with bipolar II, which is characterized by periods of deep depressions balanced by periods of productivity and energy. Moreover, she found precious few memoirs that engage religion and faith in truly constructive ways. \n\nWhile the taboo around depression in the African-American faith community is diminishing, \"I think there are people suffering from depression and bipolar disease who are also striving to maintain their faith. There are few guides or safe places where they can discuss their feelings,\" says Coleman. This book is for them and their allies.\n\n“Monica Coleman writes with the artistry of a poetic storyteller, the intimacy of someone who has studied depression from the inside, and the courageous transparency of someone who knows the cost of silence. Weaving cultural truths with the reality of hope and despair, Coleman’s latest book is a testimony that unmasks psychological struggles, family discord, and the quest for wholeness. As a scholar and minister, Coleman has crafted a book that creates a safe space for people of faith to reflect on their journey toward truth, balance, and self acceptance.”—Thema Bryant-Davis, Past President, Society for the Psychology of Women, and Co-Editor, Womanist and Mujerista Psychologies: Voices of Fire, Acts of Courage\n\nMonica A. Coleman, MDiv, PhD, teaches theology and African-American religions at Claremont School of Theology in Claremont, CA. At CST, she was recently promoted to the position of full professor--making her the first African-American woman full professor at CST. She is a philosophical theologian who works with a process metaphysic, and the black and womanist theological traditions. Her writings cover womanist theology, sexual abuse, and the African-American experience.\n\nDr. Coleman is an ordained elder in the African Methodist Episcopal Church and a sought-after speaker and preacher. In 2005, the African American Pulpit names Coleman one of the \"Top 20 to Watch--The New Generation of Leading Clergy: Preachers under 40.\" Dr. Coleman has been featured as an expert in religion and mental health on NPR, Beliefnet.com, PsychCentral.com, and Huffington Post Live. She blogs on faith and depression at www.beautifulmindblog.com", "source": "Facebook", "url": "https://www.facebook.com/events/149741905431016/", "name": "Monica A. Coleman", "date": "2016-08-01T19:00:00-04:00"}, {"description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nBrant Losinski , the compassionate, complicated, and charismatic leader of Rootstand, plays country blues, Irish pub classics and favorites with friends.  A lively, dance friendly street party ringing with traditional sounds and the essence of modern dance music.\n\nNever a cover\nAlways a good time", "source": "Facebook", "url": "https://www.facebook.com/events/131557547268185/", "name": "Acoustic Tuesdays: Brant Losinski", "date": "2016-08-02T19:00:00-04:00"}, {"description": "PLEASE JOIN US: Wednesday, August 3, 2016 from 4-5:30 PM or 6:30-8:00 PM in the Multi-Purpose Room at the Ann Arbor District Library’s Downtown Location, 343 S 5th Ave, Ann Arbor, MI 48104.\n\t\nThe primary focus of the meeting is to:\n•\tRespond to the public concerns identified through the Pedestrian Safety Access Task Force project regarding inconsistencies in crosswalk design.\n•\tLearn about community desires and preferences for crosswalk designs, especially how the community understands existing traffic control devices at crosswalks.\n•\tShare with the community what requirements and guidelines the City already is required or chooses to work with.\n\n\nThe meeting will include:\n\n•\tWelcome and introductions\n•\tOrientation to the project\n•\tProposed process and timeline\n•\tDiscussion\n•\tNext steps\n\nWe look forward to working with the residents of the City and appreciate your interest in improving safety and travel environments for all transportation modes.\n\nIf you have any questions, please feel free to contact Cynthia Redinger at 734.794.6410 ext.43632 or by email at credinger@a2gov.org.", "source": "Facebook", "url": "https://www.facebook.com/events/227529490974346/", "name": "Crosswalk Design Guidelines Project Public Meeting", "date": "2016-08-03T16:00:00-04:00"}, {"description": "Missed the first few rallies? Don't worry! We're back at it again! Join us for this month's Food Truck Rally on August 3rd! Your favorite trucks are here to serve you some fresh, local dinner and desserts! Bring your friends, family, neighbors and anyone else you want to enjoy a summer night in Ann Arbor with! We'll see you there!\n\nDon't forget to tag us in your pictures with #a2rally We're on Twitter and Instagram too!\n\nUpcoming Rallies:\nAugust 3\nSeptember 7\nOctober 5\n\nBigalora Wood Fired Food Truck\nCheese Street\nDelectabowl Food Truck & Catering\nHero Or Villain Van\nHello! Ice Cream & Gelato\nMatt & Mo's\nMI Pops\nPetey's Donuts\nTHE PITA POST\nShimmy Shack\n\nIsosceles\nWest Park Music Society\nTeam Love", "source": "Facebook", "url": "https://www.facebook.com/events/465808310277103/", "name": "First Wednesday Food Truck Rally", "date": "2016-08-03T17:00:00-04:00"}]