[{"source": "Facebook", "url": "https://www.facebook.com/events/966863796764150/", "name": "Andrew J. Hoffman: Finding Purpose", "date": "2016-06-20T19:00:00-04:00", "description": "Literati is pleased to welcome Andrew J. Hoffman in support of his most recent title, Finding Purpose: Environmental Stewardship as a Personal Calling.\n\nBoth thoughtful and thought-provoking, Finding Purpose aims to challenge our understanding of how humanity interacts with planet Earth, and our role within this. This book is an invitation: would you like to participate in one of the most important projects of imagination, perhaps the greatest ever, in human history? Distilling and refining over 20 pieces from a lifetime of work in academia and trade, across speeches, blogs, editorials and essays, Hoffman invites us to look beyond material growth and explore the role of the individual and business in discovering a wider purpose to bring about a balanced and sustainable society.\n\nThe reader is encouraged to consider humanity’s relationship with the environment through different lenses: business, academia, faith-based and cultural. By bringing them together, Hoffman encourages us to understand our relationship with the planet in a far more holistic sense.\n\nDrawing on ideas from philosophy, literature, natural sciences and politics, Hoffman ensures that the ideas he explores are wholly accessible and applicable. Fully substantiated through various research and examples, the issues described are consistently made relevant to the reader.\n\nFinding Purpose is the perfect book for anyone - from student to CEO - thinking about their place in the world, and how making changes in our own lives and societies can impact on the world around us.\n\nAndrew J. Hoffman is the Holcim Professor of Sustainable Enterprise at the University of Michigan's The Ross School of Business. His research focuses on institutional theory; institutional and cultural change; organization theory; and corporate environmental strategies. He has published over a dozen books, which have been translated into five languages. Among his list of honors, he has been awarded the Maggie Award (2013), JMIBreaking the Frame Award (2012), Connecticut Book Award (2011), the Aldo Leopold Fellowship (2011), the Aspen Environmental Fellowship (2011 and 2009), the Manos Page Prize (2009), the Faculty Pioneer Award (2003), the Rachel Carson Book Prize (2001) and the Klegerman Award (1995).  His work has been covered in numerous media outlets, including the New York Times, Scientific American, Time, The Wall Street Journal and National Public Radio."}, {"source": "Facebook", "url": "https://www.facebook.com/events/1689584001315124/", "name": "James McCartney w/ Isla 6/20/16 at Blind Pig - Ann Arbor", "date": "2016-06-20T21:00:00-04:00", "description": "Monday, June 20 | 9pm | 18+ | $15 adv./ $20 day of\n\nCritically acclaimed singer-songwriter James McCartney has remained fiercely dedicated to his musical vision of melding smart hooks and feral alt-rock with the grandeur and spiritually centeredness of psychedelic music. Now, he issues the sharpest entry of his vision, the majestic The Blackberry Train engineered by Steve Albini (Nirvana, The Pixies and PJ Harvey).\n\n“It’s all been an evolution,” James says. “This set of songs definitely has a harder edge, but it’s a continuation of the last album. The main thing for me is to not conform or compromise.”\n\nJames’ panoramic artistry is inspired by such diverse musicians as Kurt Cobain, The Smiths, Radiohead, PJ Harvey, The Cure, The Beatles, Neil Young, Jimi Hendrix, and Hank Williams. His fingerprint aesthetic has earned him plaudits from Rolling Stone, The Boston Globe, The New York Times, and The Daily News. He’s earned a strong following the old fashioned way, through tirelessly touring the US, Europe and the UK, and playing bigger and bigger shows with each go around.\n\nThe Blackberry Train is an epiphanic co-mingling of aesthetics. James sought out the distinct audio stylings of Steve Albini to conjure a grungier sensibility. He welcomed the engineer’s gifts for capturing music with a raw clarity, and Steve Albini’s reputation for not impinging on an artist’s vision. The results make for an eclectic album with fastidiously crafted songs documented in the studio with glorious purity.\n\n“I like the music to have elements of the avant garde, psychedelic, and be just a little against the grain,” James reveals. “But in the end, it’s about having as much emotion as possible for me, musically and lyrically. It’s all about the music being cathartic, heartfelt and true.”\n\nThe Blackberry Train manages to be both diverse and cohesive. The album opens invigoratingly with the jangling rocker, “Too Hard” and closes with the stately and aptly named folk song “Peace and Stillness.” Between these bookends, highlights include the rough-edged and urgently melodic “Unicorn,” the anthemic “Peyote Coyote,” and the soulful ballad “Prayer.” One very personal song is the winsome and reflective “Waterfall” which was inspired by memories of his mother.\n\nThis summer and fall James will embark on extensive tour dates in the U.S. Thinking ahead, James says: “I just want to keep on going, keep working, and improving as a songwriter. I’d love to feel that I realized my full potential both as a person, and as a songwriter. That feels like a great, fulfilling goal to shoot for. Making a lot of music, and striving for more depth artistically–those are my goals.”"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1073002982766327/", "name": "Acoustic Tuesdays: Joel Parkkila", "date": "2016-06-21T19:00:00-04:00", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-June 21 Joel Parkkila\n\nJoel Parkkila, from the Ann Arbor punk rock and roll band Human Skull, will play acoustic folk and rock.\n\nNever a cover\nAlways a good time"}, {"source": "Facebook", "url": "https://www.facebook.com/events/257922431241963/", "name": "Skazat! Poetry Series featuring Josh Davis", "date": "2016-06-21T19:00:00-04:00", "description": "Summer is here; come celebrate the longest day of the year with us! Whether you’re a page poet, slammer, performance artist or refuse a label, we want to hear your new stuff on our open mic. We look forward to sharing great poetry (and great coffee) with you and invite you to join this free open mic and monthly reading series!\n\n\nSign up! 7:00 p.m.\n\n7:15 p.m. – Open mic\n8:00 p.m. – Featured Reader\n\nThis month's feature: JOSH DAVIS!\n\nJoshua Davis holds MFAs from the University of Southern Maine and the University of Mississippi. He has recent or forthcoming poems in The Midwest Quarterly, The Rotary Dial, Monster Verse: Poems Human and Inhuman (Everyman's Library, 2015), and The Cabildo Quarterly. He lives and writes in Athens, Ohio, where he's a Ph.D. candidate in American Literature. \n\n\nNext month's feature: ANN ARBOR YOUTH POETRY SLAM TEAM!"}, {"source": "Facebook", "url": "https://www.facebook.com/events/725944687548567/", "name": "Ann Arbor Restaurant Week", "date": "2016-06-22T00:00:00-04:00", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $28 for a three course dinner! \n\nThe Main Street Area Association (Main Street Area Ann Arbor) is proud to bring you Ann Arbor's favorite semi-annual dining event - Restaurant Week!\nThe specials run June 12-17th. Visit www.annarborrestaurantweek.com for details."}, {"source": "Facebook", "url": "https://www.facebook.com/events/1008482025896787/", "name": "Restaurant Week", "date": "2016-06-22T11:00:00-04:00", "description": "We are gearing up for another week of culinary bliss during Ann Arbor's summer Restaurant Week! \n\nWe are featuring these special menus available in addition to our regular menu all week long.  \n-------------------------------------------------------------------------------\nSummer Restaurant Week 2016\n-------------------------------------------------------------------------------\nTwo for $15 lunch\nTax and gratuity not included\n•\tChoose one entrée for each person\no\tBBQ Tofu Sandwich\no\tWhitefish Po-boy\no\tChicken BLT\no\tCaesar Salad\no\tCherry Almond Salad\n-------------------------------------------------------------------------------\nTwo for $28 dinner per person\nTax and gratuity not included\n\nAppetizer\nTo share, please choose one\n•\tFried Pickle Spears \n•\tTruffle Sprouts\n•\tHummus and Pita \n\nEntree\nEach guest chooses one entree\n•\tMac and Cheese\n•\tFish and Chips\n•\tUrban Cowboy Bean Burger\n•\tAr-burger\n\nDessert or Beer\nTo share, please choose one\n•\tStout Chocolate pudding cake\n•\tStrawberries and Cream Belgian waffle\n•\tMaple Bourbon Bread Pudding\n\nNot interested in dessert? Swap it out for your choice of two 16oz drafts"}, {"source": "Facebook", "url": "https://www.facebook.com/events/527954430710284/", "name": "Tips on Applying for Grants", "date": "2016-06-22T18:00:00-04:00", "description": "Our June Artists' Meet & Greet topic is Tips on Applying for Grants: Specifically MCACA Minigrants. Join us for this free event, connect with other artists and the Art Center staff.\n\nSpeaker: Allison Buck\n\nYou will learn about:\n\n- Tips for submitting a compelling application.\n- What types of opportunities are fundable?\n- How to create an accurate budget.\n- Things to pay extra attention to in order to avoid application mistakes.\n- Other resources for grant opportunities:\n- Grant Station \n- The Arts Alliance Newsletter\n\nOur monthly Artists' Meet & Greets, held at the 117 Gallery, are a perfect opportunity to connect with the Art Center, network with other artists and attend artist talks by guest speakers.\n\nLearn more about our Artists' Meet & Greet Events: www.annarborartcenter.org/artists-meet-greet/"}, {"source": "Facebook", "url": "https://www.facebook.com/events/799178996885556/", "name": "Shakespeare in the Arb 2016 Love's Labour's Lost Week 2", "date": "2016-06-22T18:30:00-04:00", "description": "Thursdays through Sundays through June 26. Check out Tickets Available link for arb member advance ticket info plus note Summer 2016 construction impacting arboretum area parking & traffic. Arrive early for tickets and time to walk to location of the first scene."}, {"source": "Facebook", "url": "https://www.facebook.com/events/1732247170397839/", "name": "Amy Haimerl: Detroit Hustle", "date": "2016-06-22T19:00:00-04:00", "description": "Journalist Amy Haimerl and her husband had been priced out of their Brooklyn neighborhood. Seeing this as a great opportunity to start over again, they decide to cash in their savings and buy an abandoned house for $35,000 in Detroit, the largest city in the United States to declare bankruptcy.\n\nAs she and her husband restore the 1914 Georgian Revival, a stately brick house with no plumbing, no heat, and no electricity, Amy finds a community of Detroiters who, like herself, aren t afraid of a little hard work or things that are a little rough around the edges. Filled with amusing and touching anecdotes about navigating a real-estate market that is rife with scams, finding a contractor who is a lover of C.S. Lewis and willing to quote him liberally, and neighbors who either get teary-eyed at the sight of newcomers or urge Amy and her husband to get out while they can, Amy writes evocatively about the charms and challenges of finding her footing in a city whose future is in question. Detroit Hustle is a memoir that is both a meditation on what it takes to make a house a home, and a love letter to a much-derided city."}, {"source": "Facebook", "url": "https://www.facebook.com/events/532773230239321/", "name": "WildOutWednsdays: The Last Hurrah!", "date": "2016-06-22T21:00:00-04:00", "description": "Yo! Its been a great  run and we'd like to give a big shout out to Greg Powell and the rest of the staff at Club Above, and especially to all you who have been comin out to support over the last year!!! \n\n\nLookin to end our residency with a bang and show some love to the people, so this will be a FREE show!! \n\nStay tuned, Northern Threat has plenty up its sleeves for the near future  :) Its just time for us to start partying on the weekends like the rest of the working world haha\n\nTALENT FOR THE NIGHT-\n\n9:00 -Neekapz\nhttps://m.soundcloud.com/neecaps\n10:00 // FKA [WADE]\n11:00 Trillo b2b Little-bird\n12:00 Tristarz\n1:00   Bass Panthers"}]