[{"source": "Facebook", "date": "2016-11-13T08:00:00-05:00", "description": "All week, all Garden of Life products are 35% off! That includes plant-based protein supplements, vitamins, and even special products just for kids. Stop in to chat with our friendly and knowledgable Natural Living team, and stock up on wellness!", "name": "35% Off Garden of Life", "url": "https://www.facebook.com/events/144098819397112/"}, {"source": "Facebook", "date": "2016-11-13T09:30:00-05:00", "description": "Dr. Sally Cornelison, Professor of Italian Renaissance art at Syracuse University, will provide the keynote talk for this U-M History of Art Graduate Student Symposium. Eight graduate students in Art History and related fields from the University of Michigan and other institutions will present papers that examine the visual implications of magnificence and display from a broad range of theoretical and methodological approaches. These graduate student presentations vary widely in geographic locations and historical time periods.", "name": "U-M History of Art Graduate Student Symposium", "url": "https://www.facebook.com/events/625992070896001/"}, {"source": "Facebook", "date": "2016-11-13T11:00:00-05:00", "description": "Saturday, November 12, 11 a.m.–1 p.m. & 2–4 p.m.\nMultipurpose Room\n\nFree. Registration is required: email umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email. Indicate if you would like to register for the 11:00 a.m. session or the 2:00 p.m. session and how many adults and children are in your group.\n\nCreate your own project inspired by the ceramics in UMMA's collection. UMMA docents will lead a tour of the galleries to look at different examples of the possibilities for making objects out of clay followed by a hands-on workshop led by local artist Nora Venturelli. Designed for families with children ages six and up to experience art together. Parents must accompany children.\n\nFamily Art Studio is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "name": "Family Art Studio: Clay Across Cultures", "url": "https://www.facebook.com/events/231873220561389/"}, {"source": "Facebook", "date": "2016-11-13T11:15:00-05:00", "description": "Children ages four to seven are invited to hear a story in the galleries. Stories will be followed by a short activity responding to the art on display. Parents must accompany children. Siblings are welcome to join the group. The story on November 12 will focus on ceramics in UMMA’s collection. Meet in front of the UMMA Store.\n\nStorytime is generously supported by the University of Michigan Credit Union Arts Adventures Program, UMMA's Lead Sponsor for Student and Family Engagement.", "name": "Storytime at the Museum", "url": "https://www.facebook.com/events/982437515219356/"}, {"source": "Facebook", "date": "2016-11-13T14:00:00-05:00", "description": "Pictorialism was the first truly international photography movement, and its practitioners, among them Alfred Stieglitz, Edward Steichen and Gertrude Käsebier, sought to position photography as a legitimate aesthetic art form. They favored soft-focus images that drew upon the conventions of important artists and movements of the previous century. Their poetic compositions drawn from contemporary life, combined with the use of expensive and labor-intensive printing materials established these photographs as complex and nuanced works of high artistic quality. Join a tour with an UMMA docent and explore this rich moment in the history of photography.", "name": "Guided Tour: Artists of the Photo-Secession", "url": "https://www.facebook.com/events/354100394935217/"}, {"source": "Facebook", "date": "2016-11-13T15:00:00-05:00", "description": "This program is free and open to the public, but space is limited. Please register to secure your place by emailing umma-program-registration@umich.edu. Please include date and title of program in the subject line of your email.\n\nSpanning the eighteenth to early twentieth centuries, the Ernst Pulgram and Frances McSparran collection of forty-seven works on paper speaks to a tumultuous period in European history, which saw the outbreak of the two World Wars and increased industrialization. On paper, these prints, watercolors, and drawings by artists such as Piranesi, Kirchner, Grosz, Schiele, and Klimt depict the continent’s people and places with a focus on the physical and psychological human imprint. However, these works also encourage a deeper viewing experience that engages with the expressive capacities of line and its ability to articulate the seen, as well as the unseen, such as larger socio-political and artistic contexts. This talk with exhibition curator Lehti Keelman, UMMA’s Assistant Curator of Western Art, will explore this fascinating and wide-ranging collection, introducing the thematic strands of the exhibition and the range of artistic interpretation.\n\nLead support for the exhibition, Europe on Paper: The Ernst Pulgram and Frances McSparran Collection, is provided by the Richard and Rosann Noel Endowment Fund. Additional generous support is provided by the University of Michigan Department of English Language and Literature and Department of Romance Languages and Literatures.", "name": "The Human Imprint: Exploring Europe on Paper", "url": "https://www.facebook.com/events/1942218416005379/"}, {"source": "Facebook", "date": "2016-11-13T16:00:00-05:00", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "name": "Beer and Board Games", "url": "https://www.facebook.com/events/731610996991389/"}, {"source": "Facebook", "date": "2016-11-13T19:00:00-05:00", "description": "Enjoy hilarious video shorts created by some of our very own improvisers and also by professional, amateur and even wannabe film makers in and around the community!!\n\nHere’s how it works: Each month we’ll get a new suggestion from the audience to use as inspiration for the next month’s “Pointless 730 Hour Video Challenge.\" Next, get to work creating your prerecorded masterpiece. Submissions can be no longer than two minutes in length.\n\nAnd the coolest part - We will be taking your video and using it as the suggestion for an improv scene!!! IT'S A FREAKING VIDEO NIGHT/IMPROV JAM!!! People will LITERALLY be DISSECTING your video in the name of improvised comedy. What will they do with it??? Show up to find out.\n\nSend your finished product to pointlessvideoshorts@gmail.com no later than the Saturday before the video night. And finally, come and watch the crowd go wild over your creative and hysterical work of digital media art.\n\nNot into making vids but love watching them? Submit your favorite one from YouTube related to that month’s “suggestion” and we might play it on that Sunday! That’s right, you can share with the world that video you accidentally stumbled upon late one night while browsing the interwebs that made you cry with laughter.\n\nOf course, you are not required to participate in any way. Simply come, enjoy a microbrew, sit back and laugh with some fellow funny people. Admission is pay-what-you-can.\n\nLet’s get ROLLIN’!.", "name": "Pointless 730 Hour Video Challenge - November's Theme \"Seasonal\"", "url": "https://www.facebook.com/events/1786183454989969/"}, {"source": "Facebook", "date": "2016-11-14T15:00:00-05:00", "description": "This class will introduce you to the Amaya Bravo 16-Thread CNC Embroidery Machine and the Design Shop software that lets you create digitalized embroidery files from an image file. This machine is great for monogramming shirts or towels, decorating bags and accessories and making patches! Use the Design Shop software and design your own. There is also a baseball cap attachment! You will learn the basic operation with an emphasis on safety. With the successful completion of this class you will be certified to use the Amaya CNC Embroidery Machine on your own.", "name": "Learn to use the Amaya CNC Embroidery Machine", "url": "https://www.facebook.com/events/849961008439513/"}, {"source": "Facebook", "date": "2016-11-14T19:00:00-05:00", "description": "Literati is pleased to welcome Chris Dombrowski in support of his memoir Body of Water: A Sage, a Seeker, and the World's Most Alluring Fish.\n\nChris Dombrowski was playing a numbers game: two passions—poetry and fly-fishing; two children, one of them in utero; and an income hovering perilously close to zero. Enter, at this particularly challenging moment, a miraculous email: can’t go, it’s all paid for, just book a flight to Miami. Thus began a journey that would lead to the Bahamas and to David Pinder, a legendary bonefishing guide. Bonefish are prized for their elusiveness and their tenacity. And no one was better at hunting them than Pinder, a Bahamian whose accuracy and patience were virtuosic. He knows what the fish think, said one fisherman, before they think it. By the time Dombrowski meets Pinder, however, he has been abandoned by the industry he helped build. With cataracts from a lifetime of staring at the water and a tiny severance package after forty years of service, he watches as the world of his beloved bonefish is degraded by tourists he himself did so much to attract. But as Pinder’s stories unfold, Dombrowski discovers a profound integrity and wisdom in the guide’s life.\n\n\"A brilliant book. Destined to be a classic.\"—Jim Harrison\n\nBorn in Michigan, Chris Dombrowski earned his MFA from the University of Montana. His publications include two collections of poems, By Cold Water (2009) and Earth Again (2013). His poetry and nonfiction have been widely published in leading journals and magazines. Also a well-established fly-fishing guide, Dombrowski lives in Missoula, Montana.", "name": "Chris Dombroski", "url": "https://www.facebook.com/events/547838865414445/"}]