[{"description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "date": "2017-01-13T10:00:00-05:00", "name": "Exhibit: Avant Garden-Fashion & Plants Together!", "source": "Facebook", "url": "https://www.facebook.com/events/230775294023258/"}, {"description": "Please join us for the opening reception of EMERGENT EFFECT on Friday, January 13, from 6 to 9 pm. \n\nThe exhibition is free and open to the public daily from January 13 to January 28\n\nCurated by Elize Jekabson, Jessica Tenbusch and Ilana Houten, from Ypsi Alloy Studios\n\nWhat happens when one becomes many? Emerging patterns, thoughts and ideas begin to show themselves in a way that was impossible to see by only looking at one. Things are always in conversation with each other. Their meanings are derived through interactions with other elements and those meanings change as context changes. Artists often employ comparison, context and groupings to create meaning in their work. While there are many different approaches that can be taken, the outcome is the same; to create a larger entity that arises through the interactions among smaller or simpler entities.\n\nIn Emergent Effect, the artists use these methods to create meaning and find meaning in the spaces between all of their work as well. All the artists have their practices located in Ypsi Alloy Studios and in that shared space they also share ideas. Though they all work in different mediums and materials, a common voice can be found.\n\n-----------\nThe 117 Gallery 2016/2017 season is supported by Vintage Financial Services LLC", "date": "2017-01-13T18:00:00-05:00", "name": "Emergent Effect: Opening Reception", "source": "Facebook", "url": "https://www.facebook.com/events/1164636040280941/"}, {"description": "One MFA student of fiction and one of poetry, each introduced by a peer, will read their work. The Mark Webster Reading Series presents emerging writers in a warm and relaxed setting. We encourage you to bring your friends - a Webster reading makes for an enjoyable and enlightening Friday evening.\nThis week's reading features Yasin Abdul-Muqit (Introduced by Rebecca Marie Fortes) & Ambalila Hemsell (Introduced by A.S. Gorsuch).\n\nYasin is a Michigan native. He's lived here all of his life. He's unsure whether that's a problem or not.\n\nAmbalila Hemsell is a writer, teacher, and musician from Colorado.", "date": "2017-01-13T19:00:00-05:00", "name": "Mark Webster Reading Series", "source": "Facebook", "url": "https://www.facebook.com/events/1826418890961611/"}, {"description": "Friday, January 13th at 7:00 pm \nA Night of Poetry at Nicola’s\nMalfunctions Tour with August Smith, Dylan Lancaster, KFG, Elysia Smith and C.M. Keehl\n\nAugust Smith is a poet. He grew up in the Upper Peninsula, resides in Boston, runs Cool Skull Press, and has published six chapbooks to date. His work has appeared in theNewerYork, Reality Beach, Dirty Chai, Banango Street, and other places. You can read some of his work here: http://august.mostlymidwest.com/.\n\nDylan Lancaster grew up in Northern Michigan. He started taking poetry seriously while studying at Western Michigan University in Kalamazoo. He now lives in Nashville, Tennessee playing music and writing poems on his 1960's Smith Corona Sterling typewriter. \n\nKFG is a potpourri-of-queerness, Pisces poet metamorphosed from the Great Lake State. As a spoken word poet, they are considered one of the most evocative and dynamic writers and performers to premiere in Michigan. *Blush* \nA multiple slam champ, literary published poet, activist, educator through The Diatribe and the Grand Rapids Creative Youth Center, they are perhaps most well known for their 90's sitcom catch-phrase, \"We do two-arms hugs in this household.\"\nIn conclusion, they like hugs. \n\nElysia Smith is a California transplant; re: h/s and college in Indiana. She's learning how to undo Midwestern apology and avoidance one day at a time. Her first book, UNRULY is forthcoming from BlazeVOX books in the fall.\n\nC. M. Keehl is part dreamer / part destroyer / but all alien. She currently lives in the suburbs of \nMichigan with her dog Carver. She is the poetry editor at Dirty Chai. \nHer most recent poems are/ forthcoming in: Up \nThe Staircase Quarterly, Vending Machine Press, Spy Kids Review & Reality Beach.", "date": "2017-01-13T19:00:00-05:00", "name": "Night of Poetry at Nicola's Books", "source": "Facebook", "url": "https://www.facebook.com/events/1508599252502164/"}, {"description": "The Sean Dobbins Organ Quartet will feature music from their latest CD The Journey as well as other jazz standards with an original twist. The show will also include a performance and conversation featuring the premier \"rising stars\" in the Detroit area. Drummer Sean Dobbins will be joined by tenor and soprano saxophonist Marcus Elliot, guitarist Cory Allen and Hammond B3 organist Jim Alfredson. The quartet will feature 17 year-old alto saxophone sensation Benny Rubin, Jr. \n\nThis performance is made possible through the generous support of the Don Chisholm Friends of Jazz at the Kerrytown Concert House.\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student\n\nSean Dobbins, drums\nCory Allen, guitar\nMarcus Elliot, soprano/tenor saxophone\nJim Alfredson, Hammond organ\nBenny Rubin, Jr., alto saxophone\n\nSean Dobbins got his start as sought-after Detroit area jazz sideman at a young age, when he would regularly play with Blue Note artist Louis Smith. As Sean’s Career progressed, he found himself the recipient of many awards and accolades including the “Woody Herman Jazz Award”, an award for outstanding musicianship, as well as the Louis Armstrong Scholarship. Due to Sean’s great talent both as a player and an educator, he has been the focus of countless news articles, jazz radio programs, and documentaries. \n\nCory Allen is a Detroit-based guitarist, educator, and composer. Active on the metro Detroit jazz scene, Cory performs with his own trio as well as with the Sean Dobbins Organ Quartet and as a freelance guitarist. Cory’s musical voice was developed through study at Central Michigan University (B.S. in Music) and Michigan State University (M.Mus in Jazz Studies), where he fostered his love for swing, bebop, and blues and studied the classic jazz guitarists Charlie Christian, Wes Montgomery, and Jim Hall. Not only active in jazz scene, Cory is also a band member of the Motown Eagles, Detroit’s Tribute to the Eagles and regularly performs at weddings, parties, and corporate events. Read more.\n\nMarcus Elliot is a saxophonist/composer/educator of the metro-Detroit area who is quickly gaining recognition for his imaginative improvising, and fervently thoughtful voice on the saxophone. Marcus began playing professionally in the Detroit Jazz scene when he was 15 years old. He was awarded a scholarship for his talents as a musician to attend Michigan State University to study with Wes \"Warmdaddy\" Anderson, Diego Rivera and Rodney Whitaker. Read more.\n\nJim Alfredson (Lansing, MI) comes from a musical family. His father earned a living as a professional musician for many years and encouraged Jim’s talents from a very young age. Some of Jim’s earliest memories include pulling on the drawbars of his father’s Hammond B3 at the age of four.\nJim began writing his own songs at the age of eight on a Yamaha organ. A score of synthesizers and multitrack machines followed until he came full circle at sixteen and began lusting after the sound of the Hammond organ once again. Jim has immersed himself in the study of the mighty Hammond B3 ever since, dedicated to uncovering new directions within the deep tradition of the instrument. \n\nhttp://seandobbinsmusic.com", "date": "2017-01-13T20:00:00-05:00", "name": "The Sean Dobbins Organ Quartet featuring Benny Rubin, Jr.", "source": "Facebook", "url": "https://www.facebook.com/events/362489140783377/"}, {"description": "You haven’t heard “Pinball Wizard” or “People Are Strange” until you’ve heard it played on jugs and “various other sundries.” Jug band music is blues, ragtime, swing and jazz combined in a strange concoction spawned in Loiusville, home of the Juggernaut Jug Band. Jug bands flourished in towns along the Ohio and Mississippi Rivers in the 1920s and 1930s. Today, as then, a jug band is the ultimate party band. The Juggernauts have been featured on the Today Show and radio’s “Dr. Demento Show.” Their current CD is You Mean We Get Paid For This?\njuggernautjugband.com", "date": "2017-01-13T20:00:00-05:00", "name": "Juggernaut Jug Band at Green Wood Coffee House", "source": "Facebook", "url": "https://www.facebook.com/events/446436998814101/"}, {"description": "Working on putting together another dance party for the locals. Get out yo house and shake off that holiday dinner..... With special guests Jive Colossus and Saajtak", "date": "2017-01-13T21:30:00-05:00", "name": "The Macpodz Lucky 13 Party wsg Jive Colossus & Saajtak", "source": "Facebook", "url": "https://www.facebook.com/events/1815041105379349/"}, {"description": "Laugh as our League and guests tackle long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\nNo two shows are the same!\nTickets are $10.", "date": "2017-01-13T22:00:00-05:00", "name": "A Pointless Display of Improvised Feats", "source": "Facebook", "url": "https://www.facebook.com/events/373751256312437/"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "date": "2017-01-14T08:00:00-05:00", "name": "10% For Good for Community Action Network", "source": "Facebook", "url": "https://www.facebook.com/events/324709987912141/"}, {"description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "date": "2017-01-14T10:00:00-05:00", "name": "Intro to Stagecraft Workshops", "source": "Facebook", "url": "https://www.facebook.com/events/1716505231999811/"}]