[{"date": "2016-11-28T18:00:00-05:00", "source": "Facebook", "description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "url": "https://www.facebook.com/events/1807900772828520/", "name": "Art Off The Wall Holiday Exhibition & Shopping Event"}, {"date": "2016-11-28T19:00:00-05:00", "source": "Facebook", "description": "Join Jon Milan, Gail Offen, Susan L. Nenadic & M. Joanne Nesbit for an evening of discussion about Ann Arbor Icons and Legends.\n\nWhat is an iconic Ann Arbor restaurant? Ask anyone who has ever spent time there as a student, traveler, or townie, and they are likely to name several favorites in an instant. From debating the best place to celebrate or console on football Saturdays to deciding where to eat after the bars close, the choices have always sparked passionate conversation. In Ann Arbor, people are known to have strong feelings about the best places for pizza, coffee, beer, burgers, noodles, and burritos. Although many of the go-to hangouts are long gone, a surprising number still thrive. And there are always a few newcomers coming along to win the hearts of the next generation of diners, nibblers, and noshers. Some are fine restaurants and taverns, and others are lunch counters, diners, carry-outs, and drive-ins but in each and every case, they are unique and together make up a collection of iconic local eateries.\n\nGraced by the Huron River with an abundance of parks, Ann Arbor offers residents and visitors entertainment, sports, shopping, dining, and of course, the University of Michigan. Legendary Locals of Ann Arbor celebrates its citizens. Some of those who make up Ann Arbor are creative artists, inspiring educators, dedicated public servants, and determined business owners. With the exception of Lewis the cat, who reigned at Downtown Home and Garden, this book is filled with stories about people who have made and are making Ann Arbor one of the best places to live in the United States. Within its pages lie the stories of who chose maize and blue as the University of Michigan s colors; who was the first Ann Arborite to race in the Indy 500; and who sold Tom Monaghan, founder of Domino s, his first pizzeria. Inside are photographs and descriptions of the legendary people of the past and the present, as well as those who are on their way to becoming the legends of the future.", "url": "https://www.facebook.com/events/660281374136185/", "name": "Ann Arbor Icons & Legends"}, {"date": "2016-11-29T08:00:00-05:00", "source": "Facebook", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/280243392370950/", "name": "10% For Good for Community Action Network"}, {"date": "2016-11-29T10:00:00-05:00", "source": "Facebook", "description": "Don't miss our holiday display Avant Garden: Weaving Fashion & Nature Together. The exhibit explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs Saturday, November 26, 2016-Sunday, January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "url": "https://www.facebook.com/events/723312037871156/", "name": "Holiday Exhibit - Avant Garden"}, {"date": "2016-11-29T18:00:00-05:00", "source": "Facebook", "description": "Free and open to the public. Seating is first-come, first-served.\nChina Miéville lives and works in London. He is a three-time winner of the prestigious Arthur C. Clarke Award (Perdido Street Station, Iron Council, and The City & the City) and has also won the British Fantasy Award twice (Perdido Street Station and The Scar). The City & The City, an existential thriller, was published in 2009 to dazzling critical acclaim and drew comparison with the works of Kafka and Orwell (The Times) and Phillip K. Dick (The Guardian). The City & The City recently won the British Science Fiction Award, the Arthur C. Clarke Award, and tied with Paolo Bacigalupi's The Windup Girl for the 2010 Hugo Award. It was also shortlisted for the Nebula.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64).", "url": "https://www.facebook.com/events/1777086199171550/", "name": "Zell Visiting Writers Series"}, {"date": "2016-11-29T18:00:00-05:00", "source": "Facebook", "description": "Free and open to the public. Seating is first come, first served.\nEileen Myles is an award-winning American poet and writer who has produced more than twenty volumes of poetry, fiction, nonfiction, libretti, plays, and performance pieces over the last three decades. Novelist Dennis Cooper has described Myles as “one of the savviest and most restless intellects in contemporary literature.” In 2012, she received a Guggenheim Fellowship to complete Afterglow (a memoir), which gives both a real and fantastic account of a dog’s life.\n \nLisa Kron is an actress and playwright, best known for writing the lyrics and book to the musical Fun Home, for which she won both the Tony Award for Best Original Score and the Tony Award for Best Book of a Musical. Born in Ann Arbor, Kron teaches playwriting part-time at Yale University and New York University. \n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please see lsa.umich.edu/writers/readingsevents/zellvisitingwritersseries.", "url": "https://www.facebook.com/events/1188310411191815/", "name": "Zell Visiting Writers Series: Eileen Myles and Lisa Kron in Conv"}, {"date": "2016-11-29T19:00:00-05:00", "source": "Facebook", "description": "Literati is pleased to welcome Scott Savitt in support of his memoir, Crashing the Party: An American Reporter in China.\n\nIt’s 1983. Scott Savitt, one of the first American exchange students in Beijing, picks up his guitar and begins strumming “Blackbird.” He’s soon surrounded by Chinese students who know every word to every Beatles song he plays. Scott stays on in Beijing, working as a reporter for Asiaweek Magazine. The city’s first nightclubs open; rock ‘n’ roll promises democracy. Promoted to foreign correspondent for the Los Angeles Times then United Press International, Scott finds himself drawn into China’s political heart. His girlfriend is the assistant to Bette Bao Lord, the wife of the U.S. ambassador. He interviews people who will become leaders of the democracy movement.\n\nLater, at 25 years old, Scott is the youngest accredited foreign correspondent in China, with an intimate knowledge of Beijing’s backstreets. But as the seven-week occupation of Tiananmen Square ends in bloodshed on June 4, 1989, his greatest asset is his flame-red 500cc Honda motorcycle — giving Scott the freedom to witness first-hand what the Chinese government still denies ever took place. After Tiananmen, Scott founds the first independent English language newspaper in China, Beijing Scene. He knows that it’s only a matter of time before the authorities move in, and sure enough, in 2000 he’s arrested, flung into solitary confinement and, after a month in jail, deported.\n\nScott Savitt is the in-house Chinese-English translator for numerous human rights organizations and the New York Times. His articles have been published in the Los Angeles Times, Washington Post, Wall Street Journal, New York Times, and many other newspapers and magazines. He is a former visiting scholar at Duke University.", "url": "https://www.facebook.com/events/1787205764880302/", "name": "Scott Savitt"}, {"date": "2016-11-29T19:00:00-05:00", "source": "Facebook", "description": "This meeting had been cancelled and will be rescheduled for a later date. \n\nSubject: Meeting #3 - Nixon Road Corridor Traffic Study & Dhu Varren/Nixon/Green Road Roundabout - November 29, 7-9 pm Clague Middle School Multi-purpose Room. \n\nPLEASE JOIN US: Tuesday, November 29, 2016 from 7 to 9 p.m. in the Multi-Purpose Room at Clague Middle School, 2616 Nixon Road.  \n\nThe primary focus of the meeting is to:\n•\tPresent and discuss corridor traffic study options.\n•\tPresent the finalized design details for the roundabout project. \n•\tShare options for traffic maintenance during roundabout construction. \n\nThe meeting will Include: \n1.\tWelcome & introduction\n2.\tPresentation of corridor traffic study options with brief question and answer period*. \n3.\tPresentation of roundabout design with brief question and answer period*. \n4.\tDiscussion of options for traffic maintenance during roundabout construction*.\n5.\tNext Steps and public comments*.  \n\n* Questions/comments will be limited to three minutes per person. Numbered cards will be distributed during each question and answer period to facilitate equal opportunities for all participants. \n\nAdditional information regarding the two projects is available at www.a2gov.org/Nixon.\n\nAll persons are encouraged to participate in public meetings. Accommodations including sign language interpreters, may be arranged by contacting the city clerk’s office at 734.794.6140;\nvia email to cityclerk@a2gov.org; or by written request addressed and mailed or delivered to:\n\nCity Clerk’s Office\n301 E. Huron St.\nAnn Arbor, MI 48104\nRequests made with less than two business days’ notice may not be able to be accommodated.", "url": "https://www.facebook.com/events/205322289893739/", "name": "Nixon/Green/Dhu Varren Roundabout & Corridor Study"}, {"date": "2016-11-29T19:00:00-05:00", "source": "Facebook", "description": "Only a handful of the finest athletes in the world have participated in the Olympics, and even fewer have won its highest honor—the Olympic Gold Medal. Olympic Odyssey is Emory Clark’s first-hand account of the journey from his first grueling workouts on the Schuylkill River in Philadelphia to the winners dock by the Toda Rowing Course at the 1964 Olympics in Tokyo.\n\nWhile it may have been fifty years ago, Olympic Odyssey spins a timeless tale of youthful ambition and the intense physical and emotional exertion that turned one man’s dream into reality.  \n\nTold in his own distinctive voice, and augmented with images, artifacts, contemporary letters and accounts from his training diary, Clark brings his picaresque journey to life with intimate details, insightful commentary and humorous asides that come from a life-long love of competitive rowing—and the perspective gained from reaching a pinnacle in the world of sports.\n\nEmory Clark began rowing at age 13 at Groton School on the Nashua River an hour west of Boston. He went on to Yale University where he was captain of the crew his senior year, graduating in 1960 with a degree in English literature.\n\nAfter college he joined the U.S. Marine Corps, serving on active duty from 1961 to 1964, including a 13 month tour in the Orient.\n\nFollowing the Games in Tokyo he taught history and coached the rowing team at Iolani School in Honolulu.\n\nAfter his return home he was a newspaper reporter for several years before entering law school, earning a Juris Doctor degree from the University of Michigan in 1971. He practiced law in Lapeer, Michigan for 34 years, but still found time to compete. Up until 2006, Clark raced in a coxed four in veterans’ regattas around the world.\n\nBorn and raised in Michigan, he still lives on the family farm with his wife, Christina.", "url": "https://www.facebook.com/events/1791543404450674/", "name": "Meet Olympic Gold Medalist & Author Emory Clark"}, {"date": "2016-11-30T08:00:00-05:00", "source": "Facebook", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/324709987912141/", "name": "10% For Good for Community Action Network"}]