[{"url": "https://www.facebook.com/events/1860126057346312/", "source": "Facebook", "description": "“Assembled Works” Multi-Media Workshop\nAlice Vander Vennen\nIn this workshop participants will work with a variety of textiles, including remnants of their own stitched, embroidered and/or embellished work, quilts, knitting, beads, unfinished projects, antique handwork, new fabrics, and found pieces of textiles – anything that “catches the eye”—and combine them with natural materials. Allowing the rich textures, brilliant colors and nuanced lines of stitched textiles to interact with the mysterious beauty of the imprinted stone, a gentle branch or a fragile leaf, students will create a framed (20” x 20”) stitched, three-dimensional textile assemblage. Instruction will be given for the steps used to create a fiber work composition, the techniques used to incorporate natural materials, and for finishing, mounting and framing the finished art work. Website: http://www.alicevandervennen.ca/   To register go to the Ann Arbor Fiberarts Guild website: www.annarborfiberarts.org", "date": "2017-03-13T10:00:00-04:00", "name": "“Assembled Works” Workshop"}, {"url": "https://www.facebook.com/events/348084575586028/", "source": "Facebook", "description": "NOTE: Orchid Festival dates are Sat. & Sun., March 18 & 19, 2017\n\nA two-day orchid extravaganza with orchid displays, orchids in bloom, and regional commercial vendors. Tropical and hardy orchids and orchid-growing supplies and related items for sale. Free informational talks and demos. Presented by Ann Arbor Orchid Society. Free. For hours, photos, and info follow this link: mbgna.blogspot.com/2017/02/2017-ann-arbor-orchid-festival-at.html", "date": "2017-03-13T15:00:00-04:00", "name": "Ann Arbor Orchid Festival"}, {"url": "https://www.facebook.com/events/1094885923954578/", "source": "Facebook", "description": "Literati is pleased to partner with the University of Michigan to present Theodoros Chiotis, editor of the anthology Futures: Poetry of the Greek Crisis.\n\nFutures features some of the most daring new voices in Greek poetry, together with international poets with Greek connections. These bold, impassioned and critically aware texts stake new poetic and political ground: they articulate what it means to live in a time when capitalism is buckling under its own weight and new ways of living and thinking seem to be emerging. In a time of crisis, Futures calls for solidarity, resistance and poetry as a political paradigm.\n\nContributors: Dimitris Allos, Orfeas Apergis, Vassilis Amanatidis, Marios Chatziprokopiou, Theodoros Chiotis, Emily Critchley, Yiannis Doukas, Nikos Erinakis, Phoebe Giannisi, Constantinos Hadzinikolaou, Κaterina Iliopoulou, Panayotis Ioannidis, D.I. (Dimitra Ioannou), Adrianne Kalfopoulou, Patricia Kolaiti, Dimitra Kotoula, Alexios Mainas, Christodoulos Makris, Sophie Mayer, Stergios Mitas, Eftychia Panayiotou, Konstantinos Papacharalampos, Iordanis Papadopoulos, Stephanos Papadopoulos, Eleni Philippou, Stamatis Polenakis, Nick Potamitis, George Prevedourakis, Theodoros Rakopoulos, Kiriakos Sifiltzoglou, Eleni Sikélianòs, A. E. Stallings, Yiannis Stiggas, Barnaby Tideman, Maria Topali, Tryfon Tolides, Thanasis Triaridis, Thomas Tsalapatis, George Ttoouli, Universal Jenny, Steve Willey.\n\n\"Excellent … launches a counter-offensive against the inhuman and mystifying terminologies of high finance … [Chiotis's] translations have such vitality that they mesh seamlessly with the English language poems.\"--Times Literary Supplement\n\nEvent date: \nMonday, March 13, 2017 - 7:00pm", "date": "2017-03-13T19:00:00-04:00", "name": "Theodoros Chiotis: Poetry of the Greek Crisis"}, {"url": "https://www.facebook.com/events/1006014226188234/", "source": "Facebook", "description": "Can't make it to Ann Arbor on March 26? You can still participate in the Probility Ann Arbor Marathon by registering for our Virtual Half Marathon! Virtual participants run or walk 13. 1 miles at a location of their choosing: at a park, on a trail, on a treadmill, even in a different part of Ann Arbor! All Virtual Half Marathons must be completed between February 1 and March 26. When you've completed your Virtual Half Marathon, tell us about it! Post your stats, photos, and story here on the Probility Ann Arbor Marathon Virtual Half Facebook event page; if you post on Twitter, be sure to tag @epicraces and @a2marathon. Best of all, you get the same race shirt and medal as those who join us in downtown Ann Arbor for the actual event!\n\nPlease note: Epic Races does not ship swag to Canada or internationally. If you are a resident of Canada or another country and wish to participate in an Epic Races virtual event, please provide us with a U.S. shipping address.", "date": "2017-03-14T00:00:00-04:00", "name": "2017 Probility Ann Arbor Marathon Virtual Half Marathon"}, {"url": "https://www.facebook.com/events/398150247201638/", "source": "Facebook", "description": "A free, informal discussion with the Stewardship Network's Huron Arbor cluster. Open to anyone interested. This month’s topic: River and Stream Restoration: A lot of our conservation focus is spent on terrestrial ecosystems and restoration, however, it is just as important to protect our rivers and streams. Join us for a discussion about rivers, fluvial ecosystems, and the best practices to protect them. For more information go to www.stewardshipnetwork.org\nPhoto by Chuck Pearson", "date": "2017-03-14T07:30:00-04:00", "name": "Stewards’ Circle – River and Stream Restoration"}, {"url": "https://www.facebook.com/events/1008319905968712/", "source": "Facebook", "description": "March 11–August 20, 2017\nPhotography Gallery\n\nIn 2013, artist Ernestine Ruben (BSDEs ’53) photographed the once-famed industrial complex Willow Run in Washtenaw County, Michigan. Designed by her grandfather, Detroit architect Albert Kahn, for the Ford Motor Company, Willow Run was an exemplar of American defense manufacturing because of its efficient mass-production of B-24 Liberators during World War II.\nFor this exhibition, Ruben overlaid interior views of the now-dormant factory with imagined glimpses into her body’s interior landscape. The resulting compositions seem to breathe energy and light into the stagnant and cavernous spaces of Willow Run and suggest a longing for a productive existence undeterred by mortality for both Willow Run and the artist. Her grandfather’s role in the history of the site underscores Ruben’s personal connection.\nThe exhibition presents Ruben’s photographs of Willow Run in UMMA’s Photography Gallery and an original film—co-created by Ruben and video artist Seth Bernstein and featuring an original score by award-winning composer Stephen Hartke—in the Museum’s Forum.\n\nLead support for Ernestine Ruben at Willow Run: Mobilizing Memory is provided by the University of Michigan Office of the Provost and the Herbert W. and Susan L. Johe Endowment.", "date": "2017-03-14T12:00:00-04:00", "name": "Ernestine Ruben at Willow Run: Mobilizing Memory"}, {"url": "https://www.facebook.com/events/254145231679684/", "source": "Facebook", "description": "Sip, Socialize, and Have Fun Learning About Wine While \u0003Enjoying Complimentary Hors D’oeuvres With Friends.\u0003 This Month, We’ll be Tasting 8 Oregon Wines.", "date": "2017-03-14T18:00:00-04:00", "name": "Sava's Uncorked: Oregon WInes"}, {"url": "https://www.facebook.com/events/1249790265109247/", "source": "Facebook", "description": "Joel Rydecki of the Joel Rydecki Band returns for Acoustic Tuesday before the Joel Rydecki Band plays at our St. Patrick's Day Street Party. .", "date": "2017-03-14T19:00:00-04:00", "name": "Acoustic Tuesday - Joel Rydecki"}, {"url": "https://www.facebook.com/events/1853185534970856/", "source": "Facebook", "description": "Join us for this self-proclaimed \"geek show-and-tell.\" Makers present their creations! \n\nWe have people interested in a wide scope of topics and endeavors. Programming, robots, machining, welding, artistic creations, metal casting, anything being built or created. Pretty much anything someone is \"Making\" is welcome at a Go-Tech meeting. \n\nAlso, if you have a problem with your project ask for help and the brain trust of Go-Tech will amaze you with solutions to difficulties you haven't even explored yet.. This is an open group all are welcome and especially young makers are encouraged to bring in a project to show off.\n\nSecond Tuesday of each month at 7pm.", "date": "2017-03-14T19:00:00-04:00", "name": "Go-Tech Meeting (second Tuesday of each month)"}, {"url": "https://www.facebook.com/events/661152594058390/", "source": "Facebook", "description": "Tue. March 14 | 8pm | 18+ | $20 Cover\n\nYou could mistake JD McPherson for a revivalist, given how few other contemporary artists are likely to assert, as he boldly does, that “’Keep a Knockin’ by Little Richard is the best record ever made. It’s so insanely visceral, you feel like it’s going to explode your speakers. If I’m listening to that in the car, I find myself having to brake suddenly. I can listen to that and it makes me feel like I’m 20 feet tall. And the feeling of joy I get from that record is always going to be the real push behind trying to make music.”\n\nWSG: The Scrappers & Del Villarreal\n\nTickets: http://www.ticketweb.com/t3/sale/SaleEventDetail?eventId=7174935&pl=blindpig&dispatch=loadSelectionData", "date": "2017-03-14T20:00:00-04:00", "name": "JD McPherson 3/14/17 at the Blind Pig - Ann Arbor"}]