[{"source": "Facebook", "url": "https://www.facebook.com/events/324709987912141/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "date": "2017-01-03T08:00:00-05:00", "name": "10% For Good for Community Action Network"}, {"source": "Facebook", "url": "https://www.facebook.com/events/318146895251771/", "description": "Rescue Dawn is making the trip out from Buffalo, NY for this one.  This will a hype show! Tickets are $5 come say hey!", "date": "2017-01-03T20:00:00-05:00", "name": "Bad Television, Rescue Dawn (NY), Swordfish, Midnight Journal"}, {"source": "Facebook", "url": "https://www.facebook.com/events/388503011499248/", "description": "COLD-PRESSED JUICE CLEANSES ARE BACK!\n\n... and just in time for the New Year! For the month of January only– get 10% off your juice cleanse and a free yoga class with Bikram Yoga West!\n\nBook your Cleanse now with promo code JUICECLEANSEJANUARY at Store.BaboAnnArbor.com!", "date": "2017-01-04T00:00:00-05:00", "name": "Babo Juice Cleanses"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1171307782957839/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "date": "2017-01-04T09:00:00-05:00", "name": "10% For Good for Community Action Network"}, {"source": "Facebook", "url": "https://www.facebook.com/events/230775294023258/", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "date": "2017-01-05T10:00:00-05:00", "name": "Exhibit: Avant Garden-Fashion & Plants Together!"}, {"source": "Facebook", "url": "https://www.facebook.com/events/105488613282374/", "description": "THROWBACK THURSDAY \nAll Your Favorite Music from the 80's, 90's & early 00's\nFREE for 21+ | $10 for 18-20\n\nwith DJ\nKevin Michael\nhttps://soundcloud.com/kevinmichaelofficial/\n\nTotally Awesome Drink Specials:\n$3.50 Well drinks\n$2.50 Fireball shots\n3 for $10 Jaeger Bombs\n$2 Miller Lite Bottles\n\nGet social:\nnecto.com\nfacebook.com/NectoNightclub\ntwitter.com/Necto\ninstagram.com/nectonightclub", "date": "2017-01-05T22:00:00-05:00", "name": "TBT at Necto"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1195526610494635/", "description": "Friday, January 6 | 9pm | 18+ | $10 adv./ $12 day of\n\nGolf Clap\nwsg: Ghita Sisters\n\nGolf Clap are Hugh Cleal and Bryan Jones, a Detroit duo with an unmatched passion for house music and a seemingly endless supply of studio and club-focused creativity. And with releases on some of the world’s most influential house labels already under their belts, along with a lauded Boiler Room session and beyond, they’re only just getting started. With roots in the Detroit underground, booking local and international DJs to play at their own parties, Golf Clap have established themselves as in-demand artists and performers in their own right, via an irresistible combination of hard work, talent and consistently being the last guys standing, wherever the party ends up. Releases on Simma Black, their own Country Club Disco imprint, and Kerri Chandler’s Madtech have announced Golf Clap as a musical force to be reckoned with, however it’s behind the decks where they truly come into their own. They are regulars at esteemed clubs such as Output in New York, Primary in Chicago, and Grasshopper Underground in Detroit. They have also performed at Movement, Electric Forest, Mysteryland, and Brooklyn Electronic Music Festival, and are adept at crafting highly creative, energetic sets across four decks: masters of live remixing, tweaking and layering up effects and of teasing out the music for maximum dancefloor impact. Whether they’re playing clubs, warehouse shows, or at an impromptu after-party – which they more than likely arranged themselves – the sheer love these guys have for playing records and making people dance is evident. Just ask Lee Foss, Shiba San or any of the other DJs who’ve shared the decks with them for a B2B session: Golf Clap can mix it with the very best of them. As with every movement worth being a part of, Golf Clap’s self-made community started small: a group of like-minded artists and fans giving one another exactly what they needed to throw incredible parties. But as their profile has increased, word has spread both across the US and internationally. Go to any electronic music festival now and you’ll find a strong showing for their Country Club Disco merchandise and an ever-growing army of fans. 2016 has already seen the release of yet more essential Golf Clap material, including remixes for Simma Black and Sleazy G, original productions ‘All You Need’ and ‘Feel It’ on Country Club Disco and most recently their remix of Skapes ‘Deeper Love’. Add to this a flourishing gig schedule, including a European tour, and 2016 looks set to be a landmark year for the boys from Detroit.", "date": "2017-01-06T21:00:00-05:00", "name": "Golf Clap w/ Ghita Sisters 1/6/17 at Blind Pig - Ann Arbor"}, {"source": "Facebook", "url": "https://www.facebook.com/events/388503011499248/", "description": "COLD-PRESSED JUICE CLEANSES ARE BACK!\n\n... and just in time for the New Year! For the month of January only– get 10% off your juice cleanse and a free yoga class with Bikram Yoga West!\n\nBook your Cleanse now with promo code JUICECLEANSEJANUARY at Store.BaboAnnArbor.com!", "date": "2017-01-07T00:00:00-05:00", "name": "Babo Juice Cleanses"}, {"source": "Facebook", "url": "https://www.facebook.com/events/280243392370950/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "date": "2017-01-07T08:00:00-05:00", "name": "10% For Good for Community Action Network"}, {"source": "Facebook", "url": "https://www.facebook.com/events/1654083548217903/", "description": "BMG (IT)\nBrendan M Gillen founded Interdimensional Transmissions in late 1994 when he heard far too many ancient voices in his head. Positive that dimensions were colliding and that he could literally feel the deepest will of some mystic past, he decided not to ignore these voices but to contemplate their input, and thus Interdimensional Transmissions came to fruition and the idea-based project Ectomorph found a true home. Since then the vision has continually grown organically and mutated into something that is hard to describe yet easy to feel. His sets effortlessly combine a multitude of seemingly disparate genres into a coalescing solid sound system sensation - pure transcendent psychedelic wizardry. \n\nAlso Featuring:\n\nUnofficial: Matilda\n\nDoogatron\n\nPAT in the HAT\n\n7$\nLocated @ Club Above (Above the Heidleberg) Ann Arbor, MI.", "date": "2017-01-07T21:00:00-05:00", "name": "BMG at The Club Above w/ Matilda // Doogatron // Pat in the Hat"}]