[{"description": "Experience the flavors of the season and try our new Spring menu. Featuring new food and beverages you are sure to love! \nBut, don't worry we have kept some of the classics on our menu too.\nYou can make your reservation with OpenTable link above.", "url": "https://www.facebook.com/events/1745052782438333/", "source": "Facebook", "name": "Spring Menu Launch", "date": "2016-05-27T12:00:00-04:00"}, {"description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/704680732968092/", "source": "Facebook", "name": "Drink & Draw / Imbibe & Inscribe", "date": "2016-05-27T15:00:00-04:00"}, {"description": "Come join friends & neighbors alike for a fun, slow, community bike ride through Ann Arbor. For this month's ride, grab your backpacks, latch on your panniers, haul a child carrier & fill up your baskets (we're really excited about this one!) it's Bike-in :: Picnic! \n\nThat's right, come one, come all, by bike, for a friendly little time of picnicking. We'll be enjoying whatever you can bring during our extended mid-ride stop at the Greenview Nature Area (http://www.friendsofgreenview.org/).\n \nBring something for yourself or bring something to share. Better yet, join up with a few others, share around, and you may end up enjoying a whole meal together! If you forgot your food, no problem! Enjoy the time outdoors and friendliness might lend you some grub. If you're bringing more than finger foods and drinks, remember to pack some type of utensils and eating surface (parchment paper, tupperware lids, compostable plates, etc.).\n\nMeet-up time is 7:00 PM at the Ann Arbor Farmers Market, departing at 7:15 PM per usual. The route will be 10 miles or less, within city limits, include the mid-ride \"bike-in\" for picknicing, and end downtown. Check back soon for route & other details to come.\n\n\nWhat's Bike-in?\nSee the community page:\nhttps://www.facebook.com/bikeinannarbor/info?tab=page_info\n\nOR read below\n\nBike-in is: Slow bike rides throughout Ann Arbor for everyone. Post-ride fun with friends, neighbors, and visitors around the community.\n\nEach ride we will begin at the listed location & time, ride casually, then finish the ride by \"biking-in\" to a post-ride time together at a local establishment, green space, or other friendly host setting (i.e. Bike-in :: Movie (outdoor), Creamery (ice cream), Picnic (potluck), Garden (beer garden), etc.).\n\nRides will be open and friendly to all. For gathering information, times, locations, riding routes, weather updates, etc. like/follow the page or visit for updates.\n\nPlease practice safe riding and abide by all legal riding rules at all times, especially while riding with a Bike-in community. Be sure to provide your own helmet, riding lights, and other appropriate accessories.", "url": "https://www.facebook.com/events/281530315518082/", "source": "Facebook", "name": "Bike-in :: Picnic", "date": "2016-05-27T19:00:00-04:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Aggressively Nice\" starring Jade Fearn, Ryan Stennett, and Adam Hirzel\n\nGroup 2: \"Heather & Erik\" starring Heather Sejnowski and Erik Heilner\n\nGroup 3: \"The League of Pointless Improvisers\" starring Heather Sejnowski, Maggie O'Reilly, Matthew Flickinger, Erik Heilner, and Andy Reid", "url": "https://www.facebook.com/events/1710939282497760/", "source": "Facebook", "name": "Pointless Improv with Aggressively Nice and Heather & Erik", "date": "2016-05-27T20:00:00-04:00"}, {"description": "Laugh as our League tackles long form improv with their hilarious skills. Gasp as they traverse styles with ease. Be amazed as they improvise without a net.\n\nNo two shows are the same!\n\nStarring Heather Sejnowski, Maggie O'Reilly, Matthew Flickinger, Erik Heilner, and Andy Reid", "url": "https://www.facebook.com/events/1007681102644869/", "source": "Facebook", "name": "A Pointless Display of Improvised Feats", "date": "2016-05-27T22:00:00-04:00"}, {"description": "The PlayGround is part performance, part drama activities, and part crafts, each week with its own theme.\nRecommended for pre-k through grade 5.\nTickets: $7 per child (additional children $5 each). Adults are free.", "url": "https://www.facebook.com/events/1719473614960941/", "source": "Facebook", "name": "Little Peeps PlayGround - \"Five Senses\"", "date": "2016-05-28T10:30:00-04:00"}, {"description": "We're grilling out! Our footlong Made In-House brats or sausage with baked in house buns and side of our coleslaw, just $5 a plate- now that's a sausage party!", "url": "https://www.facebook.com/events/1708191829422279/", "source": "Facebook", "name": "$5 Footlong", "date": "2016-05-28T11:00:00-04:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Dianasty\" \n\nGroup 2: \"Frank & Dale\" \n\nGroup 3: \"The League of Pointless Improvisers\" starring Arthur Brannon III, Chris Moody, Julia Schroeder, Moni Jones, and James Quesada", "url": "https://www.facebook.com/events/1710692055846356/", "source": "Facebook", "name": "Pointless Improv with Dianasty and Frank & Dale", "date": "2016-05-28T20:00:00-04:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Frank & Dale\" \n\nGroup 2: \"Dianasty\" \n\nGroup 3: \"The League of Pointless Improvisers\" starring Arthur Brannon III, Chris Moody, Julia Schroeder, Moni Jones, and James Quesada", "url": "https://www.facebook.com/events/173186349747059/", "source": "Facebook", "name": "Pointless Improv with Frank & Dale and Dianasty", "date": "2016-05-28T22:00:00-04:00"}, {"description": "Experience the flavors of the season and try our new Spring menu. Featuring new food and beverages you are sure to love! \nBut, don't worry we have kept some of the classics on our menu too.\nYou can make your reservation with OpenTable link above.", "url": "https://www.facebook.com/events/1745052782438333/", "source": "Facebook", "name": "Spring Menu Launch", "date": "2016-05-29T12:00:00-04:00"}]