[{"source": "Facebook", "name": "25% Off Cosmetics and Facial Care", "description": "Pucker up! All cosmetics and facial care are 25% off Friday through Sunday, so stock up for yourself or someone you love <3", "url": "https://www.facebook.com/events/1060585290673795/", "date": "2016-05-09T07:00:00-04:00"}, {"source": "Facebook", "name": "Fresh + Fit!", "description": "FRESH + FIT!\nStarting April 1, babo and FitPoint want to help you optimize your diet and fitness. Get rejuvenated and restored with the babo Juice Cleanse then enjoy a free 7-day trial at FitPoint, a hot new fitness and yoga studio right here in Ann Arbor.  \n\nAs an extra reward for completing the cleanse, you’ll also get 50% off a personal training session with FitPoint founder and former pro tennis player, Dominika Wozniak.\n\nPLUS! \nWith every purchase you make from April 1-May 12 you’ll be entered to win our FRESH & FIT prize package:\n1-month Unlimited membership to FitPoint + a babo Market Wellness basket, featuring our cold press juices, salads, healthy snacks, and our famous Seedtrus granola.\nThis grand prize is worth over $250!\n\nYou can redeem this offer with a 1- or 3-day juice cleanse purchase, between April 1– May 12, in store or online.\n\nRULES\n7-Day FitPoint trial and 50% training session redeemable one time only.\nOne entry per purchase (1-day cleanse = 1 entry; 3-day cleanse= 3 entries) \nPrize package winners will be announced on May 12th via Instagram @babo_ann_arbor\n\nAbout FitPoint: http://fitpointa2.com/about\nFitPoint class schedule: http://fitpointa2.com/schedule", "url": "https://www.facebook.com/events/110005266066559/", "date": "2016-05-09T12:00:00-04:00"}, {"source": "Facebook", "name": "Acoustic Tuesdays: Tike Anderson", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\n-       May 10 - Tike Anderson \nTike Anderson’s songs are genuine testaments to life on the road, life at home, life in the center of the fire and life in the Motor City. He is an accomplished guitar player with a voice that sounds trained but feels honest. Tike’s songwriting blends road worn soul with the roots rock grit of the motor city and a hint of the easy intellectual earth tones of Ann Arbor.\n\n\nNever a cover\nAlways a good time", "url": "https://www.facebook.com/events/183943595325432/", "date": "2016-05-10T19:00:00-04:00"}, {"source": "Facebook", "name": "Paper Flower Making Party 3", "description": "Learn how to make beautiful paper flowers while helping AOT prepare for the inaugural James K. Berg Award gala on May 20th.  The paper flowers will be sold to raise funds and awareness of an upcoming tour of our “La Traviata” adaptation, which addresses the stigma surrounding mental illness and suicide.  They will also be used to create large topiaries that will be featured at the gala.  No experience is necessary, but it would be useful to bring a good pair of paper scissors and a glue gun (if you have one).  We will provide the papers, the instruction and other tools needed to create gorgeous, paper flowers.  They’d even make a wonderful gift for any woman you wish to honor this mother’s day.\n\nLight refreshments will be provided - Park along the street, as this is the home of artistic director, Shawn McDonald", "url": "https://www.facebook.com/events/1528797477430060/", "date": "2016-05-10T19:00:00-04:00"}, {"source": "Facebook", "name": "Bank of Ann Arbor is matching donation up to a total of $3,000 for United Way's Volunteer program", "description": "http://cafegive.com/make_the_match/boaa-volunteermatch\nWe believe everyone should have the chance to make a difference. That's why United Way of Washtenaw County's Volunteer Center makes it easy for good people and good causes to connect. The Bank of Ann Arbor is a proud sponsor and matching all donations up to $3,000 for a grand total of $3,000 for this amazing volunteer program. www.volunteerwashtenaw.org\n\nPlease share this on your social media to help us hit our goal!!", "url": "https://www.facebook.com/events/1739721849644306/", "date": "2016-05-11T14:00:00-04:00"}, {"source": "Facebook", "name": "Sump Pump Workshop", "description": "The City is hosting a third and final Open House for all sump pump owners on sump pump operations and maintenance on Wednesday, May 11 in the cafeteria at Lawton Elementary School, located at 2250 S Seventh St in Ann Arbor, 6:30 to 8:30 p.m. \n\nAttendees will learn about sump pump operations, maintenance, tips to keep their basements dry and have an opportunity to ask questions. There is no formal presentation; residents can stop by anytime between 6:30 and 8:30 p.m. This workshop is a repeat of previous sump pump workshops. \n \nTo learn more about sump pumps and how to properly maintain them, watch a few short videos. The videos and other materials on the website explain the purpose of a sump pump, as well as the components of a footing drain disconnection and sump pump installation. More information is available at a2gov.org/sumppumps.", "url": "https://www.facebook.com/events/946362432150961/", "date": "2016-05-11T18:30:00-04:00"}, {"source": "Facebook", "name": "Emily St. John Mandel", "description": "Literati is thrilled to welcome Emily St. John Mandel, author of Station Eleven, which was chosen as the 2015-16 Great Michigan Read! This event is sponsored by the Michigan Humanities Council and is free and open to the public.\n\nStation Eleven is an audacious, darkly glittering novel about art, fame, and ambition set in the eerie days of civilization's collapse. One snowy night a famous Hollywood actor slumps over and dies onstage during a production of King Lear. Hours later, the world as we know it begins to dissolve. Moving back and forth in time—from the actor's early days as a film star to fifteen years in the future, when a theater troupe known as The Travelling Symphony roams the wasteland of what remains—this suspenseful, elegiac, spellbinding novel charts the strange twists of fate that connect five people: the actor, the man who tried to save him, the actor's first wife, his oldest friend, and a young actress with the Traveling Symphony, caught in the crosshairs of a dangerous self-proclaimed prophet. Sometimes terrifying, sometimes tender, Station Eleven tells a story about the relationships that sustain us, the ephemeral nature of fame, and the beauty of the world as we know it.\n\nEmily St. John Mandel is the author of four novels, most recently Station Eleven, which was a finalist for a National Book Award and the PEN/Faulkner Award, and won the 2015 Arthur C. Clarke Award. A previous novel, The Singer's Gun, was the 2014 winner of the Prix Mystere de la Critique in France. Her short fiction and essays have been anthologized in numerous collections, including Best American Mystery Stories 2013. She is a staff writer for The Millions. She lives in New York City with her husband and daughter.", "url": "https://www.facebook.com/events/606755719498706/", "date": "2016-05-11T19:00:00-04:00"}, {"source": "Facebook", "name": "Scissor Now!, Curse, Dear Darkness", "description": "Curse from Baltimore, Maryland are coming back to the 3rd Death Star sandwiched between Scissor Now! and Dear Darkness\n\nhttps://scissornow.bandcamp.com/\nhttps://cursebaltimore.bandcamp.com/\nhttps://deardarkness1.bandcamp.com/", "url": "https://www.facebook.com/events/834448559998831/", "date": "2016-05-11T19:00:00-04:00"}, {"source": "Facebook", "name": "Meet Author Viola Shipman (aka Wade Rouse) for a Discussion & Signing of His Debut Novel 'the charm bracelet'", "description": "Viola Shipman is a pen name for Wade Rouse, a popular, award-winning memoirist. Rouse chose his grandmother’s name, Viola Shipman, to honor the woman whose charm bracelet and family stories inspired him to write his debut novel, which is a tribute to all of our elders. Rouse lives in Michigan and writes regularly forPeopleand Coastal Living, among other places, and is a contributor to All Things Considered. To date, The Charm Bracelethas been translated into nine languages. He is at work on his second “heirloom novel,” which will be published in 2017.\n\nThrough an heirloom charm bracelet three women will rediscover the importance of family and a passion for living as each charm changes their lives.\n\nFor every birthday Lolly’s mother gave her a charm with the advice that there is nothing more important than keeping family memories alive and Lolly’s charm bracelet would be a constant reminder of that love.\n\nNow seventy and starting to forget things, Lolly knows time is running out to reconnect with a daughter and granddaughter whose lives have become too busy for Lolly or her family stories.\n\nWhen Arden, Lolly’s daughter, receives an unexpected phone call about her mother she and granddaughter Lauren rush home.  Over the course of their visit Lolly reveals the story behind each charm on her bracelet and one by one the family stories help Lolly, Arden and Lauren reconnect in a way that brings each woman closer to finding joy, love and faith.\n\nA compelling story of three women and a beautiful reminder of the preciousness of family The Charm Bracelet is a keepsake you’ll cherish long after the final page.", "url": "https://www.facebook.com/events/879543862156644/", "date": "2016-05-11T19:00:00-04:00"}, {"source": "Facebook", "name": "Del The Funky Homosapien wsg DJ Shiftee & Sean Anonymous 5/11/16 at Blind Pig - Ann Arbor", "description": "Wed. May 11 | 9pm | 18+ | $20 Cover\n\nHailing from Oakland, California, Del the Funky Homosapien and his crew, the Hieroglyphics came out as a markedly non-gangster response to a burgeoning West Coast scene. After being put on at the tender age of 17 by his cousin Ice Cube, Del released two records on Elektra, I Wish My Brother George Was Here (1991) and No Need For Alarm (1993). Despite record sales in the hundreds of thousands, he recorded a third album, Future Development, which was never commercially released. Del parted with Elektra and started work on the Hieroglyphics..family album, 3rd Eye Vision (Hiero Imperium, 1998). Hiero went on the road and toured incessantly in support of the album for much of 1998. Del also spent a good portion of his time drawing, practicing Japanese, and playing mass amounts of video games. Finally ready to unleash a new record on the world, Del comes with BOTH SIDES OF THE BRAIN. Seventeen tracks of pure Del. He says of his work on this album: ..\"I've had complete control\". At times, Del has felt restrained by the formulas in hip hop and the expectations fans place upon emcees who have had hits. I wish that I had the same freedom that someone like Bjork has when she puts out an album..Apart from collaborations with PrincePaul, El-P (Company Flow), and help from a few of his Hiero cohorts (A-plus, Casual, Domino) Del handled the majority of production on this album. By staying true to himself, Del has earned legions of adoring fans. He may have said it best in his classic, Mistadobalina when he declared all in the mind and the heart. WSG: Sean Anonymous", "url": "https://www.facebook.com/events/222011124804458/", "date": "2016-05-11T21:00:00-04:00"}]