[{"description": "Savco Hospitality, the people that brought you Babo: A Market By Sava, Sava's Restaurant, Aventura Ann Arbor, and Tavolina Catering & Events are hiring for a variety of positions.\n\nJoin us for our career fair!\n\nEnjoy live music, refreshments, and on-the-spot interviews!\nVisit the link \"Ticket URL\" for our current job listings.", "date": "2016-04-14T14:00:00-04:00", "source": "Facebook", "name": "Savco Career Fair", "url": "https://www.facebook.com/events/1593975464227691/"}, {"description": "Savco Hospitality, the people that brought you Babo: A Market By Sava, Sava's Restaurant, Aventura Ann Arbor, and Tavolina Catering & Events are hiring for a variety of positions.\n\nJoin us for our career fair!\n\nEnjoy live music, refreshments, and on-the-spot interviews!\nVisit the link \"Ticket URL\" for our current job listings.", "date": "2016-04-14T14:00:00-04:00", "source": "Facebook", "name": "Savco Career Fair", "url": "https://www.facebook.com/events/572638872905174/"}, {"description": "Savco Hospitality, the people that brought you Babo: A Market By Sava, Sava's Restaurant, Aventura Ann Arbor, and Tavolina Catering & Events are hiring for a variety of positions.\n\nJoin us for our career fair!\n\nEnjoy live music, refreshments, and on-the-spot interviews!\nVisit the link \"Ticket URL\" for our current job listings.", "date": "2016-04-14T14:00:00-04:00", "source": "Facebook", "name": "Savco Career Fair", "url": "https://www.facebook.com/events/245596369124191/"}, {"description": "The School of Social Work People of Color Collective is thrilled to host a live recording of the BuzzFeed podcast, Another Round with Heben Nigatu and Tracy Clayton. These co-hosts cover everything from race, gender and pop culture to squirrels, mangoes, and bad jokes on their weekly podcast. They’ve interviewed a number of esteemed guests, including Ta-Nehisi Coates and Hillary Clinton. Now they're taking the show on the road! Join the ladies of Another Round for a LIVE SHOW on U of M's campus.\n\nThis event will be free, open to the public, and will take place in the Michigan Union Rogel Ballroom. RSVP is encouraged via Eventbrite. Doors open at 6:30pm for resource fair showcasing campus and community organizations. Show starts at 7:30pm.\n\nThere will also be an after party at Club Above for $5 per person. You can register for the free event and purchase tickets for the club above after party at Eventbrite. \n\nhttps://www.eventbrite.com/e/buzzfeeds-another-round-at-university-of-michigan-tickets-23072091246\n\nFacebook: Another Round\nBuzzfeed: buzzfeed.com/anotherround \nTwitter: @anotherround\nEvent Twitter: @umich #AnotherRoundatUM \n\nQuestions to anotherround@umich.edu\n\nThe People of Color Collective would like to thank the following co-sponsors and supporters: The School of Social Work Integrated Health Learning Community, The Vivian A. and James L. Curtis School of Social Work Research and Training Center, The School of Social Work Office of Student Services, The Office of the Vice Provost for Equity, Inclusion, and Academic Affairs, The Department for Afroamerican and African American Studies, The Women's Studies Department, The Spectrum Center, UMSocial, and others", "date": "2016-04-14T18:30:00-04:00", "source": "Facebook", "name": "Buzzfeed's Another Round at the University of Michigan", "url": "https://www.facebook.com/events/1188375341195164/"}, {"description": "the event: our monthly beer tasting series explore the expansive world of beer through the lens of different themes. we'll gather a couple dozen brews worth sampling to bring you a novel and varied experience for your palates. We’ll pair the beer samples with an appetizer buffet, provide a program with tasting notes, and top off the night with a door prize drawing.\n\nthe style: For April's tasting, we're getting weird. Think Hefeweizen's made with curry, porters made with pig heads, historical ales made with heather.  Whatever outlandish beers that we can get out hands on, we guarantee they will be unorthodox and out of the ordinary.\n\nthe details: Arbor Brewing Company's monthly tastings run from 7-9 PM on the 2nd Thursday of each month. Ticket holders will enter through the Arbor Brewing Company Tap Room entrance. \n\nthe contest: Guests who come attired in a creative costume will get a second raffle ticket for the door prize drawing. Get wacky, get weird, get funky and double your chances!\n\nthe tickets: Tickets are available at the pub or by phone at 734-213-1393. $25 in advance, $30 day of. \nTickets are also available on Eventbrite: https://www.eventbrite.com/e/beer-tasting-april-foolishness-tickets-22819923004", "date": "2016-04-14T19:00:00-04:00", "source": "Facebook", "name": "Beer Tasting: April Foolishness", "url": "https://www.facebook.com/events/1767827183440408/"}, {"description": "April is National Poetry Month and we intend on celebrating with our voices, snaps, claps, and smiles. Light refreshments will be served. \n\nOur featured poet, Marilyn Churchill, will be reading from her new book Memory Stones. “All of life is her material. She takes the everyday and shapes it into a mix of humor and quicksilver.” (Mary Koral) Marilyn has a BFA from U of M and a Masters in Creative Writing from EMU. She is a visual artist and poet, and part-owner of the West Side Book Shop in Ann Arbor.\n\nThe event begins with an open mic session when area poets can share their own work or that of a favorite author. Signing to follow.", "date": "2016-04-14T19:00:00-04:00", "source": "Facebook", "name": "Open Mic & Share Poetry Series featuring Marilyn Churchill", "url": "https://www.facebook.com/events/1010317442371650/"}, {"description": "Thursday, April 14, 2016, 7:30 pm\nHill Auditorium\n\nNamed after a pub in Austria, where the former Vienna Conservatory students spent many a night socializing and performing at a monthly open mic, Mnozil Brass beautifully combines fearless, world-class virtuosity and zany theatrical wit. This brass septet seamlessly blends original compositions with classical favorites, jazz standards, and popular hits, presented with the group’s iconic humor in scenes so clever that they would be worthy of Monty Python. \n\nMore info: http://ums.org/performance/mnozil-brass/", "date": "2016-04-14T19:30:00-04:00", "source": "Facebook", "name": "Mnozil Brass", "url": "https://www.facebook.com/events/1621365181438631/"}, {"description": "The Jim Toy Birthday Bash is a fantastic event to honor our namesake, the legendary Jim Toy, while also bringing our community together for an enjoyable evening celebrating an incredible man and his lifetime of advocacy and accomplishments on behalf of the LGBTQ community.\n\nThank you to our growing list of financial sponsors who made this event possible:\n\nSponsors:\nComcast & Out Post\n\nHosts:\nLeigh Greden & Washtenaw Community College\n\nFriends of Jim Toy:\nMichigan Supreme Court Justice Bridget Mary McCormack\nU.S. Congresswoman Debbie Dingell\nState Representative Jeff Irwin\nState Representative Adam F Zemke\nWashtenaw Sheriff Jerry Clayton\nEvan Pratt, Washtenaw County Water Resources Commissioner \nAnn Arbor Mayor Christopher Taylor\nYpsilanti Mayor Amanda Maria Edmonds & Hollie Pietsch\nAnn Arbor City Councilmember Sabra Briere\nAnn Arbor City Councilmember Chip Smith & Courtney Piotrowski\nAnn Arbor City Councilmember Kirk Westphal\nAnn Arbor City Councilmember Jane Lumm\nAnn Arbor City Councilmember Graydon Krapohl\nWashtenaw County Commissioner Yousef Rabhi\nWashtenaw County Commissioner Andy LaBarre\nJoan Lowenstein\nTravis Radina\nAngus Burch\nDoug Scott\nLawrence La Fountain-Stokes\nBarbara Murray\nAnn Arbor Area Convention & Visitors Bureau\n\nTo become a sponsor or donate to the event, please go here: https://secure.lglforms.com/form_engine/s/NMRhi10N5uVq9ZSSGKmuwg\n\nThank you also to our community sponsors, the Washtenaw ID Project, Planned Parenthood Advocates of Michigan and Equality Research Center! These organizations will be in attendance at Birthday Bash - please be sure to learn more about them while you enjoy the party!\n\nPlease note this event is 21-and-over. Minors welcome with a parent. $10 suggested donation at the door. Small appetizers will be provided!", "date": "2016-04-15T18:30:00-04:00", "source": "Facebook", "name": "5th Annual Jim Toy Birthday Bash", "url": "https://www.facebook.com/events/1714526335426651/"}, {"description": "Literati is pleased to welcome Tamar Boyadjian, Tarfia Faizullah, & Airea D. Matthews to the store in celebration of National Poetry Month.\n\nTamar Boyadjian is the author of it is what it is and the vineyard of mirrors. Her poetic and academic work has been included in a number of literary journals and creative anthologies around the world including the United States, Turkey, Armenia, parts of Europe and the Middle East. Tamar teaches medieval literature (and the literature of other people and cultures) as well as creative writing at Michigan State University, and is involved with the Armenian Studies Program at the University of Michigan.\n\nPoet, editor, and educator Tarfia Faizullah was born in 1980 in Brooklyn, NY and raised in west Texas. She received an MFA in poetry from Virginia Commonwealth University and is the author of Seam, which U.S. Poet Laureate Natasha Trethewey calls “beautiful and necessary,” as well as Register of Eliminated Villages (forthcoming from Graywolf in 2017).\n\nAirea D. Matthews is a 2015 Kresge Literary Arts Fellow and the executive editor of The Offing. She is currently the Assistant Director of the Helen Zell Writers’ Program at University of Michigan, Ann Arbor, where she earned her MFA. Her poems have appeared or are forthcoming in Best American Poetry 2015, American Poet,The Missouri Review, The Baffler, Callaloo, Indiana Review, WSQ and elsewhere. Her performance work has been featured at the Cannes Lions Festival, PBS’ RoadTrip Nation and NPR. She lives in Detroit with her husband and their four children.", "date": "2016-04-15T19:00:00-04:00", "source": "Facebook", "name": "Tamar Boyadjian, Tarfia Faizullah, & Airea D. Matthews", "url": "https://www.facebook.com/events/1064590700274844/"}, {"description": "Friday, April 15, 2016, 8:00 pm\nMichigan Theater \n\nSimon Shaheen brings to life the Arab music of Al-Andalus and blends it with the ubiquitous art of flamenco in Zafir, a program of instrumental and vocal music and dance that renews a relationship with music from a thousand years ago. Zafir explores the commonalities of music born in the cultural centers of Iraq and Syria that blew like the wind (zafir) across the waters of the Mediterranean to Al-Andalus. There it blended with elements of Spanish music and was brought back across the seas to North Africa, where it flourished in the cities of Morocco, Algeria, and Tunisia. Zafir features virtuoso composer and musical director Simon Shaheen with his group Qantara, acclaimed singer Nidal Ibourk, flamenco musician Juan Pérez Rodríguez, and the fiery young flamenco dancer Auxi Fernandez, who completes the music with her explosive footwork. \n\nMore info: http://ums.org/performance/zafir-simon-shaheen/", "date": "2016-04-15T20:00:00-04:00", "source": "Facebook", "name": "Zafir: Musical Winds from North Africa to Andalucía", "url": "https://www.facebook.com/events/419604171550681/"}]