[{"source": "Facebook", "date": "2017-01-19T17:00:00-05:00", "description": "Join KPW, our meat department manager, for an informative chat and demo about how to prepare chicken. This time, he'll be focussing on how to break down a chicken to get more out of it. More cluck for your buck- join us!", "name": "Chicken 101 with KPW", "url": "https://www.facebook.com/events/952501411516218/"}, {"source": "Facebook", "date": "2017-01-19T17:30:00-05:00", "description": "Kelly Link is the author of the collections Stranger Things Happen, Magic for Beginners, Pretty Monsters, and Get in Trouble. Her short stories have been published in The Magazine of Fantasy & Science Fiction, The Best American Short Stories, and Prize Stories: The O. Henry Awards. She has received a grant from the National Endowment for the Arts. She and Gavin J. Grant have co-edited a number of anthologies, including multiple volumes of The Year’s Best Fantasy and Horror and, for young adults, Steampunk! and Monstrous Affections. She is the co-founder of Small Beer Press and co-edits the occasional zine Lady Churchill’s Rosebud Wristlet. Link was born in Miami, Florida. Shecurrently lives with her husband and daughter in Northampton, Massachusetts.\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (AB ’64, LLDHon '13).", "name": "Zell Visiting Writers Series: a conversation with Kelly Link", "url": "https://www.facebook.com/events/360267014340397/"}, {"source": "Facebook", "date": "2017-01-19T18:00:00-05:00", "description": "Improve your woodworking knowledge with one-on-one instruction. The process of using woodworking tools in unison to create a final product is the primary focus of this class. \n\nWe’ll walk you through using the Jointer, Planer, Table Saw and Drum Sander to gain confidence with each tool. You will also be learning how different materials and their features or defects might affect the finished project. \n\nWoodworking skills taught: Wood identification and selection, milling, gluing/clamping, shaping, and table saw ripping/crosscutting. You’ll also learn how to use a table saw in unexpected ways. \n\nProject: End Grain Cutting Board \n\nPrerequisites: Attendees must be checked out on on the Jointer, Planer, Drum Sander and Table Saw. \n\nThis class meets three times: Monday 01/16 6:00pm - 9:00pm and Tuesday, 01/17 6:00pm - 8:00pm, and Wednesday, 01/18 6:00pm - 8:30pm \n\nThis class is taught by Chris Riecker, find out more about his work here: maker-works.com/this-woodworking-is-a-cut-above/", "name": "Woodworking Skill Development - 7.5hrs - $200", "url": "https://www.facebook.com/events/1826785644235500/"}, {"source": "Facebook", "date": "2017-01-19T18:30:00-05:00", "description": "…AND WE’RE BACK! \n\nIt’s the new year and we’ve got an all new line up of speakers ready to let their nerd light shine. First up is Reema Abi-Akar, who knows there’s nothing new under the pun, but has some quip-witted repartee on everyone’s (dad’s) favorite kind of wordplay. Andrew McAllister, he studies applied physics, he works on a super computer, and he predicts a glorious and well-lit future in which super-efficient LED bulbs are also super-affordable. Newshound Jim McBee of The Ann magazine is here to talk about those phony news stories your uncle keeps sharing on Facebook, and how to separate the credible from the incredible.\n\nIt’s going to be illuminating in more ways than one!\n\nWhen: Thursday, January 19, 2017, doors at 6:30 pm, talks at 7 pm!\nWhere: LIVE, 102 S First St, Ann Arbor\n$$$: NO COVER, thanks to your friendly neighborhood AADL!", "name": "Nerd Nite #41: Packing a PUNch, Making Light and Fake News", "url": "https://www.facebook.com/events/1829972520597291/"}, {"source": "Facebook", "date": "2017-01-19T19:30:00-05:00", "description": "Ann Arbor Civic Theatre presents In the Next Room or the vibrator play by Sarah Ruhl, directed by Melissa Freilich, January 19-22, 2017, at the University of Michigan’s Arthur Miller Theatre, 1226 Murfin Ave, 48109. Performances are Thursday at 7:30 p.m., Friday-Saturday at 8 p.m. and Sunday at 2 p.m. Ticket prices are $22 for adults, $20 for seniors, and $17 for tickets on Thursday, with student tickets just $11 for any performance. Tickets are available online at www.a2ct.org, by calling the office at 734-971-2228, at the A2CT office at 322 W. Ann St., or at the door. Additional information is available by visiting www.a2ct.org. \n \nAt a time when electricity was beginning to light up the dark corners of the polite Victorian home, In the Next Room introduces us to characters wondering what they want and how they are supposed to love.  Dr. Givings treats women for hysteria, and now, thanks to the invention of electricity, he has a new vibrating instrument which is getting amazing results.  On just the other side of the door in the living room, his wife Catherine struggles with her role as a wife and mother.  Each of them is beginning to wonder, and worry, about exactly what is happening in the next room.  Loosen your corset and join Ann Arbor Civic Theatre for a play full of both poetry and farce that asks whether we are so different today.\n \nDirector Melissa Freilich is working with a talented ensemble of actors and designers to develop the world of the doctor’s home.  Describing the emotional impact of the show, she says, “This play brings us into the character's lives.  We don't see what we expect from a Victorian stereotype.  Instead, we recognize real people who are struggling with their own feelings, in a way that's both beautiful and often really funny.”\n \nThe artistic staff of In the Next Room, or the vibrator play includes set designer Leo Babcock, set dressing designer Beth Duey, props designer Aaron Wade, lighting designer Brad Pritts, costume designers Jamee Zielke and Abby Zielke, undergarments designer Molly Borneman, and sound designer Matt Steward.  The talented cast includes Greg Kovas as Dr. Givings, Liana Abela as Mrs. Givings, Amanda Photenhauer as Mrs. Daldry, Ellen Blanchard as Annie, Joseph McDonald as Leo, Maegan Murphy as Elizabeth and Rob Roy as Mr. Daldry.  Stage managed by Alexa Ducsay and produced by Lindsay Harkins.", "name": "In the Next Room or the Vibrator Play", "url": "https://www.facebook.com/events/344427089276306/"}, {"source": "Facebook", "date": "2017-01-19T20:00:00-05:00", "description": "Clear Soul Forces\nhttps://www.facebook.com/clearsoulforces/?fref=ts\n\nwsg\n\nIlladope\nwww.illadope.com\n\nMunch\nhttps://www.facebook.com/MunchMusic/\n\nObie Ioyha\nhttps://soundcloud.com/obie-iyoha\n\nDaG\nhttps://heisthedagger.bandcamp.com/\n\nTickets: \nhttp://www.ticketweb.com/t3/sale/SaleEventDetail?eventId=7087435&pl=blindpig&dispatch=loadSelectionData\n\n8pm  / /  $8", "name": "Clear Soul Forces, Munch, Obie Iyoha, DaG at Bling Pig", "url": "https://www.facebook.com/events/173095993163772/"}, {"source": "Facebook", "date": "2017-01-19T20:00:00-05:00", "description": "Stephen Boegehold’s Way of Dreams Band\n\nStephen Boegehold, drums\nBen Rolston, bass\nAndrew Bishop, saxophones\nMolly Jones, saxophones\nKirsten Carey, guitar\n\nFrom bandleader Stephen Boegehold:\n\n'The title of this project comes from Carl Jung, who wrote, \"The way of dreams is to give us more than what we ask.\" I like this quote because it suggests that dreams, symbols from which we can glean understanding, reflection, and growth, have their own distinct way that's both at once borne from us and exists outside of us. On a musical level, these songs came to exist with a similar purpose in mind: to use creation as a source for illumination of dreams and as a way of finding that same understanding, reflection, and growth with a band of musicians that I trust and respect.'\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student", "name": "Stephen Boegehold’s Way of Dreams Band", "url": "https://www.facebook.com/events/1794780760771056/"}, {"source": "Facebook", "date": "2017-01-19T22:00:00-05:00", "description": "Hey #CandyFam!\n\nOn the eve of the inauguration, let's celebrate what we share and what brings us together. We will refuse to be discouraged or afraid or ashamed. Instead, we will find strength and a space for joy in our community together.\n\nThis week is also the time each year that we celebrate the life, work, and message of Dr. Martin Luther King, and we remember that all it takes for evil to succeed is for good people to do nothing. So in lieu of cover, we'll be collecting donations for the Southern Poverty Law Center, a group carrying on the spirit of Dr. King's mission and  dedicated to fighting hate and bigotry and to seeking justice for the most vulnerable members of our society.\n\n** Doors at 10p\n** Free cover, donations encouraged for SPLC", "name": "Candy Bar: UNITE", "url": "https://www.facebook.com/events/962985427135592/"}, {"source": "Facebook", "date": "2017-01-20T10:00:00-05:00", "description": "A2CT will hold a series of workshops on various aspects of stage production on Saturday, January 14 and Saturday, January 21, between 10am-2:30pm each day at the A2CT Studio, 322 West Ann Street, Ann Arbor, MI, 48104. As a part of Civic Theatre’s education series, these one-hour workshops will offer an overview of sound, lighting, set, props, make-up/hair, and costume design, as well as stage management. Each session will be led by local technical theater experts from A2CT, local colleges, and the acclaimed technical theater department at Community High School. The workshops are designed for those in grade 6 through adult, and those attending may attend any or all sessions. Each individual session is $5, or $20 for a pass for all sessions per day ($10 for A2CT members). Those interested may register by calling the A2CT office at 734-971-2228 or by e-mail at manager@a2ct.org. Additional information is available at a2ct.org. \nThe workshops on January 14 begin with an introduction to technical theater, followed by sessions on lighting design, sound design, and set design. The workshops on January 21 feature sessions on stage management, props design, hair and makeup design, and costume design. There will be a lunch break from noon-12:30 each Saturday, and participants staying for afternoon sessions are invited to bring a lunch or purchase pizza for $5.", "name": "Intro to Stagecraft Workshops", "url": "https://www.facebook.com/events/1716505231999811/"}, {"source": "Facebook", "date": "2017-01-20T15:00:00-05:00", "description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Drink & Draw / Imbibe & Inscribe", "url": "https://www.facebook.com/events/306303139753622/"}]