[{"date": "2016-08-28T15:00:00-04:00", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by The New York Times, this world famous high-wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high-wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with a grand flourish, be awestruck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets should be purchased in advance, if any tickets remain, they will be sold at the tent 30 minutes prior the show. The tent is wheelchair accessible with advance notice and tent capacity is limited. For everyone's comfort and safety, please note that the tent has a cooling feature that is used if it is a particularly hot day. Performance parking is available at the Burns Park Elementary lot for a $5 donation to the PTO.\n\n$20 Kids & $30 Adult - General Admission\nParking at the Burns Park Elementary School\n\nSponsored by: Toyota USA\nPresented in part with support from: National Endowment for the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nAugust 24 @ 6:30 pm, Burns Park \nAugust 25 @ 6:30 pm, Burns Park\nAugust 26 @ 6:30 pm, Burns Park \n** JUST ADDED ** August 27 @ 3 pm, Burns Park\nAugust 27 @ 6:30 pm, Burns Park \n** JUST ADDED ** August 28 @ 3 pm, Burns Park\nAugust 28 @ 6:30 pm, Burns Park\n\nWatch the videos:\nThe Show: https://youtu.be/TB0Oyl1gSNk\n\nHighwire Stunts: https://www.youtube.com/watch?v=rqCzjvM3_Sc\n\nOn a Treadmill: https://www.youtube.com/watch?v=oxrqksjrMf0", "url": "https://www.facebook.com/events/550149985168236/", "source": "Facebook", "name": "JUST ADDED ** One-Man Circus"}, {"date": "2016-08-28T16:00:00-04:00", "description": "Come in out of the rain/sunshine/snow/tornado/weird-Michigan-weather and play board games while enjoying brewed-on-site craft beer! \nBring your own games or use ours. \nBrings some friends or meet some new ones. \nSundays at 4pm at Pointless Brewery & Theatre, 3014 Packard in Ann Arbor.", "url": "https://www.facebook.com/events/1139704566116036/", "source": "Facebook", "name": "Beer and Board Games"}, {"date": "2016-08-28T18:30:00-04:00", "description": "Enter the magical world of David Dimitri. Lauded “Lord of the Wire” by The New York Times, this world famous high-wire dancer and veteran of Cirque du Soleil and Big Apple Circus epitomizes innovation as he alone performs an entire circus. Creating what he calls “a unique magic” in the intimate setting of a tent in Burns Park, his L’homme Cirque balances dramatic feats like high-wire flips and a human cannon launch with humor, poetry, and serenades on the accordion. It’s as gripping as it is charming—and with a grand flourish, be awestruck as he exits the tent on his high wire, crossing above at 150 feet “and into the sky.”\n\nPlease note: Tickets should be purchased in advance, if any tickets remain, they will be sold at the tent 30 minutes prior the show. The tent is wheelchair accessible with advance notice and tent capacity is limited. For everyone's comfort and safety, please note that the tent has a cooling feature that is used if it is a particularly hot day. Performance parking is available at the Burns Park Elementary lot for a $5 donation to the PTO.\n\n$20 Kids & $30 Adult - General Admission\nParking at the Burns Park Elementary School\n\nSponsored by: Toyota USA\nPresented in part with support from: National Endowment for the Arts\nThis performance is generously underwritten by Ellie Serras.\nMedia Partner: Michigan Radio 91.7\n\nAugust 24 @ 6:30 pm, Burns Park \nAugust 25 @ 6:30 pm, Burns Park\nAugust 26 @ 6:30 pm, Burns Park \nAugust 27 @ 6:30 pm, Burns Park \nAugust 28 @ 6:30 pm, Burns Park\n\nWatch the videos:\nThe Show: https://youtu.be/TB0Oyl1gSNk\n\nHighwire Stunts: https://www.youtube.com/watch?v=rqCzjvM3_Sc\n\nOn a Treadmill: https://www.youtube.com/watch?v=oxrqksjrMf0", "url": "https://www.facebook.com/events/1556374641333780/", "source": "Facebook", "name": "One-Man Circus (L’homme Cirque)"}, {"date": "2016-08-28T19:00:00-04:00", "description": "War Brides from Chicago, IL are on tour. Locals Terrible As the Dawn and King Under the Mountain will kick off the show!\n\nWAR BRIDES (chicago)\nhttps://warbrides.bandcamp.com/\n\nTerrible As The Dawn\nhttps://terribleasthedawn.bandcamp.com/releases\n\nKing Under the Mountain\n¯\\_(ツ)_/¯", "url": "https://www.facebook.com/events/293378414374229/", "source": "Facebook", "name": "War Brides, Terrible As the Dawn, King Under the Mountain"}, {"date": "2016-08-28T19:00:00-04:00", "description": "Sunday nights the beer flows as we open the stage to local performers. Come to watch or to perform in this fun, relaxed atmosphere.\n\nDo you play in a band, do improv, write poetry, belly dance, or have some other talent you would like to perform? Then sign up for a 10-15 minute spot on the Open Stage, and share your gifts. The Open Stage is a great place to try out your latest project among other artists and supporters. \n\nFree for performers, pay-what-you-can for spectators.", "url": "https://www.facebook.com/events/956189751193648/", "source": "Facebook", "name": "Open Stage"}, {"date": "2016-08-30T19:00:00-04:00", "description": "Arbor Brewing Company presents...\nACOUSTIC TUESDAYS!\nEvery Tuesday at 7pm, we’ll be featuring live acoustic sets from the area’s most talented artists.\n\nDickie D. - Richard Delcamp, Singer-songwriter-guitar-banjo artist from Dragon Wagon, one of Michigan's premier bluegrass outfits,  playing a little bit of everything, Acoustic rock/Americana/traditional roots/bluegrass/folk/blues/original songwriting!\n\nNew a cover\nAlways a good time", "url": "https://www.facebook.com/events/1777527079192278/", "source": "Facebook", "name": "Acoustic Tuesdays: Rich Delcamp"}, {"date": "2016-08-31T19:00:00-04:00", "description": "Literati is pleased to welcome Fabienne Josaphat in support of her debut novel, Dancing in the Baron's Shadow.\n\nHaiti, 1965. Francois Duvalier, often called Papa Doc or Baron Samedi, is a brutal dictator using extreme violence to control the impoverished island nation. Unrelenting curfews are imposed on the people of Port-au-Prince and the ever-present bogeymen, Tonton Macoutes militia, have scared away even the bravest of tourists. For taxi driver Raymond L'Eveillé, life under these conditions is becoming increasingly untenable. Unable to properly feed his wife and young children, or pay the rent on time, Raymond's family is on the brink of destitution. By contrast, Raymond's brother Nicolas is a wealthy professor at the local university. A believer in law and justice, Nicolas is secretly writing a socialist manifesto, in an attempt to rally support for those that oppose Papa Doc's harsh dictatorship. When Nicolas' home is searched as a result of his liberal lectures, the violent and unfeeling Tonton Macoutes quickly arrest him and send him to Fort Dimanche, an over-filled, disease-ridden prison that few survive. Meanwhile, Raymond comes home to find his wife has left with their children, hoping to build a better life for her starving family abroad. With his family gone, and as Nicolas' colleagues continue to disappear, Raymond plunges into a daring scheme to save his brother. In order to gain access to the dreaded Fort Dimanche, the cab driver does something few Haitians would ever dream of doing: he gets himself arrested. Once inside, and with the help of a small gang of resistance fighters and a sympathetic prison guard, the two men will attempt a death-defying prison break. But first, they will both have to survive life in Fort Dimanche. The harrowing experience shared by the two brothers is brutal, heartbreaking and ultimately triumphant. \n\nJosaphat's electric prose brings to life a horrifying and not so distant time in Haiti's past while exploring the best and worst of humanity. The novel examines power's tendency to corrupt, the impulse of nationalistic pride, and above all, the human desire to survive, while describing in rigorous detail the shocking realities of life in the Baron's shadow.\n\n\"Dancing in the Baron's Shadow takes us to hell and back, inside one of the most brutal prisons run by one of the world’s most ruthless dictators. Fabienne Josaphat impressively brings to life a horrible period as well as the men and women who fought against it. Filled with life, suspense, and humor, this powerful first novel is an irresistible read about the nature of good and evil, terror and injustice, and ultimately triumph and love.\"—Edwidge Danticat, author of Claire of the Sea Light\n\nFabienne Josaphat received her M.F.A. in creative writing from Florida International University. Dancing in the Baron’s Shadow is her first novel. She lives in Miami.\n\nEvent date: \nWednesday, August 31, 2016 - 7:00pm", "url": "https://www.facebook.com/events/614305965415106/", "source": "Facebook", "name": "Fabienne Josaphat"}, {"date": "2016-09-01T16:00:00-04:00", "description": "Lunches and snacks and dinners, oh, my! Back to school means a lot of meals to get ready with less time, but no worries- we're here to help! Join us for our Back to School Vendor Fair, where we'll be joined by some of our favorite vendors to provide inspiration for school days eats.", "url": "https://www.facebook.com/events/1755447901393272/", "source": "Facebook", "name": "Back to School Vendor Fair"}, {"date": "2016-09-01T16:00:00-04:00", "description": "Our in-house Oktoberfest release is one of our favorite days of the year! Come say \"o'zapft is\" with us -- we'll have German food specials running all weekend and 11x17 prints of our Oktoberfest poster wil be available for purchase. Prost!", "url": "https://www.facebook.com/events/660184664155555/", "source": "Facebook", "name": "Oktoberfest Release"}, {"date": "2016-09-02T16:00:00-04:00", "description": "Our in-house Oktoberfest release is one of our favorite days of the year! Come say \"o'zapft is\" with us -- we'll have German food specials running all weekend and 11x17 prints of our Oktoberfest poster wil be available for purchase. Prost!", "url": "https://www.facebook.com/events/660184664155555/", "source": "Facebook", "name": "Oktoberfest Release"}]