[{"description": "For just one day next Wednesday, all our supplements are 30% off! Stock up on your favortites to keep healthy as we go into cold and flu season, and find some new favorites to try.", "date": "2016-09-21T08:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/859789944151960/", "name": "30% Off Supplements- One Day Only!"}, {"description": "The City of Ann Arbor invites the public to attend and participate in the next round of public meetings in the Ann Arbor Station Environmental Review project to discuss and comment on the Alternatives Analysis Phase II report. \n\nLeadership Advisory Group Meeting\nWednesday, September 21\t\n8:00 a.m. – 9:30 a.m.\nCouncil Chambers, 2nd Floor, Ann Arbor City Hall, 301 E. Huron Street, Ann Arbor\n\nThis Alternatives Analysis is the result of technical and environmental analysis compliant with the National Environmental Policy Act (NEPA) and public input received since February 2014. The Ann Arbor Station planning effort is led by the City of Ann Arbor with the Michigan Department of Transportation (MDOT) and the Federal Railroad Administration (FRA). The Phase II report, along with additional project information and documents, is available online at www.a2gov.org/annarborstation.", "date": "2016-09-21T08:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/520260811510701/", "name": "Ann Arbor Station Leadership Advisory Group Meeting"}, {"description": "The City of Ann Arbor invites the public to attend and participate in the next round of public meetings in the Ann Arbor Station Environmental Review project to discuss and comment on the Alternatives Analysis Phase II report. \n\nCitizen Working Group Meeting\nWednesday, September 21\t\t\t\n6:30 p.m.-8:30 p.m.\nCouncil Chambers, 2nd Floor, Ann Arbor City Hall, 301 E. Huron Street, Ann Arbor\n\nThis Alternatives Analysis is the result of technical and environmental analysis compliant with the National Environmental Policy Act (NEPA) and public input received since February 2014. The Ann Arbor Station planning effort is led by the City of Ann Arbor with the Michigan Department of Transportation (MDOT) and the Federal Railroad Administration (FRA). The Phase II report, along with additional project information and documents, is available online at www.a2gov.org/annarborstation.", "date": "2016-09-21T18:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/320953951588714/", "name": "Ann Arbor Station Citizen Working Group Meeting"}, {"description": "Literati is thrilled to welcome Eileen Pollack back to the store in support of her latest book, A Perfect Life.\n\nLove and science converge in Eileen Pollack’s luminous new novel, A Perfect Life. With singular insight and narrative grace, Pollack explores the moral complexities of scientific discovery through the story of a brilliant research biologist facing heartrending decisions about her personal life and the fate that genetics may have preordained for her. \n\nJane Weiss is a young post doc at MIT who is obsessed with finding the genetic marker for Valentine’s disease, a neurodegenerative disorder that killed her mother. With the clear vision of a scientist, she knows that she and her sister each stand a fifty percent chance of inheriting the disease, and her research is fueled by a need to discover if they are genetic carriers. Having witnessed the devastating effect that Valentine’s had on her parents’ marriage, Jane has vowed to steer clear of love unless she is sure she is free of the disease, refusing to become a burden on anyone else. But that determination is upended when she meets and falls in love with Willie, whose own father died of Valentine’s. Suddenly, with the very real possibility of their relationship ending in tragedy, her research takes on a new ferocity.\n\n“A Perfect Life probes how we live in the face of uncertainty and the ways risk can both disable and empower us. Eileen Pollack has crafted a tender exploration of family love that is as smart and thought-provoking as it is moving.”--Celeste Ng, author of Everything I Never Told You\n\n“Like Richard Powers’s The Gold Bug Variations and Allegra Goodman’s Intuition, Eileen Pollack’s compelling novel offers an intimate portrait of scientists engaged in research with the potential to change all our lives—and equally engaged in relationships that change their own lives.\"--Andrea Barrett, author of Ship Fever and Servants of the Map\n\n“A tense scientific mystery propels this gripping novel, but what resonates most powerfully are the keenly observed discoveries Jane makes about even deeper mysteries: the risks and pleasures of being human, and the nuances—as well as the costs—of love.”--Kim Edwards, author of The Memory-Keeper's Daughter\n\nWith both an MFA from the Iowa Writers’ Workshop and a BS in physics from Yale, Eileen Pollack is uniquely positioned to have written A Perfect Life, bringing both a fiction-writer’s sensibility and a scientific background to the novel. She is the author of two previous novels, two story collections, and two books of nonfiction, and has received fellowships from the National Endowment for the Arts, the Michener Foundation and the Rona Jaffe Foundation. Her work has been included in both the Best American Short Stories and the Best American Essays series. Pollack has been a professor at the Helen Zell MFA Program at the University of Michigan since 1999, and was a director of the program for five years. She now divides her time between Ann Arbor and Manhattan.", "date": "2016-09-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/310581899312138/", "name": "Eileen Pollack"}, {"description": "Rise Again Community Sing-Along with Jeanne Mackey • Sept. 21, Oct. 26, Nov. 30; 7 p.m. in the Crazy Wisdom Community Room • Join song leader Jeanne Mackey for a community sing-along from the recently released Rise Again Songbook, a guide with lyrics to over 1200 songs, from Beatles to ballads, Dylan to Broadway. Purchase the songbook at Crazy Wisdom or use the store copy. Shower singers welcome! Suggested donation $5. Call 665-2757 or email rachel@crazywisdom.net.", "date": "2016-09-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1354366534574989/", "name": "Rise Again Community Sing-Along with Jeanne Mackey"}, {"description": "Kristin Rebecca is a captivating performer who combines her powerful, angelic voice, unique guitar rhythms and rare harp ability into a show unlike any other.  Joe Holt is a folk singer/songwriter described by Indie, Bikes and Beer as \"a smart songwriter with a rich voice.\" More info at: http://www.ouryellowbarn.com/event/kristin-rebecca-with-joe-holt/?instance_id=22566", "date": "2016-09-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1071944319522170/", "name": "Kristin Rebecca with Joe Holt"}, {"description": "Nisi Shawl is a writer of science fiction and fantasy short stories and a journalist. She is the co-author (with Cynthia Ward) of \"Writing the Other: Bridging Cultural Differences for Successful Fiction.\" Her short stories have appeared in \"Asimov's SF Magazine,\" \"Strange Horizons,\" and numerous other magazines and anthologies.\n\n\"Everfair \"is a wonderful Neo-Victorian alternate history novel that explores the question of what might have come of Belgium's disastrous colonization of the Congo if the native populations had learned about steam technology a bit earlier. Fabian Socialists from Great Britian join forces with African-American missionaries to purchase land from the Belgian Congo's \"owner,\" King Leopold II. This land, named Everfair, is set aside as a safe haven, an imaginary Utopia for native populations of the Congo as well as escaped slaves returning from America and other places where African natives were being mistreated.\n\nhttp://bit.ly/2bsc2RP", "date": "2016-09-21T19:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/861030390698582/", "name": "Author Nisi Shawl Discussion & Signing"}, {"description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "date": "2016-09-22T12:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/585713071616738/", "name": "POP-X"}, {"description": "New Holland Brewing Company is our September Brewery of the Month, and they'll be with us to share some of their favorite beers with you. Cheers!", "date": "2016-09-22T17:00:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/206306759786449/", "name": "Brewery of the Month Tasting"}, {"description": "Bob Hicok was born in 1960 in Michigan and worked for many years in the automotive die industry. A published poet long before he earned his MFA, Hicok is the author of several collections of poems, including The Legend of Light, winner of the Felix Pollak Prize in Poetry in 1995 and named a 1997 ALA Booklist Notable Book of the Year; Plus Shipping(1998); Animal Soul (2001), a finalist for the National Book Critics Circle\nAward; Insomnia Diary (2004); This Clumsy Living (2007), which received the Rebekah Johnson Bobbitt National Prize for Poetry from the Library of Congress; Words for Empty, Words for Full (2010); and Elegy Owed (2013), a finalist for the National Book Critics Circle Award. His work has been selected numerous times for the Best American Poetry series. Hicok has won Pushcart Prizes and fellowships from the Guggenheim Foundation and the National Endowment for the Arts, and has taught creative writing at Western Michigan University and Virginia Tech.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64). For more information, please visit the LSA's Zell Visiting Writer Series website.", "date": "2016-09-22T17:30:00-04:00", "source": "Facebook", "url": "https://www.facebook.com/events/1635741953403427/", "name": "Zell Visiting Writers Series: Bob Hicok Poetry Reading"}]