[{"description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "date": "2016-11-18T15:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/360781184260443/", "name": "Drink & Draw / Imbibe & Inscribe"}, {"description": "Bring your well-worn items that could use a tune up, and we'll take a look at them! \n\nOr, make someone else's day by volunteering at Fix-It Friday and repairing their items.\n\nFix-It Friday:\nThink of this as the last chance before you get rid of something; Free, but no Guarantee.\n\nWe will:\n- try to diagnose what is wrong\n- tell you if we think we may be able to fix it today\n- tell you if you'll need a part, and where you might be able to get it\n- try to fix it to the best of our ability, but in the limited time we have\n\nHowever, we may not be able to fix it. Many products are not designed to be fixed, and just opening them up may damage them. Furthermore, we may not have someone on hand with the expertise to do a proper repair. Also, it may require a special part, tools, information, or materials to repair, or it may just require more time than we have.\n\nWe may end up damaging your item even more. Please let the repairer know how comfortable you are at each stage of diagnosis and repair.\n\nItems that are often easier to repair: lamps, types of toys, broken wires, things that need epoxy/wood glue\n\nItems that are often very difficult to repair: consumer electronics such as CD/Cassette boom boxes, TVs, radios, CD players, VCRs, and DVD players", "date": "2016-11-18T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1430807266946738/", "name": "Fix-It Friday (third Friday of every month)"}, {"description": "Beginning November 4th, GameStart will be hosting a six-week series of Open House workshops called GameLab. Each week will feature a FREE to participate class, rotating* between two of GameStarts most popular courses: Game Creation with Unity and Minecraft Python Programming. Students are invited to try out and retake each class as often as they'd like during the six-week term.\n\nGameLab Course Schedule:\nNovember 4th, 4:00pm - 5:00pm: Minecraft Python Programming\nNovember 11th, 4:00pm - 5:00pm: Game Creation with Unity\nNovember 18th, 4:00pm - 5:00pm: Minecraft Python Programming\nNovember 25th, 4:00pm - 5:00pm: Game Creation with Unity\nDecember 2nd, 4:00pm - 5:00pm: Minecraft Python Programming\nDecember 9th, 4:00pm - 5:00pm: Game Creation with Unity\n \n*Note: Course topics will be repeated between each rotating week, but students are invited to experiment with the material in as many ways as they'd like during each visit.", "date": "2016-11-18T16:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1714187022234961/", "name": "GameLab: Open House (3/6)"}, {"description": "This program is free and open to the public. First-come, first-served.\nIn this talk, Professor of Architecture Fernando Lara, University of Texas-Austin, will explore the similarities, influences, and cultural context of modern architecture in Latin America. Joined by Assistant Professor Ana Maria Leon, U-M History of Art, Professor Lara will discuss the importance of Latin American architecture and the interesting hybridization with European traditions in contemporary practice. In the second half of the 20th century, modern architectures in Venezuela, Mexico and Brazil have been extremely influential throughout the world, yet the Eurocentric history of modern architecture in the Americas has not fully explored those influences, often relegating them to a secondary status.\n\nProfessor Lara's exhibition Modern Architecture in Latin America: The Other of the Other on view in the Duderstadt Gallery in the Duderstadt Center on North Campus, November 18-December 2, 2016.\n\nThis program is sponsored by the U-M Brazil Initiative at the Center for Latin American and Caribbean Studies (LACS), and co-sponsored by the LACS, The Duderstadt Gallery, and UMMA.", "date": "2016-11-18T18:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/629756370532470/", "name": "Modern Architecture in Latin America"}, {"description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "date": "2016-11-18T18:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1807900772828520/", "name": "Art Off The Wall Holiday Exhibition & Shopping Event"}, {"description": "Literati is thrilled to welcome Thylias Moss in support of her latest collection, Wannabe Hoochie Mama of Realities’ Red Dress Code.\n\nThylias Moss, one of American poetry’s great innovators, is a national taxonomist and secular preacher who catalogues our culture and responds in gorgeous outrage to its injustices. This career-spanning volume conveys the hypnotic spectrum of her full poetic output, from Hosiery Seams on a Bowlegged Woman, her 1983 debut, to Slave Moth, her acclaimed 2006 novel in verse, to more than fifty pages of new poems. Whether in early or recent writing, Moss makes no promises of smooth sailing: even when her poems begin with beloved cultural icons (Robert Frost, Doctor Who, the Statue of Liberty), they insist on new perspectives, truths, and realities. She is a fearless reimaginer of poetry’s possibilities, a writer who seems made for (and by) the digital age—its blitz of interactivity and reinvention—a futuristic archivist always compelled by the current moment.  Arranged chronologically, this volume offers us Moss as she has evolved through the past three decades, recognizable yet unpredictable, ever “a poet of fierce intelligence and radiant intensity” (Martín Espada). Wannabe Hoochie Mama of Realities’ Red Dress Code is an indispensable book, a record of who this essential writer has been and where she may be heading.\n\n“Thylias Moss is a permanent American poet, canonical in the old, authentic sense.”—Harold Bloom\n\n“As if the muse of Wallace Steves were transplanted into the body of a black, female pop-culture maven.”—David Yaffe, Village Voice\n\n“It’s tempting to confuse Moss with the characters she describes, so deeply does she appear to inhabit their lives. . .[with] her trademark intensity and ferocious intelligence.”—Jabari Asim, Washington Post Book World\n\n“Reading Thylias Moss is always dangerous and exhilarating, because one never knows exactly when the poem might explode and leave its reader marked forever.”—Raphael Campo, Parnassus Poetry in Review\n\n“Thylias Moss names the black truths behind white lies. She is a writer who speaks bitterness and makes her own music of it.”—Marilyn Hacker, Women’s Review of Books\n\nThylias Moss is a multi-racial Professor Emerita in the departments of English and Art & Design at the University of Michigan. Her eight previous books of poetry include Last Chance for the Tarzan Holler, a National Book Critics Circle Award finalist, and Slave Moth, named Best Poetry Book of 2004 by Black Issues Book Review. Moss is a recipient of the fellowships from the Guggenheim and MacArthur foundations, among other honors. She lives in Michigan.", "date": "2016-11-18T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/423074158080402/", "name": "Thylias Moss"}, {"description": "Join us for an enchanting evening with owls. Night hikes, owl calling, and visits with live owls will fill the evening with wonder as we discover how ears, eyes, and feathers help owls survive the night. This program is for adults age 18+. A similar event for families is offered on November 19.", "date": "2016-11-18T19:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1226543000752823/", "name": "Owling: Adults Only"}, {"description": "The wildly successful Civic Improv Ensemble will present a Fall Showcase, with all three Civic Improv troupes performing in four shows. The shows are Friday November 18 and Saturday November 19 at 8pm and 10pm in the A2CT Studio, 322 W. Ann St., Ann Arbor. Tickets are $10 and are available by phone at 734-971-2228 or in limited quantities at the door. Due to limited seating, ordering tickets in advance is recommended.\n\nThe Civic Improv Ensemble was founded in April 2015 by directors Shelly Smith and David Widmayer with the goal of building a sustainable improv comedy performance and education program at Ann Arbor Civic Theatre. After two rounds of auditions, over thirty actors were cast in three new performance troupes: CSI: Ann Arbor (directed by Shelly Smith), Luxury Possum (directed by Jen Delisi), and Dearly Beloved (directed by David Widmayer). The troupes each focus on a different style of improv comedy, ranging from game-based improv (ala Whose Line Is It Anyway?) to long-form scenic improv (popularized by iO Chicago and Upright Citizens Brigade). Each of the four shows in the upcoming Fall Showcase will feature completely unique improvised sets inspired by audience suggestions. \n\nIn addition to shows at A2CT, the three troupes have performed at theaters around southeast Michigan, including Barefoot Productions in Plymouth and Pointless Brewery & Theatre in Ann Arbor.", "date": "2016-11-18T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/236841736733878/", "name": "Fall Improv Showcase"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: Arthur & Steve\nGroup 2: Listen, Stupid\nGroup 3: The League of Pointless Improvisers", "date": "2016-11-18T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1183590841699842/", "name": "Pointless Improv with Arthur & Steve and Listen, Stupid"}, {"description": "Grammy Award winner Don Henry's songs have been recorded by legends such as Ray Charles, Patti Page and Conway Twitty; by country crooners including Gene Watson, John Conlee and B.J. Thomas; and by today's hitmakers such as Blake Shelton, Miranda Lambert, and Kathy Mattea. But his songs shine most when performed by the very artist who wrote them. Don Henry is a 37 year veteran in the music business. Wit and wisdom grace Don's songs, from campfire favorites, to the poignant tribute to Martin Luther King, \"Beautiful Fool;\" or, of course, the Grammy award-winning country classic, \"Where've You Been.\" In addition to the Grammy, Kathy Mattea's version of \"Where've You Been\" took Song of the Year honors from the Academy of Country Music, The Country Music Association and Nashville Songwriter's Association International - the first song ever to be awarded all four honors in the same year.  Expect an exceptional evening of music and humor. www.donhenry.com", "date": "2016-11-18T20:00:00-05:00", "source": "Facebook", "url": "https://www.facebook.com/events/1513216465641630/", "name": "Don Henry at Green Wood Coffee House"}]