[{"description": "For the 11th year in a row, the Brewers Association has declared American Craft Beer Week (ACBW), the nationwide celebration of U.S. small and independent craft brewers. The weeklong tribute provides an opportunity for craft brewers to share their diversity, creativity and passion for the beverage they love with the greater craft beer community. From May 16 – 22, all 50 states will be holding events including exclusive brewery tours, special craft beer releases, food and beer pairings, tap takeovers and more to celebrate the ever-advancing beer culture in the United States.\n \nABC is tapping a limited release brew each day to celebrate. \n\nMONDAY: New beer release!! \"Flower Assembly Pale Ale\" 6.2% ABV 35 IBU. Hopped entirely with Mosaic, the beer is loaded with citrus and tropical fruit character, with grassy and resinous notes in the background. \n\nTUESDAY:1/6bbl teaser of Sour Sacred Cow. Tart, bitter, and dry. Sneak peak of a new addition to our sour lineup before a full batch is tapped next week\n\nWEDNESDAY: Pin of Euchre Pils dry-hopped with whole flower Cascade. An extra flowery, zesty rendition of our classic pilsner. \n\nTHURSDAY: 1/6bbl teaser of Sour Michael Faricy Stout. Age has amplified the chocolate and roast character of this stout. The tartness isn't as intense as many of our sour offerings, but this brew delivers a complex, multi-dimensional brew. \n\nFRIDAY: Flower Assembly pin dry hopped in the cask with more Mosaic. This cask version is  little softer and nuanced, but with all the loveliness of the Mosaic hops. \n\nSATURDAY: Strawberries & Cream - Cream soda meets fresh-picked strawberry in this juicy rendition of the infamous Strawberry Blonde. Smooth scents of vanilla flood the nose and taste buds at first sip, followed by the bite of strawberry and a satisfying finish.. \n\nSUNDAY: VIPA day!! ABC VIPA members receive HAPPY HOUR pricing all day!", "url": "https://www.facebook.com/events/158066451258466/", "source": "Facebook", "name": "American Craft Beer Week", "date": "2016-05-19T11:30:00-04:00"}, {"description": "Benjamin Weatherston is a commercial and editorial photographer based in Ann Arbor, MI and the photographer and photo editor of The Ann magazine. He considers himself less an artist and more of a skilled tradesman who has been shooting professionally since 1997.  Weatherston works for businesses and publications to visually communicate in creative ways what they do and how they do it. He has a small downtown studio where he meets with clients and does a lot of his portrait and product work while at least half of what he does is on location. He regularly does public speaking engagements and has done a lot of teaching, both privately and in workshop formats. \nWeatherston’s favorite work is “definitely portraiture”. Having created thousands of Ann Arbor portraits over the years, he wants to show how Ann Arbor has some of the most interesting people in the world.", "url": "https://www.facebook.com/events/1777669515797048/", "source": "Facebook", "name": "Ann Arbor Portraits Opening", "date": "2016-05-19T18:00:00-04:00"}, {"description": "Kelly Barson: \n\nK.A. (Kelly) Barson earned her MFA in Writing for Children and Young Adults from Vermont College of Fine Arts. She is the author of 45 Pounds (More or Less) and Charlotte Cuts It Out, both from Viking Children's, an imprint of Penguin Random House. She lives in Jackson with her husband, a pack of unruly designer dogs, and a cat named Karen. \n\nCori McCarthy: \n\nCori McCarthy studied poetry and screenwriting before falling in love with writing for young adults at Vermont College of Fine Arts. She is the author of You Were Here, Breaking Sky, and The Color of Rain. Breaking Sky is in development at Sony Pictures to become a film, while You Were Here is a mixed format contemporary, including word art poetry and graphic novel chapters. Cori lives in western Michigan with her family.\n\n'Charlotte Cuts It Out':\n\nLydia and I were in eighth grade when we came up with our Grand Plan to go to cosmetology school and get jobs to build our clientele while we earned business degrees. Then we’d open our own salon . . .  \n\nNow Charlotte and Lydia are juniors, in a Cosmetology Arts program where they’ll get on-the-job training and college credits at the same time. The Grand Plan is right on schedule.\n\nWhich means it’s time for Step Two: Win the Winter Style Showcase, where Cos Arts and Fashion Design teams team up to dazzle the judges with their skills.\n\nCharlotte is sure that she and Lydia have it locked up—so sure, in fact, that she makes a life-changing bet with her mother, who wants her to give up cos for college.\n\nAnd that’s when things start going off the rails.\n\n'You Were Here': \n\nCori McCarthy delivers an emotionally taut page-turner from multiple points of view combined with stunning illustrations.\n\nJaycee is about to accomplish what her older brother Jake couldn't: live past graduation.\nJaycee is dealing with her brother's death the only way she can by re-creating Jake's daredevil stunts. The ones that got him killed. She's not crazy, okay? She just doesn't have a whole lot of respect for staying alive.\n\nJaycee doesn't expect to have help on her insane quest to remember Jake. But she's joined by a group of unlikely friends all with their own reasons for completing the dares and their own brand of dysfunction: the uptight, ex-best friend, the heartbroken poet, the slacker with Peter Pan syndrome, and... Mik. He doesn't talk, but somehow still challenges Jayce to do the unthinkable-reveal the parts of herself that she buried with her brother.\n\nCori McCarthy's gripping narrative defies expectation, moving seamlessly from prose to graphic novel panels and word art poetry, perfect for fans of E. Lockhart, Jennier Niven, and Jandy Nelson. From the petrifying ruins of an insane asylum to the skeletal remains of the world's largest amusement park, You Were Here takes you on an unforgettable journey of friendship, heartbreak and inevitable change.", "url": "https://www.facebook.com/events/1161062693925432/", "source": "Facebook", "name": "Meet Michigan YA Authors K. A. Barson & Cori McCarthy for a Disucssion & Signing of Their New Novels", "date": "2016-05-19T19:00:00-04:00"}, {"description": "Red Electric Shark - goof rock/experimental animal songs\n\ncig butts - jangly blues rock : back to the basics\n\nSIPS - heavy lounge\n\ndoor @ 8, music @ 9\nsuggested donation 25cent-$1,000", "url": "https://www.facebook.com/events/280289085641992/", "source": "Facebook", "name": "Red Electric Shark // Cig Butts // SIPS at Club Above", "date": "2016-05-19T20:00:00-04:00"}, {"description": "Unwind from the workweek and flex your creative muscles while enjoying our exclusive Pointless craft beers. \n\nWe will provide the writing and drawing prompts, doodle starters, colored pencils and markers, you provide your awesome self and your desire to relax and have fun.\n\nFridays, 3-7pm at Pointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/1747640632114260/", "source": "Facebook", "name": "Drink & Draw / Imbibe & Inscribe", "date": "2016-05-20T15:00:00-04:00"}, {"description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nBUY JUNE 11 TICKETS: http://bpt.me/2538000\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule", "url": "https://www.facebook.com/events/192972824428594/", "source": "Facebook", "name": "Ann Arbor Derby Dimes 2016 season", "date": "2016-05-20T17:00:00-04:00"}, {"description": "Join us for the opening reception for INSTRUCTOR SHOW on Friday, May 20, from 6 to 9 pm. \n\nFree, drop-in event\n\nThe Ann Arbor Art Center is proud to present the Instructor Show (May 20 – June 4), an exhibition that celebrates the creativity and skill of the instructors who make the Education Department at the Art Center thrive.\n\nArtists represent a wide variety of art mediums and applications, including painting, mixed media, drawing, ceramics, sculpture, printmaking, encaustic, fiber and photography. Visitors will be delighted to find a range of artistic styles presented, from traditional, figural works reminiscent of classical masters, to abstract landscapes, and new media in photography and animation.\n\nFeatured Artists: \n\nHeather Accurso, Morgan Barrie, Beth Billups, Payton Cook, Kim DeBord, Jerzy Drozd, Dave Dziedzic, \nMichael Garguilo, Chris Kamykowski, Angela Lenhardt, Emily LoPresto, Marc McCay, Rebecca Pugh, \nDeb Scott, Claudia Selene, Larry Sekulich, Brian Skol, Daria Paik White\n\nARTISTS TALK: Saturday, June 4, from 1pm to 3pm (https://www.facebook.com/events/1073032126125579/)\n-----------\nThe 117 Gallery 2015/2016 season is supported by Vintage Financial Services LLC", "url": "https://www.facebook.com/events/103034240101301/", "source": "Facebook", "name": "Instructor Show: Opening Reception", "date": "2016-05-20T18:00:00-04:00"}, {"description": "Literati is pleased to welcome Michael Byers, Peter Ho Davies, and Michael Delp for a discussion of Bob Seger's House and Other Stories, recently published by the Made in Michigan Writers Series.\n\nBob Seger’s House and Other Stories is a collection of short stories written by some of Michigan’s most well-known fiction writers. This collection of twenty-two short stories serves as a celebration not only of the tenth anniversary of the Made in Michigan Writers Series in 2016 but also of the rich history of writing and storytelling in the region. As series editors Michael Delp and M. L. Leibler state in their preface, \"The stories contained in this anthology are a way to stay connected to each other. Think of them as messages sent from all over the map, stitching readers and writers together through stories that continue to honor the ancient art of the fire tale, the hunting epic, and all of the ways language feeds the blood of imagination.\"\n\nThe scope of this project reflects the dynamic and diverse writing that is currently taking place by people who consider their home to be the Great Lakes state. Stories are far-ranging, from the streets of Detroit and the iconic presence of the auto industry to the wild tracts of the Upper Peninsula, to a couple on the west coast trying to figure out parenting. The book vibrates with that tension, of metal versus rock and human frailty taking on the pitfalls and hardships of living in this world.\n\nIn his foreword, Charles Baxter asks, \"Does a region give rise to a particular kind of literature? Michigan is so fiercely diverse in its landscapes, its economy, and its population demographics that it presents anybody who wants to write about it with a kind of blank slate. You can’t summarize the state easily.\" These storytellers exude a \"Michigan aesthetic\" in their writing, something that cannot be learned in a textbook or taught in a classroom but can be felt through the tales of these storytellers.\n\nThe experience of picking up this collection is akin to taking a drive from the mechanized world and arriving several hours later in one of the wildest places on earth. Readers of short fiction will enjoy the multitude of voices in this anthology.\n\nEvent date: \nFriday, May 20, 2016 - 7:00pm", "url": "https://www.facebook.com/events/1602099290105979/", "source": "Facebook", "name": "Fiction at Literati: A Made In Michigan Discussion", "date": "2016-05-20T19:00:00-04:00"}, {"description": "In memory of Arbor Opera Theater’s first artistic director, we are pleased to announce the creation of the JAMES K. BERG AWARD for outstanding contributions to the vocal arts. Our 2016 recipients, Grammy and Pulitzer Prize winning composer William Bolcom and mezzo soprano Joan Morris, will receive their award at a black-tie dinner featuring a staged tribute of the works associated with Bolcom and Morris.\n\nYour attendance and contributions will directly support AOT’s mission by funding our June Festival and a national tour of our ground-breaking adaptation of Verdi’s La Traviata, created with the National Network of Depression Centers to fight the stigma surrounding mental illness. AOT is a 501(c)3 non-profit organization and all contributions are tax deductible as allowed by", "url": "https://www.facebook.com/events/1591757697781501/", "source": "Facebook", "name": "James K. Berg Award Gala honoring William Bolcom & Joan Morris", "date": "2016-05-20T19:00:00-04:00"}, {"description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers.\n\nGroup 1: \"Dancing Doris\" \n\nGroup 2: \"The Real Thing\" starring Nathan Corliss and M De Lisle\n\nGroup 3: \"The League of Pointless Improvisers\" starring Emily Engelhart, Heather Sejnowski, Jason Valentini, Erik Heilner, and Bob Wieck", "url": "https://www.facebook.com/events/723688071106755/", "source": "Facebook", "name": "Pointless Improv with Dancing Doris and The Real Thing", "date": "2016-05-20T20:00:00-04:00"}]