[{"source": "Facebook", "name": "Comics Unbound: Artist Reception", "description": "Join us for the Public Artist Reception of COMICS UNBOUND on Friday, June 17, from 6 to 9 pm.  \n\nCurated by Anne Drozd and Jerzy Drozd, Cartoonist\n\nThis is a FREE event. \n\nIt’s amazing to think about what our minds do when we read comics. When we regard a single image it may convey some meaning, but the moment we place another image next to it--even a very different one--our minds begin to construct narrative between those two images. Most of the narrative found in comics happens in the reader’s mind, prompted by deft choices made by the cartoonist author.\n\nHOW MIGHT OUR RELATIONSHIP WITH COMICS CHANGE IF WE WERE MORE AWARE OF THE THINKING WE’RE DOING WHEN READING THEM?\n\nComics Unbound explores how cartoonists use shape, size, line, color, and context to activate the readers’ imaginations and invite them into the partnership of comics narrative. Pages are removed from their intended context, that of the graphic novel or comic book, and re-contextualized with the materials that went into making the final pages. Sketches, notes, scripts, and tools are displayed alongside the final artwork. This new context reveals what is usually an invisible narrative in comics--the journey from artist’s vision to clear transmission of meaning.\n\nThe exhibition runs June 10 to June 24 (the public artist reception is June 17)\n\nThis exhibition contains pieces by cartoonists appearing at the Ann Arbor Comic Arts Festival held at the Ann Arbor District Library June 18 and 19, 2016.\n\nCURATOR BIOS:\n\nJerzy Drozd is one of the artists of The Warren Commission Report. He leads cartooning classes for children, teens, and adults, as well as for teachers who want to bring comics to the classroom. He co-founded the Ann Arbor Comic Arts Festival and serves as the event’s programming coordinator. Drozd wrote and drew the graphic novel The Front, has worked on Antarctic Press’s Ninja High School and PPV: Pay- Per-View, and has drawn special projects for Glencoe/McGraw-Hill, Marvel Comics, VIZ Media, and others.\n\nAnne Drozd is a librarian and artist. She and her husband Jerzy created Tiny Astronaut Press, to create many space-themed art works, including Rocketosaurus, a fanciful comic for young readers about an Apollo crew. As a librarian at the Ann Arbor District Library, she develops arts programming and has drawn instructional comics for the science tools collection. Anne and Jerzy live in Ann Arbor with their two cats.\n\n-------------\nIn partnership with Ann Arbor District Library\n\nCatering generously provided by Laura's Catering (http://laurascatering.com/)", "url": "https://www.facebook.com/events/230585263967439/", "date": "2016-06-17T18:00:00-04:00"}, {"source": "Facebook", "name": "Shakespeare in the Arb 2016 Love's Labour's Lost Week 2", "description": "Thursdays through Sundays through June 26. Check out Tickets Available link for arb member advance ticket info plus note Summer 2016 construction impacting arboretum area parking & traffic. Arrive early for tickets and time to walk to location of the first scene.", "url": "https://www.facebook.com/events/799178996885556/", "date": "2016-06-17T18:30:00-04:00"}, {"source": "Facebook", "name": "AFC Ann Arbor vs Lansing United 6-17 Friday (Under 18 yrs free admission)", "description": "Scool's Out for Summer! To celebrate the last day of school in Ann Arbor, all students up to age 18 will get in FREE on Friday, June 17th.\n\nRide the Shuttle from Arbor Brewing Company for FREE! Pregame festivities start at 11am! http://bit.ly/ABCShuttle\n\nAdult Online Ticket: $8\nAdult Ticket At The Gate: $10", "url": "https://www.facebook.com/events/978342215595344/", "date": "2016-06-17T19:00:00-04:00"}, {"source": "Facebook", "name": "The Canterbury Tales", "description": "Join us for this hilarious retelling of Geoffrey Chaucer's classic tale, in which every character plays numerous parts, to fantastic effect. This recent adaptation maintains Chaucer's biting humor while keeping the bawdiness to a minimum, so all can enjoy the show in Ann Arbor's West Park! The show runs June 16, 17, 18, 23, 24, 25, 30, July 1, and 2.  Curtain at 7pm each night.  Tickets are just $10 for adults, $7 for kids 12 and under.", "url": "https://www.facebook.com/events/1689877964609383/", "date": "2016-06-17T19:00:00-04:00"}, {"source": "Facebook", "name": "The Deep End", "description": "Summer is upon us, celebrate this as well as the release of Matilda's new VHS by jumping in the deep end. Friday June 17th. Tunes and visuals will be proper as usual. 9pm, 18+.\n\nMATILDA\n\nShady P (Catholic Press) \n(https://www.residentadvisor.net/dj/shadyp)\n\nUNI-STRUT SOUNDSYSTEMS\n\nArjun (Ceramic Recs)\n(https://www.residentadvisor.net/dj/arjun)\n\nPAT in the HAT\n(https://m.soundcloud.com/patinthehatdoe)\n\nJeff Garcia\n(https://m.mixcloud.com/ClubFaygo/)", "url": "https://www.facebook.com/events/105625486531088/", "date": "2016-06-17T21:00:00-04:00"}, {"source": "Facebook", "name": "Ann Arbor Restaurant Week", "description": "Restaurant Week is your opportunity to try as many great Ann Arbor restaurants as your schedule allows for one incredibly low fixed price. $28 for a three course dinner! \n\nThe Main Street Area Association (Main Street Area Ann Arbor) is proud to bring you Ann Arbor's favorite semi-annual dining event - Restaurant Week!\nThe specials run June 12-17th. Visit www.annarborrestaurantweek.com for details.", "url": "https://www.facebook.com/events/725944687548567/", "date": "2016-06-18T00:00:00-04:00"}, {"source": "Facebook", "name": "Coffee and Coloring for Dad", "description": "We're celebrating dads with a free 12oz cup of coffee all day on Saturday! We'll have some fun coloring pages for all ages, too, so you can relax with a cup of joe and do some soothing coloring, to boot.", "url": "https://www.facebook.com/events/252286721802099/", "date": "2016-06-18T07:00:00-04:00"}, {"source": "Facebook", "name": "Argo Park Stewardship Workday", "description": "Bring family and friends out to remove invasive weeds, opening space for tree seedlings and native wildflowers. The oak-hickory woods here overlook Argo Pond, and owls and hawks nest in the trees. Meet in the parking lot north of the Argo Canoe Livery, off Longshore Drive.\nPlease wear long pants and closed-toe shoes. All minors must present a completed release form, and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/1730586637224726/", "date": "2016-06-18T09:00:00-04:00"}, {"source": "Facebook", "name": "ARTBus: Art in the Market", "description": "Join the ARTBus on Saturday June 18 and don't miss the exclusive opportunity to feel firsthand the creative energy sweeping Detroit!\n\nWe will be heading to the Eastern Market neighborhood, which is rich with innovative and diverse art spaces. Our itinerary has been designed to showcase Detroit artists from emerging to established as well as strengthen the comradery amongst Art Center community members.\n\nLimited seating - Reserve your spot soon.\n\n**Members of the Ann Arbor Art Center receive a discounted price. To learn about our membership program please visit: https://goo.gl/oCflqB\n-----------------------------------------------------------\n ARTBus Art in the Market generously sponsored by: Sarah Whitsett Real Estate", "url": "https://www.facebook.com/events/258245371187585/", "date": "2016-06-18T09:00:00-04:00"}, {"source": "Facebook", "name": "Restaurant Week", "description": "We are gearing up for another week of culinary bliss during Ann Arbor's summer Restaurant Week! \n\nWe are featuring these special menus available in addition to our regular menu all week long.  \n-------------------------------------------------------------------------------\nSummer Restaurant Week 2016\n-------------------------------------------------------------------------------\nTwo for $15 lunch\nTax and gratuity not included\n•\tChoose one entrée for each person\no\tBBQ Tofu Sandwich\no\tWhitefish Po-boy\no\tChicken BLT\no\tCaesar Salad\no\tCherry Almond Salad\n-------------------------------------------------------------------------------\nTwo for $28 dinner per person\nTax and gratuity not included\n\nAppetizer\nTo share, please choose one\n•\tFried Pickle Spears \n•\tTruffle Sprouts\n•\tHummus and Pita \n\nEntree\nEach guest chooses one entree\n•\tMac and Cheese\n•\tFish and Chips\n•\tUrban Cowboy Bean Burger\n•\tAr-burger\n\nDessert or Beer\nTo share, please choose one\n•\tStout Chocolate pudding cake\n•\tStrawberries and Cream Belgian waffle\n•\tMaple Bourbon Bread Pudding\n\nNot interested in dessert? Swap it out for your choice of two 16oz drafts", "url": "https://www.facebook.com/events/1008482025896787/", "date": "2016-06-18T11:00:00-04:00"}]