[{"url": "https://www.facebook.com/events/280243392370950/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "source": "Facebook", "date": "2016-11-24T08:00:00-05:00", "name": "10% For Good for Community Action Network"}, {"url": "https://www.facebook.com/events/324709987912141/", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "source": "Facebook", "date": "2016-11-24T08:00:00-05:00", "name": "10% For Good for Community Action Network"}, {"url": "https://www.facebook.com/events/1807900772828520/", "description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "source": "Facebook", "date": "2016-11-24T18:00:00-05:00", "name": "Art Off The Wall Holiday Exhibition & Shopping Event"}, {"url": "https://www.facebook.com/events/198748373865966/", "description": "Here's our Black Friday present to you- all our Vino Direct wines are 30% off, Friday only! Stock up for gifting and for yourself <3", "source": "Facebook", "date": "2016-11-25T08:00:00-05:00", "name": "Vino Direct Wines 30% Off- One Day Only!"}, {"url": "https://www.facebook.com/events/144098819397112/", "description": "All week, all Garden of Life products are 35% off! That includes plant-based protein supplements, vitamins, and even special products just for kids. Stop in to chat with our friendly and knowledgable Natural Living team, and stock up on wellness!", "source": "Facebook", "date": "2016-11-25T08:00:00-05:00", "name": "35% Off Garden of Life"}, {"url": "https://www.facebook.com/events/1197643866959330/", "description": "Come out to the 8th Annual Black Friday MTB Ride at Rolling Hills and Hewens Creek Parks in Ypsilanti Township on Friday 11/25 at 10 AM.  This will be a no-drop group ride and is a great chance for novice MTBer's to get exposure to single track riding and be a fun way to burn off that Thanksgiving feast and get a jump start on getting fit for 2017.  The ride will be about 14 miles long covering ~5.5 miles at Hewens Creek and ~6.5 miles at Rolling Hills along with a few miles of dirt road connecting the two parks.  For those who haven't ridden or rarely ride at either trail, Hewens Creek is a flat, winding ride through meadows and new growth forest which is great for beginning riders.  The RHP trail on the other hand twists and turns through 4+ miles of forest and rolling hills that provide a great opportunity to improve your bike handling skills and 2.5+ miles of open meadows.  The 1.2-mile West Meadows loop on the west side of RHP includes beautiful open meadows and some fun pump-track like riding on the Munger Mounds.   \n\nMeet at the Rolling Hills Lodge at 9:45 AM and then we will head out by 10-10:15 AM.  After the ride, we will have some pizza and refreshments at the lodge at about 12:30 PM.  Please register in advance at Event Brite to attend so a good estimate of riders can be made for the pizza and beverages.  Rain date will be Saturday 11/26 at 10 AM.  Look for changes in schedule on the Rolling Hills or Hewens Creek forums on the MMBA website, the Poto Yahoo! Group Email list, the Poto MBA Facebook page or Poto MBA Twitter account.\n\nPlease park in the MTB trail head parking lot:  enter the park, go straight through the traffic circle and park in the first lot on your right next to a big pavilion ~1/4 mile west of the circle.  The Lodge will be about 200 yards away on your left.  \n\nThere will be a gate charge to enter RHP.  It is a Washtenaw County Park so if you already have WCP sticker you are good to go.  Otherwise, park entry will cost $5 for everyone as a discount for non-Washtenaw residents was arranged.\n\nLast but definitely not least, we have to thank DeWight and crew at Wheels in Motion for supporting the MTB community by sponsoring this event and paying for the food and refreshments since its inaugural event in 2009.", "source": "Facebook", "date": "2016-11-25T10:00:00-05:00", "name": "8th Annual Poto MBA Black Friday MTB Ride"}, {"url": "https://www.facebook.com/events/531742880354118/", "description": "ABC is offering a one day discount on some of our finest, funkiest brews, all of which are suitable for drinking now (think hostess gifts, toasting the New Year or simply enjoying on a cold winter night in front of the fireplace) or laying down to cellar (in your already established cellar or that collection you have been meaning to start)! \nAnnually on Black Friday we release a the newest vintage of our Wild Root Special Reserve, this year is our 2014 brew and we promise, you will not be disappointed! \n\nThe featured bottles:\n\nWild Root Special Reserve 2014 - A tart and complex old ale aged in oak for a year and bottle conditioned for an additional year. Autumnal aromas of crisp apple and earthy wet leaves mingle with sweet-tart sour cherry. Rich, vinous wet tobacco and juicy fruits on the palate are complemented by subtle chocolate and caramel notes and balanced by lactic acidity, tart green apple and dry tannins that persist through a long and slightly mineral finish.\n\nFramboise 2016 - Our take on this classic style is neither spontaneously fermented nor barrel aged, but the addition of lactic acid and raspberries to our crisp Blonde create a flavor that is refreshingly tart without being aggressively sour or acidic. A crisp and refreshing brew with tart raspberry, and subtle notes of zesty orange peel and spicy coriander.\n\nAnniversary Barleywine 2015 - Our 20th anniversary ale combines the best of all worlds – big, rich malts with plenty of nutty and caramel sweetness; the bitterness of a heavy-handed dose of resiny locally grown hops; and the warming alcohols you would expect in a high gravity brew. An American Barleywine brewed with predominantly Thomas Fawcett malts and Michigan-grown Chinook hops. We brewed this bad boy in honor of our 20th anniversary because a big celebration demanded a big beer! And since running a brewery is sometimes sweet and sometimes sour, we decided to pull off a portion of the beer to sour in our cellar.\n\nDivette 2013 - A tart and refreshing barrel-aged blonde ale spiced with orange peel and coriander. The combination of spices, oak aging, and bottle-conditioning creates a unique flavor experience that seems part beer, part wine, and part cider even though it is made with one hundred percent malted barley.\n\nBrune 2015 - Brune is a classic, refreshingly soured Flemish style brown ale in the Rodenbach tradition. A dark, copper-red, medium-bodied ale with subtle spiced sour cherry and woodsy notes. This beer has a pronounced tart sourness on the palate that follows through with complex, malty, and earthy vinous flavors.\n\nAll selections are only available exclusively at the Brewpub.", "source": "Facebook", "date": "2016-11-25T11:00:00-05:00", "name": "Black Friday Sale"}, {"url": "https://www.facebook.com/events/1146163732085513/", "description": "LIVE Nightclub is excited to announce the launch of the LIVE Festival Series. The last Friday of each month, LIVE Nightclub will transform into a music festival you cannot miss. This month’s Festival will be SENSATION!\n\nSensation creates a new show every year to dazzle the senses. Committed to innovation and excellence, Sensation has earned the distinction of being The World’s Leading Dance Event. \n\nWe know everyone can't make it to Chile this year, so we are bringing the festival to you thanks to DJ Madisi and AceMyth! http://bit.ly/LiveA2b", "source": "Facebook", "date": "2016-11-25T21:00:00-05:00", "name": "LIVE Festival Series: Sensation"}, {"url": "https://www.facebook.com/events/1220895527971258/", "description": "Earphorik and Stormy Chromer teaming up for an epic double-headlining show at the Club Above!\n\nDoors 9pm\nStormy Chromer - 9:30-11:00pm\nEarphorik - 11:30pm-end\n18+ // $6 at the door", "source": "Facebook", "date": "2016-11-25T21:00:00-05:00", "name": "Earphorik // Stormy Chromer // 11.25.2016 Club Above, Ann Arbor"}, {"url": "https://www.facebook.com/events/1291269264238314/", "description": "The Macpodz continue their exploration of sound and Dylan Charles brings his Brooklyn group for a visit to the midwest to perform psychedelic soul", "source": "Facebook", "date": "2016-11-25T21:30:00-05:00", "name": "The Macpodz with On the Sun at the Blind Pig - Nov. 25"}]