[{"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "url": "https://www.facebook.com/events/1171307782957839/", "source": "Facebook", "name": "10% For Good for Community Action Network", "date": "2016-12-10T09:00:00-05:00"}, {"description": "Stewardship Workday\nSaturday, December 10\nMiller Nature Area\n9 a.m. to noon \nMiller Nature Area’s 22 acres include magnificent elm trees, breathtaking spring wildflowers, and miles of winding trails. Help us maintain the unique landscape that Miller has to offer by removing invasive shrubs such as buckthorn and honeysuckle. Meet us at the Arborview Boulevard entrance, just east of Wildwood Avenue. Please wear long pants and closed toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/1783202241891741/", "source": "Facebook", "name": "Stewardship Workday- Miller Nature Area", "date": "2016-12-10T09:00:00-05:00"}, {"description": "This week, all our body care is 25% off! Skin care, hair care, cosmetics, soaps- it's all on sale, just in time for your holiday shopping. And with prices like this, you can pick up a few things to treat yo' self, too <3", "url": "https://www.facebook.com/events/381601068852607/", "source": "Facebook", "name": "25% Off Body Care", "date": "2016-12-10T10:00:00-05:00"}, {"description": "Back by popular demand! Our kitchen is whipping up tostadas for you this Saturday- 2/$5. Fiesta!", "url": "https://www.facebook.com/events/649456641903025/", "source": "Facebook", "name": "Popup Kitchen- Tostada!", "date": "2016-12-10T11:00:00-05:00"}, {"description": "Save the date Saturday December 10th High Noon....On the POTO TRAIL...\nThe ride will leave and finish from the YURT. Ride as much or as little. I will have Chili and the fire going... Bring your favorite thing to hydrate after the ride. This is always a fun ride with great people. I will do my best to order cold temps and snow for that weekend....\nWe always have a pretty good turn out. Bring some wood if possible.\nIf you bring some dogs I will have the griddle going as well.\nThis is a MMBA event\n\nCheers!\nWoody", "url": "https://www.facebook.com/events/1160885797313898/", "source": "Facebook", "name": "2016 Abominable Snowman RIDE", "date": "2016-12-10T12:00:00-05:00"}, {"description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nRSVP on FB: http://bit.ly/29dSJv0\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule\n\n______________________________________________\n\n\nPreviously this season:\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nRSVP on FB: http://bit.ly/29dSikp\nBUY JUNE 11 TICKETS: http://bpt.me/2538000", "url": "https://www.facebook.com/events/192972824428594/", "source": "Facebook", "name": "Ann Arbor Derby Dimes 2016 season", "date": "2016-12-10T16:00:00-05:00"}, {"description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/712236988928037/", "source": "Facebook", "name": "Icebreakers^2", "date": "2016-12-10T16:00:00-05:00"}, {"description": "It's a night out for grown-ups while the kids enjoy an exciting evening at LSNC. Study the incredible adaptations that help animals hunt, run, jump, and swim, and then apply those ideas to your own inventions and creations. Parents’ Night Out includes pizza and carrots for dinner as well as a late-night popcorn snack. Activities will be outside as much as possible, so please come dressed for the weather!", "url": "https://www.facebook.com/events/156420698158795/", "source": "Facebook", "name": "Parents' Night Out: Animal Engineers", "date": "2016-12-10T17:00:00-05:00"}, {"description": "FaLaLaLager is back, and it's ready to party! We've had a huge year: a bronze medal from the World Beer Cup, a gold medal from the Great American Beer Festival, a completed expansion, new flagship packaging, and distribution in brand-new territories, just to name a few things! So we want YOU to help us celebrate. \n\nJoin us for a night of hollyjollymerriment in the Tap Room. We'll have some special beer releases, including a specialty \"holiday cheer\" cask, and you can beef up your Euchre and Santa Water Pong skills in advance of the holiday in the Gulo Room aka Santa's Game Room! We'll have holiday movies on all night to really add to the ambiance. \n\nA special cookie+beer pairing menu will be available to delight your senses. \n\nGrowler fills awarded to most festive outfit, so come in your best, most heinous red-green-and-tinsel sweaters, your extra large Santa hats, your actual pine bough necklaces. It's up to you how hard you're willing to try and, trust us...we'll be watching. So. \n\nSo make sure you circle that date and come hang out with us for some beer, some games, some cookies, and some holiday-freakin-cheer. We are AMPED. \n\nSee you under the mistletoe ;)", "url": "https://www.facebook.com/events/1743282949325525/", "source": "Facebook", "name": "FaLaLaLager!", "date": "2016-12-10T18:00:00-05:00"}, {"description": "To show our appreciation for all of your support over the years, Maker Works invites our members (past and present) and their families to join us for an evening of games, food, music, fun, and prizes! Please bring a dish to share. Costumes are encouraged, but not required. Prizes for best costume and best dish!\n\nKids are welcome until 9pm. Please RSVP on this event listing. Thanks!", "url": "https://www.facebook.com/events/109309762893714/", "source": "Facebook", "name": "Third Annual Nightmare Before Christmas Costume Potluck", "date": "2016-12-10T18:00:00-05:00"}]