[{"description": "Save these dates to head over to beautiful Buhr Park (unless noted otherwise) and see fast paced, full contact roller derby action from your local league, Ann Arbor Derby Dimes!\n\nMay 14 - June 11 - July 9 - August 6\n\nBUY 2016 SEASON PASSES: http://bpt.me/2537986\n\nJuly 9\nArbor Bruising Co. vs Border City Brawlers: All-Stars\nYpsilanti Vigilantes vs Border City Brawlers: Canadian Clubbers\nRSVP on FB: http://bit.ly/29dSJv0\nBUY JULY 9 TICKETS: http://bpt.me/2539693\n\nAugust 6\nArbor Bruising Co. vs Flint City Derby Girls\nYpsilanti Vigilantes vs Killamazoo Derby Darlins: Kill Squad\nBUY AUGUST 6 TICKETS: http://bpt.me/2539697\n\nFor more information, see our 2016 season schedule: http://a2derbydimes.org/2016-schedule\n\n______________________________________________\n\n\nPreviously this season:\n\nMay 14\nBrawlstars vs The Chicago Outfit: Syndicate\nYpsilanti Vigilantes vs East Lansing Roller Derby: Broadbarians\nRSVP on FB: http://bit.ly/1reSK5y\nBUY MAY 14 TICKETS: http://bpt.me/2537998\n\nJune 11\nBrawlstars vs North Star Roller Girls: Supernovas\nArbor Bruising Co. vs North Star Roller Girls: Northern Lights\nRSVP on FB: http://bit.ly/29dSikp\nBUY JUNE 11 TICKETS: http://bpt.me/2538000", "name": "Ann Arbor Derby Dimes 2016 season", "source": "Facebook", "date": "2016-11-01T17:00:00-04:00", "url": "https://www.facebook.com/events/192972824428594/"}, {"description": "This class will introduce you to the Epilog 50watt Laser Cutter/Engraver. Learn how to cut and engrave lots of different materials such as paper, fabric, plastics, wood and more! The Epilog Laser can handle many different file formats such as pdf, Adobe illustrator and photoshop, jpgs, dwg, dxf, eps and more. You will learn basic operation of this tool with an emphasis on safety. With the successful completion of this class you will be certified to use the Epilog Laser Cutter/Engraver on your own. Find additional information about this tool here: www.epiloglaser.com/how_lasers_work.htm\n\nRegister by calling 734-222-4911 or visiting http://www.supersaas.com/schedule/makerworks/CheckOut?day=1&month=11&year=2016&view=day\n\nPlease arrive 10 minutes early if this is your first time to Maker Works.", "name": "Learn to use a 50W laser - $25 - 1 Hr", "source": "Facebook", "date": "2016-11-01T17:00:00-04:00", "url": "https://www.facebook.com/events/302151046836170/"}, {"description": "Ann Arbor’s own Kerrytown Concert House proudly announces the 20th anniversary of its avant-garde jazz festival, Edgefest, October 26th through 29th, 2016!\n\nThis year’s festival, Edgefest 20: 20 Years At The Edge, will celebrate the iconic and avantgarde artistry of the past 20 years, while looking ahead to the future of the festival and jazz at the edge itself! Drawing from the artist rosters of former Edgefests, 2016 will feature distinguished groundbreaking composer-performers with their ensembles and collaborators, illuminating their various innovative roles in the avant/jazz world of today.\n\nThis year’s lineup will include: Will McEvoy's Third Coast Quartet, Sylvaine Hélary’s Spring Roll, Wadada Leo Smith & John Lindberg, TranceFormation: A Tribute to Connie Crothers, John Hollenbeck’s Claudia Quintet, Ingrid Laubrock’s Serpentines, David Torn's Nohband + Craig Taborn, Conference Call Quartet, Craig Taborn, Kris Davis Trio, Jason Kao Hwang’s Burning Bridge Ensemble, William Parker Quartet, MoTreetown Collective, Northwoods Improvisers Trio, Trio 3, John Hollenbeck’s Works for Large Ensemble, Stephen Rush, The University of Michigan Jazz Ensemble, Tad Weed’s Freedom Ensemble featuring Vinny Golia.\n\nEdgefest is honored to receive sponsorship from The Maxine and Stuart Frankel Foundation, and a matching grant on ticket sales from the Robert D. Bielecki Foundation including double for every new attendee. Additional support for the festival is provided in part by awards from New Music USA, the Community Foundation for Southeast Michigan, the Michigan Council for Arts & Cultural Affairs, and the National Endowment for the Arts. Art Works.\n\nFor more information, visit the Edgefest website: \nwww.edgefestannarbor.com", "name": "Edgefest 20: 20 Years At The Edge!", "source": "Facebook", "date": "2016-11-01T17:00:00-04:00", "url": "https://www.facebook.com/events/1606056323056977/"}, {"description": "Sava's Uncorked is a new, monthly wine tasting and dinner event!\n\nMix and mingle style tasting exploring\u0003 7 California wines. This will be a full sensory \u0003experience with light hors d'oeuvres. $25", "name": "Sava's Uncorked | Wine Tasting", "source": "Facebook", "date": "2016-11-01T18:00:00-04:00", "url": "https://www.facebook.com/events/191401441294553/"}, {"description": "This class will introduce you to the MakerBot Replicator 2x 3D Printer. This machine is great for making 3D models of prototypes and fun and useful objects found on websites like http://www.instructables.com and http://www.thingiverse.com. The MakerBot 3-D printer extrudes hot ABS plastic in layers and uses .stl or OBJ files. Many 3-D design software can save as .stl. Learn more at MakerBot's Website http://www.makerbot.com You will learn basic operation with an emphasis on safety. With the successful completion of this class you will be certified to use the MakerBot 3D Printer on your own.\n\nRegister at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=1&month=11&year=2016&view=day\n\nNo prior knowledge or experience required. Please arrive 10 minutes early if this is your first time to Maker Works.", "name": "Learn to use a MakerBot 2x 3D printer - $25 - 1 hr", "source": "Facebook", "date": "2016-11-01T18:30:00-04:00", "url": "https://www.facebook.com/events/1257373837616846/"}, {"description": "\"In this page-turning debut, Savitt, a New York Times’s Chinese-English translator, relates his experiences in China. He begins his story in 1982, when he was a first-year Duke student; grief-stricken after his girlfriend’s death, he decided to go on a study abroad trip to the country. Returning after graduation to pursue his journalistic dreams, Savitt finds himself in the midst of historic news stories. The book vividly describes his 17 years of knowing China as intimately as an American can, during which he sees its cultural and economic flowering. He also observes the Tiananmen Square massacre, where he dodges bullets and fights the urge to participate, not just witness. His creation of China’s first independent English-language newspaper gets him noticed, first by the Beijing bureaus of Western media outlets and then by the Communist Party. He comes across as a risk taker whose wealthy family back home could only help him so much—his activist reporting style eventually leads to solitary confinement and a hunger strike. Savitt is a smart, thrilling memoirist, but his book is not just a narrative roller-coaster ride: readers will receive a new understanding of what has happened in China over the past 30 years, from someone who stood shoulder to shoulder with students asking for a better country.\" — Publishers Weekly (http://www.publishersweekly.com/978-1-59376-652-8)", "name": "Scott Savitt Discussion & Signing for 'crashing the party'", "source": "Facebook", "date": "2016-11-01T19:00:00-04:00", "url": "https://www.facebook.com/events/1816181065293764/"}, {"description": "Join us on Wednesday November 2nd at 6pm for a 2 hour workshop on the fundamentals of using Spritekit to develop games for Apple's Mobile platform. Mark Strader and Kaitlin Singer from University of Michigan will run this free workshop. We will cover basic physics simulations, sprite animations, sounds, actions, and touches. This is an interactive tutorial: All audience members should bring a laptop, an iPhone, a lightning cable, and the most updated version of both Xcode and iOS. By the end of the workshop, audience members should have a fully-functioning iOS game and understand the basics of game development on the iPhone to a level that they can begin to develop on their own.\n\nThose attending should have some prior coding knowledge to really benefit from the workshop.\n\nCOST: FREE!!", "name": "Learn Spritekit - An Apple Mobile Game Dev Framework", "source": "Facebook", "date": "2016-11-02T06:00:00-04:00", "url": "https://www.facebook.com/events/1774061006180500/"}, {"description": "Literati is delighted to welcome Matt Bell back to Ann Arbor in support of his most recent work, A Tree or a Person or a Wall.\n\nHere we have Matt Bell at his most inventive and uncanny: parents and children, murderers and monsters, wild renditions of the past, and stunning visions of the present, all of which build to a virtuoso reimagining of our world. A 19th-century minister builds an elaborate motor that will bring about the Second Coming. A man with rough hands locks a boy in a room with an albino ape. An apocalyptic army falls under a veil of forgetfulness. The story of Red Riding Hood is run through a potentially endless series of iterations. A father invents an elaborate, consuming game for his hospitalized son. Indexes, maps, a checkered shirt buried beneath a blanket of snow: they are scattered through these pages as clues to mysteries that may never be solved,  ingering evidence of the violence and unknowability of the world. A Tree or a Person or a Wall brings together Bell’s previously published shorter fiction—the story collection How They Were Found and the acclaimed novella Cataclysm Baby—along with seven dark and disturbing new stories, to create a collection of singular power.\n\n“These fables plumb the depths of human longing… a collection that resonates like a tuning fork, lingering after the book is closed.”—Publishers Weekly\n\n“A clutch of stories with a flavor of the experimental, the apocalyptic, and often both…Admirable efforts to strip familiarity and sentiment from stories of humanity at its worst.”—Kirkus Reviews\n\n“Told in a mythic, ­omniscient voice, some of these pieces read like cruel fairy tales… Imagine a tale from Lydia Davis on a bad trip… smart and edgy.”—Library Journal\n\nMatt Bell is the author of the novels Scrapper and In the House Upon the Dirt Between the Lake and the Woods, which was a finalist for the Young Lions Fiction Award, a Michigan Notable Book, and an Indies Choice Adult Debut Book of the Year Honor Recipient, as well as the winner of the Paula Anderson Book Award. His writing has appeared in Best American Mystery Stories, Tin House, The New York Times, Conjunctions, Gulf Coast, The American Reader, and many other publications. Born in Michigan, he now teaches creative writing at Arizona State University.\n\nEvent date: \nWednesday, November 2, 2016 - 7:00pm", "name": "Matt Bell", "source": "Facebook", "date": "2016-11-02T19:00:00-04:00", "url": "https://www.facebook.com/events/312947649079847/"}, {"description": "Subject: Meeting #3 - Nixon Road Corridor Traffic Study & Dhu Varren/Nixon/Green Road Roundabout - November 2, 7-9 pm Clague Middle School. \n\nPLEASE JOIN US: Wednesday, November 2, 2016 from 7 to 9 p.m. in the Multi-Purpose Room at Clague Middle School, 2616 Nixon Road.  \n\nThe primary focus of the meeting is to:\n•\tPresent and discuss corridor traffic study options.\n•\tPresent the finalized design details for the roundabout project. \n•\tShare options for traffic maintenance during roundabout construction. \n\nThe meeting will Include: \n1.\tWelcome & introduction\n2.\tPresentation of corridor traffic study options with brief question and answer period*. \n3.\tPresentation of roundabout design with brief question and answer period*. \n4.\tDiscussion of options for traffic maintenance during roundabout construction*.\n5.\tNext Steps and public comments*.  \n\n* Questions/comments will be limited to three minutes per person. Numbered cards will be distributed during each question and answer period to facilitate equal opportunities for all participants. \n\nAdditional information regarding the two projects is available at www.a2gov.org/Nixon.\n\nAll persons are encouraged to participate in public meetings. Accommodations including sign language interpreters, may be arranged by contacting the city clerk’s office at 734.794.6140;\nvia email to cityclerk@a2gov.org; or by written request addressed and mailed or delivered to:\n\nCity Clerk’s Office\n301 E. Huron St.\nAnn Arbor, MI 48104\nRequests made with less than two business days’ notice may not be able to be accommodated.", "name": "Nixon Road Traffic Study & Roundabout", "source": "Facebook", "date": "2016-11-02T19:00:00-04:00", "url": "https://www.facebook.com/events/205606623195025/"}, {"description": "Music at far house! Get yer post punk post halloween scream on\n\nLet The Animals Kill Us (gr) https://lettheanimalskillus.bandcamp.com/\n\nApe Not Kill Ape (gr) https://apenotkillape1.bandcamp.com\n\nAdam Shead (a2) Solo - drums and electronics\nhttps://soundcloud.com/adamsheadmusic\n\nAdam Shead is a Improvisor, Percussionist, and Composer whose life and work is deeply rooted in the intercommunication of tones in space. Adam received a BM in Percussion Performance from Columbia College Chicago and is currently pursuing an MM in Improvisation at The University of Michigan.  During Adam’s time in Chicago he developed a strong background in orchestral, chamber, theatrical, and interdisciplinary performance as well as founding such groups as Dod Kalm, Action Patterns, and Adam Shead's 'Stasis'; performing at such venues as The Jazz Showcase, Experimental Sound Studio, Andy's Jazz Club, The Whistler, and Cafe Mustache. Since moving to Ann Arbor, Michigan Adam has been focusing on the development of solo repertoire for Percussion & Electronics with the goal of creating music that not only resembles place but is inherently place.", "name": "[••][••][••][••][••][••]", "source": "Facebook", "date": "2016-11-02T21:00:00-04:00", "url": "https://www.facebook.com/events/672314046278929/"}]