[{"source": "Facebook", "name": "Popup Kitchen- Wings!", "description": "We'll be serving up our beloved made in-house wings outside this weekend, 6 for $5, as well as $2 pints of craft beer. Come be our wing man, woman, or child?", "url": "https://www.facebook.com/events/1493588277395378/", "date": "2016-10-01T09:00:00-04:00"}, {"source": "Facebook", "name": "Spots and Brats!", "description": "Park in our lot and get one of one of our made in-house brats*, just $25! We'll be tailgating all day, too- $2 pints, made in-house wings, and good times. Go Blue!\n\n*Please note that it is just one delicious brat per car for $25.", "url": "https://www.facebook.com/events/192593237818652/", "date": "2016-10-01T09:00:00-04:00"}, {"source": "Facebook", "name": "Children's Author Adam Rex & Illustrator Christian Robinson Discussion & Signing", "description": "Author: \n\nAdam Rex has written several books for young readers, including the \"New York Times\" bestselling \"Frankenstein Makes a Sandwich \"and \"The True Meaning of Smekday. \"His first day of school was at Lookout Mountain Elementary in Phoenix. He lives now with his wife and son in Tucson.\n\nIllustrator: \n\nChristian Robinson's award-winning books for young readers include \"Josephine, \" which was a Coretta Scott King Honor Book as well as a Sibert Honor Book and \"Harlem's Little Blackbird, \"which was an NAACP Image Award nominee. His latest book \"Last Stop on Market Street \" earned four starred reviews and was on the \"New York Times\" bestseller list. This is his first book for Roaring Brook Press.\n\nBook: \n\nIt's the first day of school at Frederick Douglass Elementary and everyone's just a little bit nervous, especially the school itself. What will the children do once they come? Will they like the school? Will they be nice to him?\nThe school has a rough start, but as the day goes on, he soon recovers when he sees that he's not the only one going through first-day jitters.", "url": "https://www.facebook.com/events/1741498216102456/", "date": "2016-10-01T11:00:00-04:00"}, {"source": "Facebook", "name": "Sylvia", "description": "Ann Arbor Civic Theatre presents the Second Stage comedy, Sylvia, directed by Cassie Mann, September 30-October 2, 2016, at the A2CT Studio Theater, 322 West Ann St, Ann Arbor, MI, 48104. Performances are Friday and Saturday at 8 p.m. and Sunday at 2 p.m. All tickets are $12, with a $2 discount at the Sunday performance for those bringing a photo—printed or on a cell phone—of them with their dog, or a non-perishable pet supply donation. In collaboration with the Humane Society of Huron Valley, donations of pet supplies and food, as well as monetary donations, will be accepted at every performance. Tickets are available by calling the office at 734-971-2228, or at the door.  Additional information is available by visiting www.a2ct.org.  \nSylvia finds Greg and Kate, recent empty-nesters, at a cross roads in their relationship. Kate is a middle school English teacher who fills the void with a renewed commitment to her career. Greg, on the other hand, flounders in a job he has grown to dislike and a surplus of free time. Enter Sylvia, a disarming dog of unknown origins whom Greg finds unattended in Central Park. Greg brings Sylvia home, much to Kate’s displeasure. As the bond between Greg and Sylvia grows, a chasm opens in Greg and Kate’s marriage into which friends, a well-meaning fellow dog owner, and a misguided therapist fall. With sharp wit and biting satire, A.R. Gurney explores the age-old connection between man and his best friend.\n“I saw a scene from Sylvia in an acting showcase a few years ago and fell in love with the play,” says director Cassie Mann. “Having a young woman play a dog—not in a dog suit but as a fully-conversant human with dog tendencies--is a brilliant device. The audience gets to experience the inner life of a dog as well as the relationships between Sylvia and those around her. The comedy builds as the relationship between Sylvia and Greg grows, but there’s also a poignant message about how a longtime couple navigates their post-child-rearing years.”\n\nThe cast of Sylvia features Stacy Buck as Sylvia, Larry Rusinsky as Greg, and Denyse Clayton as Kate. The cast also includes Lonnie Curri, Dave Giles, and Celeste Green. \n\nSylvia contains adult themes and languages and is intended for mature audiences. ***", "url": "https://www.facebook.com/events/199447367142600/", "date": "2016-10-01T20:00:00-04:00"}, {"source": "Facebook", "name": "Parisian Soirée: Celebrating 32 Years!", "description": "“To hear a number of Ann Arbor's top-notch talent perform together in a fun, laid-back atmosphere for an evening was certainly a real treat. Or, as the French would say, magnifique!” – Ann Arbor Journal\n\nThis annual gala is fun, full of surprises, includes champagne and features a multi-genre program with connections to all things French & Parisian! Kevin Bylsma will lead a cabaret and vocal portion of the evening, Kathryn Goodson will perform works by Erik Satie, violinist Sunmi Chang & pianist Amy I-Lin Cheng will perform Debussy’s Violin Sonata, and Julien Labro will perform as solo set as well as a set with his quartet.\n\nDeanna Relyea, mezzo-soprano\nMonica Swartout-Bebow, mezzo-soprano\nJane Schoonmaker Rodgers, soprano\nOlivia Johnson, soprano\nJosh Lovell, tenor\nKevin Bylsma, piano\nSunmi Chang, violinist\nAmy I-Lin Cheng, piano\nKathryn Goodson, piano/voice\n------------\nJulien Labro Quartet:\nJulien Labro, accordion\nJon Dixon, piano\nJordan Schug, bass\nJesse Kramer, drums\n\nTickets:\n$50 Assigned Seats in Rows 1-2\n$35 Assigned Seats in Rows 3-5\n$25 General Admission\n$10 Student General Admission", "url": "https://www.facebook.com/events/243725796023937/", "date": "2016-10-01T20:00:00-04:00"}, {"source": "Facebook", "name": "Erika (I.T.) at Club Above Ann Arbor", "description": "Erika dreams on the cellular level, or perhaps of transdimensional intelligences moving through strange patterns on celestial objects, working towards a mysterious goal. Her connection to the dreamworld becomes concrete in her approach to music, simultaneously so solid and yet so ethereal. Erika still finds time to accomplish many things in her waking hours, such as being a member of Ectomorph, co-conspirator of Detroit's Interdimensional Transmissions record label, DJing with vinyl, making music with her pet machines, and running erika.net - a freeform streaming radio station. From 1993 through 1999, Erika was very involved in WCBN in Ann Arbor, as a freeform and jazz DJ, and Program Director.\n\nCome get your mind melted by the one and only. You know the deal.\n\nSupport from: \nJimmy K (Detroit)\nPAT in the HAT b2b Suitor (Sly Fox Records)\nJeff Garcia (Club Faygo) b2b Arjun (Ceramic)\n\nVisuals by Unofficial: Matilda", "url": "https://www.facebook.com/events/1776812192599606/", "date": "2016-10-01T21:00:00-04:00"}, {"source": "Facebook", "name": "POP-X", "description": "POP-X IS FREE AND OPEN TO THE PUBLIC!\n\nPresented by The Ann Arbor Art Center, POP-X is an annual 10-day festival involving pop-up art pavilions, interactive exhibitions, performances and special events in Ann Arbor. \nDuring the ten days that the art pavilions are grouped in Liberty Plaza, visitors of all ages will have the opportunity to interact with these exhibitions, attend lectures and family events, see special performances, and enjoy Ann Arbor’s art scene like never before.\n\nThe pavilions are independently available for sale as well, serving as beautiful yard installations for work or play!\n \nVisit popxannarbor.com for details about the pavilions, the artists, and the full schedule of events! \n----------\n\nPOP-X 2016 ARTISTS: Ann Arbor Women Artists | Beth Billups | FLY Children’s Art Center | Gallery Project | Donald Harrison and Martin Thoburn | Jodi Stuart | Synecdoche Design | Andrew Thompson | Lisa Waud | David Zinn\n----------\n\nTHANK YOU TO OUR GENEROUS SPONSORS:  Ann Arbor Area Community Foundation |  Ann Arbor Area Convention and Visitors Bureau | Ann Arbor Downtown Development Authority | Community Foundation for Southeast Michigan | First Martin Corporation | Isalita Cantina and MANI Osteria & Bar | Larry and Lucie Nisson | Old National Bank | Savco Hospitality | Skidmore Studio", "url": "https://www.facebook.com/events/585713071616738/", "date": "2016-10-02T12:00:00-04:00"}, {"source": "Facebook", "name": "Stewardship Workday-Bluffs Nature Area", "description": "Stewardship Workday\nSunday, October 2\nBluffs Nature Area\n1 to 4 p.m.\nTucked away within Bluffs’ 39 acres is an open field filled with native prairie species. Come out and help us preserve this beautiful habitat by removing invasive shrubs, such as buckthorn and honeysuckle, which are encroaching on the prairie. Meet at the park entrance on Sunset Road. Please wear long pants and closed-toe shoes. All minors must present a completed release form and should be accompanied by a guardian. Tools, snacks and know-how are provided. Free.", "url": "https://www.facebook.com/events/1039321782829774/", "date": "2016-10-02T13:00:00-04:00"}, {"source": "Facebook", "name": "Author Bill Ayers - Discussion and Signing", "description": "Author: \n\nWilliam Ayers, formerly Distinguished Professor of Education and Senior University Scholar at the University of Illinois at Chicago (UIC) has written extensively about social justice and democracy, education and the cultural contexts of schooling, and teaching as an essentially intellectual, ethical, and political enterprise. His books include A Kind and Just Parent; Teaching toward Freedom; Fugitive Days: A Memoir; Public Enemy: Confessions of an American Dissident; On the Side of the Child; Teaching the Personal and the Political; To Teach: The Journey, in Comics; Teaching toward Democracy; and Race Course: Against White Supremacy.\n\nBook: \n\nIn an era defined by mass incarceration, endless war, economic crisis, catastrophic environmental destruction, and a political system offering more of the same, radical social transformation has never been more urgentor seemed more remote. \n\nA manifesto for movement-makers in extraordinary times, \"Demand the Impossible \" urges us to imagine a world beyond what this rotten system would have us believe is possible. \nIn critiquing the world around us, insurgent educator and activist Bill Ayers uncovers cracks in that system, raising the horizons for radical change, and envisioning strategies for building the movement we need to make a world worth living in.\n\nhttp://bit.ly/2bDtSha", "url": "https://www.facebook.com/events/518635875000773/", "date": "2016-10-02T15:00:00-04:00"}, {"source": "Facebook", "name": "Big Fun at the UMMA | Warming Up the Edge Series", "description": "Join Kerrytown Concert House as we celebrate the lead-up to the 20th anniversary of our avant-garde jazz festival Edgefest (October 26-29) with a series of free concerts throughout Ann Arbor!\n\nMark Kirschenmann's Big Fun plays the electric music of Miles Davis, including material from In A Silent Way, Big Fun, On the Corner, Get Up With It, and Tutu.\n\nThe band includes: Mark Kirschenmann, trumpet/electric trumpet; Stephen Rush, keyboards; Patrick Booth, tenor/soprano saxophones; Tim Flood, electric bass; Jeremy Edwards, drums; Dan Piccolo, percussion; Jonathan Edwards, electric guitar.\n\nThis performance is made possible through the generous sponsorship of The Maxine and Stuart Frankel Foundation for Art in honor of Maurice and Linda Binkow on the occasion of her 80th birthday and their 60th wedding anniversary.\n\nThis concert is a part of the Warming Up The Edge series leading up to Kerrytown Concert House's Edgefest festival of creative music in celebration of the festival's 20th anniversary.", "url": "https://www.facebook.com/events/1269554833089875/", "date": "2016-10-02T17:00:00-04:00"}]