[{"source": "Facebook", "date": "2016-12-08T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network", "url": "https://www.facebook.com/events/280243392370950/"}, {"source": "Facebook", "date": "2016-12-08T08:00:00-05:00", "description": "All week, all Garden of Life products are 35% off! That includes plant-based protein supplements, vitamins, and even special products just for kids. Stop in to chat with our friendly and knowledgable Natural Living team, and stock up on wellness!", "name": "35% Off Garden of Life", "url": "https://www.facebook.com/events/144098819397112/"}, {"source": "Facebook", "date": "2016-12-08T09:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network", "url": "https://www.facebook.com/events/1171307782957839/"}, {"source": "Facebook", "date": "2016-12-08T10:00:00-05:00", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "name": "Exhibit: Avant Garden-Fashion & Plants Together!", "url": "https://www.facebook.com/events/230775294023258/"}, {"source": "Facebook", "date": "2016-12-08T17:30:00-05:00", "description": "Free and open to the public. Seating is first come, first serve.\nLaura Kasischke is the Allan Seager Collegiate Professor of English Language and Literature and a member of the Helen Zell Writers’s Program MFA faculty at the University of Michigan. She has published eight collections of poetry and eight novels. Her novels include Suspicious River (1996), White Bird in a Blizzard (1999), and The Life Before Her Eyes (2002). They have been translated widely, and adapted for film. Kasischke has been the recipient of the National Book Critics Circle Award for poetry, a Guggenheim Fellowship, and two creative writing fellowships from the National Endowment for the Arts, among many other honors. In this conversation, moderated by fellow HZWP faculty member Douglas Trevor, she will be discussing aspects of process and craft.\n\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64).", "name": "Zell Faculty Spotlight: Laura Kasischke", "url": "https://www.facebook.com/events/309711509384304/"}, {"source": "Facebook", "date": "2016-12-08T17:30:00-05:00", "description": "Laura Kasischke is the Allan Seager Collegiate Professor of English Language and Literature and a member of the Helen Zell Writers’s Program MFA faculty at the University of Michigan. She has published eight collections of poetry and eight novels. Her novels include Suspicious River (1996), White Bird in a Blizzard (1999), and The Life Before Her Eyes (2002). They have been translated widely, and adapted for film. Kasischke has been the recipient of the National Book Critics Circle Award for poetry, a Guggenheim Fellowship, and two creative writing fellowships from the National Endowment for the Arts, among many other honors. In this conversation, moderated by fellow HZWP faculty member Douglas Trevor, she will be discussing aspects of process and craft.\nUMMA is pleased to be the site for the Zell Visiting Writers Series, which brings outstanding writers each semester. The Series is made possible through a generous gift from U-M alumna Helen Zell (’64).", "name": "Zell Faculty Spotlight: Laura Kasischke", "url": "https://www.facebook.com/events/154594958349434/"}, {"source": "Facebook", "date": "2016-12-08T18:00:00-05:00", "description": "The City of Ann Arbor invites the public to participate in a Crosswalk Design Guidelines Project workshop on Thursday, Dec. 8, 2016, 6–8 p.m. at Slauson Middle School located at 1019 W. Washington St. in Ann Arbor.\n\t\nThe primary focus of the workshop will be to update the community on the project and provide examples of real-world application of guidelines through a table top, game-like exercise. Attendees will be divided into groups and assigned various fictitious examples of crosswalk challenges and be asked to work together to find solutions using tools that fit within given budget constraints. The groups will be assisted by city staff, and at the conclusion of the exercise, will discuss the solutions each developed. \n\nAll persons are encouraged to participate in public meetings. Accommodations, including sign language interpreters, may be arranged by contacting the city clerk’s office at 734.794.6140; via email to cityclerk@a2gov.org; or by written request addressed and mailed or delivered to:\n\nCity Clerk’s Office\n301 E. Huron St. \nAnn Arbor, MI 48104\n\nRequests made with less than two business days’ notice may not be able to be accommodated.\n\nProject contact:\nCynthia Redinger\ncredinger@a2gov.org \n734.794.6410, ext.43632", "name": "Crosswalk Design Guidelines Project Workshop", "url": "https://www.facebook.com/events/341837432866402/"}, {"source": "Facebook", "date": "2016-12-08T19:00:00-05:00", "description": "Join our friends from New Belgium Brewing to try their new Ben & Jerry's Chocolate Chip Cookie Dough Ale! They'll be pairing it with Ben and Jerry's ice creams to get the full effect- beer float, anyone?", "name": "Adult Ice Cream Social", "url": "https://www.facebook.com/events/944135112354321/"}, {"source": "Facebook", "date": "2016-12-08T19:00:00-05:00", "description": "Our featured poet, Saleem Peeradina, is Professor Emeritus at Siena Heights University. His poetry is represented in major anthologies including The Oxford India Anthology of Poetry and The Bloodaxe Book of Contemporary Indian Poetry. He has authored several poetry collections including his latest, Final Cut, along with a memoir, The Ocean in My Yard (Penguin, 2005). \n\nSigning to follow.\n\nThe event begins with an Open Mic session when area poets can read their own work or share a favorite poem by another author in a welcoming atmosphere. This event is part of a poetry series held on the second Thursday of most months at 7pm.\n\n(NOTE: There will not be an Open Mic event in January 2017. )\n\nSaleem Peeradina is one of the most important Indian poets writing in the English language. In Final Cut, his fifth collection, the poet’s focus is turned towards the beauty that lies below the surface of the everyday; the extraordinary hiding in the ordinary.\n\nThese poems are hymns of praise – to birds, to objects, to fruits and to our own human bodies, intently recounting the character and history of each. In time, items as mundane as a sparrow, a stapler or an orange take on the appearance of wondrous gifts.\n\nThese meditations are joined by monologues, the remarkable yet unremarkable stories of characters encountered by the poet in India, Michigan and beyond. This is the work of a master of language; a self-proclaimed ‘participant-observer’, set to delight a new generation of poetry readers with this enthralling collection.", "name": "Open Mic & Share Poetry Series feat Saleem Peeradina", "url": "https://www.facebook.com/events/145978892541912/"}, {"source": "Facebook", "date": "2016-12-08T22:00:00-05:00", "description": "Come take it back to the 90s with ABSWS!!! You've said it at least once in your life - that you want to attend a 90s party and this is your chance! \n\nThink about all you favorite 90's movies, tv shows, and music stars- Love & Basketball, Clueless, BAPS, Poetic Justice, The Spice Girls, Aaliyah, Missy Elliot, Tupac, Biggie, The Fresh Prince, Selena, Jodeci, TLC,Cash Money,-  or any of your favorite 90s characters and come experience the hype with us! This will be the perfect event right before Finals & THE TEAM 95 GRADUATION!  So come & Have a good time! \n\nTHE ATTIRE IS 90'S ALL THE WAY! Ladies bring out those high waisted jeans with the big hoops! Fellas its time to bring out those white Tees! lol \n\nThere will be a $$$$ prize for BEST COSTUME!!!\n\nThe party will be held at Club Above 215 N. Main St. Ann Arbor, MI 48104 from 10 pm-2 am! Prices will go up at the door so get your tickets ahead of time at EventBrite.com! The event link is below!\n\n https://www.eventbrite.com/e/a-90s-to-remember-tickets-29336417013", "name": "A 90's To Remember", "url": "https://www.facebook.com/events/581967308677138/"}]