[{"source": "Facebook", "date": "2017-02-25T16:00:00-05:00", "description": "There's no winter warmer like the Winter Beer Festival! Join us in Comstock Park for the Michigan Brewers Guild's annual Winter Beer Festival. Beer list forthcoming! Saturday is sold out, but get your Friday tickets here: http://www.mibeer.com/winter-festival", "url": "https://www.facebook.com/events/634509003388839/", "name": "Winter Beer Festival"}, {"source": "Facebook", "date": "2017-02-25T16:00:00-05:00", "description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "url": "https://www.facebook.com/events/1081635985282122/", "name": "Icebreakers^2"}, {"source": "Facebook", "date": "2017-02-25T19:00:00-05:00", "description": "Kool Bads in a Kool place with some Kool kids! \n\n$7/18+\n\nBad Television: Ann Arbor sadbois\nhttp://badtelevision.bandcamp.com\n\nMomentai: instrumental math ear candy - Grand Rapids\nhttps://momentaisounds.bandcamp.com/releases\n\nNature's Garbage: groovy & melodic emo - Detroit\nhttps://naturesgarbage.bandcamp.com/album/green-hill-zone\n\nBAVE: thrashy mathy power dads - Detroit\nhttps://bave.bandcamp.com/releases\n\nMitch Branch: Hip happity hip hop (not your dad's hip hop) - Ann Arbor", "url": "https://www.facebook.com/events/1200109503435673/", "name": "Bad Television Nature's Garbage BAVE Momentai and Mitch Branch"}, {"source": "Facebook", "date": "2017-02-25T20:00:00-05:00", "description": "And no memes either.\n\n18+\n$7/ under 21 $10\nDoors @ 8, music @ 9\nFeaturing:\nWorst Case Scenario\nDaddy and the Long Legs\nComplainer.\nLewis Knudsen", "url": "https://www.facebook.com/events/623844591155665/", "name": "No Fun Allowed"}, {"source": "Facebook", "date": "2017-02-25T20:00:00-05:00", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Tony Hawk \nGroup 2: Motor City Improv\nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/577608552448620/", "name": "Pointless Improv with Tony Hawk and Motor City Improv"}, {"source": "Facebook", "date": "2017-02-25T21:00:00-05:00", "description": "Frequency Mardi Gras : Bourbon Street Blow Out!\nLet's get a little crazy New Orlean's style! Join DJ Hardy & MC Yoda as we celebrate Mardi Gras! Lots of beads & French Quarter drink menu all night!!!\n\n• DRINK SPECIALS: Happy Hour from 9pm-11pm : 1/2 off all drinks, shots & bottled beers. $2 Miller Lite bottles & $2 Vodka Drinks all night. Excludes bottle service & specials. \n\n• MUSIC. DJ Hardy spins Top 40 & House with MC Yoda\n\n• COVER is Free before 10pm. Ladies get in Free before 11pm. $5 for 21+ & $10 for 18 to 20.\n\n• VIP services available. Contact VIP@necto.com, 734-994-5835 or book via necto.com.\n\nDoors open at 9pm /// 18 & over welcome with proper ID /// \n\n--- Get social ---\nwww.necto.com/pride-friday.html\nwww.facebook.com/pridenecto\nhttps://twitter.com/NectoPride\nhttp://instagram.com/necto_pride", "url": "https://www.facebook.com/events/1308490445874744/", "name": "Mardi Gras 2017 : Bourbon Street Blow Out!"}, {"source": "Facebook", "date": "2017-02-25T22:00:00-05:00", "description": "These shows are completely improvised, and star an impressive cast of experienced local improvisers, including our resident company The League of Pointless Improvisers. \n\nGroup 1: Motor City Improv\nGroup 2: Tony Hawk \nGroup 3: The League of Pointless Improvisers", "url": "https://www.facebook.com/events/401411943544112/", "name": "Pointless Improv with Motor City Improv and Tony Hawk"}, {"source": "Facebook", "date": "2017-02-26T12:00:00-05:00", "description": "America's High Fiver: A Michigan 5-on-5 Roller Derby Tournament! \n\nThis event is open to teams of 5 skaters (from anywhere, not just Michigan!) who will compete against other teams in 5-minute \"mini-bouts\" for the ultimate glory of being crowned the best team of 5! Minimum of 3 \"mini-bouts\" guaranteed per team. Registration fee is $75/team ($15/particpant, but you MUST sign up with a team of 5). Deadline for registration is 2/12/17. \n\n*Participation open to anyone who identifies within the WFTDA gender policy. All teams must bring black and white with numbers on the back -- feel free to make some sweet DIY team jerseys! Unfortunately, due to space limitations, NO SPECTATORS allowed. Due to small team size, no Coaches will be allowed for teams either.*\n\n***REGISTRATION INFO***\nEach individual interested in participating must fill out the Registration Form (link below). Once we've received your completed form, you will be sent an invoice through Venmo to pay the registration fee. Please allow a bit of a window for this to happen and don't freak out if you don't see it right away. We have real jobs (bummer) and will be sending the invoices out when we get a chance. Your registration is NOT COMPLETE until this payment has been made.\n\nhttps://goo.gl/forms/vVkm9iNyuIK5Ncrv2", "url": "https://www.facebook.com/events/1533173573364052/", "name": "America's High- Fiver"}, {"source": "Facebook", "date": "2017-02-26T14:00:00-05:00", "description": "Commemorating the University of Michigan’s 2017 Bicentennial, Victors for Art: Michigan’s Alumni Collectors celebrates the deep impact of Michigan alumni on the global art world. This exhibition features works collected by a diverse group of alumni and the artworks themselves span 3,500 years of art making, from ancient sculptures to multimedia works by emerging artists. Victors for Art offers visitors an unprecedented opportunity to view art that may have never been publicly displayed otherwise—and most certainly, not together. Presented in two parts—Figuration (February 18-June 11, 2017) and Abstraction (July 1- October 29, 2017) this first part, Figuration will presents art across a wide range of media, time periods, and geographies including works by artists as diverse as Christo, Jean Dubuffet, Georgia O’Keeffe, and Elizabeth Vigeé Le Brun, among others. By assembling these seemingly disparate works and displaying them alongside one another, the scope of what is encompassed by the term “figuration” is explored and revealed, even as its meaning continues to evolve today.\n\nThis exhibition was organized by Joseph Rosa, Guest Curator, in collaboration with Laura De Becker, Helmut & Candis Stern Associate Curator of African Art, Jennifer Friess, Assistant Curator of Photography, Lehti Mairike Keelman, Assistant Curator of Western Art, and Natsu Oyobe, Curator of Asian Art.\n\nLead support for Victors for the Arts: Michigan's Alumni Collectors is provided by the University of Michigan Office of the Provost, the University of Michigan Health System, the University of Michigan Office of the President, the Michigan Council for Arts and Cultural Affairs and the National Endowment for the Arts, and the University of Michigan Bicentennial Office.", "url": "https://www.facebook.com/events/248475528931412/", "name": "Guided Tour: Victors for Art"}, {"source": "Facebook", "date": "2017-02-26T14:00:00-05:00", "description": "Featuring \nRandy Napoleon \nRick Roe\nSean Dobbins \nPaul Keller \nPaul Finkbeiner", "url": "https://www.facebook.com/events/424265344632355/", "name": "Celebrating the music of Louis Smith "}]