[{"description": "Park in our lot and get one of one of our made in-house brats*, just $25! We'll be tailgating all day, too- $2 pints, made in-house wings, and good times. Go Blue!\n\n*Please note that it is just one delicious brat per car for $25.", "name": "Spot and a Brat", "source": "Facebook", "date": "2016-10-22T09:00:00-04:00", "url": "https://www.facebook.com/events/1660199434270541/"}, {"description": "Tailgating in style! Brats for $5 and Chicago-style hotdogs, $5 mimosas, and $2 pints- go Blue!", "name": "Tailgating Popup", "source": "Facebook", "date": "2016-10-22T09:00:00-04:00", "url": "https://www.facebook.com/events/277202442679926/"}, {"description": "Please join us at the Matthaei Botanical Gardens for some spooky, spectacular Halloween fun! The Spooktacular will provide youth with the chance to learn about Halloween and the fall season through hands on, fun activities. Participants will learn about plant life cycles, bats, local foods, and how Halloween is celebrated all over the world. Pumpkin painting, seasonal snack making, and mask decorating are just some of the amazing activities happening at the Matthaei Botanical Gardens Harvest Spooktacular. Please come dressed in your favorite Halloween costume to show some Halloween spirit! \n\nChildren of all ages are welcome to join in for this event. The cost of registration is $10. Please RSVP for the Spooktacular using the link below. In order to be registered for this event, you must RSVP through the Matthaei website. A Facebook RSVP will not guarantee your child a spot at the Spooktacular. \n\nLink to Registration: http://mbgna-peony.miserver.it.umich.edu/shop/youth-programs", "name": "Harvest Spooktacular Celebration at Matthaei", "source": "Facebook", "date": "2016-10-22T10:00:00-04:00", "url": "https://www.facebook.com/events/1751269895146980/"}, {"description": "Our friends from Dogfish Head Beer will be with us for a tasting of their delicious beer- hoppy hour!", "name": "Dogfish Head Beer Tasting", "source": "Facebook", "date": "2016-10-22T12:00:00-04:00", "url": "https://www.facebook.com/events/538385943017820/"}, {"description": "THIS EVENT IS FREE AND OPEN TO THE PUBLIC!\n\nChildren and families are invited to our 2016 Cardboard Challenge on October 22nd from 12:00 to 4:00 PM! \n\nIt's a free, drop-in, all-ages event that challenges participants to use cardboard in order to create anything from a gargantuan monster costume to Thor's hammer to a set of magnificent fairy wings and much, much more! Join us at the Art Center as our teaching artists provide support and guidance to participants in crafting their wondrously imaginative creations.\n\nFor more info about the Cardboard Challenge: https://goo.gl/XydIV3", "name": "Cardboard Challenge 2016", "source": "Facebook", "date": "2016-10-22T12:00:00-04:00", "url": "https://www.facebook.com/events/285087828551415/"}, {"description": "Every improv education starts somewhere - yours starts here. Learn the fundamentals of improvisation, basic games, scene work and skills. Get used to being on stage and working with others in safe, supportive environment. For ages 18 and up.\n​\nSaturdays @ 12:00 - 3:00 pm\nOctober 22 – December 17, 2016 (no class Nov 5)\nTeacher: Jason Tomalia\n \nCost: $225\n\nVisit www.pointlessbrew.com/adult-improv-classes for more info.", "name": "Intro 1: Welcome to Improv (Saturdays)", "source": "Facebook", "date": "2016-10-22T12:00:00-04:00", "url": "https://www.facebook.com/events/1783301281892174/"}, {"description": "The members of Far House are excited to present to you two days and two nights of art and music at our house. Featuring local artists in multiple mediums such as: Glass, Beads, Organic, Jewelry,  Pins, Sculpture, Photography, Zines, along side a killer musical lineup featuring touring and local bands!!!\n\nAdmission is free, however artists will be selling their art in a wide range of prices.\n\n\n[][][][][][][][][][][]ARTISTS[][][][][][][][][][][]\n\n~Renee Lalinsky\nElaborate bead work such as tapestries & 3-D sculptures that glow in the dark and react to UV (black light). Creepy resin cast jewelry featuring plant & animal materals. Loads of various pins!!\n\n~Kevin Kissinger\nOne of Far House's very own who works with a varity of studies such as Pen & Ink, Linoleum Block Printing, & other various 2-D displays.\n\n~Dylan Harris\nFrom Jackson MI, this street artist runs Hylan Designs and makes everything from Stickers & Pins to Clothing to Painted Canvas.\n\n~Igor Kocherga & Ethan Zuck\nIgor is an established tatoo artist from Ann Arbor who has had his steady hand at the art for over 7 years.\nEthan Zuck is a young and inspiring artist who has been around tattooing the majority of his life.\nBoth of them will be offering tattoo style Body & Face Painting.\n\n<><><><><><PERFORMERS><><><><><>\n\n~Friday October 21st~\n\n2:00 Doors Open\n\n3:00 Ian Burk\n\n4:00 Telementals \nhttp://telementals.bandcamp.com/album/universal-burst\n\n5:00 Honey Monsoon\n\n6:00 BSRB\nhttps://soundcloud.com/bsrb1983\n\n7:00 Jordan Adema\nhttps://soundcloud.com/jordan-adema/thermodynamic\n\n8:00 Yaje\nhttp://yajeyaje.bandcamp.com/\n\n9:00 Corridors\nhttps://corridorsypsi.bandcamp.com\n\n10:00 Prisim Print\nhttps://soundcloud.com/user-309584363\n\n11:00 Hanging Hearts (CHI)\nhttps://www.youtube.com/watch?v=Olr_r-FZww8\n\n\n~Saturday October 22nd~\n\n2:00 Doors Open\n\n3:00 Soft Milk\nhttps://m.soundcloud.com/soft-milk\n\n4:00 NO DATA\nhttp://nodata1.bandcamp.com/\n\n5:00 Modus Operandi\nhttp://modusoperandi.bandcamp.com/releases\n\n6:00 Brian Tucker\n\n7:00 Outer Realms\nhttps://outerrealms.bandcamp.com/album/city-demos\n\n8:00 STRCHLD\nhttps://soundcloud.com/strchldmusic\n\n9:00 Liars & Theives\nhttps://soundcloud.com/liars-and-thieves\n\n10:00 Big Bad Wolf\nhttps://www.reverbnation.com/bigbadwolftheband\n\n11:00 Ada Z\nhttps://adazmusic.bandcamp.com\n\nIf you are interested in playing music or selling your art, please contact Far House via facebook: https://www.facebook.com/profile.php?id=131037849418&tsid=0.1526037330586194&source=typeahead\n\nAs always, everyone is welcome (18+) as long as everyone respects the space, the artists/performers and of course eachother.", "name": "Far Fest", "source": "Facebook", "date": "2016-10-22T14:00:00-04:00", "url": "https://www.facebook.com/events/1128442770578344/"}, {"description": "Due to a family emergency this event has been cancelled, we hope to reschedule soon.\n\nL.E. Kimball has her MFA in creative writing from Northern Michigan University. She is an associate editor for Passages North literary journal. She is also the author of A Good High Place and has been published in journals such as Alaska Quarterly Review and Gray’s Sporting Journal. Most of the year she lives off the grid on a trout stream with her son, Josh, and her English shepherd, Maggie.\n\nKimball's stories unravel the beautiful mess of layers that is their lives and allow the narratives to roam freely in time, thus granting the reader keen insights into the past, present, and future.\n\nSpiraling through time and perspective, the stories converge at Norna's two-room cabin in the woods, accessible only by \"seasonal roads\" that disappear under deep snow in the winter. The cabin is witness to Norna's years of solitude spent hunting, foraging, fishing, and defending herself from intruders, Aissa's escape from her divorce, and Jane's stubborn vigil as a forest fire rages dangerously nearby. Through raw and ephemeral memories, we learn the darkest kept secrets of these women and the ties that bind them to each other and to the land.\n\nKimball's sensual descriptions of the Upper Peninsula, combined with her hauntingly vivid characters, paint an unforgettable picture in Seasonal Roads. Readers of fiction will enjoy the surprising turns of this collection.", "name": "Event Cancelled - L.E. Kimball Discussion", "source": "Facebook", "date": "2016-10-22T15:00:00-04:00", "url": "https://www.facebook.com/events/327473547607654/"}, {"description": "Combining parlor games with the classic social lubricant (alcohol) to multiply their ice busting powers.\n\nWe will supply some low-key interactive games and craft beer. \nBring your friends or make some new ones. \nSaturdays at 4pm.\nPointless Brewery & Theatre. 3014 Packard Road, Ann Arbor.", "name": "Icebreakers^2", "source": "Facebook", "date": "2016-10-22T16:00:00-04:00", "url": "https://www.facebook.com/events/1738348603083037/"}, {"description": "Fall, beer, Eastern Market! What more do you need? Beer list to be released soon. Tickets: http://www.mibeer.com/detroit-fall-festival", "name": "Detroit Fall Beer Festival", "source": "Facebook", "date": "2016-10-22T17:00:00-04:00", "url": "https://www.facebook.com/events/1112511325491127/"}]