[{"description": "Please join us in honoring Trans lives that have been lost and remembering their names as they rest in power.", "date": "2016-11-21T18:00:00-05:00", "name": "Trans Day of Remembrance (TDOR)", "source": "Facebook", "url": "https://www.facebook.com/events/262534960811351/"}, {"description": "Learn how to use the Raspberry Pi, a popular, powerful, and inexpensive ($25-$35!) single-board computer. In this class we’ll cover the basics of programming the Raspberry Pi in Python, connecting simple switches, LEDs, and sensors, and creating web pages that provide remote sensing and control. We’ll even do our programming right on the Raspberry Pi itself with a full-featured Linux operating system, graphical user interface, editors, and web browsers.\r\n\r\nIf you are familiar with the Arduino, the Raspberry Pi is a great platform for those projects that need lots more memory, more speed, video output, internet, USB, or other features. Unlike the Arduino, there is no low-cost or reduced size or power option. You may also enjoy the ease and power that Python offers as a programming language, and the many possibilities of the underlying Linux operating system.\r\n\r\nThis is a beginner course, so no electronics or programming experience is necessary. (It may move slow for experienced programmers!)\r\n\r\nWe suggest ages 12 and up, but advanced younger people will probably do fine.\r\n\r\nWe supply a model 2 Raspberry Pi and all parts for use in the class. You’ll take home a comprehensive set of class notes.\r\n\r\nLearn more about the Raspberry Pi at www.raspberrypi.org/\r\nPlease arrive 10 minutes early if visiting Maker Works for the first time. $90\r\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=14&month=11&year=2016&view=day to sign up.", "date": "2016-11-21T18:00:00-05:00", "name": "Intro to Raspberry Pi", "source": "Facebook", "url": "https://www.facebook.com/events/1669121740084145/"}, {"description": "Art Off The Wall 2016 is the Ann Arbor Art Center's BIGGEST Holiday Exhibition and Shopping Event ever! And it happens from NOVEMBER 19th 2016 to JANUARY 7th 2017\n\nJOIN US FOR THE OPENING RECEPTION ON FRIDAY, NOVEMBER 18! (6 to 9pm) - This is a special reception/shopping event where members of the Ann Arbor Art Center will get discounts of up to 20%*\n\nFor the first time our first and second floors will become one giant gallery/shop where patrons will be able to purchase original, handmade works of art as holiday gifts, or to add to their personal art collection. Artwork is purchased directly “off the wall” for a fun and festive shopping experience!  \n\nCome see the work of hundreds of artists, featuring paintings, textiles, ceramics, home decor, glass, jewelry, holiday ornaments, winter accessories, cards, handmade stuffed animals and much more!\n\nTo learn more about our holiday exhibition and the exclusive shopping event: https://goo.gl/IueiWi\n\n*Discount excludes Motawi merchandise\n----------\nSponsored by: Imagine Fitness and Yoga\n\nThe 117 Gallery 2016/ 2017 season is supported by Vintage Financial Services LLC", "date": "2016-11-21T18:00:00-05:00", "name": "Art Off The Wall Holiday Exhibition & Shopping Event", "source": "Facebook", "url": "https://www.facebook.com/events/1807900772828520/"}, {"description": "Scissor Now!, Junglefowl and Laserbeams of Boredom are teaming up to provide the denizens of the 8 Ball Saloon with all the holiday cheer they could stand for absolutely free! If that's not enough, cheap beer and even cheaper whiskey will also warm your holiday cockles.\n\nScissor Now!\nHttp://scissornow.bandcamp.com \n\nJunglefowl\nHttp://junglefowl.bandcamp.com \n\nLaserbeams of Boredom\nhttps://laserbeamsofboredom.bandcamp.com", "date": "2016-11-22T21:00:00-05:00", "name": "Scissor Now! Ф Junglefowl Ф Laserbeams of Boredom", "source": "Facebook", "url": "https://www.facebook.com/events/342871136077265/"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "date": "2016-11-23T08:00:00-05:00", "name": "10% For Good for Community Action Network", "source": "Facebook", "url": "https://www.facebook.com/events/280243392370950/"}, {"description": "Books and brews are a-go! Sweetwaters Westgate (inside the renovated Ann Arbor District Library West Branch) will be open and ready for families, friends, and Sweetwaters fans Tuesday, September 6 at 9am with a GRAND OPENING PARTY Sunday, September 18 at 12noon.\n\nThe GRAND OPENING PARTY will include two live concerts, a ribbon cutting, a Chinese Lion Dance, and refreshments!  Check out http://www.aadl.org/node/345699\n__________________________\n\nTUESDAY,  SEPT 6\nLucky guest #100 will win FREE coffee or tea for a year!\n&\nBuy any Triple drink get a free mini pastry, (while supplies last)\n\nWEDNESDAY, SEPT  7\nFREE cute mini Cold Brew for the first 30 guests starting @ 9am.\n\nTHURSDAY, SEPT 8\nAll day, buy any Triple drink get a free mini cookie! (while supplies last)\n\nFRIDAY, SEPT 9\nPrecious little mini Cold Brews, FREE for the first 30 guests starting @ noon.\n\nSATURDAY, SEPT 10\nAll day, buy any Triple drink get a free mini dessert! What could it be?! (while supplies last)\n\nSUNDAY, SEPT 11\nBOGO cards (to use at that time or next purchase) especially for the first 50 guests starting at opening & then again for the first 50 guests starting at 4pm!\n\nMONDAY, SEPT 12\nBuy any Triple drink get a free mini dessert, until 3pm\n&\nTHEN for the first 40 guests starting at 3pm, FREE mini Cold Brew! The perfect afternoon pick-me-up!\n__________________________\n\nStay tuned for updates! Invite your fellow Sweetwaters enthusiasts <3", "date": "2016-11-23T08:00:00-05:00", "name": "Sweetwaters Westgate Grand Opening!", "source": "Facebook", "url": "https://www.facebook.com/events/1090878344334512/"}, {"description": "Trapped in the theater with a ghostly bartender, you have one hour to illuminate the mysteries and escape!\n\nAdventure Lab is a new business specializing in escape rooms and other live-action puzzle games. If you enjoy puzzles, fun, adventures, games, or improving your small group communication skills, then you won't want to miss this unique event at Pointless!\n\nSelect the time and date you would like to attend. Each time slot is limited to 3-6 people.\nAdventures are:​\nWednesday, November 23 @ 2 pm\nWednesday, November 23 @ 4 pm\nWednesday, November 23 @ 6 pm", "date": "2016-11-23T14:00:00-05:00", "name": "Ghost Light (An escape room adventure)", "source": "Facebook", "url": "https://www.facebook.com/events/691221434367596/"}, {"description": "Join us for the release party that started it all as we tap our infamous Terminator Dopplebock! At 8% ABV, Terminator topped the list as our highest gravity beer for years. Our winter lager is perhaps our most famous beer, though no longer the strongest. Like all traditional German Dopplebocks it is richly spicy with a subtly sweet malt palate and a clean, crisp, dry hop finish.\n\nABC is continuing our commitment to Terminate Hunger in Washtenaw County with our partnership with The Breakfast at St. Andrew's. $1 from each Terminator sold will be donated to the the Breakfast at St. Andrew's.\n\nLaunched in 1982 by a handful of volunteers, today, the Breakfast at St. Andrew's serves between 90 and 150 meals daily. More than 100 volunteers, donate their time on a regular basis. Every morning from 7:30 to 8:30 a.m., the welcome guests who come for a hot meal and to pack a sandwich lunch for later in the day. Guests include the young and old. They arrive as individuals or in groups. Some are homeless or struggling with addiction or mental illness, but most are working men and women who are trying to make ends meet in a difficult economy. As a non-profit organization, the Breakfast at St. Andrew's is the only program in the Ann Arbor community serving a meal without charge, every day at the same time and place. http://breakfastatstandrews.org/about-us.htm\n\nLive music graciously provided by Ryan Racine.\nIt's been a twenty-plus year journey for Ryan Racine to get to where his music finds itself. Recording for the first time as a solo artist and writing without what he refers to as \"the shackles of genre\", the direction is really a culmination of the variety in his past projects. The sound is still very much grounded in American Roots music but is unbound by the narrow concepts he has applied to previous outings. www.ryanracine.com\n\nThis event is open to the public and donations are encouraged.", "date": "2016-11-23T17:00:00-05:00", "name": "Terminate Hunger Release Fundraiser", "source": "Facebook", "url": "https://www.facebook.com/events/277779062623282/"}, {"description": "Join us Wednesday, November 23rd from 5pm–12am, to celebrate our 3 year anniversary! We've got some specials in store for you!\n\n$3 Sangria\n$3 Pintxos\n$3 Estrella Dam\n\nFree Cava Toast at 10pm!", "date": "2016-11-23T17:00:00-05:00", "name": "Aventura Ann Arbor 3 Year Anniversary Celebration", "source": "Facebook", "url": "https://www.facebook.com/events/353747608350722/"}, {"description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "date": "2016-11-24T08:00:00-05:00", "name": "10% For Good for Community Action Network", "source": "Facebook", "url": "https://www.facebook.com/events/280243392370950/"}]