[{"source": "Facebook", "date": "2017-03-15T14:00:00-04:00", "url": "https://www.facebook.com/events/1434827869892354/", "description": "This symposium uncovers the impact of World War II on the home front. Each of its three sessions investigate critical social changes produced by war: in Ann Arbor, the far-reaching effects of the G.I. Bill in expanding higher education to an entire generation of men; in Willow Run the profound influence of female and African American employment in defense industries alongside a personal testament evoked by the mammoth, now empty buildings; in Detroit the ripples of musical exchange that ran alongside racial, religious, and ethnic conflict. The three sessions draw upon a lively mix of scholars, artists, and musicians, who, in turn, explore the unprecedented mixing that characterized wartime America.\nSymposium schedule:\n\n2 –4 p.m. Ann Arbor: \"The GI Bill and Its Impact on Higher Education,\" featuring lectures by Glenn Altschuler and Philo Hutcheson.\n\n4 –4:15 p.m. Visit UMMA exhibition Ernestine Ruben at Willow Run: Mobilizing Memory\n\n\n4:15–6:30 p.m. \"Willow Run: Gender, Race, and Factory Work During and After World War II,\" featuring Ernestine Ruben, her collaborator composer Stephen Hartke, UMMA Assistant Curator of Photography Jennifer Friess, Ruth Milkman, and Katie Rosenblatt.\n\n6:30–7:30 p.m. Break. UMMA exhibition Ernestine Ruben at Willow Run: Mobilizing Memory open for browsing.\n\n7:30–9 p.m. \"Detroit: Remembering the Music with Vincent York's Jazzistry\"\n\nFor more information about the symposium and the U-M Bicentennial Theme Semester, please visit lsa.umich.edu/bicentennial or call 734-615-7400.\n\nThis LSA Bicentennial Theme Semester event is presented with support from the U-M College of Literature, Science, and the Arts and the University of Michigan Bicentennial Office. Additional support provided by the Department of History, the Eisenberg Institute for Historical Studies, and the University of Michigan Museum of Art.", "name": "U-M History Dept Symposium: \"1943: Consequences of Mobilization\""}, {"source": "Facebook", "date": "2017-03-15T19:00:00-04:00", "url": "https://www.facebook.com/events/1285604281521723/", "description": "Literati is pleased to welcome Jung Yun in celebration of the paperback release of her debut novel, Shelter, a staff favorite and a semifinalist for the Center for Fiction's First Novel Prize.\n\nKyung Cho is a young father burdened by a house he can’t afford. For years, he and his wife, Gillian, have lived beyond their means. Now their debts and bad decisions are catching up with them, and Kyung is anxious for his family’s future. A few miles away, his parents, Jin and Mae, live in the town’s most exclusive neighborhood, surrounded by the material comforts that Kyung desires for his wife and son. Growing up, they gave him every possible advantage—private tutors, expensive hobbies—but they never showed him kindness. Kyung can hardly bear to see them now, much less ask for their help. Yet when an act of violence leaves Jin and Mae unable to live on their own, the dynamic suddenly changes, and he’s compelled to take them in. For the first time in years, the Chos find themselves living under the same roof. Tensions quickly mount as Kyung’s proximity to his parents forces old feelings of guilt and anger to the surface, along with a terrible and persistent question: how can he ever be a good husband, father, and son when he never knew affection as a child?\n\nAs Shelter veers swiftly toward its startling conclusion, Jung Yun leads us through dark and violent territory, where, unexpectedly, the Chos discover hope. Shelter is a masterfully crafted debut novel that asks what it means to provide for one's family and, in answer, delivers a story as riveting as it is profound.\n\n\"Shelter is domestic drama at its best, a gripping narrative of secrets and revelations that seized me from beginning to end.\"—Viet Thanh Nguyen, Pulitzer Prize-Winning author of The Sympathizer\n\nJung Yun was born in South Korea, grew up in North Dakota, and educated at Vassar College, the University of Pennsylvania, and University of Massachusetts at Amherst. Her work has appeared in Tin House (the “Emerging Voices” issue); The Best of Tin House: Stories, edited by Dorothy Allison; and The Massachusetts Review; and she is the recipient of two Artist Fellowships in fiction from the Massachusetts Cultural Council and an honorable mention for the Pushcart Prize. Currently, she lives in Baltimore with her husband and serves as an Assistant Professor of English at the George Washington University.\n\nEvent date: \nWednesday, March 15, 2017 - 7:00pm", "name": "Jung Yun"}, {"source": "Facebook", "date": "2017-03-15T19:00:00-04:00", "url": "https://www.facebook.com/events/659530230915473/", "description": "Rise Again Community Sing-Along with Jeanne Mackey • Mar. 15; 7 p.m. in the Crazy Wisdom Community Room • Join song leader Jeanne Mackey for a community sing-along from the recently released Rise Again Songbook, a guide with lyrics to over 100 songs, from Beatles to ballads, Dylan to Broadway. Purchase the songbook at Crazy Wisdom or use the store copy. Shower singers welcome! Suggested donation $5. Call 665-2757 or email info@crazywisdom.net.", "name": "Rise Again Community Sing-Along with Jeanne Mackey"}, {"source": "Facebook", "date": "2017-03-15T20:00:00-04:00", "url": "https://www.facebook.com/events/1107725159355910/", "description": "Earphorik\nartistecard.com/Earphorik\n\nMister F\nmisterfband.com\n\nBlind Pig - Ann Arbor, MI\nWednesday, March 15, 2017\n$10\n\nEARPHORIK\n==========\n\nChris Treesh - Guitar/Vocals\nAustin Robinson - Guitar/Vocals\nNolan Opper - Bass\nRyan Moreno - Drums\n\nEarphorik is a progressive rock, jam band based out of Fort Wayne, IN. The band was formed by Chris Treesh (guitar/vocals), Austin Robinson (guitar/vocals), Nolan Opper (bass), and Ryan Moreno (drums). Showcasing high-energy funk, vast genre ranges, and explosive peaks - Earphorik takes you to a whole new level of musical consciousness. \n\nFormed in 2013 as a collaboration of several Fort Wayne area bands, Earphorik released their first album A Year From All Angles in August of 2014, available on all major listening platforms. The band followed up the album with the release of a live album recorded at Jake Cinninger's Boondock Studio in Niles, MI, which consisted of just one take bringing the magic of the live performance to life. It is being produced and mastered by Jake Cinninger and Jim Leep - a true one take analog experience! Stay tuned for the online album release date announcement. \n\nEarphorik has made a national presence playing venues throughout the nation, and featuring big name sit ins such as Jake Cinninger (Umphrey's McGee), Beau Sasser (Kung Fu), Rob Chafin (The Werks), George Gekas (The Revivalists), Mike Greenfield (Lotus), Jesse Clayton (Fareed Haque), Holly Bowling, and Gerlach (Turbo Suit).\n\nAlong with these performance highlights, Earphorik has made waves in the festival cicruit with performances including two consecutive plays at Summer Camp Music Festival, Hyperion Music Festival, Taste Of Randolph, amongst a number of smaller festivals around the midwest. Be sure to catch Earphorik on the road and keep up with the latest news and updates at www.Artistecard.com/Earphorik\n\nMISTER F\n========\n\nMatt Pickering – Drums/Samples/Vocals\nScott Hannay – Keyboards/Vocals/Vocoder\nBen Pickering – Bass/Vocals\nColin Shore – Guitar/Vocals\n\nFormed in 2013 from members of Northeast regional acts Timbre Coup and Capital Zen, Mister F are an eclectic, high-energy 4-piece band that takes a no-holds-barred approach to blending genres while keeping your feet moving. Describing their sound as “neat and clean, hard and dangerous”, Mister F‘s calculated yet danceable fusion-fueled sound provides something for both musicians and listeners alike. Having performed at festivals such as The Hudson Project, Catskill Chill, Disc Jam, The Werk Out, Luna Light and Resonance, as well as with their previous bands at Mountain Jam, moe.down, Summer Camp, Camp Bisco, and snoe.down, the members of Mister F are no strangers to the music community. Members of Mister F have been invited to perform onstage with Umphrey’s McGee, Twiddle, Dopapod, Particle, Robert Randolph and the Family Band, The Werks, Consider the Source, and many more. They brought their show to the road soon after their 2013 debut, reaching cities as far as Telluride, CO and Atlanta, GA within just a few short years.\n\n“Mister F…a dynamic quartet that broaches all aspects of organized music. Rooted in funk traditions, Mister F‘s members are no strangers to unique compositions and sonic explorations, though it’s done with a tightness that keeps listeners dancing throughout their performances.”\n-Live For Live Music", "name": "Earphorik w/Mister F at Blind Pig, Ann Arbor MI"}, {"source": "Facebook", "date": "2017-03-15T20:00:00-04:00", "url": "https://www.facebook.com/events/1561821517191344/", "description": "Contrabassist James Ilgenfritz celebrates the release of his second solo CD with a concert of solo works written for him by Annie\nGosfield, Miya Masaoka, JG Thirlwell, and Elliott Sharp, plus music from his first CD, featuring the music of Anthony Braxton. From hypnotic drone works involving Just Intonation and use of multiple bows to astounding feats of technical virtuosity, this collection of works brings hyper-complexity, improvisation, and lyrical beauty together into a deeply personal tour-de-force of musical invention.\n\n$30 Assigned Rows 1-2\n$20 Assigned Rows 3-5\n$15 General Admission\n$5 Student", "name": "James Ilgenfritz, Contrabass"}, {"source": "Facebook", "date": "2017-03-16T00:00:00-04:00", "url": "https://www.facebook.com/events/1006014226188234/", "description": "Can't make it to Ann Arbor on March 26? You can still participate in the Probility Ann Arbor Marathon by registering for our Virtual Half Marathon! Virtual participants run or walk 13. 1 miles at a location of their choosing: at a park, on a trail, on a treadmill, even in a different part of Ann Arbor! All Virtual Half Marathons must be completed between February 1 and March 26. When you've completed your Virtual Half Marathon, tell us about it! Post your stats, photos, and story here on the Probility Ann Arbor Marathon Virtual Half Facebook event page; if you post on Twitter, be sure to tag @epicraces and @a2marathon. Best of all, you get the same race shirt and medal as those who join us in downtown Ann Arbor for the actual event!\n\nPlease note: Epic Races does not ship swag to Canada or internationally. If you are a resident of Canada or another country and wish to participate in an Epic Races virtual event, please provide us with a U.S. shipping address.", "name": "2017 Probility Ann Arbor Marathon Virtual Half Marathon"}, {"source": "Facebook", "date": "2017-03-16T10:00:00-04:00", "url": "https://www.facebook.com/events/189417071550325/", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "name": "Women's History Month and Planned Parenthood"}, {"source": "Facebook", "date": "2017-03-16T11:00:00-04:00", "url": "https://www.facebook.com/events/1839182856327434/", "description": "In honor of Women's History Month, Vault of Midnight will be donating the profits from sales of the amazing Bitch Planet Vol. 1 to Planned Parenthood for the entire month of March. \n\nHave you read Bitch Planet? If not, you have to as soon as possible. Kelly Sue Deconnick and Valentine De Landro's dystopian, sci-fi, non-compliant masterpiece has never been more urgent or prescient. \n\nAlready have a copy? Then pick one (or a few) up as a gift and help us donate to the cause. \n\nSummon your inner Penny and Rolle up your sleeves! Let's do this!", "name": "Women's History Month and Planned Parenthood"}, {"source": "Facebook", "date": "2017-03-16T17:00:00-04:00", "url": "https://www.facebook.com/events/404085033287135/", "description": "Join us at Sava's to Celebrate St. Patrick's Day with our take on some traditional Irish Classics.\n\nFOOD SPECIALS\n\nPOTATO & PARSNIP SOUP\nleeks, garlic, cream, buttermilk, nutmeg, cracked black pepper, chives, toasted irish soda bread with cultured butter     $6\n\nBEER CHEESE BALL\nsharp cheddar, brown ale, spicy mustard, cayenne, chives, celery seed, sesame seeds, scallion, crackers, crudités, quick pickled vegetables, pretzel bread     $9\n\nCORNED BEEF SANDWICH\nbraised corned beef, brinery sauerkraut, horseradish cheddar, gruyère, farm bread, with french fries      $12\n\nCORNED BEEF BRISKET\nbraised cabbage and onions, roasted carrots and fennel with caraway seeds, smashed redskin potatoes with kale and chives, spicy horseradish cream      $18\n\nDRINK SPECIALS\n\nJAMESON IRISH WHISKEY\n$5 shots\n\nSNAKES ON A SHAMROCK\n$4 pints wolverine state brewing co. | irish red lager", "name": "Sava's St. Patrick's Day Featured Specials"}, {"source": "Facebook", "date": "2017-03-16T17:00:00-04:00", "url": "https://www.facebook.com/events/239307969872948/", "description": "We're so excited to launch the all new Vinology Wine Club!\n\nJoin our wine tasting event to kick start the wine club.  Admission included for club members, and half off any guest!", "name": "Wine Tasting & Launch Of The Vinology Wine Club"}]