[{"url": "https://www.facebook.com/events/381601068852607/", "source": "Facebook", "date": "2016-12-12T10:00:00-05:00", "description": "This week, all our body care is 25% off! Skin care, hair care, cosmetics, soaps- it's all on sale, just in time for your holiday shopping. And with prices like this, you can pick up a few things to treat yo' self, too <3", "name": "25% Off Body Care"}, {"url": "https://www.facebook.com/events/1171307782957839/", "source": "Facebook", "date": "2016-12-13T09:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network"}, {"url": "https://www.facebook.com/events/229006344179951/", "source": "Facebook", "date": "2016-12-13T18:00:00-05:00", "description": "A full sensory experience with 8 wines, cheese, and charcuterie! We will discuss the history, tasting notes, and body of the wines. \n\nWe are featuring Sparkling Wines for this tasting, perfect for the holidays!", "name": "Sava's Uncorked: Sparkling Wines"}, {"url": "https://www.facebook.com/events/169932233479066/", "source": "Facebook", "date": "2016-12-13T18:30:00-05:00", "description": "Open to the Public. FREE\nThe workshop will be a panel of area young adults who have transitioned genders.  They will have a discussion regarding transgender issues and schools, as well as the transition to adulthood.  There will be a question and answer time as well.", "name": "Parent Workshop: Transgender Young Adult Panel"}, {"url": "https://www.facebook.com/events/225189611244813/", "source": "Facebook", "date": "2016-12-13T19:00:00-05:00", "description": "Join us for this self-proclaimed \"geek show-and-tell.\" Makers present their creations! \n\nWe have people interested in a wide scope of topics and endeavors. Programming, robots, machining, welding, artistic creations, metal casting, anything being built or created. Pretty much anything someone is \"Making\" is welcome at a Go-Tech meeting. \n\nAlso, if you have a problem with your project ask for help and the brain trust of Go-Tech will amaze you with solutions to difficulties you haven't even explored yet.. This is an open group all are welcome and especially young makers are encouraged to bring in a project to show off.\n\nSecond Tuesday of each month at 7pm.", "name": "Go-Tech Meeting (second Tuesday of each month)"}, {"url": "https://www.facebook.com/events/280243392370950/", "source": "Facebook", "date": "2016-12-14T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network"}, {"url": "https://www.facebook.com/events/230775294023258/", "source": "Facebook", "date": "2016-12-14T10:00:00-05:00", "description": "Now playing through January 8! Our conservatory exhibit Avant Garden explores the role of plants as the source of raw materials for textiles and the inspiration for fashion’s designs, colors, and shapes.The stars of the show are seven fantasy outfits crafted from plant materials such as succulents, Spanish moss, ferns, and poinsettias, creating topiary couture that ignites the imagination. (Pictured here.) Permission to try this at home! FREE.\n\nAvant Garden runs through January 8, 2017. Open New Year's Day 1- am-4:30 pm. Closed Christmas Eve, Christmas, and New Year's Eve.\n\nVisit the exhibit web page for more info and activity calendar: http://www.lsa.umich.edu/mbg/happening/avant-garden.asp", "name": "Exhibit: Avant Garden-Fashion & Plants Together!"}, {"url": "https://www.facebook.com/events/194194467708726/", "source": "Facebook", "date": "2016-12-14T18:00:00-05:00", "description": "How do you use computer-controlled (“CNC”) tools?  It may look like magic when the ShopBot, plasma cutter, Tormach, or other machine accurately cuts an intricate shape, but in fact we have some powerful software tools that  let even beginners create fantastic projects.\n\nThis class is an overview of “CNC”–that is, computer controlled machines.  You’ll learn what CAD means, the difference between 2D and 3D, and other concepts.  We will do some very simple hands-on activities, including creating a drawing in a CAD program, using a CAM program to generate code to run on a CNC machine, and each person will send their job to a simple CNC machine and see it run!\n\nIf you have no CNC experience, this would be a great class to take before checkout classes for specific CNC machines. \n\nThere is no prerequisite for this class, but familiarity with using software on a computer will be needed–things like clicking with the mouse and so on.\n\nNotes and other handouts will be provided.\n\nBe sure to check out our CNC toolchain map (which we’ll explain in class) and CNC glossary at http://maker-works.com/cadcam-toolchain/\n\nClass size: 4 people\n\nPlease arrive 10 minutes early if this is your first time to Maker Works.\nCall Maker Works at 734-222-4911 or visit http://www.supersaas.com/schedule/makerworks/CheckOut?day=14&month=12&year=2016&view=day to sign up!", "name": "Intro to CNC - $25"}, {"url": "https://www.facebook.com/events/1574155032886638/", "source": "Facebook", "date": "2016-12-14T20:00:00-05:00", "description": "Wed. Dec. 14 | 8pm | 18+ | $15 adv./ $18 Day of\n\nLive For Live Music Presents\nDopapod & Pigeons Playing Ping Pong\nat Blind Pig\nAnn Arbor, MI\n\nTickets: http://tktwb.tw/2asPQDi\n\nWant to earn a FREE ticket to the show? Sign up for the street team by clicking here: http://bit.ly/2b3tDvt\n\nDOPAPOD: \n\nThe Boston born, now generally Northeast based, but ever on-the-go Dopapod has come a long way from their college basement, DIY party roots. While maintaining to be as grassroots as their humble beginnings, the group has earned praise from taste making critics like Rolling Stone, Huffington Post, Jambase, Relix, and The Boston Herald, all the while tending to their ever expanding community of devoted listeners. The past 4 years have individually held the weight of about 150 shows, which have included numerous festival appearances like Bonnaroo, Wakarusa, Summer Camp, Electric Forest, Camp Bisco, Peach Fest, & Gathering Of the Vibes. All of this time on stage with each other has given the band the opportunity to explore the wide variety of influences that has impacted them to be the players they are today. But, don’t be quick to think that the no holds barred experimentation is unguided. While the brush in their hand uses every color, it’s the stroke on the canvas that gives Dopapod a distinct voice in the way of crafty songwriting.\n\nThat calculated, compositional mindset and restless nature to never sit too still is what has allowed Dopapod to fully realize their fourth studio release, Never Odd Or Even. Guitarist/vocalist Rob Compa giddily tells, “We really felt that the material this time around represented a big leap forward, not just in the way we’ve been interacting as a band, but in the way our focus has become sharper in paying attention to things like melody, theme, lyrical imagery, and structure – all the elements that make a great song.”\n\nDetermined to have that maturity translate in the studio, the band enlisted friend and producer Jason “Jocko” Randall to both engineer and produce the record. Keys/vocalist Eli Winderman couldn’t be happier about how things went. “We lived at his studio for about a month for these sessions and it just clicked right away. Jocko immediately became another member of band in many ways. With his attitude and approach to the recording process, we were able to really dial in the sounds we wanted, get those perfect takes we were aiming for, and have a blast the whole way through.” Released in November of 2014, Never Odd Or Even serves as the spark that the band has ignited to launch them into and exciting 2015.", "name": "Dopapod & Pigeons Playing Ping Pong at Blind Pig - Ann Arbor"}, {"url": "https://www.facebook.com/events/324709987912141/", "source": "Facebook", "date": "2016-12-15T08:00:00-05:00", "description": "This holiday season, every time you buy one of our Lucky's Market products, 10% of the profits go to Community Action Network (CAN) of Ann Arbor to provide food for families who need some extra help. Look for the red L throughout the store to get products that are a great value, taste great, have no artifical colors, preservatives, or flavors, and give back to the community at the same time. This program runs from November 9th through December 14th, so mark your calendars and thank you for helping us make Ann Arbor a great place for everyone!", "name": "10% For Good for Community Action Network"}]